#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BHD_Eversmann_A_021_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BHD_Eversmann_A_021_Hall_UI.ABP_BHD_Eversmann_A_021_Hall_UI_C
// 0x08A0 (0x0B10 - 0x0270)
class UABP_BHD_Eversmann_A_021_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0ADB10EF4B5008768EC3EEA737D32A7B; // 0x0278(0x0070)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_E120DA51490857BA29B3D5AFEA3ECB82; // 0x02E8(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7320E4CC46AAC90F4C1C58A43129BC03; // 0x0348(0x0060)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_4800BE614E01F3D6DC6B41B3910DCDD5; // 0x03A8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_39FD422C41699D27D159829C2D336A7F; // 0x0520(0x0088)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_C76562B24E341521793E11ABC7A804D5; // 0x05A8(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_5D8342EC49184419BE02669CF180A14A; // 0x0700(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_527DA1CB4CFE4F37ABF9478B4589986B; // 0x0850(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A62A56FA4459E5BA4F87CB89334E36DF; // 0x09A0(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x0B01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_BHD_Eversmann_A_021_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_BHD_Eversmann_A_021_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_BHD_Eversmann_A_021_Hall_UI_C")
	}
	static class UABP_BHD_Eversmann_A_021_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BHD_Eversmann_A_021_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_BHD_Eversmann_A_021_Hall_UI_C;

}

