#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Dragon_Mythic_009_Hall_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Dragon_Mythic_009_Hall_UI.ABP_Dragon_Mythic_009_Hall_UI_C
// 0x12C0 (0x1530 - 0x0270)
class UABP_Dragon_Mythic_009_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_960DA1A941D524C46D3E9B8B8BDC0D73; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_D209697E4354F4DCC259049604355F1D; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CF00A96E4321467629930CAA5BAE56A7; // 0x0460(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_58108DF5466D22680B31CA80B3098627; // 0x04E8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E76F2C6B4EC50D13A3CCDBB96799174A; // 0x05F8(0x0108)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_8BA347654477BA7A47B65EBE3A622654; // 0x0700(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_D3183A36462D85058C14148C72895044; // 0x0F10(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_9A209929457339253956A2B8384D27AF; // 0x1068(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_85D3BE734FDBC308529CCDA99DA8CC58; // 0x11B8(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6F36516A412F65E1742F4A91EDFEFC88; // 0x1308(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_0EF3B53C4DB81440703910B7E3070B90; // 0x1460(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8AF4F7434162653DD8CC64AFBBB16939; // 0x14C0(0x0060)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x1528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x1529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Dragon_Mythic_009_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragon_Mythic_009_Hall_UI_AnimGraphNode_BlendListByBool_58108DF5466D22680B31CA80B3098627(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Dragon_Mythic_009_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Dragon_Mythic_009_Hall_UI_C")
	}
	static class UABP_Dragon_Mythic_009_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Dragon_Mythic_009_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Dragon_Mythic_009_Hall_UI_C;

}

