#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Kai_002_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Kai_002_Hall_UI.ABP_Kai_002_Hall_UI_C
// 0x0AB0 (0x0D20 - 0x0270)
class UABP_Kai_002_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_9FC40C3541B1DA73F6C8B2813BFDD7C8; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_4389FF3C4A1322FDF9B83996FFFDCCD8; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_85DFF0BB42EC9E7A4CA715BFDDE94F1D; // 0x0460(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_DD42BB3C4729ACB7A0A2E69E39C4C6A2; // 0x04E8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66C74A8F44E5B829EE3A9FAB068995F2; // 0x05F8(0x0108)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_EBA217A044D2EC7505C6DEA8C6C9666A; // 0x0700(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_718B31F1479D6616AFED2FAFFD4FDB9F; // 0x0858(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_CA9925CE4B9BDD5843DC519216CADD66; // 0x09A8(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_E132307941BEC43BE1EE818DE83D4E09; // 0x0AF8(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_44FA8899459492F178FEA9852DC0E0D1; // 0x0C50(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_BDCF71A74CB28776724C65930D78BC19; // 0x0CB0(0x0060)()
	class UAnimSequence*                          LoopAnim;                                          // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Kai_002_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Kai_002_Hall_UI_AnimGraphNode_BlendListByBool_DD42BB3C4729ACB7A0A2E69E39C4C6A2(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Kai_002_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Kai_002_Hall_UI_C")
	}
	static class UABP_Kai_002_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Kai_002_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Kai_002_Hall_UI_C;

}

