#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_David_027_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_David_027_Hall_UI.ABP_David_027_Hall_UI_C
// 0x1790 (0x1A00 - 0x0270)
class UABP_David_027_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_D03BAD4D4F352FBB69D5F79EE203818D; // 0x0278(0x0070)()
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_349F85FC4BF31FCC0EBE51886A1F8623; // 0x02F0(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_240CA20A4AC2683E5B0851949B16F629; // 0x0B00(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0F88F27C40628E0D10F92784A2248BC3; // 0x0B60(0x0060)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_8EC191934B2EB7E93842F183720BFE91; // 0x0BC0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_94291F2046DD3B4F9A12A499422714F9; // 0x0CF0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_E88FCF3D46E8DC9741D4EB8697CC89EC; // 0x0E20(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9C1E6EF349B3EF05983A1BBAEE01C731; // 0x0F50(0x0130)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_4A2277E84FEF397324B5CA8E4F6A2BAD; // 0x1080(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B6123FC24E455644ACC99B8402224317; // 0x11F8(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_77A53DE44A6E02FF294FEF91E60E8753; // 0x1280(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C9114FBB4B74BB610AF3CC9C6BEF3CDB; // 0x1390(0x0108)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_923791CD49FEA82271EDD6843830A73E; // 0x1498(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_9885BE4B42F0A856827DB89ED006B78D; // 0x15F0(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_BBD216CC4DA5B48A900B0EB1A1414F5D; // 0x1740(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_AFE424574FF496AA88ED27A8D13C70F7; // 0x1890(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x19E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x19F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x19F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_David_027_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_David_027_Hall_UI_AnimGraphNode_BlendListByBool_77A53DE44A6E02FF294FEF91E60E8753(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_David_027_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_David_027_Hall_UI_C")
	}
	static class UABP_David_027_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_David_027_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_David_027_Hall_UI_C;

}

