#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Roy_016_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Roy_016_Hall_UI.ABP_Roy_016_Hall_UI_C
// 0x12C0 (0x1530 - 0x0270)
class UABP_Roy_016_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_E0EC489C48155EACC90773990F6D3F74; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_639A129A4A4269E87B8BF9938D9C9DFA; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_675ED50B43E67806DDC0CB8C927C1E56; // 0x0460(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9E3CF0D0440AD9BB8A3234A08D2C1D65; // 0x04C0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_58807A104475E7C872630AB277A1B870; // 0x0520(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_EC2DD9EF4DA2F9D11E77F8A7076C1502; // 0x05A8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4DBF7B80401E161E8DBE84B99FBEC2BC; // 0x06B8(0x0108)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_C351EE6F4DD1D764E7F7E4A6E79DEC69; // 0x07C0(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_FFC0684946EA0E9A85A5F193EBB751C8; // 0x0FD0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_83A7E7364E1E6419CAFF86A1E2CAD928; // 0x1128(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_E589AB72454CF84ACB70D388DF5E00DD; // 0x1278(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6DD3E25747A9F65B36E729A5AB61F0ED; // 0x13C8(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x1528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x1529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Roy_016_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Roy_016_Hall_UI_AnimGraphNode_BlendListByBool_EC2DD9EF4DA2F9D11E77F8A7076C1502(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Roy_016_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Roy_016_Hall_UI_C")
	}
	static class UABP_Roy_016_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Roy_016_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Roy_016_Hall_UI_C;

}

