#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Roy_Mourners_Body_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Roy_Mourners_Body_UI.ABP_Roy_Mourners_Body_UI_C
// 0x2A10 (0x2C80 - 0x0270)
class UABP_Roy_Mourners_Body_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_19D3416A4BE80ABBB1D310A4F848674F; // 0x0280(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_035E080946B9F2B5BA9709A70504FFC4; // 0x0A90(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C6EC77134C85852C61E371AA8F724B46; // 0x0AF0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AC1F5E10402C70995C320A9C571538BE; // 0x0B50(0x0088)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_990611954A947EB4DBFFC1804B1CEE0D; // 0x0BD8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_7B2681C1455680446753BE97E16D2DF6; // 0x0D50(0x0070)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_FC8C2CC2445115BF26AC3FACE4357469; // 0x0DC0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_A3F8D96B4BB9DBA2D6C63C908F26F8F2; // 0x0F18(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_231C9F4741B01EA7A8BB2D90B0890D1F; // 0x1068(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_7393F57F4656FDF2746F8397F3348DEC; // 0x11B8(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_0ACBAD9041D8C173DD970CB9A8D14FA5; // 0x1310(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_99FB9A764F133E778CFB4B8B382166CC; // 0x1440(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_79F817E14B92D91B4E085FB0EBAAC754; // 0x1570(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7C5BF01C41CB7C6DE8BAA9B5DB8EBA70; // 0x16A0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_31067E0246EDC61D0C403A861F95D59E; // 0x17D0(0x0130)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_ECD208C34625C1ECCD893691465AB16A; // 0x1900(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_32A4A67B42C3F424CA545BBD6DE1F29F; // 0x1A50(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_D4A64BF344FA96B11809A0A523EAC034; // 0x1BA0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_FAF795024B8F2F00BB91F6A0C3EAE0F7; // 0x1CF8(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5E8F6D594DFBC46D235D4DAB10AC6BBF; // 0x1E50(0x00B0)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_30B6CBE44E69F3D51D145BB5C99D81AF; // 0x1F00(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1E6DB81447CAFBD3D6DCCE8E466E4B1A; // 0x2710(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_FCAA73344BF8BC7223188786FF83D72B; // 0x2868(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6EAF2E944F5B73C7FBC943AFC23CC52C; // 0x29C0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0DB726584EE1122320EBE8ABA89D1EA0; // 0x2B18(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x2C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x2C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x2C79(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Roy_Mourners_Body_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Roy_Mourners_Body_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Roy_Mourners_Body_UI_C")
	}
	static class UABP_Roy_Mourners_Body_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Roy_Mourners_Body_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Roy_Mourners_Body_UI_C;

}

