#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HallCharacterShow

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Hall_classes.hpp"
#include "ZZAnimationLib_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_HallCharacterShow.ABP_HallCharacterShow_C
// 0x15B0 (0x1AD0 - 0x0520)
class UABP_HallCharacterShow_C final : public UHallMainCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_B44A066D488474D68345098013CB5C83; // 0x0528(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B6A2186B4D76192787399DA62AD36691; // 0x0598(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E237E1044DE240D1EF66E3BEFD29D853; // 0x06A0(0x0088)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_0970320545AF9F49A1E307AB9D81CD7D; // 0x0728(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1F5EA3E04AD0F6C9B56B0EB7F0D81DEF; // 0x0788(0x0060)()
	uint8                                         Pad_7E8[0x8];                                      // 0x07E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_CCDLookAt                    ZZAnimGraphNode_CCDLookAt_997D5A7047DACBE097956C946322A2F2; // 0x07F0(0x0220)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_1057BAC54A1EB88A9B141F8AA25754C5; // 0x0A10(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_5955425D494BCFD1F0B60D98B4BBEEE1; // 0x0B60(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_8222B861424FB45F7CC3CBAA4E871269; // 0x0CB0(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_FEDF39C64110C26F7634118607857696; // 0x0E00(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_EDCEC24E4A8CDA5E77B893A93E814539; // 0x0F50(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_40B30891438241B1181750B74E4D161E; // 0x10A0(0x0150)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_AD05048848AC74116619B28C4A574E39; // 0x11F0(0x01F0)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_812431AD49B5FB965FD03EAD50BFC4FD; // 0x13E0(0x01F0)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_CB920A4C4D8B579B84F9F792C9454A8B; // 0x15D0(0x01F0)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_3886430D45E4020E53D3E886E4E45D26; // 0x17C0(0x01F0)()
	struct FAnimNode_ResetNaN                     AnimGraphNode_ResetNaN_643B03D54BC8A4965950E3A529CF7222; // 0x19B0(0x0110)()
	class UAnimSequence*                          IdleLoopAnim;                                      // 0x1AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isFootIK;                                          // 0x1AC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn)
	bool                                          isHandIK;                                          // 0x1AC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ABP_HallCharacterShow(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimNotify_ResetDynamic(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_HallCharacterShow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_HallCharacterShow_C")
	}
	static class UABP_HallCharacterShow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_HallCharacterShow_C>();
	}
};
DUMPER7_ASSERTS_UABP_HallCharacterShow_C;

}

