#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Elio_036_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Elio_036_Hall_UI.ABP_Elio_036_Hall_UI_C
// 0x2890 (0x2B00 - 0x0270)
class UABP_Elio_036_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_B7BED2FA44494981AFABEC932EF0BFE9; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_72B564E14A798561787A699236E16857; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CE252559433DF8E2F883F3BD638A3489; // 0x0460(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29A4E57848B97BAF78750080D5705A71; // 0x04E8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5ABEE889414E8E90076BD3A9E913058C; // 0x05F8(0x0108)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_C46F3EB3422F9E9D1AAE5F871B6EB407; // 0x0700(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_BCDD509A4BB28F2C7A407E9063F16020; // 0x0858(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D2A519404BB10B51FDD6459D02371FE6; // 0x09A8(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0B9A80634AB28666C8BCD49EB674AE56; // 0x0AF8(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1E5EDB6F4F6547FECF7B9D860E9CE070; // 0x0C50(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_B77324C44DEFAA217FD58DA1C8CAD55F; // 0x0CB0(0x0060)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_802963F84A2866C211B91189906E23F7; // 0x0D10(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_76C04A7142C5519C653C61BC93D4E655; // 0x0E40(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_643AB81A43A6664A838A34A0988AAD94; // 0x0F70(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9AB8D1C04AB1F1A3EE2FCFBAE081B07D; // 0x10A0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_49680551447FFC0511BDEC990D77048F; // 0x11D0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_696FF441441E35E9F209CAB672741F9B; // 0x1300(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_E63D2E794D8C7D7F83A1F68B4627979C; // 0x1430(0x0130)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_F7BBA77346D4E670699DCD848B1FD4E2; // 0x1560(0x00B0)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_6DB62A7942F84AA47297B5BB0E2F50CD; // 0x1610(0x0810)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_C9CE56D54F692725D70A7E82C05BCEEB; // 0x1E20(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_843339BD4D2B054E00A13E970CD6FB09; // 0x1F50(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_329F94B643379DC1D636FB93A89E8DDA; // 0x2080(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_ADB3F96B49594BD2A259C98487484A66; // 0x21B0(0x0130)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_06117FEA4151C926764022BD82D034B0; // 0x22E0(0x0810)()
	class UAnimSequence*                          LoopAnim;                                          // 0x2AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          ResetDynamicToggle;                                // 0x2AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isDynamic;                                         // 0x2AF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Elio_036_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BlueprintUpdateAnimation(float DeltaTimeX); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Elio_036_Hall_UI_AnimGraphNode_BlendListByBool_29A4E57848B97BAF78750080D5705A71(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Elio_036_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Elio_036_Hall_UI_C")
	}
	static class UABP_Elio_036_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Elio_036_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Elio_036_Hall_UI_C;

}

