#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AirplaneDoor

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AirplaneDoor.ABP_AirplaneDoor_C
// 0x09D0 (0x0C40 - 0x0270)
class UABP_AirplaneDoor_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_7BDA830D413F8AB7C18AF086B77B164D; // 0x0278(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DC36354844681847D0B708A2C1B5C87A; // 0x02E8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_086ACCF349A27952AD0C23A1619D82F7; // 0x0358(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DEB7F480445AD3CF602BAFA65DC6EFA4; // 0x03C8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9216F28044A58638032FCA95052E8A34; // 0x0438(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ACC71A8D44D920B3F9D7DAA4D5E5D7C1; // 0x04A8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9F1397F2470281B49909A28CADA74FFD; // 0x05B0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0B050F3946C95D5B5E9EDFBE43500F94; // 0x0620(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FFB3DF0D4AB85152846D02B6C7F19DC6; // 0x0728(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28CE119041288A69E17D91B3FEF34733; // 0x0798(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B32AF44146D239313F2A4589F7401D27; // 0x08A0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28E782D24A1E510A9F3514913900806D; // 0x0910(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B36BE8334C58EAF70D12FCAC216D67D1; // 0x0A18(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_F0EF88CA43853616282BE1B57090BA88; // 0x0A88(0x01B0)()
	bool                                          Open_;                                             // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AirplaneDoor(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AirplaneDoor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AirplaneDoor_C")
	}
	static class UABP_AirplaneDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AirplaneDoor_C>();
	}
};
DUMPER7_ASSERTS_UABP_AirplaneDoor_C;

}

