#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BHD_Hoot_A_020_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BHD_Hoot_A_020_Hall_UI.ABP_BHD_Hoot_A_020_Hall_UI_C
// 0x08A0 (0x0B10 - 0x0270)
class UABP_BHD_Hoot_A_020_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3613104646F2DE52B00F7C979D122E33; // 0x0278(0x0070)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30A3FCA2408EB818EC8E4787E3577DFE; // 0x02E8(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_B2CCBF0B447333768CA65CA0367A8E13; // 0x0348(0x0060)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_23D415E1427644C19A6BB99D0ABCB2EE; // 0x03A8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_88AC952546179C1F1C0361BF0BD885F0; // 0x0520(0x0088)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_7094A7C74920B0A3321634905EE47822; // 0x05A8(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_EE4DB3454B11AEB78D924F886459B987; // 0x0700(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_77675AC84D822D9C320EC3AB7C9DBA1C; // 0x0850(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6B00A26C4631924590E281A0969AE6FC; // 0x09A0(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x0B01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_BHD_Hoot_A_020_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_BHD_Hoot_A_020_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_BHD_Hoot_A_020_Hall_UI_C")
	}
	static class UABP_BHD_Hoot_A_020_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BHD_Hoot_A_020_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_BHD_Hoot_A_020_Hall_UI_C;

}

