#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Dragon_Pilot_A_032_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Dragon_Pilot_A_032_Hall_UI.ABP_Dragon_Pilot_A_032_Hall_UI_C
// 0x1C60 (0x1ED0 - 0x0270)
class UABP_Dragon_Pilot_A_032_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_FC8E1A3A49ACCB1F267A8EACCD5F6154; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_F89807E049C156A106587AB59B960C0E; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_FAFC9E6A4A2B3701176F9892D343256E; // 0x0460(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1C617C754267D1F121E74087B79D17E7; // 0x04E8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6B43F8AA4FF4A4DD49BDEAB6D60069B5; // 0x05F8(0x0108)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_C1D4293F41C319775AD721905BCB7025; // 0x0700(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_84976A694AA776AC5E093E97D3799BE9; // 0x0858(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_4F79AB8840F9EEC25D05E6862DA2A04A; // 0x09A8(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_224D503F4105AF1C6027EB8E01CC3620; // 0x0AF8(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6FC886954339BB41ABB1839180A622E4; // 0x0C50(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E4DD949644D4356DA3ED678C19A9980C; // 0x0CB0(0x0060)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_0C341CC342D7EDE3185B64A4D727BFA8; // 0x0D10(0x0130)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_B008CDD249BB3C50148E58B71BC18FD6; // 0x0E40(0x00B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3EAAB8C24E2026DED6EBDFA47066C13B; // 0x0EF0(0x0130)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_826A3E0D47D2BF8679357C91BDADB19F; // 0x1020(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_7AE79BF04C4BE7522F2CA9A7543A63EB; // 0x1830(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_BE11D6F3456269DE2BE46C8122052384; // 0x1988(0x0130)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5786579F42740ACE6B1C7386E4E53257; // 0x1AB8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_68CBF6704C018D0025C5BBAB155924DC; // 0x1C10(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5243A3934C90B871BE420892D048413F; // 0x1D68(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          ResetDynamicToggle;                                // 0x1EC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isDynamic;                                         // 0x1EC9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Dragon_Pilot_A_032_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Dragon_Pilot_A_032_Hall_UI_AnimGraphNode_BlendListByBool_1C617C754267D1F121E74087B79D17E7(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Dragon_Pilot_A_032_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Dragon_Pilot_A_032_Hall_UI_C")
	}
	static class UABP_Dragon_Pilot_A_032_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Dragon_Pilot_A_032_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Dragon_Pilot_A_032_Hall_UI_C;

}

