#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Engineering_C404_SentryBox_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Engineering_C404_SentryBox_UI.ABP_Engineering_C404_SentryBox_UI_C
// 0x0210 (0x0480 - 0x0270)
class UABP_Engineering_C404_SentryBox_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A1F401524A3F50E13F05AD8F600C230D; // 0x0278(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_856BEEDF4FDA0AE397F75E9EFD2F6E30; // 0x02E8(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_87FB79844C72721DB29D1DB6AF784347; // 0x03F0(0x0088)()
	class UAnimSequenceBase*                      LoopAnim;                                          // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Engineering_C404_SentryBox_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Engineering_C404_SentryBox_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Engineering_C404_SentryBox_UI_C")
	}
	static class UABP_Engineering_C404_SentryBox_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Engineering_C404_SentryBox_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Engineering_C404_SentryBox_UI_C;

}

