#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Sineva_034_Hall_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Sineva_034_Hall_UI.ABP_Sineva_034_Hall_UI_C
// 0x18C0 (0x1B30 - 0x0270)
class UABP_Sineva_034_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A7B5F6454B88C8297A2F72ADF3CA8E2B; // 0x0278(0x0070)()
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_3259CA0845C5DDED0E0C6282276660B6; // 0x02F0(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DBD9BDAD41F3D947F30A9DA2B885C53E; // 0x0B00(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_96BF69064DF45FBC16E9C693C65D607D; // 0x0B60(0x0060)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_37193AEC4D528513F14D4386155D9E49; // 0x0BC0(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_392AA2B747A76C1EA43EADA27143F8F8; // 0x0D38(0x0088)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_2DC3554F40C5C59626FBD7A355570EFB; // 0x0DC0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_5FE20B244B15740733C3F7B309A136B6; // 0x0F18(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D1FB664C4FC2DD93E4DE6192A49411E8; // 0x1068(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_BA102F9E47A9230F9500BCB3DA69BC87; // 0x11B8(0x0158)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_394C601C42F1C72E61D189A13F231DB2; // 0x1310(0x0810)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x1B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x1B29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Sineva_034_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Sineva_034_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Sineva_034_Hall_UI_C")
	}
	static class UABP_Sineva_034_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Sineva_034_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Sineva_034_Hall_UI_C;

}

