#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_M_Sineva_Tincan_3w_A_Body_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_M_Sineva_Tincan_3w_A_Body_UI.ABP_M_Sineva_Tincan_3w_A_Body_UI_C
// 0x3BC0 (0x3E30 - 0x0270)
class UABP_M_Sineva_Tincan_3w_A_Body_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7E6C10DB40B70BC3A55C5CA49728C95F; // 0x0278(0x0088)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8A84701C44AA0ECEB99806AB3D0119B4; // 0x0300(0x0060)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_F635BAAD4F8D79F851718F835E6E8E5A; // 0x0360(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_03BD26304CC926D03B6538ABFB125289; // 0x04B8(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_E67FD6A844480D92C60A5BB4D71E3815; // 0x0608(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A853A178464569C3C42C1F9888638116; // 0x0758(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_792F599941880C676E290C9012AAC67B; // 0x08B0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2D96D0604CABA47D825EC8AF3B7CFC50; // 0x09E0(0x0130)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_86B05E7243BA704B53B50D9A982E162D; // 0x0B10(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_04895E4C46A8CD293917AC94AA4E3F0C; // 0x0C60(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B961A5BD40E90B7B6A3384923EE01D2F; // 0x0DB0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9D9D5DA8479EB63CD17E918E4D2AA0FD; // 0x0F08(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6F871E5E492E55B09F894BA7D0900D97; // 0x1060(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1791D4694DD17827BFA05599D5FB333C; // 0x1110(0x0060)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_4747E2474368F35D4A0D30B371F7B940; // 0x1170(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_F2FD20974456CCA6CB5735957088E688; // 0x12C8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_906D51AF451E1B9799653A82A26BC4A9; // 0x1420(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_44A6860D482DA83C5E61699BF1121ABD; // 0x1578(0x0158)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_80C1B38841FC6B346D9903B33A2E4DF5; // 0x16D0(0x0810)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_A4A56473413105E64EEF6DB0977E378F; // 0x1EE0(0x0178)(ContainsInstancedReference)
	uint8                                         Pad_2058[0x8];                                     // 0x2058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_23F9E7374DDA4ECDEAE60DA062E82614; // 0x2060(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_BD3815AD4567C3D20F5784B4C768D268; // 0x2870(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_F9AE389745674C8A2450739E0EB21E61; // 0x29C8(0x0130)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_106589254F89204FE6F302A727F79C36; // 0x2AF8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_183DECDE44B251F916AB518FF05B915C; // 0x2C50(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_74284B554B171E64662393AEA6FB707E; // 0x2DA8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_EB4EB47A4FC69E545162D9A1544E23A5; // 0x2F00(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_84E3104448E62CF10D657E8210ECE49D; // 0x3058(0x0070)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7503D84D4E5461A392640A8AA3AD8C2D; // 0x30C8(0x0130)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5F5A178C4FC0C67439E5DCA0CC45F31D; // 0x31F8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9148B37C4DE105621F6C0A860754450A; // 0x3350(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_DB850E3E4F9097E9024D7C8A6FEA9E0D; // 0x34A8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B94F2A70458A27A955CBD49205F3781C; // 0x3600(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_CA9269A1425AA13C8578BF9C207A5C1E; // 0x3758(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A7B9DFAD45F1CDBB75BCFB88E34DC992; // 0x38B0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0C0F3EEB4302214F8125FA9A2C614054; // 0x3A08(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_DCC20BC64D1BC6DE8D18C3B5BB3DD6B5; // 0x3B60(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_28D1DBCE4C5945BAB232EC9428BD76BD; // 0x3CB8(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x3E10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x3E18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x3E19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          isKnifeAnim;                                       // 0x3E1A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_3E1B[0x1];                                     // 0x3E1B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shoulder_Armor_Rotation;                           // 0x3E1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Shoulder_Armor_tx;                                 // 0x3E20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_M_Sineva_Tincan_3w_A_Body_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_M_Sineva_Tincan_3w_A_Body_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_M_Sineva_Tincan_3w_A_Body_UI_C")
	}
	static class UABP_M_Sineva_Tincan_3w_A_Body_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_M_Sineva_Tincan_3w_A_Body_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_M_Sineva_Tincan_3w_A_Body_UI_C;

}

