#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ShoreGUn

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ShoreGUn.ABP_ShoreGun_C
// 0x0E30 (0x10C0 - 0x0290)
class UABP_ShoreGun_C final : public UDFMWeaponAAGunAnimInstance
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_CE12EED7421FDE1A363896BFB0DB3FA2; // 0x0298(0x0070)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_BF12B63549FB0A70C28CDAA075E4805A; // 0x0308(0x0100)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_7ADEBF4E4E33099A260B558598EE364D; // 0x0408(0x0050)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3602DCD74311A4EDD442F6A38CCF6000; // 0x0458(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_E1A4754740D6E17E043CAE83032E646C; // 0x05B8(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8F62B8F54AFA8C55003F9FADE721B724; // 0x0618(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9C9695724DB55E55F99A6391BFC326BE; // 0x0678(0x0160)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_FD0383944E30E577F003B69FACF4503F; // 0x07D8(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B0D6955441E9E0B8D9D19E9D9074E57D; // 0x0900(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76F767F54787F3DEB80AB5BCF200C013; // 0x0988(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A9DDD6B446CEB2F0DD9AF5B6B31D0AA2; // 0x09F0(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1E2E83554CCA85D5B7D0CDB257D789D7; // 0x0A58(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8015C15D4A598512DF06F584C86C7528; // 0x0B58(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_598DC21F48BC21AEF319A5B288500518; // 0x0BC0(0x0110)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6B6E3DBB4675DBCED599839DC0728BFF; // 0x0CD0(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2166430F43E0B05068B4D6B3A1C6703E; // 0x0E30(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C1CB782C4C1D4B9A001CCE9C5115C52F; // 0x0E90(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_573D6C7E4D685C0E55137D8B6026E74B; // 0x0EF0(0x0160)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_AC0BD16D4E485E39EF1F6986A9799F98; // 0x1050(0x0068)()

public:
	void ExecuteUbergraph_ABP_ShoreGun(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ShoreGun_AnimGraphNode_ModifyBone_3602DCD74311A4EDD442F6A38CCF6000(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ShoreGun_AnimGraphNode_ModifyBone_9C9695724DB55E55F99A6391BFC326BE(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ShoreGun_AnimGraphNode_ModifyBone_6B6E3DBB4675DBCED599839DC0728BFF(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ShoreGun_AnimGraphNode_ModifyBone_573D6C7E4D685C0E55137D8B6026E74B(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_ShoreGun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_ShoreGun_C")
	}
	static class UABP_ShoreGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ShoreGun_C>();
	}
};
DUMPER7_ASSERTS_UABP_ShoreGun_C;

}

