#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BS_Door_SecurityGate

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BS_Door_SecurityGate.ABP_BS_Door_SecurityGate_C
// 0x09D0 (0x0C40 - 0x0270)
class UABP_BS_Door_SecurityGate_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_93A8467D42C8DD40731A798DA1F5DF75; // 0x0278(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_996B9F604855E8B2E703988B2A9DBFA1; // 0x02E8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9CC7AAA14AAABDD8D88A7C8924A04C23; // 0x0358(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_273AD5004385840C7945BDA431E56687; // 0x03C8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30818C164D17F07EADDDFC83D6F3EE0E; // 0x0438(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7024B80A4FD9D555F377ABA294B3CE1F; // 0x04A8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0AD886714ED3952CCF1B1A85FF65A7EC; // 0x05B0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5B8EBF1B4924D53917FAB6B52B7CCF23; // 0x0620(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6BFDE14148256CCB78735ABF54044AE9; // 0x0728(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2D702C7E401F96AC33A8B8A5F28DB29B; // 0x0798(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79A3247447A2A7189B5FFDA5044B4D84; // 0x08A0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7CD6D0CB43B28360A6453DBE75647595; // 0x0910(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BF928FDB4888E32263A3409A23078C7B; // 0x0A18(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_91D177974AB78C342A6D65A988E7F6E2; // 0x0A88(0x01B0)()
	bool                                          Open_;                                             // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_BS_Door_SecurityGate(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_BS_Door_SecurityGate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_BS_Door_SecurityGate_C")
	}
	static class UABP_BS_Door_SecurityGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BS_Door_SecurityGate_C>();
	}
};
DUMPER7_ASSERTS_UABP_BS_Door_SecurityGate_C;

}

