#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Assault_C301_Exoskeleton01_S01_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Assault_C301_Exoskeleton01_S01_UI.ABP_Assault_C301_Exoskeleton01_S01_UI_C
// 0x1F40 (0x21B0 - 0x0270)
class UABP_Assault_C301_Exoskeleton01_S01_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1D4A011F4E0E1105363291B7F41C7A89; // 0x0278(0x0070)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_493D678C4FF5ABCC47BC4EBDD933B792; // 0x02E8(0x0060)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_FE9DB3C543CA4C650E2F33A11A519554; // 0x0348(0x0060)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_9587BCA54BB1DBED453F319EE6C94B81; // 0x03A8(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_3C8815AF40B4D1396DEDE6932A599115; // 0x04F8(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_E89DBB4E4000A69DB953529425AE3A16; // 0x0648(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D1EA0FDA4CA43C53B1AD27B9D96725F5; // 0x0798(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_DE6255BE4F511B4DBB823EB88D643243; // 0x08E8(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_6EBEC0BD49780EB75A4A07B72EFFD274; // 0x0A38(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_CCF7D0F34C45C970F00647BCF2E11BF9; // 0x0B88(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_BA21109F45D405249346FF824AD1C6CD; // 0x0CE0(0x0158)()
	uint8                                         Pad_E38[0x8];                                      // 0x0E38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_483B64E84BF25BB4862ED086023628EB; // 0x0E40(0x01F0)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0F49661E483D18690943D5A60E9C4651; // 0x1030(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_23BD9C2B4796F9C17C95F88E24FA590F; // 0x1188(0x0158)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_198CD4F24503B23F8E1C83831ACA1C75; // 0x12E0(0x01F0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_29CC9B8B4BE8793088193CB629DA8F25; // 0x14D0(0x0178)(ContainsInstancedReference)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_E35612A347151EB6E0C89FB39305ACD8; // 0x1648(0x00B0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D0BE7D1349ED9A3E04355CA16F2E7D6F; // 0x16F8(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_3E05C95D42D6F88D76CBF9806752A726; // 0x1848(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_54A66F5B49AE1D1FBA6D25813892C827; // 0x1998(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_E299588A44E251E88078C19E99624E54; // 0x1AF0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9A2234A145852AAAA1EFF8816FFA37F1; // 0x1C48(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_06E466484721E868286664B175A88249; // 0x1DA0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_D169AAE84DB3B0EA626658BB75888B6C; // 0x1EF8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_EDF1611943119BC3783F5284C67EB05F; // 0x2050(0x0158)()

public:
	void ExecuteUbergraph_ABP_Assault_C301_Exoskeleton01_S01_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Assault_C301_Exoskeleton01_S01_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Assault_C301_Exoskeleton01_S01_UI_C")
	}
	static class UABP_Assault_C301_Exoskeleton01_S01_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Assault_C301_Exoskeleton01_S01_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Assault_C301_Exoskeleton01_S01_UI_C;

}

