#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Hero_Face_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ZZAnimationLib_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Hero_Face_UI.ABP_Hero_Face_UI_C
// 0x0E50 (0x10C0 - 0x0270)
class UABP_Hero_Face_UI_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6F02573541ECC579CE3289AEEED131B7; // 0x0278(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_A45F6F9941AE22065870AF87A3CAF201; // 0x0380(0x0088)()
	struct FAnimNode_CacheBlend                   ZZAnimGraphNode_CacheBlend_2273E558453C0D550EE751B3E40BA74E; // 0x0408(0x02F0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_8B169ABF4BF262146D305FAAAD960597; // 0x06F8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_DC5E999B4C2AB76D210FAFA294385128; // 0x0870(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6E0E354242EF02028AFFBAA48DB2490B; // 0x0998(0x0070)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_C84CC429421979D36C720A81B2084F74; // 0x0A08(0x00D8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8E3527A84427F89CEB61269DC149BF86; // 0x0AE0(0x0128)()
	struct FAnimNode_BlendCurveOnly               AnimGraphNode_BlendCurveOnly_CBDDE0E04F3B4F2DF338768467FE6217; // 0x0C08(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8C9BEA8541D63477A4397ABA085E475C; // 0x0C88(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1BE9F67A4C948CE0DC8D6CB5A6AF8A01; // 0x0D88(0x0120)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_BF793696436B7268E473E9BB6B125D78; // 0x0EA8(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_607D25764354A2B765D01C88D9F91750; // 0x0F10(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1CB8E8B14EF256A87E2AAAB30CCAFD78; // 0x0F78(0x0068)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3402DAAF4B5C6F948A9FFEAE49F1E2CB; // 0x0FE0(0x0050)()
	class UAnimSequenceBase*                      FaceLoopAnim;                                      // 0x1030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Look_At_Target;                                    // 0x1038(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Look_At_Weigth;                                    // 0x1044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Look_At_Speed_Strength;                            // 0x1048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104C[0x4];                                     // 0x104C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      DefaultFaceAnim;                                   // 0x1050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FaceAnimToggle;                                    // 0x1058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1059[0x7];                                     // 0x1059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAnimSequenceBase*, class UAnimSequenceBase*> BodyFaceAnimMapping;                    // 0x1060(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	class UPoseAsset*                             PoseAsset;                                         // 0x10B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          isPoseAssetValid;                                  // 0x10B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Hero_Face_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BlueprintBeginPlay(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SyncLookat(const struct FVector& LookAtTarget, float LookAtWeight, float LookAtSpeedStrength); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BlueprintInitializeAnimation(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SyncFaceAnim(class UAnimSequenceBase* BodyAnim, class UAnimSequenceBase* FaceAnim, bool IsResetPlay, bool SetOrGet, class UAnimSequenceBase** GetBodyAnim, class UAnimSequenceBase** GetFaceAnim, bool* GetIsResetPlay); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Hero_Face_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Hero_Face_UI_C")
	}
	static class UABP_Hero_Face_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Hero_Face_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Hero_Face_UI_C;

}

