#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Roy_Doctor_A_030_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Roy_Doctor_A_030_Hall_UI.ABP_Roy_Doctor_A_030_Hall_UI_C
// 0x13F0 (0x1660 - 0x0270)
class UABP_Roy_Doctor_A_030_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_D5A673EC48971B62063C3497C6270DBE; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_F231DF6F4190D2C7BADDDC9B5FE84593; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_FE95053244095EF9934BB888128CD6A5; // 0x0460(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_90ADC51749EC196E10FD89B95E5DCEC9; // 0x04C0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7F16501343DC245331E719809850AFBD; // 0x0520(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_86C2E9DE4148D084E3F081AED95D0692; // 0x05A8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3D81A9CA48FB029B2D9C659E5EC99201; // 0x06B8(0x0108)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_D11D9F7F4B1BB4456C7FC5AF0426E4AB; // 0x07C0(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_63F9B739484A0111B1639B8BE987F52F; // 0x0FD0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_917196E446BADC119F144FA6AA0D8C72; // 0x1128(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_B605B85E4FCA21DC4B2CACB1E4298205; // 0x1278(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_CE470530427E94630EFDFCB1CDE1992F; // 0x13C8(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9AF9007840B1465EFE479395F9FB4549; // 0x1520(0x0130)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x1658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x1659(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Roy_Doctor_A_030_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Roy_Doctor_A_030_Hall_UI_AnimGraphNode_BlendListByBool_86C2E9DE4148D084E3F081AED95D0692(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Roy_Doctor_A_030_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Roy_Doctor_A_030_Hall_UI_C")
	}
	static class UABP_Roy_Doctor_A_030_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Roy_Doctor_A_030_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Roy_Doctor_A_030_Hall_UI_C;

}

