#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BHD_Grimes_A_019_Hall_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BHD_Grimes_A_019_Hall_UI.ABP_BHD_Grimes_A_019_Hall_UI_C
// 0x10B0 (0x1320 - 0x0270)
class UABP_BHD_Grimes_A_019_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6B5D26934CC14B63AC4CFCAB9DD1494F; // 0x0278(0x0070)()
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_C6098EE1449C8FE7C2C750AA056199DE; // 0x02F0(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_CF8C8690438F936D19AB15B6EF8A5516; // 0x0B00(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_47D3D8C549984434B3496AA57E499F11; // 0x0B60(0x0060)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_BB6595054032088BDA1425B14A636F69; // 0x0BC0(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BCDF611141107F22F92B00B89668A021; // 0x0D38(0x0088)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0D779B9A42EF9D2B7097FA8BD2F1A587; // 0x0DC0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D45DDBB248C61CF2AFB3ACB990DE1EE3; // 0x0F18(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_E1EA568A4B6D172B348E2381B6B48C96; // 0x1068(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6A0BB5A649DECB3235CB13BADDA347E4; // 0x11B8(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x1318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x1319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_BHD_Grimes_A_019_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_BHD_Grimes_A_019_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_BHD_Grimes_A_019_Hall_UI_C")
	}
	static class UABP_BHD_Grimes_A_019_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BHD_Grimes_A_019_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_BHD_Grimes_A_019_Hall_UI_C;

}

