#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Terry_King_A_031_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Terry_King_A_031_Hall_UI.ABP_Terry_King_A_031_Hall_UI_C
// 0x2340 (0x25B0 - 0x0270)
class UABP_Terry_King_A_031_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_CBC46D9945822AED36244A9755EE60F5; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_F165127649F65F5B2A1AB19AB1877D78; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6A996B474C514503A8BA5ABF804DE689; // 0x0460(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_67DD162840F818F72BF2B09D4424DF2E; // 0x04C0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5C7D13C043AC6A801B79D38885507FFC; // 0x0520(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3161B5E9491EAE1AC810379136F65AC2; // 0x05A8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9E69567E4752D04CC84705A79F42EFF7; // 0x06B8(0x0108)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_12188AAB4BC8BDCF3013FFBDE5C884DE; // 0x07C0(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_41BA77F9433F9DD604F50F87945DDAF9; // 0x0FD0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_61C26CAB49870DFCCF0D8DA0FA503D9D; // 0x1128(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_1767D73E44D13C19935953B0822FF67B; // 0x1278(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_762E85C449E1B044E700D1BE3957F05A; // 0x13C8(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_D4F6884F49424CA4002682A5C7B20D6B; // 0x1520(0x00B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_886417BD492D325A094B2F8FD85A74C2; // 0x15D0(0x0130)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_64CC18E04AEAAB49BB5A0587C73CCEC5; // 0x1700(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_7ACD7C254409E959B4A0188994542052; // 0x1F10(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_AC19E68D4D8125168E988C99F2E3DEAD; // 0x2068(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_901480704CDFF427AD4C9DAE90C6012D; // 0x21C0(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_D0444913479925F901D633969C3A9C9F; // 0x2318(0x0130)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_670E8CD04E6A9DAE0F9A8ABFEABB4D3C; // 0x2448(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x25A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x25A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x25A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Terry_King_A_031_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terry_King_A_031_Hall_UI_AnimGraphNode_BlendListByBool_3161B5E9491EAE1AC810379136F65AC2(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Terry_King_A_031_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Terry_King_A_031_Hall_UI_C")
	}
	static class UABP_Terry_King_A_031_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Terry_King_A_031_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Terry_King_A_031_Hall_UI_C;

}

