#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Luna_014_Hall_UI

#include "Basic.hpp"

#include "PBDPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Luna_014_Hall_UI.ABP_Luna_014_Hall_UI_C
// 0x20E0 (0x2350 - 0x0270)
class UABP_Luna_014_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_620CAFCD4282AD676BAC09AA70A9B135; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_3DDC11E04019235E6A59DBA27C64D5CB; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Chain                        AnimGraphNode_Chain_21B1F03C489D0B105D498C8B3244E417; // 0x0460(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_47A8560445C45BD355465BBA9F1F3BC5; // 0x0C70(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_AA8D726B414DF597B2F24998D1791BDE; // 0x0CD0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_86C1A5434759F1A79EAA3A9CCF79E060; // 0x0D30(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BBFC01D94018F60C62AAE0BBCF693DBD; // 0x0DB8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D74ABABC4260343C4E365E8FEC8EE387; // 0x0EC8(0x0108)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A9BB57144592B9D2712803B3AA752E4D; // 0x0FD0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_EDBF5F7945AA24F80D89529F07F5AB21; // 0x1128(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_90FD09244A7B267AEC61418B77B7A0BE; // 0x1278(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_03F07F3546DC7DB08BBE4ABA64C99ACD; // 0x13C8(0x0158)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_45A509FB461F2A99A560F6953129D964; // 0x1520(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_049B73264F7F8524A8857B97FF4524D9; // 0x1D30(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_8815B01B40DFEAC36C09BD8956F7AD79; // 0x1E88(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_44E2E9FC48BC96808F2D97888A44339B; // 0x1FE0(0x00B0)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A49A627147DF7828416A66A7C8A611B7; // 0x2090(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_4914E375481D074882C3F59229F3E649; // 0x21E8(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x2340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x2348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x2349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Luna_014_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Luna_014_Hall_UI_AnimGraphNode_BlendListByBool_BBFC01D94018F60C62AAE0BBCF693DBD(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Luna_014_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Luna_014_Hall_UI_C")
	}
	static class UABP_Luna_014_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Luna_014_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Luna_014_Hall_UI_C;

}

