#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_M_Landon_20_Body_UI

#include "Basic.hpp"

#include "PBDPhysics_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_M_Landon_20_Body_UI.ABP_M_Landon_20_Body_UI_C
// 0x3430 (0x36A0 - 0x0270)
class UABP_M_Landon_20_Body_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_40BFF23049FBFD9713792B8D698C50BC; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_8A903CAE446E0201FC2C58AD3056404D; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Chain                        AnimGraphNode_Chain_B2E5593B47F01539C86DEFA0EB3DE6D6; // 0x0460(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23F712F54F8F81217816999F42005BA9; // 0x0C70(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_218597664A2D10633618389C9A6AC5C5; // 0x0CD0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_45ECEAA64B1066F3E78960B63D69AA6E; // 0x0D30(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B8FED73647517B7E774D8FAC44F42FF1; // 0x0DB8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C5FFB15046B42453E398848D5A8FFC3A; // 0x0EC8(0x0108)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_696F3D504566A50809BF0B994F84E793; // 0x0FD0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_B44D83CF458FB9C3CCDEA693EE7F9197; // 0x1128(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_4BA43B3A48C2F37D17F74992C3DDCA58; // 0x1278(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_44B07F734D6527152FB32B8734F0CE67; // 0x13C8(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_F29F8B8E4AEB87D9CE330F8CEF048F87; // 0x1520(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_09011549422E38CEA7F72EA513476808; // 0x1650(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_F72616514D65C4009181A6ACC713A985; // 0x1780(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1F05F05A4AA7B3FABC667D89A8C05FFE; // 0x18B0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_8C34CD8048C2927DDB68BABA31FC7E21; // 0x19E0(0x0130)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_A34A1E4C48AF3C6AB89134A2B1E0A1F9; // 0x1B10(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_378C97C04DB67F2BFE4BF1935B5A2D7C; // 0x1C60(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_12F7F28C46764AF83FBFE7A25AB76EF9; // 0x1DB0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B134C60048FB63F41967B597B48673DD; // 0x1F08(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_681046794D61E9A44A90D2B226E9384B; // 0x2060(0x00B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5FECA50F41047A44295FF9AD4D4D7E8D; // 0x2110(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5F5FBBA14BB0AA75F3EBAE85B86189C0; // 0x2240(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_467786D9447A9F97D9ABFF92B716ED92; // 0x2370(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7AA861124DB82499EA02068A626F05FE; // 0x24A0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_CA0EC91E4181DF0B9876B2949A25AC62; // 0x25D0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_575752604A89B6D2BDA232802E76D173; // 0x2700(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_202F86AD4F1EF23205C77FAA7D9FC9FA; // 0x2830(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_246443E940C83480188091B8661BE9BF; // 0x2960(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_EA9924ED476B8EF34BF2CEB097B416F7; // 0x2A90(0x0130)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_7A2D54CB4A15F5BF11DB80A9A7508E44; // 0x2BC0(0x0810)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_71362CDC4A1F2F29E7FC11B286531D0E; // 0x33D0(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13BD66D54990C3602D5D6EAE8C498B90; // 0x3530(0x0160)()
	class UAnimSequence*                          LoopAnim;                                          // 0x3690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x3698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x3699(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          isKnifeAnim;                                       // 0x369A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          isBendLine;                                        // 0x369B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_M_Landon_20_Body_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_M_Landon_20_Body_UI_AnimGraphNode_BlendListByBool_B8FED73647517B7E774D8FAC44F42FF1(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_M_Landon_20_Body_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_M_Landon_20_Body_UI_C")
	}
	static class UABP_M_Landon_20_Body_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_M_Landon_20_Body_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_M_Landon_20_Body_UI_C;

}

