#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Terry_018_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Terry_018_Hall_UI.ABP_Terry_018_Hall_UI_C
// 0x1B60 (0x1DD0 - 0x0270)
class UABP_Terry_018_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_5F7FF67C46BD3A376A3AFDAE11808FF8; // 0x0278(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_B8111E8B44D6C9E973BCBC8E9BB5DA12; // 0x02E8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DFCC944B4B9FBCF074F8E9BFE17FCC2B; // 0x0460(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_655FD2CA41329F7B6335E9AEA27BA871; // 0x04C0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6C1DC7D041772346BFD78AB4B896377C; // 0x0520(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_82B95048410903999FB8E9914EA1A3A9; // 0x05A8(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F9789E7945485E8D196978871F563FDF; // 0x06B8(0x0108)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_B96E1C4F4D32AEA6230939B5720A9FCB; // 0x07C0(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0C28568247B9B6DAA203EB80D4A7C6F7; // 0x0FD0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A517E4EF46CB67C25F3009A9B617DCA5; // 0x1128(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_CD399EAD4E38E38A390401B2ACD145E3; // 0x1280(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_893EE27A4B270F3E8670FEAD7222437B; // 0x13D8(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D207ECFF4FFB6DB9DA13ACA5B7CE710B; // 0x1528(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_EBBD1D894217DDB10FDF41B9A4338E3D; // 0x1678(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9F8C6A02425410349AD9EB9C24743544; // 0x17D0(0x00B0)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A66CAAE94C39A72729C89495A144D9F4; // 0x1880(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_FB49F90646663102399746AA9D99E400; // 0x19D8(0x0130)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_C1D748274ABEBE03F68CF2BDEBE12B38; // 0x1B08(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9801957F49CA724903A2D7A156432DE6; // 0x1C60(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1DB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x1DC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x1DC1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Terry_018_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Terry_018_Hall_UI_AnimGraphNode_BlendListByBool_82B95048410903999FB8E9914EA1A3A9(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Terry_018_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Terry_018_Hall_UI_C")
	}
	static class UABP_Terry_018_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Terry_018_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Terry_018_Hall_UI_C;

}

