#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Zoya_Angel_Body_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Zoya_Angel_Body_UI.ABP_Zoya_Angel_Body_UI_C
// 0x91C0 (0x9430 - 0x0270)
class UABP_Zoya_Angel_Body_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_89002A46487147BA98A5A295F7181FD3; // 0x0280(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21F4AC8F44D32BEB1CB1638404209FCC; // 0x0A90(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1AEB868F4C5A1C91E5FBF8A342664835; // 0x0AF0(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CA9D949E418FD72917279296311C9552; // 0x0B50(0x0088)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1A090A9C415CABD5A4680DA3B5777005; // 0x0BD8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_34D0F0F348CF2CEA5CFA75B00AAD363C; // 0x0D50(0x0070)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0EE7B3EC4C85A47C82C96F8D8B93235C; // 0x0DC0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_3E15CA8647AD4C7B230C78B8B9931769; // 0x0F18(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_0F09164548C13CC3134C4BA7528ABABA; // 0x1068(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_71FBF55E48A380D1B62F1BA39F932FBC; // 0x11B8(0x0158)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_ED0946EB46679D5A7D5E85B019192575; // 0x1310(0x0810)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_45E993544D0AD967F4387494308F9CA1; // 0x1B20(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_67E1F5724CF30816B5A23F95C81C2FA5; // 0x1C50(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_C678B92349216502DD1966B5E97C0720; // 0x1D80(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2E7C01E6456F7606DF6BDFA8367781E9; // 0x1EB0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_E117FF104D5E2684763B57BE877C3176; // 0x1FE0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1C9E86A9470B44E33FCF5BBF4F6B4272; // 0x2110(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_CD3A1C544B3741D2D1E724A8EE882D3C; // 0x2240(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3C9FDFAD4D12B0A8AD496D83BE6A8319; // 0x2370(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4AC84C2943CFC099145B26B0AFBFBCFC; // 0x24A0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7E99CBC646DA7C2D3A5D0FBC2200C186; // 0x25D0(0x0130)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_FC4F30C14D4ABBB5D0187EA62D22F28C; // 0x2700(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_1C9913EA4F2B32BE9AE27B8BA702FD64; // 0x2850(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_C4E3CCD8412658955FCDB98372564967; // 0x29A0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B4A1EE9B46CA6E8967AA81B9AEEC1727; // 0x2AF8(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_864F82C14A75E73836F247A09C6ACB69; // 0x2C50(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_FCD2359843763223F40C1B9F20A8D308; // 0x2D80(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_F5A29E9F4AE12ECBFE2278BC8FFECC49; // 0x2EB0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_F2950A324649B334C8462E97AAABE4CC; // 0x2FE0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6A9DBA814464598C374E9292EE7D7A0C; // 0x3110(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5B8131594542176A2FDF81AA949B1DF3; // 0x3240(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_24A5B93D4E9B261186225987FFB2FA4A; // 0x3370(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_CF27DC0E488055398D4B48A61051EE8A; // 0x34A0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_7EA1EB204382503787C10EA64C6ED47C; // 0x35D0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_C47FADCB40FBEC44BD82B19CDCE5C5D7; // 0x3700(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_792D707E49C723B5A6CB16BED37404D2; // 0x3830(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6ABFAAD740F85BFA4F90F2983BCFB561; // 0x3960(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_B29280A045A68C8D814ACFA289637C87; // 0x3A90(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_79ED076442E86787756290B22BD9DCD7; // 0x3BC0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_FDF8BA784F62265BF3DAD9A3111379FB; // 0x3CF0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6BDF5AE647AC7CE2A6069D9709248A89; // 0x3E20(0x0130)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5E61E3964F45AA419AC6F6BAF8C9F6CD; // 0x3F50(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B803A6F543567FA1C2A892951FE12A54; // 0x40A8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9BF89FB6439952780EBB9CA3185AE042; // 0x4200(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_C455045C454F0A51EEF91696F624B456; // 0x4358(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_1BC369BE4EBADFA781D5B8BA2983040D; // 0x44B0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6D16893049C6A76D7C1551B323E1886A; // 0x4608(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_8C7DA9DF485B560D8139D9B2A5EB48C5; // 0x4760(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_936FE9204D6B4ED806C88399207354C6; // 0x48B8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_BB092F4F4504F4B6757747BA62C708FD; // 0x4A10(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_592098494C74F87E312F01933F85285D; // 0x4B68(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_D59488E847D50C7DF7E48891A5BED219; // 0x4CC0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_D36C00A24A6EF7597EC45EA1BB14B6FE; // 0x4E18(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_8BC0FF9C45C0990B4EDCF6B5D226506C; // 0x4F70(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9D2139854AEC280DE0B9EE93052FB9E3; // 0x50C8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_CF08113A4561100B03316696DF1C156F; // 0x5220(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5DAD5B88498BA7B3FB00AAA0129A5940; // 0x5378(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_BB1267564C8BD127561ED8948B823B50; // 0x54D0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_521DFD14475388F965A4F5B12A7AFDEB; // 0x5628(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_CDF1B86F40A8FF8BF2AA7BA926D472DE; // 0x5780(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_270698B4499E339049467AB7349B83A7; // 0x58D8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_541DBE5748CC400BEA6E8F8389EC115A; // 0x5A30(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_E46E201F49262E3AEB8D1C9AB883FC60; // 0x5B88(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B794AE3E49BE3A58131A95B0BADDF896; // 0x5CE0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_D62E006E48DBEF32069F5E9355B36D5C; // 0x5E38(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_F1A6FAAD40D51DB8CBCCD2A1372BBEAD; // 0x5F90(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_5825F49043FF86712E2F09955818FD9F; // 0x60E8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_DE2A5FF34A666F232CCB498CDE42CD25; // 0x6240(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_3E2C465345F18FA4B534E2A3FF9A2128; // 0x6398(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_8DF752AD4ACDD0A2A5C348B43F06FA1E; // 0x64F0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_AA6E145245989FC18881B7AEC65BD1A2; // 0x6648(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A7404E924160E850353042B490A0B2A3; // 0x67A0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_34A369B341CE57CFA0FB8D9A3EB7DC20; // 0x68F8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_0640F99642774C8D7F70569EBF3F5CD9; // 0x6A50(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_8A8BAF3C4B6ED5358E4F1082B335360F; // 0x6BA8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_EBED5B5B448CA15E092F189C16E9B492; // 0x6D00(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9C6027514112FA6BBE435D98F6926CE0; // 0x6E58(0x00B0)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_DF1E5138494F246344BCBE8A50E8D4DA; // 0x6F08(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_E22DCC164D84510EED0DFFABB526236D; // 0x7060(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_DC71CF1A4368853A7E1660B86188AF58; // 0x71B8(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6A002A5C4FBEAA7CD85E65BCC3C6772D; // 0x7310(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_A1C8CF89424FC3E5C7025080DA89645D; // 0x7468(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_F849C37945950480D2379DB1D4044F8D; // 0x75C0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_6B338C594B7A34828D3FB684653F94D3; // 0x7718(0x0158)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_12ECE3814F7C8DD36573CAAEB6C8135F; // 0x7870(0x0810)()
	struct FAnimNode_Chain                        AnimGraphNode_Chain_4D4CADB949E4DA694CBB82B9D9372241; // 0x8080(0x0810)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_6264EC194BBB6624889388ADC45508B3; // 0x8890(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_3E71990545B0333CFBD4878D87E5E725; // 0x89E0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_136C46FE41DEF71FC7D92F836B4D2AE3; // 0x8B38(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_4A8D2F31458DF1E96F7A6AA87315F9CB; // 0x8C88(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_30FAE2E048FA704D69D556B2797B2A88; // 0x8DE0(0x0158)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_617A3932422164E77CDC2B81E569B9B7; // 0x8F38(0x0158)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_E6576E0A41D9A5C59B46229F57826A58; // 0x9090(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2FD82D1A4B968AACD5C405B391FA9575; // 0x91C0(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_21CC3E374AD3729BDF0E559D85EDE2D6; // 0x92F0(0x0130)()
	class UAnimSequence*                          LoopAnim;                                          // 0x9420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x9428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x9429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Zoya_Angel_Body_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Zoya_Angel_Body_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Zoya_Angel_Body_UI_C")
	}
	static class UABP_Zoya_Angel_Body_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Zoya_Angel_Body_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Zoya_Angel_Body_UI_C;

}

