#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Scout_C201_Bow01_S06_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Scout_C201_Bow01_S06_UI.ABP_Scout_C201_Bow01_S06_UI_C
// 0x0210 (0x0480 - 0x0270)
class UABP_Scout_C201_Bow01_S06_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F6FA75EA47A72852C106BE89C2C3BEB0; // 0x0278(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_77E696AA4AFE129AE0953AAD81DD321F; // 0x02E8(0x0088)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8D525CCB48A2DCBC690EE58F73CE1B02; // 0x0370(0x0108)()
	class UAnimSequenceBase*                      LoopAnim;                                          // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_Scout_C201_Bow01_S06_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Scout_C201_Bow01_S06_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Scout_C201_Bow01_S06_UI_C")
	}
	static class UABP_Scout_C201_Bow01_S06_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Scout_C201_Bow01_S06_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Scout_C201_Bow01_S06_UI_C;

}

