#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Zoya_025_Hall_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PBDPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Zoya_025_Hall_UI.ABP_Zoya_025_Hall_UI_C
// 0x1840 (0x1AB0 - 0x0270)
class UABP_Zoya_025_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13641FDD4CEDC804CA78FAAA644014A0; // 0x0278(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9A32AB62427009AC603441B083E2F7B2; // 0x02D8(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D6B2660B4DCB5B324CFE98A6D77605A9; // 0x0338(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_827E3AF441EE57D97495C09BD55758DD; // 0x03C0(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7485463E4716F32AB5A86AB92258A513; // 0x04D0(0x0108)()
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_779DB8F448211902F9B4E38F2FA0E7C1; // 0x05E0(0x0810)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B0AB36564484612B774961A03A1A0E8F; // 0x0DF0(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_3E9442C24EAEF82FB83D2EA161A2D813; // 0x0F48(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_8D7D7F8045E58BE7018BB3BC7A71ABAD; // 0x1098(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_2D6B5C134A533DBF981C138557C9F203; // 0x11E8(0x0158)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_50FE560345DBE4E61FAFDD96413DAD8F; // 0x1340(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_4314885B4112D4FF48440D8EACAF28F8; // 0x14B8(0x0070)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_C63710A146F7517177FF1A8047D38448; // 0x1528(0x00B0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4EB8CF4542CE07B9740828A22A4461A5; // 0x15D8(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_B4892E4544080BDE5759ADAFF798DEA6; // 0x1708(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_FCA151B044619E6995C324B3792F0E56; // 0x1838(0x0130)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_510BB4D54FC04805397033BB57A0767B; // 0x1968(0x0130)()
	class UAnimSequence*                          LoopAnim;                                          // 0x1A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x1AA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x1AA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Zoya_025_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Zoya_025_Hall_UI_AnimGraphNode_BlendListByBool_827E3AF441EE57D97495C09BD55758DD(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Zoya_025_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Zoya_025_Hall_UI_C")
	}
	static class UABP_Zoya_025_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Zoya_025_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_Zoya_025_Hall_UI_C;

}

