#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_BHD_Sanderson_A_022_Hall_UI

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_BHD_Sanderson_A_022_Hall_UI.ABP_BHD_Sanderson_A_022_Hall_UI_C
// 0x08A0 (0x0B10 - 0x0270)
class UABP_BHD_Sanderson_A_022_Hall_UI_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3CF4463C487D18ED9A83A7BA308B14C9; // 0x0278(0x0070)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_CDD85C114D00E674EB4274875BB7ABF3; // 0x02E8(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18E6CB754EFDECE446A8A28E4BADA9E2; // 0x0348(0x0060)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_F75AB78844065ECE389F848357625F54; // 0x03A8(0x0178)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_84288BA24B191FF04F7826863D41D445; // 0x0520(0x0088)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_9425FFDA4DE6ED319055928A2CE57E8A; // 0x05A8(0x0158)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_38E0DF634233BF2643967F9FF6810FBE; // 0x0700(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_C2844E66425362A6A0EB09BD3E7453E8; // 0x0850(0x0150)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_3C6A39C34413BE3BFB33FD8906EFAD7B; // 0x09A0(0x0158)()
	class UAnimSequence*                          LoopAnim;                                          // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          isDynamic;                                         // 0x0B00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                          ResetDynamicToggle;                                // 0x0B01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)

public:
	void ExecuteUbergraph_ABP_BHD_Sanderson_A_022_Hall_UI(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void DynamicSet(bool isDynamic_0, bool ResetDynamic); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_BHD_Sanderson_A_022_Hall_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_BHD_Sanderson_A_022_Hall_UI_C")
	}
	static class UABP_BHD_Sanderson_A_022_Hall_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_BHD_Sanderson_A_022_Hall_UI_C>();
	}
};
DUMPER7_ASSERTS_UABP_BHD_Sanderson_A_022_Hall_UI_C;

}

