#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AAGun

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AAGun.ABP_AAGun_C
// 0x0E30 (0x10C0 - 0x0290)
class UABP_AAGun_C final : public UDFMWeaponAAGunAnimInstance
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A9093F064C8E85622002A3BA24448E60; // 0x0298(0x0070)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_0480D8FE47FAB138267A7D80FBD3BECC; // 0x0308(0x0100)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_93FDF5D149538B0CD20320BB84263875; // 0x0408(0x0050)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2162CC7D4F97F227010E25BB13A6401A; // 0x0458(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C1CF4DE447CCCCA11D7298AA1324017C; // 0x05B8(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_347BF47E45D91CD4B2AEC9830603F481; // 0x0618(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_F97299434A593BDBBA06FBABD7C7289A; // 0x0678(0x0160)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_591ECD844D1B94A601293D9EEDAC0BFE; // 0x07D8(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_208B076B430CB2C562D6CFBC1B7AD144; // 0x0900(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_981EDCBA49FCAE95CC31FFA8C7AF422A; // 0x0988(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_DC5C0D274F5A7F893F96D9B34F3A7D06; // 0x09F0(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_509A418B44A9C4659CECC4A462F72315; // 0x0A58(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_96D80D4E43F0148F3078649DB0BAD249; // 0x0B58(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B77C0B70498DAD701CD270BAF4B70674; // 0x0BC0(0x0110)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6129787E42E3A49A158EB3AB99CC95B5; // 0x0CD0(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_CC7591F34467D6D8A1D2DE8EA3BD6E9D; // 0x0E30(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18432BC2472AAAA1822CDFAF02622F87; // 0x0E90(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2667057B46D9C2507889EF9061BB1F0D; // 0x0EF0(0x0160)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63542A23434B669667F5A2995A50C70C; // 0x1050(0x0068)()

public:
	void ExecuteUbergraph_ABP_AAGun(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AAGun_AnimGraphNode_ModifyBone_2162CC7D4F97F227010E25BB13A6401A(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AAGun_AnimGraphNode_ModifyBone_F97299434A593BDBBA06FBABD7C7289A(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AAGun_AnimGraphNode_ModifyBone_6129787E42E3A49A158EB3AB99CC95B5(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AAGun_AnimGraphNode_ModifyBone_2667057B46D9C2507889EF9061BB1F0D(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AAGun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AAGun_C")
	}
	static class UABP_AAGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AAGun_C>();
	}
};
DUMPER7_ASSERTS_UABP_AAGun_C;

}

