#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Weapon_ChainHook

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "DFMAbility_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Weapon_ChainHook.ABP_Weapon_ChainHook_C
// 0x0730 (0x1140 - 0x0A10)
class UABP_Weapon_ChainHook_C final : public UChainHookAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1420520544B26BED5402A1B5B729E511; // 0x0A18(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91401E32471069F5524D2BBC51140301; // 0x0A88(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3B5F5621431F7EE900859A9EBEB8137E; // 0x0AF8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67FBAB9641A2DB208FAA799E710F35AA; // 0x0B68(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30B119E741402BC40F0C0E897BF8B76F; // 0x0BD8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EF18A0BD4CB5C40CC9177C9F32C92573; // 0x0CE0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C4BBAF2248A15900549A0BB6EF4399A4; // 0x0D50(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_AB376A584CCBA45EA8F3D3A22766EC43; // 0x0E58(0x0070)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_AC9161AF419956A0D5C440AEC49071E3; // 0x0EC8(0x0050)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9015D80840FBFD9A8B18B0A70EE2D40E; // 0x0F18(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E079678C427375E28D62CD94097F9FE4; // 0x0F88(0x01B0)()

public:
	void ExecuteUbergraph_ABP_Weapon_ChainHook(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Weapon_ChainHook_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Weapon_ChainHook_C")
	}
	static class UABP_Weapon_ChainHook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Weapon_ChainHook_C>();
	}
};
DUMPER7_ASSERTS_UABP_Weapon_ChainHook_C;

}

