#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActvButtonStyle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// UserDefinedStruct ActvButtonStyle.ActvButtonStyle
// 0x00B8 (0x00B8 - 0x0000)
struct FActvButtonStyle final
{
public:
	class FString                                 Name_33_F8DDB4584080ADE45A9278B0F67D0490;          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector2D                              SizeOverrideHD_7_AC3E554E48032243DCBA62ACD3F3CBB9; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              SizeOverrideMobile_8_5192E20A4245B24646114A86FDB3FE92; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         FontOverride_6_183F47074E2C081E4E8FB68F512E3601;   // 0x0020(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FVector2D                              MaxDesiredSize_10_33AEFFF14E132DE1647D0C9B5C1DB157; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                TitleTextPadding_14_E68650E241B695117438A2BA5617F360; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         StateIconSize_18_BE4CC90641B58BFBBBE96B82F02BECD3; // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InfoBoxPositionHD_20_75C860E343BB7CD8B0E743A8DF03EBF1; // 0x0094(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              InfoBoxPositionMobile_22_9ED9237C4B2515AF415EC4A2F2D46706; // 0x009C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                DescTextPadding_25_A342AF564118D7F5F3589D89C6C19960; // 0x00A4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MaskEnabled_36_23BAA8404F8E9CB35749FC925D808389;   // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FActvButtonStyle;

}

