#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class AkAudio.AkMediaAssetData
// 0x0068 (0x0090 - 0x0028)
class UAkMediaAssetData final : public UObject
{
public:
	bool                                          IsStreamed;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseDeviceMemory;                                   // 0x0029(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Language;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetPlatform;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAssetData")
	}
	static class UAkMediaAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAssetData>();
	}
};
DUMPER7_ASSERTS_UAkMediaAssetData;

// Class AkAudio.AkGameObject
// 0x0020 (0x0270 - 0x0250)
class UAkGameObject : public USceneComponent
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAkEvent(class UAkAudioEvent* AkEvent, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const TArray<struct FAkExternalSourceInfo>& ExternalSources, const class FString& in_EventName); // (BlueprintCosmetic, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8E2C0
	void PostAkEventAsync(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, int32* PlayingId, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const TArray<struct FAkExternalSourceInfo>& ExternalSources, const struct FLatentActionInfo& LatentInfo); // (BlueprintCosmetic, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8E590
	int32 PostAssociatedAkEvent(int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const TArray<struct FAkExternalSourceInfo>& ExternalSources); // (BlueprintCosmetic, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8E8C0
	void PostAssociatedAkEventAsync(const class UObject* WorldContextObject, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const TArray<struct FAkExternalSourceInfo>& ExternalSources, const struct FLatentActionInfo& LatentInfo, int32* PlayingId); // (BlueprintCosmetic, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8EB00

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameObject")
	}
	static class UAkGameObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameObject>();
	}
};
DUMPER7_ASSERTS_UAkGameObject;

// Class AkAudio.AkAcousticPortal
// 0x0170 (0x0518 - 0x03A8)
class AAkAcousticPortal final : public AVolume
{
public:
	EAkAcousticPortalState                        InitialState;                                      // 0x03A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionRefreshInterval;                        // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             ObstructionCollisionChannel;                       // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x167];                                    // 0x03B1(0x0167)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal(); // (Final, Native, Public, BlueprintCallable) // @ 0x141C89270
	void OpenPortal(); // (Final, Native, Public, BlueprintCallable) // @ 0x141C89880

	EAkAcousticPortalState GetCurrentState() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C893B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticPortal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticPortal")
	}
	static class AAkAcousticPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAcousticPortal>();
	}
};
DUMPER7_ASSERTS_AAkAcousticPortal;

// Class AkAudio.AkMediaAsset
// 0x0070 (0x0098 - 0x0028)
class UAkMediaAsset : public UObject
{
public:
	uint32                                        ID;                                                // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MediaName;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoLoad;                                          // 0x0040(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        userData;                                          // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x10];                                      // 0x0068(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkMediaAssetData*                      CurrentMediaAssetData;                             // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAkMediaAssetData*                      CurrentMediaAssetData_LQ;                          // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAsset")
	}
	static class UAkMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkMediaAsset;

// Class AkAudio.AkComponent
// 0x0450 (0x06C0 - 0x0270)
class UAkComponent : public UAkGameObject
{
public:
	bool                                          bUseSpatialAudio;                                  // 0x0270(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	ECollisionChannel                             OcclusionCollisionChannel;                         // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             OriginalOcclusionCollisionChannel;                 // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OcclusionTraceOffset;                              // 0x027C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         EnableSpotReflectors : 1;                          // 0x0288(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugName;                                         // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DebugIndex;                                        // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAuxBus*                              EarlyReflectionAuxBus;                             // 0x02A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 EarlyReflectionAuxBusName;                         // 0x02B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EarlyReflectionOrder;                              // 0x02C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EarlyReflectionBusSendGain;                        // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EarlyReflectionMaxPathLength;                      // 0x02C8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         roomReverbAuxBusGain;                              // 0x02CC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         diffractionMaxEdges;                               // 0x02D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         diffractionMaxPaths;                               // 0x02D4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         diffractionMaxPathLength;                          // 0x02D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         DrawFirstOrderReflections : 1;                     // 0x02DC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DrawSecondOrderReflections : 1;                    // 0x02DC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DrawHigherOrderReflections : 1;                    // 0x02DC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DrawDiffraction : 1;                               // 0x02DC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DrawOccObs : 1;                                    // 0x02DC(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RoomObstructionValue;                              // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerDestroyed;                            // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttenuationScalingFactor;                          // 0x02E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionRefreshInterval;                          // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseReverbVolumes;                                 // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoUpdateReverbVolumes;                          // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F2[0x3CE];                                    // 0x02F2(0x03CE)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetRTPCValue(class UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, const class FString& RTPC, int32 PlayingId); // (Final, BlueprintCosmetic, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C89500
	int32 PostAkEventAndWaitForEnd(class UAkAudioEvent* AkEvent, const class FString& in_EventName, const TArray<struct FAkExternalSourceInfo>& ExternalSources, const struct FLatentActionInfo& LatentInfo); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C898A0
	void PostAkEventAndWaitForEndAsync(class UAkAudioEvent* AkEvent, int32* PlayingId, const TArray<struct FAkExternalSourceInfo>& ExternalSources, const struct FLatentActionInfo& LatentInfo); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C89B30
	int32 PostAkEventByName(const class FString& in_EventName); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C89D80
	int32 PostAssociatedAkEventAndWaitForEnd(const TArray<struct FAkExternalSourceInfo>& ExternalSources, const struct FLatentActionInfo& LatentInfo); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C89E50
	void PostAssociatedAkEventAndWaitForEndAsync(int32* PlayingId, const TArray<struct FAkExternalSourceInfo>& ExternalSources, const struct FLatentActionInfo& LatentInfo); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8A030
	void PostTrigger(class UAkTrigger* TriggerValue, const class FString& Trigger); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8A270
	void SetAttenuationScalingFactor(float Value); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8A530
	void SetEarlyReflectionsAuxBus(const class FString& AuxBusName); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8A630
	void SetEarlyReflectionsVolume(float SendVolume); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8A6F0
	void SetListeners(const TArray<class UAkComponent*>& Listeners); // (Final, BlueprintCosmetic, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8A800
	void SetOutputBusVolume(float BusVolume); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8A8D0
	void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, const class FString& RTPC); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8A950
	void SetStopWhenOwnerDestroyed(bool bStopWhenOwnerDestroyed); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8AB20
	void SetSwitch(class UAkSwitchValue* SwitchValue, const class FString& SwitchGroup, const class FString& SwitchState); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8ABB0
	void UseEarlyReflections(class UAkAuxBus* AuxBus, int32 Order, float BusSendGain, float MaxPathLength, bool SpotReflectors, const class FString& AuxBusName); // (Final, Native, Public, BlueprintCallable) // @ 0x141C8AE00
	void UseReverbVolumes(bool inUseReverbVolumes); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8B000

	float GetAttenuationRadius() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C89350
	float GetDistanceFromFirstListener() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C893E0
	float GetDistanceFromNearestListener() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C89410

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkComponent")
	}
	static class UAkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkComponent>();
	}
};
DUMPER7_ASSERTS_UAkComponent;

// Class AkAudio.AkLateReverbComponent
// 0x0040 (0x0290 - 0x0250)
class UAkLateReverbComponent : public USceneComponent
{
public:
	uint8                                         bEnable : 1;                                       // 0x0250(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAuxBus*                              AuxBus;                                            // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuxBusName;                                        // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SendLevel;                                         // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeRate;                                          // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkLateReverbComponent*                 NextLowerPriorityComponent;                        // 0x0280(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkLateReverbComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkLateReverbComponent")
	}
	static class UAkLateReverbComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkLateReverbComponent>();
	}
};
DUMPER7_ASSERTS_UAkLateReverbComponent;

// Class AkAudio.AkAudioType
// 0x0018 (0x0040 - 0x0028)
class UAkAudioType : public UObject
{
public:
	TArray<class UObject*>                        userData;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        ShortID;                                           // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioType")
	}
	static class UAkAudioType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioType>();
	}
};
DUMPER7_ASSERTS_UAkAudioType;

// Class AkAudio.AkAcousticTexture
// 0x0000 (0x0040 - 0x0040)
class UAkAcousticTexture final : public UAkAudioType
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticTexture")
	}
	static class UAkAcousticTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTexture>();
	}
};
DUMPER7_ASSERTS_UAkAcousticTexture;

// Class AkAudio.AkPortalComponent
// 0x0000 (0x0250 - 0x0250)
class UAkPortalComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPortalComponent")
	}
	static class UAkPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPortalComponent>();
	}
};
DUMPER7_ASSERTS_UAkPortalComponent;

// Class AkAudio.AkAmbientSound
// 0x0040 (0x03B0 - 0x0370)
class AAkAmbientSound final : public AActor
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0370(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                           AkComponent;                                       // 0x0378(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerIsDestroyed;                          // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_382[0x2E];                                     // 0x0382(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartAmbientSound(); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8ADC0
	void StopAmbientSound(); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8ADE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAmbientSound")
	}
	static class AAkAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAmbientSound>();
	}
};
DUMPER7_ASSERTS_AAkAmbientSound;

// Class AkAudio.AkAndroidInitializationSettings
// 0x0100 (0x0128 - 0x0028)
class UAkAndroidInitializationSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0030(0x0068)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x0098(0x0028)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAndroidAdvancedInitializationSettings AdvancedSettings;                                // 0x00C0(0x0068)(Edit, Config, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	void MigrateMultiCoreRendering(bool NewValue); // (Final, Native, Public) // @ 0x141C89800

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidInitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidInitializationSettings")
	}
	static class UAkAndroidInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidInitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkAndroidInitializationSettings;

// Class AkAudio.AkPlatformInfo
// 0x0048 (0x0070 - 0x0028)
class UAkPlatformInfo : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPlatformInfo")
	}
	static class UAkPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkPlatformInfo;

// Class AkAudio.AkAndroidPlatformInfo
// 0x0000 (0x0070 - 0x0070)
class UAkAndroidPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidPlatformInfo")
	}
	static class UAkAndroidPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkAndroidPlatformInfo;

// Class AkAudio.AkAssetBase
// 0x0010 (0x0050 - 0x0040)
class UAkAssetBase : public UAkAudioType
{
public:
	class UAkAssetPlatformData*                   PlatformAssetData;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetBase")
	}
	static class UAkAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetBase>();
	}
};
DUMPER7_ASSERTS_UAkAssetBase;

// Class AkAudio.AkAssetData
// 0x0178 (0x01A0 - 0x0028)
class UAkAssetData : public UObject
{
public:
	uint32                                        CachedHash;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CachedHash_LQ;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BankLanguage;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x160];                                     // 0x0040(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetData")
	}
	static class UAkAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetData>();
	}
};
DUMPER7_ASSERTS_UAkAssetData;

// Class AkAudio.AkAssetDataWithMedia
// 0x0060 (0x0200 - 0x01A0)
class UAkAssetDataWithMedia : public UAkAssetData
{
public:
	TArray<class UAkMediaAsset*>                  MediaList;                                         // 0x01A0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x50];                                     // 0x01B0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetDataWithMedia")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetDataWithMedia")
	}
	static class UAkAssetDataWithMedia* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetDataWithMedia>();
	}
};
DUMPER7_ASSERTS_UAkAssetDataWithMedia;

// Class AkAudio.AkAssetPlatformData
// 0x0010 (0x0038 - 0x0028)
class UAkAssetPlatformData final : public UObject
{
public:
	class UAkAssetData*                           CurrentAssetData;                                  // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAssetData*                           CurrentAssetData_LQ;                               // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetPlatformData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetPlatformData")
	}
	static class UAkAssetPlatformData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetPlatformData>();
	}
};
DUMPER7_ASSERTS_UAkAssetPlatformData;

// Class AkAudio.AkAssetDataSwitchContainerData
// 0x0050 (0x0078 - 0x0028)
class UAkAssetDataSwitchContainerData final : public UObject
{
public:
	TSoftObjectPtr<class UAkGroupValue>           GroupValue;                                        // 0x0028(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkGroupValue*                          DefaultGroupValue;                                 // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAkMediaAsset*>                  MediaList;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class UAkAssetDataSwitchContainerData*> Children;                                         // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetDataSwitchContainerData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetDataSwitchContainerData")
	}
	static class UAkAssetDataSwitchContainerData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetDataSwitchContainerData>();
	}
};
DUMPER7_ASSERTS_UAkAssetDataSwitchContainerData;

// Class AkAudio.AkAssetDataSwitchContainer
// 0x0068 (0x0268 - 0x0200)
class UAkAssetDataSwitchContainer : public UAkAssetDataWithMedia
{
public:
	TArray<class UAkAssetDataSwitchContainerData*> SwitchContainers;                                 // 0x0200(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class UAkGroupValue*                          DefaultGroupValue;                                 // 0x0210(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<uint32, class UAkAssetDataSwitchContainerData*> PendingSwitchLoads;                         // 0x0218(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetDataSwitchContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetDataSwitchContainer")
	}
	static class UAkAssetDataSwitchContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetDataSwitchContainer>();
	}
};
DUMPER7_ASSERTS_UAkAssetDataSwitchContainer;

// Class AkAudio.AkAudioEventData
// 0x01A0 (0x0408 - 0x0268)
class UAkAudioEventData final : public UAkAssetDataSwitchContainer
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0268(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInfinite;                                        // 0x026C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDuration;                                   // 0x0270(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDuration;                                   // 0x0274(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UAkAssetDataSwitchContainer*> LocalizedMedia;                          // 0x0278(0x0050)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	TSet<class UAkAudioEvent*>                    PostedEvents;                                      // 0x02C8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TSet<class UAkAuxBus*>                        UserDefinedSends;                                  // 0x0318(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TSet<class UAkTrigger*>                       PostedTriggers;                                    // 0x0368(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TSet<class UAkGroupValue*>                    GroupValues;                                       // 0x03B8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioEventData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioEventData")
	}
	static class UAkAudioEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioEventData>();
	}
};
DUMPER7_ASSERTS_UAkAudioEventData;

// Class AkAudio.AkAudioBank
// 0x00C8 (0x0118 - 0x0050)
class UAkAudioBank final : public UAkAssetBase
{
public:
	bool                                          AutoLoad;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, TSoftObjectPtr<class UAkAssetPlatformData>> LocalizedPlatformAssetDataMap;   // 0x0058(0x0050)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TSet<TSoftObjectPtr<class UAkAudioEvent>>     LinkedAkEvents;                                    // 0x00A8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	class UAkAssetPlatformData*                   CurrentLocalizedPlatformAssetData;                 // 0x00F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x18];                                     // 0x0100(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioBank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioBank")
	}
	static class UAkAudioBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioBank>();
	}
};
DUMPER7_ASSERTS_UAkAudioBank;

// Class AkAudio.AkAudioEvent
// 0x0098 (0x00E8 - 0x0050)
class UAkAudioEvent final : public UAkAssetBase
{
public:
	TMap<class FString, class UAkAssetPlatformData*> LocalizedPlatformAssetDataMap;                  // 0x0050(0x0050)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x18];                                      // 0x00A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          CanNotPlayBy3DFunc;                                // 0x00C0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAssetPlatformData*                   CurrentLocalizedPlatformData;                      // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaxAttenuationRadius;                              // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsInfinite;                                        // 0x00D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDuration;                                   // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MaximumDuration;                                   // 0x00DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        StopShortID;                                       // 0x00E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetIsInfinite() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C89440
	float GetMaxAttenuationRadius() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C89470
	float GetMaximumDuration() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C894A0
	float GetMinimumDuration() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C894D0
	uint32 GetStopShortID() const; // (Final, Native, Public, Const) // @ 0x141C89770

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioEvent")
	}
	static class UAkAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioEvent>();
	}
};
DUMPER7_ASSERTS_UAkAudioEvent;

// Class AkAudio.AkAudioInputComponent
// 0x0030 (0x06F0 - 0x06C0)
class UAkAudioInputComponent final : public UAkComponent
{
public:
	uint8                                         Pad_6C0[0x30];                                     // 0x06C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAssociatedAudioInputEvent(); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141C8A240

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioInputComponent")
	}
	static class UAkAudioInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioInputComponent>();
	}
};
DUMPER7_ASSERTS_UAkAudioInputComponent;

// Class AkAudio.AkAuxBus
// 0x0008 (0x0058 - 0x0050)
class UAkAuxBus final : public UAkAssetBase
{
public:
	class UAkAudioBank*                           RequiredBank;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAuxBus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAuxBus")
	}
	static class UAkAuxBus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAuxBus>();
	}
};
DUMPER7_ASSERTS_UAkAuxBus;

// Class AkAudio.AkCheckBox
// 0x0A88 (0x0BF0 - 0x0168)
class alignas(0x10) UAkCheckBox final : public UContentWidget
{
public:
	uint8                                         Pad_168[0x3C8];                                    // 0x0168(0x03C8)(Fixing Size After Last Property [ Dumper-7 ])
	ECheckBoxState                                CheckedState;                                      // 0x0530(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             CheckedStateDelegate;                              // 0x0534(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         WidgetStyle;                                       // 0x0548(0x05C8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0B10(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFocusable;                                       // 0x0B11(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B12[0x6];                                      // 0x0B12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkBoolPropertyToControl               ThePropertyToControl;                              // 0x0B18(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FAkWwiseItemToControl                  ItemToControl;                                     // 0x0B28(0x0040)(Edit, Config, EditConst, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsChecked)> AkOnCheckStateChanged;                           // 0x0B68(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGuid& ItemDroppedID)> OnItemDropped;                 // 0x0B78(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& PropertyDropped)> OnPropertyDropped;          // 0x0B88(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B98[0x58];                                     // 0x0B98(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAkBoolProperty(const class FString& ItemProperty); // (Final, Native, Public, BlueprintCallable) // @ 0x141C8A3D0
	void SetAkItemId(const struct FGuid& ItemID); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141C8A490
	void SetCheckedState(ECheckBoxState InCheckedState); // (Final, Native, Public, BlueprintCallable) // @ 0x141C8A5B0
	void SetIsChecked(bool InIsChecked); // (Final, Native, Public, BlueprintCallable) // @ 0x141C8A770

	const struct FGuid GetAkItemId() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x141C89290
	const class FString GetAkProperty() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C892D0
	ECheckBoxState GetCheckedState() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C89380
	bool IsChecked() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C897A0
	bool IsPressed() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141C897D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkCheckBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkCheckBox")
	}
	static class UAkCheckBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkCheckBox>();
	}
};
DUMPER7_ASSERTS_UAkCheckBox;

// Class AkAudio.AkEventMemoryStatistics
// 0x0000 (0x0028 - 0x0028)
class UAkEventMemoryStatistics final : public UBlueprintFunctionLibrary
{
public:
	static void ForceUnloadNonPlayingLeakingMediaMems(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141C8DCA0
	static void LogMemInfo(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141C8E2A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkEventMemoryStatistics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkEventMemoryStatistics")
	}
	static class UAkEventMemoryStatistics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkEventMemoryStatistics>();
	}
};
DUMPER7_ASSERTS_UAkEventMemoryStatistics;

// Class AkAudio.AkFolder
// 0x0078 (0x00B8 - 0x0040)
class UAkFolder final : public UAkAudioType
{
public:
	class FString                                 UnrealFolderPath;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WwiseFolderPath;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x58];                                      // 0x0060(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkFolder")
	}
	static class UAkFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkFolder>();
	}
};
DUMPER7_ASSERTS_UAkFolder;

// Class AkAudio.AkGameplayStatics
// 0x0000 (0x0028 - 0x0028)
class UAkGameplayStatics final : public UBlueprintFunctionLibrary
{
public:
	static void SetSwitch(class UAkSwitchValue* SwitchValue, class AActor* Actor, class FName SwitchGroup, class FName SwitchState); // (Final, BlueprintCosmetic, Native, Static, Public, BlueprintCallable) // @ 0x141C8EE10
	static bool TestGetAudioSamplesFromSinkRecordPlugin(TArray<float>* OutSamples); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x141C8EF40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameplayStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameplayStatics")
	}
	static class UAkGameplayStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameplayStatics>();
	}
};
DUMPER7_ASSERTS_UAkGameplayStatics;

// Class AkAudio.AkCallbackInfo
// 0x0008 (0x0030 - 0x0028)
class UAkCallbackInfo : public UObject
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkCallbackInfo")
	}
	static class UAkCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkCallbackInfo;

// Class AkAudio.AkEventCallbackInfo
// 0x0008 (0x0038 - 0x0030)
class UAkEventCallbackInfo : public UAkCallbackInfo
{
public:
	int32                                         PlayingId;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventID;                                           // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkEventCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkEventCallbackInfo")
	}
	static class UAkEventCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkEventCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkEventCallbackInfo;

// Class AkAudio.AkMIDIEventCallbackInfo
// 0x0008 (0x0040 - 0x0038)
class UAkMIDIEventCallbackInfo final : public UAkEventCallbackInfo
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetCc(struct FAkMidiCc* AsCc); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8DCC0
	uint8 GetChannel(); // (Final, Native, Public, BlueprintCallable) // @ 0x141C8DD70
	bool GetChannelAftertouch(struct FAkMidiChannelAftertouch* AsChannelAftertouch); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8DDA0
	bool GetGeneric(struct FAkMidiGeneric* AsGeneric); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8DE50
	bool GetNoteAftertouch(struct FAkMidiNoteAftertouch* AsNoteAftertouch); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8DF00
	bool GetNoteOff(struct FAkMidiNoteOnOff* AsNoteOff); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8DFB0
	bool GetNoteOn(struct FAkMidiNoteOnOff* AsNoteOn); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8E060
	bool GetPitchBend(struct FAkMidiPitchBend* AsPitchBend); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8E110
	bool GetProgramChange(struct FAkMidiProgramChange* AsProgramChange); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141C8E1C0
	EAkMidiEventType GetType(); // (Final, Native, Public, BlueprintCallable) // @ 0x141C8E270

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMIDIEventCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMIDIEventCallbackInfo")
	}
	static class UAkMIDIEventCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMIDIEventCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMIDIEventCallbackInfo;

// Class AkAudio.AkMarkerCallbackInfo
// 0x0018 (0x0050 - 0x0038)
class UAkMarkerCallbackInfo final : public UAkEventCallbackInfo
{
public:
	int32                                         Identifier;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Position;                                          // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMarkerCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMarkerCallbackInfo")
	}
	static class UAkMarkerCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMarkerCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkMarkerCallbackInfo;

// Class AkAudio.AkDurationCallbackInfo
// 0x0018 (0x0050 - 0x0038)
class UAkDurationCallbackInfo final : public UAkEventCallbackInfo
{
public:
	float                                         Duration;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EstimatedDuration;                                 // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AudioNodeID;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MediaID;                                           // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStreaming;                                        // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkDurationCallbackInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkDurationCallbackInfo")
	}
	static class UAkDurationCallbackInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkDurationCallbackInfo>();
	}
};
DUMPER7_ASSERTS_UAkDurationCallbackInfo;

// Class AkAudio.AkMusicSyncCallbackInfo
// 0x0040 (0x0070 - 0x0030)
class UAkMusicSyncCallbackInfo final : public UAkCallbackInfo
{
public:
	int32                                         PlayingId;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAkSegmentInfo                         SegmentInfo;                                       // 0x0034(0x0024)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	EAkCallbackType                               MusicSyncType;                                     // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserCueName;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMusicSyncCallbackInfo")
	}
	static const class FName& StaticName()
	{
