#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AssetManagerEx

#include "Basic.hpp"


namespace SDK
{

// Enum AssetManagerEx.EAssetRegistryDependencyTypeEx
// NumValues: 0x000A
enum class EAssetRegistryDependencyTypeEx : uint8
{
	None                                     = 0,
	Soft                                     = 1,
	Hard                                     = 2,
	SearchableName                           = 4,
	SoftManage                               = 8,
	HardManage                               = 16,
	Packages                                 = 3,
	Manage                                   = 24,
	All                                      = 31,
	EAssetRegistryDependencyTypeEx_MAX       = 32,
};

// ScriptStruct AssetManagerEx.AssetDetail
// 0x0030 (0x0030 - 0x0000)
struct FAssetDetail final
{
public:
	class FString                                 mPackagePath;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 mAssetType;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 mGuid;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetDetail;

// ScriptStruct AssetManagerEx.AssetDependenciesDetail
// 0x0060 (0x0060 - 0x0000)
struct FAssetDependenciesDetail final
{
public:
	class FString                                 ModuleCategory;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FAssetDetail>      AssetDependencyDetails;                            // 0x0010(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetDependenciesDetail;

// ScriptStruct AssetManagerEx.AssetDependenciesInfo
// 0x0050 (0x0050 - 0x0000)
struct FAssetDependenciesInfo final
{
public:
	TMap<class FString, struct FAssetDependenciesDetail> AssetsDependenciesMap;                      // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetDependenciesInfo;

// ScriptStruct AssetManagerEx.HotPatcherPackageInfo
// 0x0020 (0x0020 - 0x0000)
struct FHotPatcherPackageInfo final
{
public:
	class FString                                 AssetName;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetGuid;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHotPatcherPackageInfo;

}

