#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomFSM_BasePose

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AtomFSM_BasePose.AtomFSM_BasePose_C
// 0x25B8 (0x2C68 - 0x06B0)
class UAtomFSM_BasePose_C final : public UGPFSMInstanceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2_9C2181274B0B924D3CA5B9A279E94D46; // 0x06B8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_D4B4CDFA4851581F8DC45E9C7872C650; // 0x0818(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4BA7DDA040FC0248A8B01583B6E915F8; // 0x0978(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_2_C0DBF5B740F7B9D1ACCE33B304AEB402; // 0x0AD8(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_1_1FACFA3B42188AD48CB8FE86FA345CE8; // 0x0C78(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_CF4E52DC4722886E63BB5FA77C287B6E; // 0x0E18(0x01A0)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_26_0B8166E24E17986EEBD2D2B7C7669B87; // 0x0FB8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_25_4EF24D604A1B26CBA1B40CB1B5389803; // 0x10C8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_24_7B9A2F5242D5C0A09AEAFB9EF9777E0C; // 0x11D8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_23_BBD7E6C24F093AB644A50696EC37CC4C; // 0x12E8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_22_B5976DFF4B62E5360B1EA89D8AE977E4; // 0x13F8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_21_15350AC14AD6EC008466F6B4A498EE11; // 0x1508(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_20_E7A137594D279F137E503D85F7634CFD; // 0x1618(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_19_9A5DA2E04D383A8B99C59E8AF0EB45E7; // 0x1728(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_18_B6B6D9F7490CA6FD6E8F32943D0A1E5D; // 0x1838(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_17_BE4BA6884C262887F959F4BFA680387D; // 0x1948(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_16_CF57221F422BAFAA4FD449B4F0AF5428; // 0x1A58(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_15_5E2BC43B424AA24CCB3D5EBD3C81B7FF; // 0x1B68(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_14_5D13481E491E4F324E6FA682CDA631B8; // 0x1C78(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_13_FF1119B944E81D48E6D5268A78531DDF; // 0x1D88(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_12_AC5FF6854CD71E348887A49F30470B1D; // 0x1E98(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_11_E49029A54C1422B293D2DCAF7B77A77B; // 0x1FA8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_10_C8B8F8F94894193D040D218988FF0D46; // 0x20B8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_9_6822FBCA4761BC24374A13BFD75A09D5; // 0x21C8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_8_C7A4619E4BC836C83E483EA632945CFE; // 0x22D8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_7_DDBB8BA14A67FE72604D8FA6579B138B; // 0x23E8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_6_C6550DB84EB312D4876B03A1A1C9EF9F; // 0x24F8(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_5_F71F0EED42C74D3F066BB9ADB26CD698; // 0x2608(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_4_DB785E3546482417D936CEA201D16A44; // 0x2718(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_3_4C42393E427BF20986DAD9988C737B57; // 0x2828(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_2_49D0CA7F4C83C6204C50E4A0CEA472B6; // 0x2938(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_1_2FE81A82427E06D5C25F79A7B1A9AFDD; // 0x2A48(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_DF27C1CF48DAF7DA684A468CD7E15B35; // 0x2B58(0x0110)()

public:
	void SMGraphK2Node_TransitionResultNode_27CF2FEE49E25238DC6E0FB862AA8FDC_Event_GPCharacterFSMTransitionEvent__DelegateSignature_2(EGPFSMTransitionEvent EventType); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_27CF2FEE49E25238DC6E0FB862AA8FDC_Event_GPCharacterFSMTransitionEvent__DelegateSignature_1(EGPFSMTransitionEvent EventType); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_27CF2FEE49E25238DC6E0FB862AA8FDC_Event_GPCharacterFSMTransitionEvent__DelegateSignature(EGPFSMTransitionEvent EventType); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_2_BasePoseSharedState_to_Sprint_EFD806E04ABDE9F32B921585824829BA_43AA3AC04487F0E83EBE2298C3E4139E(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_1_Sprint_to_BasePoseSharedState_CBDAA00A4F248D800FAE268000ED2EDE_12EA9C614C7AE838E59272AF5273B324(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_0_BasePoseSharedState_to_Sprint_4D90F507408573065FB5D5B6FE3F4042_61D56974493DBA951F3DD7BCE4B5D25F(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_26_F912980BA1E49DC58E0B0C6B538C930B_124313F347AFF346271F419A11ACAD1D(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_25_8D8AAE1A9DCBB3A8870784ACE75E6F21_AC3A581B43367C5BDF993A8295CBB6DF(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_24_BEF33787E402DE38F6FDB54C4CA138B8_8B39148944895C1A5A8536BF6AC1B0BD(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_23_891E57B94B5421C8B7C330551284881B_D367F8E14747EE89CF08529B84D312CD(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_22_D72EB99E2CB74A904342169ADB1CA8FD_C0A5EDC7493E6A43D4EF54B2C85AA706(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_21_C5600FA9BEAF947D9FAB3AFDF625E219_086A02A74AD8F81032A6C0AD3F543F85(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_20_D77C841041182708170C5E0CDE78F50C_1BC336D74BAF37CA81FD05A1AC3352BA(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_19_FB5EE0DA2E801DFF4F68FE0382FFF377_123F78A345157F5EC46E758ABD6F1B52(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_18_2F52A5815851051767F77D1610E2D70A_607357E44BCEB3BD29021890DB3E3001(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_17_49C3DD959793C41BF06B9C3B87660697_BEBF6E4045479EC1C26BEF9F426AC5FB(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_16_3CB9803930ED2D6F97075B96534A5DA0_0A166B2947A780DCCA36EFA10FBDDAB1(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_15_C5EC90824BBB6D648D08B65F19DD8680_E1F6E79940DE8B62CE35AB89FFB05CAF(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_14_A4F21E8D892268C653893D22E5404D48_36F96CEF4FDC09FB4414779F1C1E4419(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_13_7D5690022126E20AA62236F443B3468A_7A41F36B4C00E69AA4398D8243EC7EA0(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_12_08D69815133DF15F7BBB4F130A23E30A_6078AFDD4565F545F8FF44903A81B34E(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_11_A47E9C4E8979A270EF2E5871668F49C6_8726D75148FB30072F8BB5992E2FA413(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_10_EE2C9C974BD4C5D0D671E88235927486_1A99E6744E4323759693018D181C808E(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_9_6932F0F5DF8ABCA747B4959901B71EC6_E05884B34098624BBA1B56A39BE26ECF(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_8_061D83AAE986DEBBCD843DB58383D437_8AD5BFC54A3707A3F76125AC8608DB29(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_7_B16E82FB86383E9E3695EC9C3D365C4E_6604F2DD419083998E4DBFB13B7D9AB2(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_6_3EDE059D3C82BB38F94C92108AE7550E_E3F922E046F0915EE8BD658D1166ACA6(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_5_DD1AE6F8818CED32C8B51A68571AF1BF_7FF404E64748E2989F18C49DB4398B8E(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_4_C4024619E1FA1B5FEC4CD27D529DEDFD_8A34311143DBF69A27EB6ABDA1DC1418(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_3_5F91878FFBFB228F133C449F60098EB2_10E93F0B4A11A59110B3AE9DCC827ECE(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_2_F2AF2D19DB28D621C9D444F2EE8ADAC3_0C4C89744222D3825893CA98D68C616D(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_1_B54898A39F090E782C29CA5A2D5EF5E9_9973989342530D36CD0B0D8BC0FC7846(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_GraphPropertyNode_0_E6B9789C4DD6013908D634F9B3AA59AD_B18C83F8409CF15A4D964985C4E88A73(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionInitializedNode_2_BasePoseSharedState_to_Sprint_EFD806E04ABDE9F32B921585824829BA_08AAD5ED40DEFB65E6A71588EA8519B8(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionShutdownNode_2_BasePoseSharedState_to_Sprint_EFD806E04ABDE9F32B921585824829BA_76BF193A427D4B89ECBAE6954376B396(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionInitializedNode_0_BasePoseSharedState_to_Sprint_4D90F507408573065FB5D5B6FE3F4042_AB606F624B67C55920EE4AAFBC7D9C44(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionShutdownNode_0_BasePoseSharedState_to_Sprint_4D90F507408573065FB5D5B6FE3F4042_1D9E18A142C55FEED2E484B5CEE34A38(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionInitializedNode_1_Sprint_to_BasePoseSharedState_CBDAA00A4F248D800FAE268000ED2EDE_CEA37019463FAAB9E39537AEF5667498(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionShutdownNode_1_Sprint_to_BasePoseSharedState_CBDAA00A4F248D800FAE268000ED2EDE_DECC415C4C25013E7D36089963C424C6(); // (BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_AtomFSM_BasePose(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AtomFSM_BasePose_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AtomFSM_BasePose_C")
	}
	static class UAtomFSM_BasePose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomFSM_BasePose_C>();
	}
};
DUMPER7_ASSERTS_UAtomFSM_BasePose_C;

}

