#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AtomFSM_Vehicle

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass AtomFSM_Vehicle.AtomFSM_Vehicle_C
// 0x9230 (0x98E0 - 0x06B0)
class UAtomFSM_Vehicle_C final : public UGPFSMInstanceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_26_ED6C3449487FF986A52034A2CF2AFBA4; // 0x06B8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_25_131B1572409C44E664A053A9E91891B7; // 0x0818(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_24_4F526C334BCBD6492E4E8CA6F5038E0B; // 0x0978(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_23_D8AD6DBE4BBD5854D0FF4A88844819ED; // 0x0AD8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_22_97E1E77B472CED83B27102A8817459B2; // 0x0C38(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_21_7706425E4955746EFEF2BE93FA53D26E; // 0x0D98(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_20_D94C88584722805C80CC869C09666FE6; // 0x0EF8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_19_D71545184B4BAE8A327D6B9C7EEA0889; // 0x1058(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_18_58C040964EFE8B2D328F7BBF3841FB7E; // 0x11B8(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_13_73E83D184E86C93DF07E20985388BD13; // 0x1318(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_12_ED5073234F68A35077C2EC9190F98640; // 0x14B8(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_17_03A653964766B00F5D32B5AAAAD31AD8; // 0x1658(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_16_6465BBF641CEC480FA93ACBA2978CAB8; // 0x17B8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_15_671B2CB1418C991F0F0C26814C64B09A; // 0x1918(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_14_719A1E3D4E74DF4DC2DC908AA75EB5C7; // 0x1A78(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_13_8D54333941F5E5B73251638765F88877; // 0x1BD8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_12_766D917E40EF5798173441BE7FFB5DC4; // 0x1D38(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_11_C27CAFA44BF8E48CCA5A36BF3D1F39DC; // 0x1E98(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_10_041537A24681776D59C69D8537190F9E; // 0x2038(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_11_8618B70E454B13CA97503EA9882724A1; // 0x21D8(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_9_51160ED4480F4CDFDAB071A6DEA3CFA4; // 0x2338(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_10_D380A8B64D60EA46F14EDDB91CC4BFDC; // 0x24D8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_9_71444E2541CA927CFC9DE7B5A2584FC2; // 0x2638(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_8_ED962D6B4BDE24C4B63152B73D81B4A8; // 0x2798(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_7_10930B594339C13B6F5A1D923085A744; // 0x28F8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_6_1E98D21E49CF41F47B878FA0BDAA8D66; // 0x2A58(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_5_523B436D4C0636AF37ED21997AF19688; // 0x2BB8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4_0A66399D44E554F5735E8697FF579D55; // 0x2D18(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_8_E25F36E64CC724C92435DE8C863BC7E3; // 0x2E78(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_7_C746EA194C2914D051DCA5B842EDCA5B; // 0x3018(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_6_9FDC987E4C17278AA1958BB96CF3B622; // 0x31B8(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_5_D76018DE472C3614A72AF78F3BE0BC61; // 0x3358(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_4_0446122945C53BED832AD2A0A1C4600B; // 0x34F8(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_3_AC54C8104397C43D9C6482A104DE2AF9; // 0x3698(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2_D1C2B7864B13EB1598CA348CACECD912; // 0x37F8(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_E7FBAE5A4B44EC251283B3A92F120A8E; // 0x3958(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_C6442B004A713B42E9273EA857CA0186; // 0x3AB8(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_3_02A6491448DC9A37D6568F92F14596D7; // 0x3C18(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_2_6EC4DD444BB26ECFFCDB62BF8543F22B; // 0x3DB8(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_1_A0A80CE94D81C131AE6FF7BC6179C890; // 0x3F58(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_F393F79E45EC00391479FB869B326DB2; // 0x40F8(0x01A0)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_6_C53E19E347D5C2064F6354900752D89F; // 0x4298(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_5_4ECDC212464BD1D4A43A92B19E4CA1CA; // 0x45D0(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_4_F9F51EB147729A2D54AC44B216D5635A; // 0x4908(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_3_B53E46ED4205378CAA8C5FB729B4B049; // 0x4C40(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_2_8C42DD334D84F912B38577AF7B2D6163; // 0x4F78(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_1_8A4B50204818BAFB356F668776852FC5; // 0x52B0(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_2C193379406833C8F229CA9A92316896; // 0x55E8(0x0338)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_59_0083F8EF4C124851653BB58A4DB7CD10; // 0x5920(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_58_D98F507543F4B7D12F734AA5C01C83AE; // 0x5A30(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_57_1E4FFF1441C0F021F4BB87AE3C43DDA6; // 0x5B40(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_56_57EF0D8F49FE0B0B221135A1BBAAE334; // 0x5C50(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_55_E3B11CE440FE9A5BF80B7699FEFB050B; // 0x5D60(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_54_A091647944BA48D3F1E9FBB82757502F; // 0x5E70(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_53_2D76FD3C4766D18C165879842B095CF3; // 0x5F80(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_52_83EFFBA64DAC0EA4D33671BDEE44450C; // 0x6090(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_51_F33D6F1543A010618A25B0A5C35E3B13; // 0x61A0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_50_BAE2D24F49FF8A2881C4D9A18A9EA07B; // 0x62B0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_49_12DADE504A1D5D16303FC3B588A5BA8B; // 0x63C0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_48_53D4FED74756F682D40F0DBEC737C14F; // 0x64D0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_47_AF1149CF40EF2529AE548995600CE424; // 0x65E0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_46_C998B0464C3514258D31BF9AC694C4FE; // 0x66F0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_45_BE798FF641624356DC9364BC442017C1; // 0x6800(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_44_07FD2FD243006BCE6ABF5A9268A00687; // 0x6910(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_43_B8C8D09C404B0358929458BAC266F8A1; // 0x6A20(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_42_308BA1B646C50D0EC653678118CF2D38; // 0x6B30(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_41_9EF5B4174C9E399C5BFA208F73F5ED3B; // 0x6C40(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_40_F6286FE74F6BEF5CACC3EEB8096DC11E; // 0x6D50(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_39_E5C55BA2477390054FFE2794450D186C; // 0x6E60(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_38_F61C64124CA1981CD90BC39F3A65AC7D; // 0x6F70(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_37_B0F010BD4321E0CAF9CC12A80EAEDD1A; // 0x7080(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_36_96100BD2440EEF76BCAA9CA1DB46FC5A; // 0x7190(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_35_1779758340F1577D8F9B39BCEA887E58; // 0x72A0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_34_9CD1AD5F45DEFBCBBFE9339CEC538DAB; // 0x73B0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_33_E733581446E4006EF2D225BDB6BF0F6F; // 0x74C0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_32_418BF1D045AC35CC3145BA86BF49F297; // 0x75D0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_31_8B78F0B6428C4C94732F2BBEE9DBBB7C; // 0x76E0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_30_423AAD884480EB259C17A0A5197231E6; // 0x77F0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_29_55D8D36A40430173493049A98016DC34; // 0x7900(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_28_A71DE4E2471A1080746D4280FD86D28B; // 0x7A10(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_27_7CE3B2B948975668B98520A0BCB2035B; // 0x7B20(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_26_D977D8E74B0FDAD7FE0F0D8EE190C6D5; // 0x7C30(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_25_74721D8A4666D61513321BAADAB91EC2; // 0x7D40(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_24_D363E55E4EF266EB864C389404B55CC7; // 0x7E50(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_23_F9B1D79943085B84E02252944E380F0C; // 0x7F60(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_22_FCF8BE49440B629F898C39BA85A17A40; // 0x8070(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_21_64B0BE2E4464D38A1B78FEA14D87AE22; // 0x8180(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_20_0DF50EEF4A8176974271DAA0C86EC1FF; // 0x8290(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_19_F466B57E4F16BDF58757D69E03337E57; // 0x83A0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_18_AB550B4B46713AE8D561FEAE17BD3D59; // 0x84B0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_17_1331AFEC4B20D9CF752593B9B6FB1D41; // 0x85C0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_16_23E1A3D643442A22E506B7A51C4F6F49; // 0x86D0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_15_B6933B5B4F937847F9F8208E992993C6; // 0x87E0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_14_82E5A31C40937A5310775DB1DE2CE1A5; // 0x88F0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_13_D17D13D248FAA6A25C2249BD2247334B; // 0x8A00(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_12_DB4F495F4BC5D871590F1CA4C59A89C5; // 0x8B10(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_11_C387C0CE49607B75508EC299AFF12828; // 0x8C20(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_10_01278C614BF028632AB0818DCA29AF97; // 0x8D30(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_9_490BB97C4BBD41EB70D6CBA8BEDB0FCA; // 0x8E40(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_8_31BA2E264A1727251215829BB8F3A990; // 0x8F50(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_7_3A63EBEF45CDFC8630278BB6159FFA82; // 0x9060(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_6_F31B72094294EB854E44CB95AFBFAB26; // 0x9170(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_5_AC796C204186DD84318268A26ED7922F; // 0x9280(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_4_8FE625994253B30152D7E78B8F72B52E; // 0x9390(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_3_A42759C44D74BB31B614C5B0CAE05F9B; // 0x94A0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_2_5AC3BEF14E49FBDBF6343ABF8027205C; // 0x95B0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_1_A6A2FD884C61A5035B3C5CA5E71B7AEF; // 0x96C0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_5976557C4EBBC9F979781498C2084AEA; // 0x97D0(0x0110)()

public:
	void SMGraphK2Node_TransitionInitializedNode_0_AutoDriveCar_to_GetOn_5206C81E40701CE923AAA2AC0CB61BE9_9CB5EE0C47AD8097AA48BFA8FEB849B0(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionShutdownNode_0_AutoDriveCar_to_GetOn_5206C81E40701CE923AAA2AC0CB61BE9_9AE6676D4A48C09E9F92C3960F96FA20(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionInitializedNode_1_GetOn_to_AutoDriveCar_19D60D22469E9739B6575280E579C4A8_6EC93D6E46F00E1CBC518F9F83C697CD(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionShutdownNode_1_GetOn_to_AutoDriveCar_19D60D22469E9739B6575280E579C4A8_9A1D5C1A4564958C691413815148B6CA(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionInitializedNode_2_Hip_Firing_to_Aim_Down_Sights_C093AB9B4EF47DD1C049B5A71594F9C1_A4975C05430BC9F023957496F3CF7F08(); // (BlueprintEvent) // @ 0x14B5B5E20
