#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseSystem

#include "Basic.hpp"

#include "BaseSystem_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class BaseSystem.BaseSystem
// 0x0058 (0x03C8 - 0x0370)
class ABaseSystem final : public AActor
{
public:
	TMap<TSubclassOf<class AActor>, struct FActorDependence> DataComponentClasses;                   // 0x0370(0x0050)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C0[0x8];                                      // 0x03C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseSystem")
	}
	static class ABaseSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseSystem>();
	}
};
DUMPER7_ASSERTS_ABaseSystem;

// Class BaseSystem.BaseSystemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UBaseSystemBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void RegisterAutoSpawnComponentForActor(TSubclassOf<class AActor> ActorClass, TSubclassOf<class UActorComponent> DataComponentClass, bool bPersistent, uint8 Flags_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CABA00

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseSystemBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseSystemBlueprintLibrary")
	}
	static class UBaseSystemBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseSystemBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UBaseSystemBlueprintLibrary;

// Class BaseSystem.SystemDataStorage
// 0x0050 (0x0078 - 0x0028)
class USystemDataStorage final : public UObject
{
public:
	TMap<class UScriptStruct*, struct FSystemData> DataStore;                                        // 0x0028(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SystemDataStorage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SystemDataStorage")
	}
	static class USystemDataStorage* GetDefaultObj()
	{
		return GetDefaultObjImpl<USystemDataStorage>();
	}
};
DUMPER7_ASSERTS_USystemDataStorage;

// Class BaseSystem.BaseSystemContainer
// 0x0010 (0x0038 - 0x0028)
class UBaseSystemContainer final : public UObject
{
public:
	TArray<TWeakObjectPtr<class ABaseSystem>>     Systems;                                           // 0x0028(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseSystemContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseSystemContainer")
	}
	static class UBaseSystemContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseSystemContainer>();
	}
};
DUMPER7_ASSERTS_UBaseSystemContainer;

// Class BaseSystem.WorldPreloadData
// 0x0030 (0x0058 - 0x0028)
class UWorldPreloadData final : public UObject
{
public:
	TArray<class UObject*>                        PreloadOjects;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSoftObjectPath>                SoftObjects;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        LoadedOjects;                                      // 0x0048(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WorldPreloadData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorldPreloadData")
	}
	static class UWorldPreloadData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPreloadData>();
	}
};
DUMPER7_ASSERTS_UWorldPreloadData;

// Class BaseSystem.SystemSettingGroup
// 0x0010 (0x0038 - 0x0028)
class USystemSettingGroup final : public UObject
{
public:
	TArray<struct FSystemConfig>                  SettingDatas;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SystemSettingGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SystemSettingGroup")
	}
	static class USystemSettingGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<USystemSettingGroup>();
	}
};
DUMPER7_ASSERTS_USystemSettingGroup;

// Class BaseSystem.BaseWorldSettings
// 0x0080 (0x0600 - 0x0580)
class ABaseWorldSettings final : public AWorldSettings
{
public:
	uint8                                         Pad_580[0x8];                                      // 0x0580(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWorldPreloadData*>              PreloadConfigs;                                    // 0x0588(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSystemConfig>                  SystemSettings;                                    // 0x0598(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class AActor>, struct FActorDependence> ComponentRegistry;                      // 0x05A8(0x0050)(Edit, ZeroConstructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	class USystemSettingGroup*                    SystemGroup;                                       // 0x05F8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseWorldSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseWorldSettings")
	}
	static class ABaseWorldSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseWorldSettings>();
	}
};
DUMPER7_ASSERTS_ABaseWorldSettings;

}

