#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BaseSystem

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct BaseSystem.RangeValue
// 0x000C (0x000C - 0x0000)
struct FRangeValue final
{
public:
	int32                                         MinValue;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxValue;                                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRangeValue;

// ScriptStruct BaseSystem.SystemData
// 0x0028 (0x0028 - 0x0000)
struct FSystemData final
{
public:
	class UObject*                                obj;                                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSystemData;

// ScriptStruct BaseSystem.DataStorageBase
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FDataStorageBase final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataStorageBase;

// ScriptStruct BaseSystem.DataTableRowNamePicker
// 0x0008 (0x0008 - 0x0000)
struct FDataTableRowNamePicker final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableRowNamePicker;

// ScriptStruct BaseSystem.DataTablePathPicker
// 0x0028 (0x0028 - 0x0000)
struct FDataTablePathPicker final
{
public:
	TSoftObjectPtr<class UDataTable>              DataTablePath;                                     // 0x0000(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTablePathPicker;

// ScriptStruct BaseSystem.DataTableRowPicker
// 0x0010 (0x0010 - 0x0000)
struct FDataTableRowPicker final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableRowPicker;

// ScriptStruct BaseSystem.DataTablePicker
// 0x0008 (0x0008 - 0x0000)
struct FDataTablePicker final
{
public:
	class UDataTable*                             DataTable;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTablePicker;

// ScriptStruct BaseSystem.SystemConfig
// 0x0010 (0x0010 - 0x0000)
struct FSystemConfig final
{
public:
	TSubclassOf<class ABaseSystem>                SystemClass;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Flags;                                             // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSystemConfig;

// ScriptStruct BaseSystem.SystemConfigs
// 0x0010 (0x0010 - 0x0000)
struct FSystemConfigs final
{
public:
	TArray<struct FSystemConfig>                  Configs;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSystemConfigs;

// ScriptStruct BaseSystem.ActorDependence
// 0x0058 (0x0058 - 0x0000)
struct FActorDependence final
{
public:
	TSet<TSubclassOf<class UActorComponent>>      ComponentClasses;                                  // 0x0000(0x0050)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Flags;                                             // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorDependence;

// ScriptStruct BaseSystem.ActorDependences
// 0x0010 (0x0010 - 0x0000)
struct FActorDependences final
{
public:
	TArray<struct FActorDependence>               Configs;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FActorDependences;

}

