#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleField

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DFMGameHud_classes.hpp"
#include "BattleField_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "GPGameFlow_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "GPGameHud_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "UMG_classes.hpp"
#include "GM_classes.hpp"
#include "GPAIBase_classes.hpp"


namespace SDK
{

// Class BattleField.WeaponSwitchView
// 0x0000 (0x0608 - 0x0608)
class UWeaponSwitchView final : public ULuaUIBaseView
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeaponSwitchView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeaponSwitchView")
	}
	static class UWeaponSwitchView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponSwitchView>();
	}
};
DUMPER7_ASSERTS_UWeaponSwitchView;

// Class BattleField.BattleFieldAudioPlayerComponent
// 0x0348 (0x0440 - 0x00F8)
class UBattleFieldAudioPlayerComponent : public UActorComponent
{
public:
	struct FSoftObjectPath                        BroadcastAudioTablePath;                           // 0x00F8(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        PlayerAudioTablePath;                              // 0x0110(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        TipsTablePath;                                     // 0x0128(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        BGMTablePath;                                      // 0x0140(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x20];                                     // 0x0158(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGPAudioEventAsset*>             CacheBroadcastAudioArr;                            // 0x0178(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UGPAudioEventAsset*>             CachePlayerAudioArr;                               // 0x0188(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UGPAudioEventAsset*>             CacheBGMArr;                                       // 0x0198(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A8[0x140];                                    // 0x01A8(0x0140)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBattleFieldAudioInfo>          AudioCacheArr;                                     // 0x02E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBattleFieldAudioInfo>          PlayerAudioCacheArr;                               // 0x02F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBattleFieldTipInfo>            TipsCacheArr;                                      // 0x0308(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGPAudioFuturePlayingID                CurrentBroadcastAudioId;                           // 0x0318(0x0008)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGPAudioFuturePlayingID                CurrentPlayerAudioId;                              // 0x0320(0x0008)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_328[0x28];                                     // 0x0328(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EBroadcastAudioType, float>              BroadcastAudioTriggerTimeMap;                      // 0x0350(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<EPlayerAudioType, float>                 PlayerAudioTriggerTimeMap;                         // 0x03A0(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<EBattleFieldTipType, float>              TipsTriggerTimeMap;                                // 0x03F0(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnBGMLoadComplete(const TArray<struct FSoftObjectPath>& Assets); // (Final, Native, Protected) // @ 0x14A547130
	void OnBGMTableLoadComplete(const struct FSoftObjectPath& AssetRef); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x14A5472C0
	void OnBroadcastAudioFinished(EGPEventCallbackType EventCallbackType, int32 PlayingId); // (Final, Native, Protected) // @ 0x14A5473A0
	void OnBroadcastAudiosLoadComplete(const TArray<struct FSoftObjectPath>& Assets); // (Final, Native, Protected) // @ 0x14A547540
	void OnBroadcastAudioTableLoadComplete(const struct FSoftObjectPath& AssetRef); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x14A547460
	void OnOwnerCharacterDied(class AGPCharacterBase* CHARACTER, class AController* Killer, const class UDamageType* DamageType); // (Final, Native, Protected) // @ 0x14A547A90
	void OnPlayerAudioFinished(EGPEventCallbackType EventCallbackType, int32 PlayingId); // (Final, Native, Protected) // @ 0x14A547B90
	void OnPlayerAudiosLoadComplete(const TArray<struct FSoftObjectPath>& Assets); // (Final, Native, Protected) // @ 0x14A547D30
	void OnPlayerAudioTableLoadComplete(const struct FSoftObjectPath& AssetRef); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x14A547C50
	void OnTipsEnd(); // (Final, Native, Protected) // @ 0x14A547FC0
	void OnTipsTableLoadComplete(const struct FSoftObjectPath& AssetRef); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x14A547FE0
	void ServerNetMulticastTriggerTip(const struct FBattleFieldTipInfo& TipInfo); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A5489E0
	void ServerTriggerAudio(const struct FBattleFieldAudioInfo& AudioInfo); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548D00
	void ServerTriggerBGM(EBackGroundMusicType InType); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A548D90
	void ServerTriggerClientAudio(const struct FBattleFieldAudioInfo& AudioInfo); // (Net, Native, Event, Public, NetClient) // @ 0x14A548E10
	void ServerTriggerTip(const struct FBattleFieldTipInfo& TipInfo); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548EA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldAudioPlayerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldAudioPlayerComponent")
	}
	static class UBattleFieldAudioPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldAudioPlayerComponent>();
	}
};
DUMPER7_ASSERTS_UBattleFieldAudioPlayerComponent;

// Class BattleField.BattleFieldCapturePoint
// 0x01D0 (0x0540 - 0x0370)
class ABattleFieldCapturePoint final : public AActor
{
public:
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x0380(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UShapeComponent*                        CollisionComp;                                     // 0x0388(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      CapturedMat;                                       // 0x0390(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      NeutralMat;                                        // 0x0398(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      EnemyCapturedMat;                                  // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AStaticMeshActor*                       ShowModel;                                         // 0x03A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Name_0;                                            // 0x03B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   NameInIcon;                                        // 0x03C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         RebornCloseRange;                                  // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RebornFarRange;                                    // 0x03E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefenseRange;                                      // 0x03E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RebornTimeLimit;                                   // 0x03EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AGPPlayerState*>                 Camp0OverlapedPlayer;                              // 0x03F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AGPPlayerState*>                 Camp1OverlapedPlayer;                              // 0x0400(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         CaptureNeedValue;                                  // 0x0410(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Captured2NeutralNeedValue;                         // 0x0414(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickInterval;                                      // 0x0418(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerGetValueEveryTick;                           // 0x041C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CampCaptureIncreaseLimitValue;                     // 0x0420(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CapturingGetPlayerScoreInterval;                   // 0x0424(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CaptureGetCampScore;                               // 0x0428(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CaptureGetCampScoreDelay;                          // 0x042C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 CampIdList;                                        // 0x0430(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<float>                                 CampCaptureValue;                                  // 0x0440(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, RepNotify, NativeAccessSpecifierPublic)
	int32                                         CaptureCamp;                                       // 0x0450(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECaptureState                                 CaptureState;                                      // 0x0454(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBattling;                                        // 0x0458(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CampAdvanced;                                      // 0x045C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_460[0x48];                                     // 0x0460(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowCapMarker;                                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class ADFMCharacter>>   Camp0InsideCharacters;                             // 0x04B0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class ADFMCharacter>>   Camp1InsideCharacters;                             // 0x04C0(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<int32>                                 Camp0CaptureTimeStamp;                             // 0x04D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 Camp1CaptureTimeStamp;                             // 0x04E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ADFMAIPlayerController*>         DefendingAIList;                                   // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_500[0x40];                                     // 0x0500(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AfterCaptureIncreaseScore(); // (Final, Native, Protected) // @ 0x14A545D30
	void CheckCharactersInPointAndInformHUD(); // (Final, Native, Protected) // @ 0x14A545E10
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult); // (Final, Native, Protected, HasOutParams) // @ 0x14A547750
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex); // (Final, Native, Protected) // @ 0x14A547950
	void OnRep_CampCaptureScore(); // (Final, Native, Protected) // @ 0x14A547EE0
	void OnRep_CapturedCamp(int32 OldCamp); // (Final, Native, Protected) // @ 0x14A547F20

	bool CanBeAutoDormant() const; // (Native, Protected, Const) // @ 0x144A3A390

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldCapturePoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldCapturePoint")
	}
	static class ABattleFieldCapturePoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleFieldCapturePoint>();
	}
};
DUMPER7_ASSERTS_ABattleFieldCapturePoint;

// Class BattleField.PVPAIJobs
// 0x0040 (0x0068 - 0x0028)
class UPVPAIJobs : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class ADFMAIPlayerController*                 Owner;                                             // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	EPVPAIJobType GetType(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55CD40
	bool IsNew(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55CDB0
	bool IsValid(); // (Native, Public, BlueprintCallable) // @ 0x141FB5A50
	void MarkIsDone(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55CDD0
	void MarkIsFailed(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55CE10
	void MarkIsRead(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55CE60
	void SetOwner(class ADFMAIPlayerController* Controller); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55D440

	bool IsDone() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14A55CD60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PVPAIJobs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PVPAIJobs")
	}
	static class UPVPAIJobs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPVPAIJobs>();
	}
};
DUMPER7_ASSERTS_UPVPAIJobs;

// Class BattleField.MoveToCapturePointJob
// 0x0010 (0x0078 - 0x0068)
class UMoveToCapturePointJob : public UPVPAIJobs
{
public:
	class ABattleRoutePoint*                      TargetRoutePoint;                                  // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 TargetPoint;                                       // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class AActor* GetTargetPoint(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55CD00
	void SetTargetPoint(class AActor* Point); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55D4C0
	void SetTargetRoutePoint(class ABattleRoutePoint* RoutePoint); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55D540

	class ABattleRoutePoint* GetTargetRoutePoint() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14A55CD20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MoveToCapturePointJob")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MoveToCapturePointJob")
	}
	static class UMoveToCapturePointJob* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoveToCapturePointJob>();
	}
};
DUMPER7_ASSERTS_UMoveToCapturePointJob;

// Class BattleField.BattleFieldCharacter
// 0x0020 (0x3510 - 0x34F0)
class ABattleFieldCharacter : public ADFMPlayerCharacter
{
public:
	uint8                                         Pad_34E8[0x3];                                     // 0x34E8(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EInGameBattleClassType                        BattleClassType;                                   // 0x34EB(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultPlayerArmedForceID;                         // 0x34EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         DefaultPlayerExpertID;                             // 0x34F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMRedeployComponent*                  DFMRedeployComponent;                              // 0x34F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBattleFieldHealthDataComponent*        BattleFieldHealthDataComponent;                    // 0x3500(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3508[0x8];                                     // 0x3508(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ServerChangeCurrentArmedPreset(int32 ArmedForceID, int32 BagId); // (Final, Native, Public, BlueprintCallable) // @ 0x14A545D50
	void ClientReceiveInGameUnlockVehiclePart(const uint64 UnlockVehiclePartItemID); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x149388BF0
	void ClientReceiveInGameUnlockWeapon(const struct FMPInventoryItemInfo& UnlockWeaponItem); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A545E30
	void ClientReceiveInGameWeaponStarIncrease(uint64 WeaponItemId, int32 StarNum); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A546070
	void ClientReceiveSwitchWeaponItemResult(int32 ArmedForceID, uint64 HeroID, uint64 ArmItemID, EAttachPosition InAttachPosition, const struct FMPInventoryItemInfo& InMPInventoryItemInfo); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A546140
	void ClientReceiveSwitchWeaponPreset(uint32 ArmedForceID, uint64 WeaponItemId, int32 WeaponPresetIndex); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A546460
	void ClientReceiveWeaponPresets(uint64 InItemID, const TArray<struct FTDMWeaponPreset>& WeaponPresetArr); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A546550
	void ClientReceiveWeaponStore(int32 InArmedForceID, uint64 HeroID, EAttachPosition AttachPosition, const TArray<struct FMPInventoryItemInfo>& ItemArr); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A546700
	void ClientReceiveWeaponStoreItemsInArmBag(int32 InArmedForceID, uint64 HeroID, const TArray<struct FMPInventoryItemInfo>& WeaponItemArr, const struct FMPInventoryItemInfo& SoldierItemArr); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14A5468D0
	bool IsNeedReplaceExpertData(); // (Final, Native, Public) // @ 0x14A546FE0
	void MatchEnd(const EMatchOverReason& reason); // (Native, Public, HasOutParams) // @ 0x14A547010
	void OnRep_BattleClassType(); // (Final, Native, Public) // @ 0x14A547EC0
	void RequestCancelWeaponItemRedDot(const TArray<uint64>& WeaponItemIDs); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548260
	void RequestSwitchWeaponPreset(uint32 ArmedForceID, uint64 HeroID, uint64 WeaponItemId, int32 WeaponPresetIndex); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548330
	void RequestWeaponPresetStore(uint64 InItemID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548470
	void RequestWeaponStore(int32 ArmedForceID, uint64 HeroID, EAttachPosition AttachPosition); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548500
	void ResetEqipment(); // (Final, Native, Public) // @ 0x14A5485F0
	void SaveRedeployMatrix(); // (Final, Native, Public) // @ 0x14A548610
	void ServerApplyWeaponItemModifyInFirstRedeploy(); // (Final, Native, Public) // @ 0x14A548630
	void ServerChangeCurrentArmedPreset(uint32 ArmedForceID, uint64 HeroID, uint32 BagId); // (Final, Native, Public) // @ 0x14A548650
	void ServerChangeCurrentArmedPresetByExpertID(int64 ExpertId, uint64 HeroID, uint32 BagId); // (Final, Native, Public) // @ 0x14A548750
	void ServerChangeCurrentArmedPresetByFullData(uint64 ExpertId, uint64 HeroID); // (Final, Native, Public) // @ 0x14A548850
	void ServerChangeCurrentArmedPresetWithFullData(uint32 ArmedForceID, uint64 HeroID); // (Native, Public) // @ 0x14A548910
	void ServerRequestSwitchWeaponItem(int32 ArmedForceID, uint64 HeroID, uint64 WeaponItemId); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548A70
	void ServerRequestWeaponStoreItemsInArmBag(int32 ArmedForceID, uint64 HeroID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14A548B70
	void ServerSetCurrentArmedPreset(uint64 ExpertId, uint64 HeroID); // (Final, Native, Public) // @ 0x14A548C40
	bool SwitchWeaponPreset(uint64 WeaponItemId, int32 WeaponPresetIndex); // (Final, Native, Public) // @ 0x14A549010

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldCharacter")
	}
	static class ABattleFieldCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleFieldCharacter>();
	}
};
DUMPER7_ASSERTS_ABattleFieldCharacter;

// Class BattleField.BattleFieldCharacterDeathConfigMgr
// 0x0068 (0x0098 - 0x0030)
class UBattleFieldCharacterDeathConfigMgr final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x68];                                      // 0x0030(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldCharacterDeathConfigMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldCharacterDeathConfigMgr")
	}
	static class UBattleFieldCharacterDeathConfigMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldCharacterDeathConfigMgr>();
	}
};
DUMPER7_ASSERTS_UBattleFieldCharacterDeathConfigMgr;

// Class BattleField.BattleFieldDSLogic
// 0x0000 (0x0670 - 0x0670)
class UBattleFieldDSLogic final : public UDFMDSLogic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldDSLogic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldDSLogic")
	}
	static class UBattleFieldDSLogic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldDSLogic>();
	}
};
DUMPER7_ASSERTS_UBattleFieldDSLogic;

// Class BattleField.BattleFieldGameMode
// 0x0040 (0x08B0 - 0x0870)
class ABattleFieldGameMode final : public ADFMGameMode
{
public:
	uint8                                         Pad_870[0x11];                                     // 0x0870(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          EnableFastRebornSetting;                           // 0x0881(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_882[0x6];                                      // 0x0882(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerStart*>                   RedPlayerStarts;                                   // 0x0888(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class APlayerStart*>                   BluePlayerStarts;                                  // 0x0898(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A8[0x8];                                      // 0x08A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RebornPlayer(class AController* PlayerController); // (Final, Native, Public) // @ 0x140C98C70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldGameMode")
	}
	static class ABattleFieldGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleFieldGameMode>();
	}
};
DUMPER7_ASSERTS_ABattleFieldGameMode;

// Class BattleField.PVPAISubsystem
// 0x01D8 (0x0B70 - 0x0998)
class APVPAISubsystem : public APVPAISubsystemBase
{
public:
	TMap<EPVPAIFightStyle, int32>                 FightStyleWeights;                                 // 0x0998(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RelayPointDistanceWeightCurve;                     // 0x09E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            FlankPointDistanceWeightCurve;                     // 0x09F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAssignJobDelay;                                   // 0x09F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9F9[0x3];                                      // 0x09F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AssignJobInterval;                                 // 0x09FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssignJobNumEverTime;                              // 0x0A00(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RequestSosEnemyDistance;                           // 0x0A04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RequestSosEnemyZDiff;                              // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequestSosEnemyCharacterNum;                       // 0x0A0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RequestSosEnemyThreatVehicle;                      // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RequestSosMaxInterval;                             // 0x0A14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RequestSosMinInterval;                             // 0x0A18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RequestSosBlockByFoliage;                          // 0x0A1C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1D[0x3];                                      // 0x0A1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RequestSosFoliageAsBlock;                          // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A24[0x4];                                      // 0x0A24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            RequestSosNoBlockDistCurve;                        // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RequestSosNoBlockAngleCurve;                       // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RequestSosBlockDistCurve;                          // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RequestSosBlockAngleCurve;                         // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectorScoreMinRatio;                               // 0x0A48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4C[0x4];                                      // 0x0A4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPVPAIJobs*>                     AIJobs;                                            // 0x0A50(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A60[0x8];                                      // 0x0A60(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AActor*, struct FPvpSectorBattleRouteInfo> SectorBattleRouteInfo;                     // 0x0A68(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_AB8[0xB8];                                     // 0x0AB8(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<EPoseType> CanPeekTargetFromLocation(class AActor* Target, const struct FVector& NavPoint, class ADFMAIController* AIController, float CrouchZOffset, float StandZOffset); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14A55EE80
	static struct FPvpAIPeekInfo GetPeekInfoBehindWall(class AActor* Target, const struct FVector& NavPoint, const struct FVector& WallLeft, const struct FVector& WallRight, class ADFMAIController* AIController, bool bDrawDebug, float CrouchZOffset, float StandZOffset); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14A55F460
	static class APVPAISubsystem* GetPPVPAISubsystem(const class UObject* ObjectContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A55F370
	static struct FPvpAIPeekInfo InnerGetPeekInfoBehindWall(class AActor* Target, const struct FVector& NavPoint, const struct FVector& WallLeft, const struct FVector& WallRight, class ADFMAIController* AIController, float HorizontalOffset, int32 CheckPointNum, float CrouchZOffset, float StandZOffset, class ULineBatchComponent* EditorDrawer); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14A55F8A0

	float BPCalcFlankRoutePointWeightScale(class ABattleRoutePoint* FlankPoint, class ADFMAIPlayerController* Controller); // (Native, Event, Public, BlueprintEvent) // @ 0x14A55EC60
	float CalcRescueCampmateEnvSecurity(class AGPCharacter* Helper, class AGPCharacter* DeathCharacter, float DistSec, float YawSec); // (Native, Event, Public, BlueprintEvent) // @ 0x14A55ED30
	class UPVPAIJobs* CreateJob(EPVPAIJobType Type, class ADFMAIPlayerController* Controller); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55F0A0
	void GetBotNumJobFlankRoutePoint(class ABattleRoutePoint* FlankPoint, int32* AttackNum, int32* DefendNum); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14A55F180
	float GetCapturePointScore(class ADFMAIPlayerController* Controller, class ABattleFieldCapturePoint* CP); // (Native, Event, Public, BlueprintEvent) // @ 0x14A55F2A0
	float GetRescueCampmateEnvSecurity(class AGPCharacter* Helper, class AGPCharacter* DeathCharacter); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55F750
	int32 GetRescueCampmateMarkCount(class AGPCharacter* DeathCharacter); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55F810
	void MarkRescueCampmateAction(class AGPCharacter* Helper, class AGPCharacter* DeathCharacter, bool AddMark); // (Final, Native, Public, BlueprintCallable) // @ 0x14A55FC10
	void OnAddBubbleMarker(class AController* Controller, EQuickChatMarkingItemType MarkingInfo); // (Final, Native, Protected) // @ 0x14A55FD20
	void OnCharacterEnterImpendingDeath(class AGPCharacterBase* GPCharacter); // (Final, Native, Protected) // @ 0x14A55FDE0
	void OnJobFinished(class UPVPAIJobs* Job); // (Native, Public) // @ 0x14A55FE60
	void OnPlayerAddBuffNtf(uint64 BuffId, class AActor* Maker, class AActor* MakerInstigator, class AActor* BuffOwner); // (Final, Native, Protected) // @ 0x14A55FEF0
	void OnPlayerRemoveBuffNtf(uint64 BuffId, class AActor* Maker, class AActor* MakerInstigator, class AActor* BuffOwner); // (Final, Native, Protected) // @ 0x14A560040
	void OnServerInitNewPlayer(class APlayerController* NewPlayerController, class AGPPlayerState* NewPlayerState); // (Final, Native, Protected) // @ 0x14A560190
	void OnServerLocalPlayerIsNeedRescueChanged(class AActor* InCharacter); // (Final, Native, Protected) // @ 0x14A560250
	void PlayerRequestAssistInternal(class ADFMPlayerController* PlayerContrller, class AGPCharacter* PlayerCharacter, EPlayerRequestAssistType AssistType); // (Native, Event, Protected, BlueprintEvent) // @ 0x14A5602D0
	int32 RandomIndexWithWeight(const TArray<float>& Weights); // (Final, Native, Public, BlueprintCallable) // @ 0x14A5603D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PVPAISubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PVPAISubsystem")
	}
	static class APVPAISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<APVPAISubsystem>();
	}
};
DUMPER7_ASSERTS_APVPAISubsystem;

// Class BattleField.BattleFieldGameState
// 0x02A0 (0x1130 - 0x0E90)
class ABattleFieldGameState final : public ADFMGameState
{
public:
	TArray<int32>                                 CampScoreList;                                     // 0x0E90(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<int32>                                 CampIdList;                                        // 0x0EA0(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPlayerStatItem>                PlayerStatistics_BF;                               // 0x0EB0(0x0010)(Edit, Net, ZeroConstructor, EditConst, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FPlayerKillAssistInfo>          PlayerKillAssistInfos;                             // 0x0EC0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         TargetScoreCount;                                  // 0x0ED0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeftTime;                                          // 0x0ED4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UsedTime;                                          // 0x0ED8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EDC[0x4];                                      // 0x0EDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABattleFieldCapturePoint*>       CapturePoints;                                     // 0x0EE0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_EF0[0x1A8];                                    // 0x0EF0(0x01A8)(Fixing Size After Last Property [ Dumper-7 ])
	class UBattleFieldNotifySubSystem*            BattleFieldNotifySubSystem;                        // 0x1098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A0[0x20];                                    // 0x10A0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AController*>                    Camp0Player;                                       // 0x10C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AController*>                    Camp1Player;                                       // 0x10D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10E0[0x50];                                    // 0x10E0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FPlayerStatItem GetMostKillPlayer(); // (Final, Native, Public) // @ 0x14A546C30
	TArray<class FString> GetPlayerNamesByCamp(int32 Camp, int32 maxLen); // (Final, Native, Public, BlueprintCallable) // @ 0x14A546D50
	int32 GetScoreCount(int32 Camp); // (Final, Native, Public, BlueprintCallable) // @ 0x14A546F50
	void MatchEndEvent(int32 Camp); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void MulticastMatchEnd(int32 Camp); // (Net, NetReliable, Native, Event, NetMulticast, Public, BlueprintCallable) // @ 0x14A5470B0
	void OnMatchEnd(int32 WinCamp); // (Final, Native, Public) // @ 0x14A5476D0
	void OnPlayerBeKilled(int32 Camp); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnRep_CampScore(); // (Final, Native, Public) // @ 0x14A547F00
	void OnRep_PlayerStatistics_BF(); // (Final, Native, Public) // @ 0x14A547FA0
	class FString PruneString(const class FString& InStr, int32 maxLen); // (Final, Native, Private) // @ 0x14A5480C0
	void SetCampScoreChange(int32 Camp, int32 Score); // (Final, Native, Public) // @ 0x14A548F30
	void SortPlayerStatsByScore(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A548FF0
	void UpdatePlayerStatsOffline(class AGPPlayerState* GPPS, uint64 InPlayerUin, bool bIsOffline); // (Final, Native, Private) // @ 0x14A5490D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldGameState")
	}
	static class ABattleFieldGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleFieldGameState>();
	}
};
DUMPER7_ASSERTS_ABattleFieldGameState;

// Class BattleField.BattleFieldHealthDataComponent
// 0x0000 (0x0C40 - 0x0C40)
class UBattleFieldHealthDataComponent final : public UDFMHealthDataComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldHealthDataComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldHealthDataComponent")
	}
	static class UBattleFieldHealthDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldHealthDataComponent>();
	}
};
DUMPER7_ASSERTS_UBattleFieldHealthDataComponent;

// Class BattleField.BattleFieldHUD
// 0x0030 (0x0760 - 0x0730)
class ABattleFieldHUD final : public ADFMHUD
{
public:
	class ABattleFieldGameState*                  GameState;                                         // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AGPPlayerController>     PlayerController;                                  // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ConquestTopBarPanelConfigName;                     // 0x0748(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CaptureFlagTopBarPanelConfigName;                  // 0x0750(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TopBarRefreshRate;                                 // 0x0758(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void NotifyHUD(int32 ChangeType); // (Final, Native, Public) // @ 0x14A54EE10
	void NotifyTeamInfoHUDMVP(); // (Final, Native, Public) // @ 0x14A54EE90
	void OnClientDFMGamePlayModeChanged(EDFMGamePlayMode InMode); // (Final, Native, Public) // @ 0x14A54F2B0
	void OnDFMGamePlaySubModeChanged(EDFMGamePlaySubMode InSubMode); // (Final, Native, Public) // @ 0x14A54F480
	void TopBarHudTimerFunction(); // (Final, Native, Private) // @ 0x14A550790

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldHUD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldHUD")
	}
	static class ABattleFieldHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleFieldHUD>();
	}
};
DUMPER7_ASSERTS_ABattleFieldHUD;

// Class BattleField.BattleFieldMapHUDController
// 0x0218 (0x04F0 - 0x02D8)
class UBattleFieldMapHUDController : public UMapBaseHUDController
{
public:
	uint8                                         Pad_2D8[0x28];                                     // 0x02D8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UMapInfoSystem*                         MapInfoSystem;                                     // 0x0300(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMBattleFieldSystem*                  BattleFieldSystem;                                 // 0x0308(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCapturePointIconHUDController*> CapturePointIconControllerArr;                     // 0x0310(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UBattleFieldTeamIconHUDController*> CampIconControllerArr;                          // 0x0320(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UBattleFieldMapMarkerIconHUDController*> FakeEnemyMarkerControllerArray;            // 0x0330(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UBattleFieldMapMarkerIconHUDController*> AvailableMarkControllerArr;                // 0x0340(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UBattleFieldMapMarkerIconHUDController*> UsingMarkControllerArr;                    // 0x0350(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<uint64, struct FTimerHandle>             EnemyLocationTimeHandleMap;                        // 0x0360(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSet<class AActor*>                           RegisteredMapIconActors;                           // 0x03B0(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_400[0x14];                                     // 0x0400(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickFrequency;                                     // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableKillInfoIcon;                               // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         KillInfoDSOutTime;                                 // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OnFireDuration;                                    // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SceneWeaponOnFireDuration;                         // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableDeadEnemy;                                  // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PendingDeadKillInfoDuration;                       // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DeadKillInfoDuration;                              // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PendingDeadTeamMateKillInfoDuration;               // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DeadTeamMateKillInfoDuration;                      // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int64, class UBattleFieldMapMarkerIconHUDController*> CampMateDeadControllers;              // 0x0440(0x0050)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<int64, struct FTimerHandle>              CampMateDeadTimers;                                // 0x0490(0x0050)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4E0[0x10];                                     // 0x04E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnClientGameStatePlayerKnockDownInfoNotify(const TArray<struct FSimpleKnockDownInfo>& KillInfos); // (Final, Native, Protected, HasOutParams) // @ 0x14A54F330
	void OnClientWeaponBeginFireNtf(class ACHARACTER* CharacterOwner); // (Final, Native, Protected) // @ 0x14A54F400
	void OnGameHudStateChanged(); // (Final, Native, Protected) // @ 0x14A54F650
	void OnGameStateCurStageChanged(int32 iValue); // (Final, Native, Protected) // @ 0x14A54F730
	void OnMapAddEnemyLocationIcon(const struct FPlayerLocation& EnemyPlayerLocation); // (Final, Native, Protected, HasOutParams) // @ 0x14A54F9F0
	void OnPlayerKillInfoNtf(const TArray<struct FKillInfo>& NewAddKillInfo); // (Final, Native, Protected, HasOutParams) // @ 0x14A54FD50
	void OnTeamIdentityReplicate(class AGPPlayerState* InPlayerState); // (Final, Native, Protected) // @ 0x14A5501C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldMapHUDController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldMapHUDController")
	}
	static class UBattleFieldMapHUDController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldMapHUDController>();
	}
};
DUMPER7_ASSERTS_UBattleFieldMapHUDController;

// Class BattleField.VCRViewCell
// 0x0018 (0x0388 - 0x0370)
class AVCRViewCell final : public AActor
{
public:
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UProceduralMeshComponent*               MeshComponent;                                     // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VCRViewCell")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VCRViewCell")
	}
	static class AVCRViewCell* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVCRViewCell>();
	}
};
DUMPER7_ASSERTS_AVCRViewCell;

// Class BattleField.BattleFieldMapMarkerIconHUDView
// 0x0038 (0x0490 - 0x0458)
class UBattleFieldMapMarkerIconHUDView final : public UMapItemHUDView
{
public:
	class UCanvasPanel*                           CanvasPanel_Default;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 PublicItemIcon;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_468[0x28];                                     // 0x0468(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldMapMarkerIconHUDView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldMapMarkerIconHUDView")
	}
	static class UBattleFieldMapMarkerIconHUDView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldMapMarkerIconHUDView>();
	}
};
DUMPER7_ASSERTS_UBattleFieldMapMarkerIconHUDView;

// Class BattleField.BattleFieldMapMarkerIconHUDController
// 0x0040 (0x02E0 - 0x02A0)
class UBattleFieldMapMarkerIconHUDController : public UMapIconViewController
{
public:
	EBattleFieldMapMarkerType                     markerType;                                        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        PlayerUin;                                         // 0x02A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPPlayerState*                         PSForThis;                                         // 0x02A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EnemyImgSize;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CampMateImgSize;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimMapInstancedIconScale_Enemy;                  // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimMapInstancedIconScale_CampMate;               // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyTeamLeaderShowTeamName;                       // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPSceneActorReplicator*                SceneActorReplicator;                              // 0x02D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldMapMarkerIconHUDController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldMapMarkerIconHUDController")
	}
	static class UBattleFieldMapMarkerIconHUDController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldMapMarkerIconHUDController>();
	}
};
DUMPER7_ASSERTS_UBattleFieldMapMarkerIconHUDController;

// Class BattleField.BattleFieldNotifySubSystem
// 0x00A8 (0x01A0 - 0x00F8)
class UBattleFieldNotifySubSystem : public UActorComponent
{
public:
	uint8                                         Pad_F8[0xA0];                                      // 0x00F8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bFistkilled;                                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAimEnemy(class ACHARACTER* LocalCharacter, class ACHARACTER* TargetCharacter); // (Final, Native, Public) // @ 0x14A54EEB0
	void OnBattleFieldCampScoreTrigger(int32 Camp, int32 Score); // (Final, Native, Protected) // @ 0x14A54EF70
	void OnCampScoreChange(int32 ScoreCamp, int32 Score); // (Final, Native, Public) // @ 0x14A54F030
	void OnCapturePointCapturedHalf(class ABattleFieldCapturePoint* Point, int32 CaptureHalfCamp); // (Final, Native, Public) // @ 0x14A54F0F0
	void OnCapturePointCapturedState(class ABattleFieldCapturePoint* Point, int32 OldCamp, int32 CapturedCamp); // (Final, Native, Public) // @ 0x14A54F1B0
