#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BetterSpline

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "BetterSpline_structs.hpp"


namespace SDK
{

// Class BetterSpline.BetterSplineSettings
// 0x0008 (0x0040 - 0x0038)
class UBetterSplineSettings final : public UDeveloperSettings
{
public:
	uint8                                         bHideSubHandles : 1;                               // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowParamSplineWhenEditingLandscape : 1;          // 0x0038(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowParamSplineOnlyWithPCGTool : 1;               // 0x0038(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, Config, GlobalConfig, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BetterSplineSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BetterSplineSettings")
	}
	static class UBetterSplineSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBetterSplineSettings>();
	}
};
DUMPER7_ASSERTS_UBetterSplineSettings;

// Class BetterSpline.ParamSplineComponent
// 0x0240 (0x08C0 - 0x0680)
class UParamSplineComponent final : public USplineComponent
{
public:
	TMap<class FString, float>                    SplineParameters;                                  // 0x0678(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            SplineStringParameters;                            // 0x06C8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     SplineBooleanParameters;                           // 0x0718(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FParamSplineCurves                     ParamSplineCurves;                                 // 0x0768(0x00C8)(Edit, NativeAccessSpecifierPublic)
	struct FParamSplinePointParameter             DefaultSplinePointParameter;                       // 0x0830(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReplaceSections;                                   // 0x0890(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bHasWidth;                                         // 0x08A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasDepth;                                         // 0x08A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasWidthFalloff;                                  // 0x08A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsymmetricWidth;                                  // 0x08A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsymmetricWidthFalloff;                           // 0x08A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasReplaceSection;                                // 0x08A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSnap;                                         // 0x08A6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A7[0x1];                                      // 0x08A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SnapDistance;                                      // 0x08A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugMeshGridSize;                                 // 0x08AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineResolution;                                  // 0x08B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EParamCurveMode                               ForceSplineType;                                   // 0x08B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B5[0xB];                                      // 0x08B5(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParamSplineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParamSplineComponent")
	}
	static class UParamSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParamSplineComponent>();
	}
};
DUMPER7_ASSERTS_UParamSplineComponent;

}

