#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BetterSpline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum BetterSpline.EParamCurveMode
// NumValues: 0x0005
enum class EParamCurveMode : uint8
{
	None                                     = 0,
	Curve                                    = 1,
	Linear                                   = 2,
	Constant                                 = 3,
	EParamCurveMode_MAX                      = 4,
};

// ScriptStruct BetterSpline.ParamSplineCurves
// 0x00C8 (0x00C8 - 0x0000)
struct FParamSplineCurves final
{
public:
	struct FInterpCurveFloat                      Width;                                             // 0x0000(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      Depth;                                             // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      WidthFalloff;                                      // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      LeftWidth;                                         // 0x0048(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      LeftWidthFalloff;                                  // 0x0060(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FInterpCurveFloat> CustomProperties;                                  // 0x0078(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FParamSplineCurves;

// ScriptStruct BetterSpline.ParamSplineInstanceData
// 0x0190 (0x0318 - 0x0188)
struct FParamSplineInstanceData final : public FSplineInstanceData
{
public:
	struct FParamSplineCurves                     ParamSplineCurves;                                 // 0x0188(0x00C8)(NativeAccessSpecifierPublic)
	struct FParamSplineCurves                     ParamSplineCurvesPreUCS;                           // 0x0250(0x00C8)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FParamSplineInstanceData;

// ScriptStruct BetterSpline.ParamSplinePointParameter
// 0x0060 (0x0060 - 0x0000)
struct FParamSplinePointParameter final
{
public:
	float                                         Width;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidthFalloff;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, float>                    CustomProperties;                                  // 0x0010(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FParamSplinePointParameter;

}

