#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BinkMediaPlayer

#include "Basic.hpp"


namespace SDK
{

// Enum BinkMediaPlayer.EBinkMediaPlayerBinkDrawStyle
// NumValues: 0x0006
enum class EBinkMediaPlayerBinkDrawStyle : uint8
{
	BMASM_Bink_DS_RenderToTexture            = 0,
	BMASM_Bink_DS_OverlayFillScreenWithAspectRatio = 1,
	BMASM_Bink_DS_OverlayOriginalMovieSize   = 2,
	BMASM_Bink_DS_OverlayFillScreen          = 3,
	BMASM_Bink_DS_OverlaySpecificDestinationRectangle = 4,
	BMASM_Bink_DS_MAX                        = 5,
};

// Enum BinkMediaPlayer.EBinkMediaPlayerBinkSoundTrack
// NumValues: 0x0008
enum class EBinkMediaPlayerBinkSoundTrack : uint8
{
	BMASM_Bink_Sound_None                    = 0,
	BMASM_Bink_Sound_Simple                  = 1,
	BMASM_Bink_Sound_LanguageOverride        = 2,
	BMASM_Bink_Sound_51                      = 3,
	BMASM_Bink_Sound_51LanguageOverride      = 4,
	BMASM_Bink_Sound_71                      = 5,
	BMASM_Bink_Sound_71LanguageOverride      = 6,
	BMASM_Bink_Sound_MAX                     = 7,
};

// Enum BinkMediaPlayer.EBinkMediaPlayerBinkBufferModes
// NumValues: 0x0004
enum class EBinkMediaPlayerBinkBufferModes : uint8
{
	BMASM_Bink_Stream                        = 0,
	BMASM_Bink_PreloadAll                    = 1,
	BMASM_Bink_StreamUntilResident           = 2,
	BMASM_Bink_MAX                           = 3,
};

// Enum BinkMediaPlayer.EBinkMoviePlayerBinkSoundTrack
// NumValues: 0x0008
enum class EBinkMoviePlayerBinkSoundTrack : uint8
{
	MP_Bink_Sound_None                       = 0,
	MP_Bink_Sound_Simple                     = 1,
	MP_Bink_Sound_LanguageOverride           = 2,
	MP_Bink_Sound_51                         = 3,
	MP_Bink_Sound_51LanguageOverride         = 4,
	MP_Bink_Sound_71                         = 5,
	MP_Bink_Sound_71LanguageOverride         = 6,
	MP_Bink_Sound_MAX                        = 7,
};

// Enum BinkMediaPlayer.EBinkMoviePlayerBinkBufferModes
// NumValues: 0x0004
enum class EBinkMoviePlayerBinkBufferModes : uint8
{
	MP_Bink_Stream                           = 0,
	MP_Bink_PreloadAll                       = 1,
	MP_Bink_StreamUntilResident              = 2,
	MP_Bink_MAX                              = 3,
};

// ScriptStruct BinkMediaPlayer.BinkMediaSrtEntry
// 0x00C8 (0x00C8 - 0x0000)
struct FBinkMediaSrtEntry final
{
public:
	int32                                         Index;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartTime;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndTime;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int32>                    StartTimes;                                        // 0x0010(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    EndTimes;                                          // 0x0060(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   DisplayText;                                       // 0x00B0(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBinkMediaSrtEntry;

}

