#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BinkMediaPlayer

#include "Basic.hpp"

#include "BinkMediaPlayer_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class BinkMediaPlayer.BinkFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBinkFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Bink_DrawOverlays(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1411BB6E0
	static struct FTimespan BinkLoadingMovie_GetDuration(); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x1411BB5D0
	static struct FTimespan BinkLoadingMovie_GetTime(); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x1411BB610

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkFunctionLibrary")
	}
	static class UBinkFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBinkFunctionLibrary;

// Class BinkMediaPlayer.BinkMediaManager
// 0x0060 (0x0090 - 0x0030)
class UBinkMediaManager final : public UGameInstanceSubsystem
{
public:
	TMap<class FName, class UBinkMediaPlayer*>    CachedToken2Player;                                // 0x0030(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UBinkMediaPlayer*>               CachedIdlePlayer;                                  // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UBinkMediaManager* GetBinkMediaManager(const class UGameInstance* InGameInstance); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1411BBC30

	bool BinkInFrontEnd(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BB570
	bool BinkInGame(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BB5A0
	void BinkSetInGame(bool bIsInGame); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BB650
	void DumpUsingPlayer(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BBC10
	class UBinkMediaPlayer* GetBinkPlayer(const class FName& InToken); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1411BBCB0
	void InitCachedPlayer(); // (Final, Native, Public) // @ 0x1411BC120
	void ReleaseBinkPlayer(const class FName& InToken); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1411BC680

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMediaManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMediaManager")
	}
	static class UBinkMediaManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaManager>();
	}
};
DUMPER7_ASSERTS_UBinkMediaManager;

// Class BinkMediaPlayer.BinkMediaPlayer
// 0x0128 (0x0150 - 0x0028)
class UBinkMediaPlayer final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMediaClosed;                                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaOpened;                    // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMediaReachedEnd;                                 // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlaybackSuspended;                               // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Looping : 1;                                       // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         StartImmediately : 1;                              // 0x0080(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         DelayedOpen : 1;                                   // 0x0080(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x0084(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x008C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0098(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkBufferModes               BinkBufferMode;                                    // 0x00A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x00A9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x00AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMediaPlayerBinkDrawStyle                 BinkDrawStyle;                                     // 0x00B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkLayerDepth;                                    // 0x00B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x38];                                      // 0x00B8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaSrt*                          CurSubtitle;                                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F8[0x58];                                      // 0x00F8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool CheckDolphinFilePath(const class FString& InURL, class FString* OutFullUrl); // (Final, Native, Static, Public, HasOutParams) // @ 0x1411BB760
	static bool CheckPufferFilePath(const class FString& InURL, class FString* OutFullUrl); // (Final, Native, Static, Public, HasOutParams) // @ 0x1411BB8B0
	static class FString GetGameSavedPath(bool bInternal); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1411BBEB0
	static bool GetGameVersionStr(class FString* OutGameVersion); // (Final, Native, Static, Public, HasOutParams) // @ 0x1411BBF80
	static bool IsBinkMediaPlayerEnable(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1411BC140

	void CloseUrl(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BBA20
	void Draw(class UTexture* Texture, bool tonemap, int32 out_nits, float Alpha, bool srgb_decode, bool hdr); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BBA40
	class FString GetCurrentSubtitle(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BBD50
	class FText GetCurrentSubtitleFromAsset(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BBDD0
	bool LoadSubtitles(const class FString& SrtUrl); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC290
	bool LoadSubtitlesFromAsset(const struct FSoftObjectPath& InResPath, const class FString& InVoiceCulture); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x1411BC3C0
	void OnSubTitleAssetLoaded(); // (Final, Native, Private) // @ 0x1411BC530
	bool OpenUrl(const class FString& NewURL); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC550
	bool Pause(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC620
	bool Play(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC650
	void ResetSubtitle(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC710
	bool Rewind(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC730
	bool Seek(const struct FTimespan& InTime); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x1411BC760
	bool SetLooping(bool InLooping); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC800
	bool SetRate(float Rate); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC910
	void SetVolume(float Rate); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC9A0
	void Stop(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BCA20

	bool CanPause() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BB700
	bool CanPlay() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BB730
	struct FTimespan GetDuration() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BBE70
	float GetRate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC050
	struct FTimespan GetTime() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC080
	class FString GetUrl() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC0C0
	bool IsInitialized() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC170
	bool IsLooping() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC1A0
	bool IsPaused() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC1D0
	bool IsPlaying() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC200
	bool IsSeeking() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC230
	bool IsStopped() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BC260
	bool SupportsRate(float Rate, bool Unthinned) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BCA40
	bool SupportsScrubbing() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BCB10
	bool SupportsSeeking() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1411BCB10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMediaPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMediaPlayer")
	}
	static class UBinkMediaPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaPlayer>();
	}
};
DUMPER7_ASSERTS_UBinkMediaPlayer;

// Class BinkMediaPlayer.BinkMediaSrt
// 0x0038 (0x0060 - 0x0028)
class UBinkMediaSrt final : public UObject
{
public:
	TArray<struct FBinkMediaSrtEntry>             Entries;                                           // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         CurStartTime;                                      // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurEndTime;                                        // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurIndex;                                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextStartTime;                                     // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastEndTime;                                       // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VoiceCulture;                                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMediaSrt")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMediaSrt")
	}
	static class UBinkMediaSrt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaSrt>();
	}
};
DUMPER7_ASSERTS_UBinkMediaSrt;

// Class BinkMediaPlayer.BinkMediaTexture
// 0x0038 (0x0168 - 0x0130)
class UBinkMediaTexture final : public UTexture
{
public:
	ETextureAddress                               AddressX;                                          // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaPlayer*                       MediaPlayer;                                       // 0x0138(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  PixelFormat;                                       // 0x0140(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          tonemap;                                           // 0x0141(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutputNits;                                        // 0x0144(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0148(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DecodeSRGB;                                        // 0x014C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepLastFrame;                                    // 0x014D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReleaseResourceAfterClose;                        // 0x014E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14F[0x19];                                     // 0x014F(0x0019)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear(); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BBA00
	void HandleMediaClosed(); // (Final, Native, Public) // @ 0x1411BC100
	void SetMediaPlayer(class UBinkMediaPlayer* InMediaPlayer); // (Final, Native, Public, BlueprintCallable) // @ 0x1411BC890

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMediaTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMediaTexture")
	}
	static class UBinkMediaTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMediaTexture>();
	}
};
DUMPER7_ASSERTS_UBinkMediaTexture;

// Class BinkMediaPlayer.BinkMoviePlayerSettings
// 0x0020 (0x0048 - 0x0028)
class UBinkMoviePlayerSettings final : public UObject
{
public:
	EBinkMoviePlayerBinkBufferModes               BinkBufferMode;                                    // 0x0028(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBinkMoviePlayerBinkSoundTrack                BinkSoundTrack;                                    // 0x0029(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BinkSoundTrackStart;                               // 0x002C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationUpperLeft;                          // 0x0030(0x0008)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              BinkDestinationLowerRight;                         // 0x0038(0x0008)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  BinkPixelFormat;                                   // 0x0040(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BinkMoviePlayerSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BinkMoviePlayerSettings")
	}
	static class UBinkMoviePlayerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBinkMoviePlayerSettings>();
	}
};
DUMPER7_ASSERTS_UBinkMoviePlayerSettings;

}

