#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlackScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BlackScreen.BlackScreen_C
// 0x0030 (0x0418 - 0x03E8)
class UBlackScreen_C final : public UBaseUIView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_49;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_ScaleBg_C*                  WBP_Common_ScaleBg;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Finished_E5DA7A8141C1FBA8799AF2A4B755579B(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PlayFadeIn(float FadeTime); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PlayFadeOut(float FadeTime); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void DirectShow(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void DirectHide(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_BlackScreen(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BlackScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlackScreen_C")
	}
	static class UBlackScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlackScreen_C>();
	}
};
DUMPER7_ASSERTS_UBlackScreen_C;

}

