#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AnimNotify_FootStep

#include "Basic.hpp"

#include "GPAudioRuntime_structs.hpp"
#include "GPAudioRuntime_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AnimNotify_FootStep.BP_AnimNotify_FootStep_C
// 0x0040 (0x0080 - 0x0040)
class UBP_AnimNotify_FootStep_C : public UAnimNotify_GPAudioBase
{
public:
	class FString                                 AttachName;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EventName;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash)
	EGPAudioFootSoundType                         AudioType;                                         // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      BindPhysMat;                                       // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistance;                                       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterialAudioDataAsset*        BindConfig;                                        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetNotifyName() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AnimNotify_FootStep_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AnimNotify_FootStep_C")
	}
	static class UBP_AnimNotify_FootStep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AnimNotify_FootStep_C>();
	}
};
DUMPER7_ASSERTS_UBP_AnimNotify_FootStep_C;

}

