#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Anim_HallMainCharacter

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Hall_classes.hpp"
#include "ZZAnimationLib_structs.hpp"
#include "GPGameplay_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Anim_HallMainCharacter.BP_Anim_HallMainCharacter_C
// 0x5A60 (0x5F80 - 0x0520)
class UBP_Anim_HallMainCharacter_C final : public UHallMainCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C31710AA4D3004BA12A5DFA90B4FE74D; // 0x0528(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6548DC294C7F81625157ACA8AE9A432A; // 0x0598(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92F36AC74CE3F591CE4660B297B9451C; // 0x0608(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A10E9BC743C7956120E68BB36FD654A5; // 0x0678(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48BA9D624FFC5CC14E6EBE89C68BC2F2; // 0x0780(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B65F306C47C12E36B212608804004ABF; // 0x07F0(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77B45AB34EE5EBE50137628693F2FA75; // 0x08F8(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_992FE6A14E354DF0896E9E97BE98102F; // 0x0968(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6E89DA254848BE255BED6798ED7470F5; // 0x0B18(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C09B101D4F608FDDED9E66964C8F8F3F; // 0x0B88(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A083B8DA4B358AE86F2B7D8B4D4FB4B4; // 0x0BF8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56BC82DD41C6A5022A6429A5A93FAF6E; // 0x0C68(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1DC53D4243151165EF2AB09FEC90E1DB; // 0x0CD8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C327D92841EEF97CD66A498592B5032E; // 0x0D48(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C2F7828C457EEAF3BEE731BB793E9C76; // 0x0DB8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45D143B641B8870C186F239A40BF7495; // 0x0E28(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_836E29EF4D4961B6DF65139BEB250F5C; // 0x0E98(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CB72D21F44C24F0878DA499502B1B0A1; // 0x0F08(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EA1382BC419B8ECA9DFADD948EE10B13; // 0x0F78(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7A9F57184FDFA7C3E3303B8CE7457A97; // 0x0FE8(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E46D907D458AB801B69F8DA4BCB61586; // 0x1058(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D1FDBBF1412BFD9CCC17F199E239CD9F; // 0x10C8(0x0070)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C35E69A6437B5676730951B95F05F6E5; // 0x1138(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1D1B3E344BFA443EFD27FCB2459EE928; // 0x1258(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25D9E6574E491DB8FAF1C7B1D7F3CB92; // 0x1360(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7DF618B74BC887B79D0D098362C9ED8F; // 0x1468(0x0070)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_183548F740560915C4A064923BAEF1ED; // 0x14D8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4C2049AF4C54DA91EC5C7384C286DDF0; // 0x15F8(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4AFFF88748FB75DE86175C895F2FF82C; // 0x1700(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B67E0E2B4B18005EE50667B66BCA9DEB; // 0x1808(0x0070)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_725E747D4F417C5794D50680D426E7EF; // 0x1878(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B252866244E4FF1057C46BA469FE049B; // 0x1998(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B5ADECEB4602063744E03E8C98F89FF7; // 0x1AA0(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EECE27FF4D74B615469659AAF4E9080E; // 0x1BA8(0x0070)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5561920845890CF2FB2D79A8CBD7275A; // 0x1C18(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9EEF01A646DBA22EDBC3289D4DA5813F; // 0x1D38(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0B0B5D8B4091F007246DD6A14EA09087; // 0x1E40(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_373C3B9D4DD930C8A35CA59F66B601B5; // 0x1F48(0x0070)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_B7F1DC6F46AFF907D75F8FACC1B272C0; // 0x1FB8(0x0098)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BF5286BD4438CCC11709AB99F022A76F; // 0x2050(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A5E4AF8B43ACEC6CE3AE9CAE493F932F; // 0x2158(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32CE1294454B11263151ACBDAFA47DE5; // 0x21C8(0x0108)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_EEB248F441F24C96ED8181ADFDF3A123; // 0x22D0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C765B233413D062C891288B959FE910B; // 0x23F0(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D8291E724E72B57E838D9E8A459E7CE8; // 0x24F8(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_551D886A424B383A82967B96CC9D47FD; // 0x2568(0x01B0)()
	uint8                                         Pad_2718[0x8];                                     // 0x2718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_239D42574B0CCF4D209B85B16CBF9CD9; // 0x2720(0x01F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3C622EE048E67EE824295D9EBA8CD672; // 0x2910(0x0160)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_59467AED43B9AD550FC3C8BAE134FED0; // 0x2A70(0x01F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_225D23714DF1F6F49EE0F5BFFA736380; // 0x2C60(0x0160)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1390D7FB45F4D4F52E24AA87E6DA0BD0; // 0x2DC0(0x0060)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_06F85F934C41F849322264928D1807A6; // 0x2E20(0x0060)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_C27644BE4F7C568286A1EE8FA300BDF4; // 0x2E80(0x0050)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_B98D97A941C0F19EABCD6CB29E6CECE5; // 0x2ED0(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_819946FD47B6F4CC9464A3B695862BFD; // 0x2FB0(0x0110)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_532E0BB942CF4F3677395695DF49C34F; // 0x30C0(0x00E0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_14A8248546FB82FBE98627B20EDE8DE6; // 0x31A0(0x00E0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_9DAC3937407C162859A15B8A9471F8E9; // 0x3280(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6FEA343D49B5D5394FD4B789527A26A3; // 0x32D0(0x0100)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_B09DFBBC4237BFF19E4C6298664155B7; // 0x33D0(0x0128)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_DE628AE245BFAFBD9D1CA881815F30C5; // 0x34F8(0x00E0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_F8FEA2BC4793D6F7E08E6CB689B6FF5D; // 0x35D8(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_24719ACD471CC393ACDDD690857B43AC; // 0x36B8(0x0110)()
	uint8                                         Pad_37C8[0x8];                                     // 0x37C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_CCDLookAt                    ZZAnimGraphNode_CCDLookAt_1EBA6EC545183D4F03E98391C10D79C9; // 0x37D0(0x0220)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B14FF53E4A42372DDA4B56BC4861D148; // 0x39F0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_858576A9458C95CBE6C27EA4DF69E798; // 0x3A60(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42052D67472BE5D7DE91CE9DDBF3D02C; // 0x3AD0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A44B6E1F4F3A7B9AC9EA28B942ECEA3F; // 0x3B40(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BAC428C64450F84186C36FAA8C4FDD9E; // 0x3C48(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6ABDDE584B5095D954A243B980FF9B86; // 0x3CB8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2597E65D445445B04E3A85BAE6AFA53E; // 0x3DC0(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_09B40F4A4CBD32386ABD01B73BBE6E97; // 0x3E30(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B0705E084F76F0BA707A8AADA7A929F5; // 0x3F38(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4912F8A74BF1D8BC89E347A76A32F8C2; // 0x3FA8(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0AFFD0554FBA2A1740CEE89089D2E0D2; // 0x4158(0x0088)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_AAB4A86845D4B30B60CE36AB6D6A79E6; // 0x41E0(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_F297909542A2649BAF655393950981AC; // 0x4330(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_A1B0506548E6B44DB6AEBCA5C5937770; // 0x4480(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_DB2E8DA54D84E160024520B9F11F64C9; // 0x45D0(0x0150)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_97539B2341FD2FDB4A772FA387FC32A0; // 0x4720(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B9C196BD43E7E0D38E4F62B025FFBCAE; // 0x4828(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_F65FE9624494CE4A4059AB9C4C56FC8B; // 0x4898(0x01B0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2033704D4DFFA90C7BF7B59EFAF4C3F7; // 0x4A48(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6DD1356940876CFDEAA98DB49E3CC144; // 0x4B28(0x0070)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_AADD48B44E06F64AFAB441B06A5FB439; // 0x4B98(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D541CE8B4FF49FC83665C3ADDC72B468; // 0x4CE8(0x0150)()
	struct FAnimNode_HandIKRetargeting            AnimGraphNode_HandIKRetargeting_B003107E4309C93B237A66864525CC5B; // 0x4E38(0x0160)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_02C1A6394F80193748C904B503331E7C; // 0x4F98(0x0130)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_978A73BE415A5018B264228059DFE60C; // 0x50C8(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_F011BDB54FA537663CDEC681BC09A142; // 0x5228(0x0160)()
	struct FAnimNode_BlendCurveOnly               AnimGraphNode_BlendCurveOnly_5D23AA2D4543F591E81EF98899047873; // 0x5388(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_EC7001414083832D79CB528DCCF4EC41; // 0x5408(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8432A307403E66EA8E271289561A97E3; // 0x5508(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_064504364B1E3D2739231D9F54469A87; // 0x5570(0x0068)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_52C9E85E404AAA1E89BFEC975AD97534; // 0x55D8(0x0098)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_1742B41B4CE44048232E9980BB556418; // 0x5670(0x0150)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_DCBCA1594129DF9B08AEFDAECB12D63E; // 0x57C0(0x0150)()
	struct FAnimNode_ResetNaN                     AnimGraphNode_ResetNaN_2FF80E1C405490874B2BFEADDC48CC9D; // 0x5910(0x0110)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5D188EE441C186B9FF6387ACB0A331AA; // 0x5A20(0x0160)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_4FBEB08540701FC1853AD9920F314957; // 0x5B80(0x01F0)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_68AA44D64317DE71C4F74986DAF632D6; // 0x5D70(0x01F0)()
	class UAnimSequenceBase*                      FaceAnim;                                          // 0x5F60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      BodyAnim;                                          // 0x5F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isResetFaceAnim;                                   // 0x5F70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F71[0x7];                                     // 0x5F71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SelfComponent;                                     // 0x5F78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Anim_HallMainCharacter(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void AnimNotify_MainFlow_ShowInterrupt(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_MainFlow_ShowEnd(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_MainFlow_Idle(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_MainFlow_Show(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_ResetDynamic(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_Equip_EquipWeapon(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_Equip_IdlePerform(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_Equip_Idle(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_Settlement_InplaceShow(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_Settlement_Idle(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_Settlement_MovementShow(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BlueprintInitializeAnimation(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnAnimSetChangeEvent_SyncFaceAnim(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_OnLeftEquip(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimNotify_OnLeftMain(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_C327D92841EEF97CD66A498592B5032E(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_836E29EF4D4961B6DF65139BEB250F5C(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_CB72D21F44C24F0878DA499502B1B0A1(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_7A9F57184FDFA7C3E3303B8CE7457A97(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_ModifyBone_5D188EE441C186B9FF6387ACB0A331AA(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_RotationMultiplier_DCBCA1594129DF9B08AEFDAECB12D63E(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_RotationMultiplier_1742B41B4CE44048232E9980BB556418(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_ModifyBone_F011BDB54FA537663CDEC681BC09A142(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_ModifyBone_978A73BE415A5018B264228059DFE60C(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_HandIKRetargeting_B003107E4309C93B237A66864525CC5B(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_E46D907D458AB801B69F8DA4BCB61586(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_D1FDBBF1412BFD9CCC17F199E239CD9F(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_42052D67472BE5D7DE91CE9DDBF3D02C(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_858576A9458C95CBE6C27EA4DF69E798(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_ZZAnimGraphNode_CCDLookAt_1EBA6EC545183D4F03E98391C10D79C9(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_LayeredBoneBlend_B09DFBBC4237BFF19E4C6298664155B7(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_ModifyBone_225D23714DF1F6F49EE0F5BFFA736380(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_Fabrik_59467AED43B9AD550FC3C8BAE134FED0(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_ModifyBone_3C622EE048E67EE824295D9EBA8CD672(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_Fabrik_239D42574B0CCF4D209B85B16CBF9CD9(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TwoWayBlend_EEB248F441F24C96ED8181ADFDF3A123(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_ModifyCurve_B7F1DC6F46AFF907D75F8FACC1B272C0(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SyncLookat(const struct FVector& LookAtTarget_0, float LookAtWeight_0, float LookAtSpeedStrength_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TwoWayBlend_5561920845890CF2FB2D79A8CBD7275A(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TwoWayBlend_C35E69A6437B5676730951B95F05F6E5(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TwoWayBlend_725E747D4F417C5794D50680D426E7EF(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_C09B101D4F608FDDED9E66964C8F8F3F(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TwoWayBlend_183548F740560915C4A064923BAEF1ED(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_HallMainCharacter_AnimGraphNode_TransitionResult_A083B8DA4B358AE86F2B7D8B4D4FB4B4(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BP_ResetRotation(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SyncFaceAnim(class UAnimSequenceBase* BodyAnim_0, class UAnimSequenceBase* FaceAnim_0, bool IsResetPlay, bool SetOrGet, class UAnimSequenceBase** GetBodyAnim, class UAnimSequenceBase** GetFaceAnim, bool* GetIsResetPlay); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Anim_HallMainCharacter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Anim_HallMainCharacter_C")
	}
	static class UBP_Anim_HallMainCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Anim_HallMainCharacter_C>();
	}
};
DUMPER7_ASSERTS_UBP_Anim_HallMainCharacter_C;

}

