#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BowArrow_S06

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "GPGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BowArrow_S06.BP_BowArrow_S06_C
// 0x0058 (0x0460 - 0x0408)
class ABP_BowArrow_S06_C final : public ABowArrow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGPSkeletalMeshComponent*               ProxSensorArrow;                                   // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGPSkeletalMeshComponent*               FireArrow;                                         // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTravelerGameAk*                        GameAk;                                            // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   P_Scout_Arrow_Lighting_1P;                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXResourceContainerComponent*          P_Scout_Arrow_Lighting_1P_Effect;                  // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   P_Scout_ArrowGlow_Red;                             // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXResourceContainerComponent*          P_Scout_ArrowGlow_Red_Effect;                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGPAudioFuturePlayingID                Audio1;                                            // 0x0450(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGPAudioFuturePlayingID                Audio2;                                            // 0x0458(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_BowArrow_S06(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void BP_OnChargeStateChange(bool ischarging); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveEndPlay(EEndPlayReason EndPlayReason); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetArrowType(bool IsProxSensor, bool NeedEffect); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetArrowActive(bool Active); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BowArrow_S06_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BowArrow_S06_C")
	}
	static class ABP_BowArrow_S06_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BowArrow_S06_C>();
	}
};
DUMPER7_ASSERTS_ABP_BowArrow_S06_C;

}

