#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BowArrowMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "DFMAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BowArrowMesh.BP_BowArrowMesh_C
// 0x0058 (0x0410 - 0x03B8)
class ABP_BowArrowMesh_C final : public ABowArrowMesh
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTravelerGameAk*                        GameAk;                                            // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Scout_C201_Arrows_02_Mesh;                         // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Scout_C201_Arrows_01_Mesh;                         // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   P_Scout_Arrow_Lighting_1P;                         // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXResourceContainerComponent*          P_Scout_Arrow_Lighting_1P_Effect;                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   P_Scout_ArrowGlow_Red;                             // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXResourceContainerComponent*          P_Scout_ArrowGlow_Red_Effect;                      // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGPAudioFuturePlayingID                Audio1;                                            // 0x0400(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGPAudioFuturePlayingID                Audio2;                                            // 0x0408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_BowArrowMesh(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void BP_OnChargeStateChange(bool ischarging); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveEndPlay(EEndPlayReason EndPlayReason); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetArrowType(bool IsProxSensor, bool NeedEffect); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetArrowActive(bool Active); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BowArrowMesh_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BowArrowMesh_C")
	}
	static class ABP_BowArrowMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BowArrowMesh_C>();
	}
};
DUMPER7_ASSERTS_ABP_BowArrowMesh_C;

}

