#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterVehicleControlAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMVehicle_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterVehicleControlAction.BP_CharacterVehicleControlAction_C
// 0x0020 (0x01F0 - 0x01D0)
class UBP_CharacterVehicleControlAction_C final : public UDFMFSM_CharacterVehicleControlAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ECollisionEnabled                             CachedCollisionType;                               // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                H2HBOffset;                                        // 0x01DC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPNetworkPlayerController*             GPPlayer;                                          // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Set_Motion_Blue(bool Enable, bool bIsTPP); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ConstructionScript(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ServerExitDriveCar(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ClientOwnerExitDriveCar(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ClientOwnerXPPChange(bool IsUnderFPP); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ClientOtherStartDriveCar(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ClientOwnerStartDriveCar(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ClientOtherExitDriveCar(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ServerStartDriveCar(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_BP_CharacterVehicleControlAction(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CharacterVehicleControlAction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CharacterVehicleControlAction_C")
	}
	static class UBP_CharacterVehicleControlAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterVehicleControlAction_C>();
	}
};
DUMPER7_ASSERTS_UBP_CharacterVehicleControlAction_C;

}

