#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CutSceneBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPCutScene_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CutSceneBase.BP_CutSceneBase_C
// 0x0010 (0x06C0 - 0x06B0)
class ABP_CutSceneBase_C : public AGPSequenceActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bLocalPlayerHideOnEnterCutScene;                   // 0x06B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLocalPlayerHideOnLeaveCutScene;                   // 0x06B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bKeepCinematicOnLeaveCutScene;                     // 0x06BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShouldSoundOff;                                   // 0x06BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CutSceneBase(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void TeleportToExec(const struct FVector& Location); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void EndSequence(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BeginSequence(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void EnterCutSceneHud(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PreEndSequence(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void LeaveCutSceneStreaming(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void EnterCutSceneStreaming(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void LeaveCutSceneHud(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CutSceneBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CutSceneBase_C")
	}
	static class ABP_CutSceneBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CutSceneBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_CutSceneBase_C;

}

