#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DFMCharacter_SafeHouse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DFMCharacter_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DFMCharacter_SafeHouse.BP_DFMCharacter_SafeHouse_C
// 0x0050 (0x3720 - 0x36D0)
class ABP_DFMCharacter_SafeHouse_C final : public ABP_DFMCharacter_C
{
public:
	uint8                                         Pad_36C4[0x4];                                     // 0x36C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DFMCharacter_SafeHouse_C;        // 0x36C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFMSafeHouseSyncComponent*             DFMSafeHouseSync;                                  // 0x36D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_DFMIrisEnterComponent_C*            BP_DFMIrisEnterComponent;                          // 0x36D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_QuestDebugJumpComponent_C*          BP_QuestDebugJumpComponent;                        // 0x36E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPVEPlayerResurrectComponent*           PVEPlayerResurrect;                                // 0x36E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPVECharacterExternalDamageComponent*   PVECharacterExternalDamage;                        // 0x36F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPVECharacterPickupComponent*           CharacterPickup;                                   // 0x36F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_RaidDebugJumpComponent_C*           BP_RaidDebugJumpComponent;                         // 0x3700(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UIrisStrongholdComponent*               IrisStrongholdComponent;                           // 0x3708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAirHitDetectorComponent*               AirHitDetector;                                    // 0x3710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       AmbientSensorCollision;                            // 0x3718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void GMFly_Path(int32 PathID); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_Debug_GetOnSafehouseHelicopter_K2Node_InputActionEvent_2(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_Debug_GetOffFromSafehouseHelicopter_K2Node_InputActionEvent_1(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_Debug_StartFlyWithSafehouseHelicopter_K2Node_InputActionEvent_0(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_BP_DFMCharacter_SafeHouse(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DFMCharacter_SafeHouse_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DFMCharacter_SafeHouse_C")
	}
	static class ABP_DFMCharacter_SafeHouse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DFMCharacter_SafeHouse_C>();
	}
};
DUMPER7_ASSERTS_ABP_DFMCharacter_SafeHouse_C;

}

