#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DFMObserverPawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DFMObserverPawn.BP_DFMObserverPawn_C
// 0x0090 (0x0578 - 0x04E8)
class ABP_DFMObserverPawn_C final : public ADFMObserverPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFMScoreTipsComponent*                 DFMScoreTips;                                      // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameAkComponent*                       GameAk;                                            // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFloatingPawnMovement*                  CameraMovementComponent;                           // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSplinePoint>                   CameraSplinePointsArray;                           // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	float                                         CurrentDistance;                                   // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FocusPoint;                                        // 0x0524(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CameraPointsArray;                                 // 0x0530(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FVector>                        TargetPointsArray;                                 // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FSplinePoint>                   TargetSplinePointsArray;                           // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class ABP_DFMCameraTrackActor_C*              CameraTrackActor;                                  // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFocusOnPoint;                                     // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentPercent;                                    // 0x056C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDebugRealTime;                                 // 0x0570(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bFocusOnTargetLine;                                // 0x0571(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowDebug;                                        // 0x0572(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetCameraTurningBoost(float TurningBoost); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetCameraDeceleration(float Deceleration); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetCameraAcceleration(float Acceleration); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetShowDebugRealtime(bool bShow); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ClearTargetPath(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ClearCameraPath(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetRotationScalar(float Scalar); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetFreeCameraMoveSpeed(float MaxSpeed); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetMoveSpeed(float Speed); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void StartMoveCamera(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetFocusWay(bool FocusOnPoint, bool FocusOnTargetLine); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Show_Debug_View(bool bShowDebugView); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateTargetPath(); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void RecordTargetPathPoint(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetFocusPoint(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void MoveCamInner(float DeltaTime); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateCameraPath(); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void RecordCameraPoint(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTick(float DeltaSeconds); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_CatchMoveRoutePoint(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_GenerateMoveRoute(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_ClearMoveRoute(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_CatchFaceRoutePoint(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_GenerateFaceRoute(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_ClearFaceRoute(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_ShowHideRouteDebugView(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_StartMoveCamera(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OBC_UpdateFocusPoint(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_BP_DFMObserverPawn(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DFMObserverPawn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DFMObserverPawn_C")
	}
	static class ABP_DFMObserverPawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DFMObserverPawn_C>();
	}
};
DUMPER7_ASSERTS_ABP_DFMObserverPawn_C;

}

