#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Heavy_Machine_Gun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Heavy_Machine_Gun.BP_Heavy_Machine_Gun_C
// 0x0C60 (0x0EF0 - 0x0290)
class UBP_Heavy_Machine_Gun_C final : public UDFMMachineGunAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_E696409E45967278FF92588DBD665E47; // 0x0298(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E0ECB43945AC5F437A7E80BCAF7E53EF; // 0x0308(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_F70075E3441C161B98B6669902AC7ECC; // 0x0430(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2CD89A37473F4C839D3146A21CA37478; // 0x04B8(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F9B5483342DF2DC62EC6D281FB115888; // 0x0520(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_DCD2E4B5441BD360B859899B67FA7492; // 0x0588(0x0100)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_51032B0A439B6446FB88E8BAAF49B246; // 0x0688(0x0100)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3BF8FC774210C108E9C9F5823073309F; // 0x0788(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_53615A5146086DF5D76DC6BB9F8138F8; // 0x0868(0x0088)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_170437D049E0AD257FF432B0A4230060; // 0x08F0(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8EB22BB543734168BB7BCCBFD5F82113; // 0x0950(0x0160)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_82B55DD445A5570A20248DBC8E6C1CEC; // 0x0AB0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_252F78194B95024D4FECB1B1E8C61265; // 0x0BB8(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F020458E4D70F957734BD18A6351D13E; // 0x0C20(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D4AA23364019FC4D060D3EA5129BA407; // 0x0C80(0x0160)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_12C945C544FD72CA1409D8B138C7AAB0; // 0x0DE0(0x0110)()

public:
	void ExecuteUbergraph_BP_Heavy_Machine_Gun(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Heavy_Machine_Gun_AnimGraphNode_ModifyBone_8EB22BB543734168BB7BCCBFD5F82113(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Heavy_Machine_Gun_AnimGraphNode_ModifyBone_D4AA23364019FC4D060D3EA5129BA407(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Heavy_Machine_Gun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Heavy_Machine_Gun_C")
	}
	static class UBP_Heavy_Machine_Gun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Heavy_Machine_Gun_C>();
	}
};
DUMPER7_ASSERTS_UBP_Heavy_Machine_Gun_C;

}

