#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HallLight2

#include "Basic.hpp"

#include "DFMLightCoordinate_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HallLight2.BP_HallLight2_C
// 0x0038 (0x03D0 - 0x0398)
class ABP_HallLight2_C final : public ADFMLightGroup
{
public:
	class USpotLightComponent*                    Spot_03;                                           // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_02;                                           // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   LightComponent2;                                   // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             LightComponent1;                                   // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    Spot_01;                                           // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HallLight2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HallLight2_C")
	}
	static class ABP_HallLight2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HallLight2_C>();
	}
};
DUMPER7_ASSERTS_ABP_HallLight2_C;

}

