#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interact_AnimSwitcherContainer

#include "Basic.hpp"

#include "BP_Interactor_ContainerBoxBase_classes.hpp"
#include "OpenWorldPrecomputedVisibility_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interact_AnimSwitcherContainer.BP_Interact_AnimSwitcherContainer_C
// 0x0048 (0x2468 - 0x2420)
class ABP_Interact_AnimSwitcherContainer_C : public ABP_Interactor_ContainerBoxBase_C
{
public:
	class UInteractorSkeletalMeshComponent*       InteractorSkeletalMesh;                            // 0x2420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          EditOnlyBox;                                       // 0x2428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        InteractorPoint;                                   // 0x2430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ContainerAnimSwitcherComponent_C*   AnimSwitcher;                                      // 0x2438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ContainerOperatorProcessComponent_C* OpenProcess;                                      // 0x2440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorProcessPawnAnimComponent*    ProcessPawnClose;                                  // 0x2448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ProcessPawnOpenContainer_C*         ProcessPawnOpen;                                   // 0x2450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ContainerOperatorProcessComponent_C* CloseProcess;                                     // 0x2458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         NewVar_0;                                          // 0x2460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool LowerPriorityAfterSomething(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	TArray<class UMeshComponent*> BP_GetOutlineMeshComponents(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	TArray<class UMeshComponent*> BP_GetAimedMeshComponents(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UInteractorAnimSwitcherComponent* BP_GetAnimSwitcher(); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UInteractorAsyncSkeletalMeshComponent* BP_GetInteractorAsyncSkeletalMeshComponent(); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UInteractorAnimSwitcherComponent* BP_GetInteractorAnimSwitcherComponent(); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UInteractorSkeletalMeshComponent* BP_GetInteractorSkeletalMeshComponent(); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FVector GetInteractPointWorldLocation(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FVector GetInteractPointWorldLocationInDS(class ACHARACTER* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	TArray<class UMeshComponent*> BP_GetOpenBoxMeshs(); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

	EOpenWorldPrecomputedFormType GetFormType() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20
	int32 GetFormIndex() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20
	struct FVector GetBoundsScaleIncrement() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20
	struct FVector GetBoundsOriginOffset() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Interact_AnimSwitcherContainer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Interact_AnimSwitcherContainer_C")
	}
	static class ABP_Interact_AnimSwitcherContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interact_AnimSwitcherContainer_C>();
	}
};
DUMPER7_ASSERTS_ABP_Interact_AnimSwitcherContainer_C;

}

