#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interact_HeavyMachineGun

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interact_HeavyMachineGun.BP_Interact_HeavyMachineGun_C
// 0x0038 (0x0F00 - 0x0EC8)
class ABP_Interact_HeavyMachineGun_C final : public ADFMHeavyMachineGunInteractor
{
public:
	class UInteractorProcessPawnUseHeavyMachineGunComponent* HeavyMachineGunUse;                     // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorOperatorProcessComponent*    HeavyMachineGunOperatorProcess;                    // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0ED8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        InteractPoint;                                     // 0x0EE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorOperatorProcessComponent*    HeavyMachineGunMoveTo;                             // 0x0EE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorBoxComponent*                InteractBox;                                       // 0x0EF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0EF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	struct FVector GetNavLocation(class AActor* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FVector GetInteractPointWorldLocation(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FRotator GetInteractPointWorldRotation(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FRotator GetTurnRotator(class AActor* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FVector GetInteractPointWorldLocationInDS(class ACHARACTER* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Interact_HeavyMachineGun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Interact_HeavyMachineGun_C")
	}
	static class ABP_Interact_HeavyMachineGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interact_HeavyMachineGun_C>();
	}
};
DUMPER7_ASSERTS_ABP_Interact_HeavyMachineGun_C;

}

