#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InventoryPickup_WeapModule

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"
#include "OpenWorldPrecomputedVisibility_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InventoryPickup_WeapModule.BP_InventoryPickup_WeapModule_C
// 0x0038 (0x1B78 - 0x1B40)
class ABP_InventoryPickup_WeapModule_C final : public AInventoryPickup_WeaponModule
{
public:
	class UGPStaticMeshComponent*                 DelayReplicateGetDefaultBoxMesh;                   // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          FakeBoxForHit;                                     // 0x1B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorSingleItemPrestartLogicComponent* InteractorSingleItemPrestartLogic;            // 0x1B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorOperatorProcessComponent*    InteractorOperatorProcess;                         // 0x1B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorProcessPawnAnimComponent*    InteractorProcessPawnAnim;                         // 0x1B68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanOverlap;                                       // 0x1B70(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	class UMeshComponent* BP_DelayReplicateGetDefaultBoxMesh(); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UBoxComponent* BP_GetFakeBoxFotHit(); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	bool CanOverlap(class ACHARACTER* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

	struct FVector GetBoundsOriginOffset() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20
	struct FVector GetBoundsScaleIncrement() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20
	int32 GetFormIndex() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20
	EOpenWorldPrecomputedFormType GetFormType() const; // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent, Const) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InventoryPickup_WeapModule_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InventoryPickup_WeapModule_C")
	}
	static class ABP_InventoryPickup_WeapModule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InventoryPickup_WeapModule_C>();
	}
};
DUMPER7_ASSERTS_ABP_InventoryPickup_WeapModule_C;

}

