#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interact_HelicopterWeapon

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interact_HelicopterWeapon.BP_Interact_HelicopterWeapon_C
// 0x0060 (0x0F28 - 0x0EC8)
class ABP_Interact_HelicopterWeapon_C final : public ADFMHeavyMachineGunDynamicInteractor
{
public:
	class UInteractorProcessPawnDeathEventComponent* InteractorProcessPawnDeathEvent;                // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractoRepairEffectComponent*        InteractoRepairEffect;                             // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorRepairComponent*             InteractorRepair;                                  // 0x0ED8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorProcessPawnAnimComponent*    InteractorProcessPawnAnim;                         // 0x0EE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorOperatorProcessComponent*    InteractorRepairOperatorProcess;                   // 0x0EE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorProcessPawnSwitchWeaponComponent_Airbrush* InteractorProcessPawnSwitchWeaponComponent_Airbrush; // 0x0EF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorProcessPawnUseHeavyMachineGunComponent* HeavyMachineGunUse;                     // 0x0EF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorOperatorProcessComponent*    HeavyMachineGunOperatorProcess;                    // 0x0F00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0F08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        InteractPoint;                                     // 0x0F10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractorBoxComponent*                InteractBox;                                       // 0x0F18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0F20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	struct FVector GetNavLocation(class AActor* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FVector GetInteractPointWorldLocation(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FRotator GetInteractPointWorldRotation(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FRotator GetTurnRotator(class AActor* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	TArray<struct FVector> GetMultiRayCastPoints(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	struct FVector GetInteractPointWorldLocationInDS(class ACHARACTER* OperatorCharacter); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Interact_HelicopterWeapon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Interact_HelicopterWeapon_C")
	}
	static class ABP_Interact_HelicopterWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interact_HelicopterWeapon_C>();
	}
};
DUMPER7_ASSERTS_ABP_Interact_HelicopterWeapon_C;

}

