#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractorContainer_BoxBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EnumLootMapName_structs.hpp"
#include "EnumDamArea_structs.hpp"
#include "EnumLootBoxType_structs.hpp"
#include "EnumLootLevel_structs.hpp"
#include "DropRateData_structs.hpp"
#include "BP_InventoryPickupOpenBoxBase_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "EnumLootRandomObjConfig_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractorContainer_BoxBase.BP_InteractorContainer_BoxBase_C
// 0x0168 (0x2418 - 0x22B0)
class ABP_InteractorContainer_BoxBase_C : public ABP_InventoryPickupOpenBoxBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x22B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   SmallAreaConfig;                                   // 0x22B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   BigArea;                                           // 0x22C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x22C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   LootDebug;                                         // 0x22D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          启用策划配置;                                      // 0x22D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EnumLootMapName                               地图;                                              // 0x22D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumDamArea                                   地图大区域;                                        // 0x22DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22DB[0x5];                                     // 0x22DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 地图小区域自定义名称;                              // 0x22E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EnumLootBoxType                               Loot容器分类;                                      // 0x22F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumLootLevel                                 掉落等级;                                          // 0x22F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22F2[0x6];                                     // 0x22F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 唯一性;                                            // 0x22F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, EnumLootMapName>          MapNameToEnum;                                     // 0x2308(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          启用任务专用掉落;                                  // 0x2358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2359[0x7];                                     // 0x2359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    选择掉落道具;                                      // 0x2360(0x0010)(Edit, BlueprintVisible, NoDestructor)
	TArray<float>                                 Price;                                             // 0x2370(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         SaveID;                                            // 0x2380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2384[0x4];                                     // 0x2384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDropRateData                          历史;                                              // 0x2388(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, struct FDropRateData>     历史数据;                                          // 0x23A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          找到数据;                                          // 0x23F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EnumLootRandomObjConfig                       倍场特殊配置;                                      // 0x23F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23FA[0x2];                                     // 0x23FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               SaveRot;                                           // 0x23FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                SavePos;                                           // 0x2408(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InteractorContainer_BoxBase(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void HideLevel2Obj(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnDsBeginMatchReqReceived_Event_0(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void UserConstructionScript(); // (Event, Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetTextScale(float Scale); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ShowLootDebug(const class FString& BigArea_0, const class FString& SmallArea, bool Clear, struct FVector* BigAreaLocation, struct FVector* SmallAreaLocation, struct FVector* SelfLocation); // (Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FString GetMapName(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FString GetBigAreaName(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FString GetSmallAreaCustomName(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FString GetUniqueName(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FString GetOpenBoxTypeName(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_InteractorContainer_BoxBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_InteractorContainer_BoxBase_C")
	}
	static class ABP_InteractorContainer_BoxBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractorContainer_BoxBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_InteractorContainer_BoxBase_C;

}

