#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interactor_Container_SafeBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "BP_Interact_AnimSwitcherContainer_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interactor_Container_SafeBox.BP_Interactor_Container_SafeBox_C
// 0x0020 (0x2488 - 0x2468)
class ABP_Interactor_Container_SafeBox_C final : public ABP_Interact_AnimSwitcherContainer_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Interactor_Container_SafeBox_C;  // 0x2468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInteractorGeneratePasswordComponent*   GeneratePassword;                                  // 0x2470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPuzzling;                                        // 0x2478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasOpen;                                           // 0x2479(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAutoRelease;                                     // 0x247A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          WithCode;                                          // 0x247B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGPAudioFuturePlayingID                AudioPlayingId;                                    // 0x247C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_Interactor_Container_SafeBox(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void BP_StopOpeningUIAudio(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_PlayOpeningUIAudio(class AGPCharacter* InGPCharacter); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__AnimSwitcher_K2Node_ComponentBoundEvent_1_OnAnimSwitcherStateChange__DelegateSignature(EAnimSwitcher_State AnimState); // (BlueprintEvent) // @ 0x14B5B5E20
	void SyncOpenSafeOperateFast(int32 Op, float params1, float params2); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SyncOpenSafeOperate(int32 Op, float params1, float params2); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Interactor_Container_SafeBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Interactor_Container_SafeBox_C")
	}
	static class ABP_Interactor_Container_SafeBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interactor_Container_SafeBox_C>();
	}
};
DUMPER7_ASSERTS_ABP_Interactor_Container_SafeBox_C;

}

