#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LG_HeroScene_Weapon

#include "Basic.hpp"

#include "DFMLightCoordinate_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LG_HeroScene_Weapon.BP_LG_HeroScene_Weapon_C
// 0x0048 (0x03E0 - 0x0398)
class ABP_LG_HeroScene_Weapon_C final : public ADFMLightGroup
{
public:
	class USpotLightComponent*                    LightComponent3;                                   // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   LightComponent2;                                   // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             LightComponent1;                                   // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent0;                                   // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Direction_Light_Cast_Shadow;                       // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn)
	bool                                          Direction_Light_ON;                                // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn)
	bool                                          SkyLightON;                                        // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_3CB[0x5];                                      // 0x03CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextureCube*>                   Cubemaps;                                          // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor)

public:
	void UserConstructionScript(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetLight(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LG_HeroScene_Weapon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LG_HeroScene_Weapon_C")
	}
	static class ABP_LG_HeroScene_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LG_HeroScene_Weapon_C>();
	}
};
DUMPER7_ASSERTS_ABP_LG_HeroScene_Weapon_C;

}

