#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LeftWeapon_HookLauncher

#include "Basic.hpp"

#include "DFMAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LeftWeapon_HookLauncher.BP_LeftWeapon_HookLauncher_C
// 0x0040 (0x14C0 - 0x1480)
class ABP_LeftWeapon_HookLauncher_C final : public AChainHookWeapon
{
public:
	class UChainHookComponent*                    ChainHook;                                         // 0x1480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChainHookAnimComponent*                ChainHookAnim;                                     // 0x1488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULeftWeaponDataComponentFiring*         LeftWeaponDataComponentFiring;                     // 0x1490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULeftWeaponAppearanceComp*              LeftWeaponAppearanceComp;                          // 0x1498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponDataComponentDamage*          DFMWeaponDataComponentDamage;                      // 0x14A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x14A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x14B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentCore*               WeaponDataComponentCore;                           // 0x14B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_LeftWeapon_HookLauncher_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_LeftWeapon_HookLauncher_C")
	}
	static class ABP_LeftWeapon_HookLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LeftWeapon_HookLauncher_C>();
	}
};
DUMPER7_ASSERTS_ABP_LeftWeapon_HookLauncher_C;

}

