#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Light_Gunsmith

#include "Basic.hpp"

#include "DFMLightCoordinate_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Light_Gunsmith.BP_Light_Gunsmith_C
// 0x0038 (0x03D0 - 0x0398)
class ABP_Light_Gunsmith_C final : public ADFMLightGroup
{
public:
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Side;                                    // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Back;                                    // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_keylight;                                // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight_Gunsmith;                                 // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight_Top;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Light_Gunsmith_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Light_Gunsmith_C")
	}
	static class ABP_Light_Gunsmith_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Light_Gunsmith_C>();
	}
};
DUMPER7_ASSERTS_ABP_Light_Gunsmith_C;

}

