#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMQuest_classes.hpp"
#include "QMarkerCustomImage_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_QMarker.BP_QMarker_C
// 0x0030 (0x0450 - 0x0420)
class ABP_QMarker_C : public ADFMQuestMarker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_ScreenMarkerMission_Raid_C*        TargetWidget;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MissionCircle_C*                    MarkerCircle;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CutNum;                                            // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_QMarker(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void ShowMarkCircelOnClient(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Event_On_Parent_Actor_Destroied(class AActor* DestroyedActor); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveDestroyed(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetTargetWidgetScale(float Scale_0); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveEndPlay(EEndPlayReason EndPlayReason); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void OnDeactivateMarkerOnClient(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnActivateMarkerOnClient(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTick(float DeltaSeconds); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Update_Widget_Location_on_Client(float* DistanceToCharacter__cm_); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ShowMarkerWidget(bool bShow); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateHealthBar(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetTargetActorHealthPercent(float* Percent); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetDistanceToCharacter(float* Distance_cm_); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetWidgetScale(float Scale_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ShowCircle(bool Enable); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetCustomImage(EQMarkerCustomImage Image); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateInteractCirleProgress(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetTargetInteratorProgress(float* Percent); // (Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_QMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_QMarker_C")
	}
	static class ABP_QMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_QMarker_C>();
	}
};
DUMPER7_ASSERTS_ABP_QMarker_C;

}

