#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RTILight_RTIMap_Weapon_1

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RTILight_RTIMap_Weapon_1.BP_RTILight_RTIMap_Weapon_1_C
// 0x0038 (0x03A8 - 0x0370)
class ABP_RTILight_RTIMap_Weapon_1_C final : public AActor
{
public:
	class USphereReflectionCaptureComponent*      SphereReflectionCapture_BP;                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcessVolume__BP;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight__BP1;                                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Bottom_1_BP1;                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight__BP1;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_Front_1_BP1;                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_RTILight_RTIMap_Weapon_1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_RTILight_RTIMap_Weapon_1_C")
	}
	static class ABP_RTILight_RTIMap_Weapon_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RTILight_RTIMap_Weapon_1_C>();
	}
};
DUMPER7_ASSERTS_ABP_RTILight_RTIMap_Weapon_1_C;

}

