#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SafeHousePlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SafeHousePlayerController.BP_SafeHousePlayerController_C
// 0x0068 (0x0DF0 - 0x0D88)
class ABP_SafeHousePlayerController_C final : public ASafeHousePlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFMControllerAudioComponent*           DFMControllerAudio;                                // 0x0D90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMQuestGamingAreaPlayerComponent*     DFMQuestGamingAreaPlayer;                          // 0x0D98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USimulationLODPerceptionComponent*      SimulationLODPerception;                           // 0x0DA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA8[0x8];                                      // 0x0DA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MiniManTransform;                                  // 0x0DB0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UObject*                                MiniManActor;                                      // 0x0DE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOpenAIDebug;                                      // 0x0DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SpawnTestAIAtLocation(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_GM_Fire_K2Node_InputActionEvent_4(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_GM_Fire_K2Node_InputActionEvent_3(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_GM_KillMe_K2Node_InputActionEvent_2(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_GM_ShowQuestGMPanel_K2Node_InputActionEvent_1(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void InpActEvt_GM_KillAI_K2Node_InputActionEvent_0(const struct FKey& Key); // (BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveDestroyed(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnClientReborn_Event_0(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_BP_SafeHousePlayerController(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SafeHousePlayerController_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SafeHousePlayerController_C")
	}
	static class ABP_SafeHousePlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SafeHousePlayerController_C>();
	}
};
DUMPER7_ASSERTS_ABP_SafeHousePlayerController_C;

}

