#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Safehouse_Collection_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SafeHouse_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Safehouse_Collection_1.BP_Safehouse_Collection_1_C
// 0x0070 (0x0450 - 0x03E0)
class ABP_Safehouse_Collection_1_C final : public ASafeHouseBuilding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Interaction3DTip;                                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Interaction3DTipBg;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USHBuildingCameraComponent*             SHBuildingCamera;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_EFX_SafeHouse_ComponentUpgrade;                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USHBuildingWhiteDotComponent*           SHBuildingWhiteDot;                                // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_dissolve_AF6F704B4FFB9D55071AFA8C4B897C8B; // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_AF6F704B4FFB9D55071AFA8C4B897C8B; // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DissolvePercent;                                   // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Safehouse_Collection_1(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PlayMeshEffectManually(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PlayMeshEffect(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Timeline_0__UpdateFunc(); // (BlueprintEvent) // @ 0x14B5B5E20
	void Timeline_0__FinishedFunc(); // (BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Safehouse_Collection_1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Safehouse_Collection_1_C")
	}
	static class ABP_Safehouse_Collection_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Safehouse_Collection_1_C>();
	}
};
DUMPER7_ASSERTS_ABP_Safehouse_Collection_1_C;

}

