#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SafeHouseNPCAnim_Interact_3pTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_SafeHouseNPCAnim_Interact_3pTest.BP_SafeHouseNPCAnim_Interact_3pTest_C
// 0x1960 (0x23F0 - 0x0A90)
class UBP_SafeHouseNPCAnim_Interact_3pTest_C final : public UDFMSafeHouseNPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8D6B2C474FE49825E283D79B67189D19; // 0x0A98(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A5F6F26045BB15DE716BC682CB230472; // 0x0B08(0x0110)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_44EBE99E4436FB2B3A71A788B148244E; // 0x0C18(0x03B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CD25B535402C88D99313A089E6ED8559; // 0x0FC8(0x0088)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_ED4EED974E81BEEBA22220B1FD1A6349; // 0x1050(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C5F9640A4DB9B16DCCDE2DA0BA5FB346; // 0x1150(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_89A8E2B7445BAE876E0142BFA6F720F3; // 0x11B8(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CCA2A890413E0DC219488587964BEE36; // 0x12B8(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0B1C29B04FE6EAED11B56C8764A80901; // 0x1340(0x0068)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AC5FC9CD4632DE36227CC2AA212F46FE; // 0x13A8(0x0088)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9D9AE9C74F6DA70F5A4582BB16EBD51F; // 0x1430(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2FD8DD2941F065E71B929BA822B6AD0A; // 0x14A0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3B8890EA40B1DE216A4100B975F59E09; // 0x1510(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0408B1CE49C8FC9AA12524918285EECC; // 0x1580(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E77728F34D578E69F26158A6B68314ED; // 0x15F0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1FAE35AE48E77B1B761E668D249913C5; // 0x1660(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8118E62A4B2E82886244F48D199CEA40; // 0x16D0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1154F7C54321C6D2AE301C8ECD0C784F; // 0x1740(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E97D2EA94D2D93BBE022218BE358AF85; // 0x17B0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C1CA0DAA4419590B25595A85F4EE0CD3; // 0x1820(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40F97EBD43152D402634838C9AE7A416; // 0x1890(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73E860C341EC1715BDCEC386FE780202; // 0x1998(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75E225044FE48E5F72E8869E548203D9; // 0x1A08(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2F0FAE03443C9F3C26E7418F88AC50BB; // 0x1B10(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33948A0E489AD5C2E93F428207DE5594; // 0x1B80(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7ACEB8124F907A80118D41BFC76F1F85; // 0x1C88(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E73D66B840F714744C32A7B59D2ED5E2; // 0x1CF8(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A1AEE23F4D5C75E60D965188C28706C5; // 0x1E00(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24712AEF44BF75AFCDBF2A8D21D752B3; // 0x1E70(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_AEBB96654CD27C9CBB1F28B0893A47EB; // 0x1F78(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5BE04E904729237F9CF17BA5C016B5B3; // 0x1FE8(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3474DCC84C7F894EA3595FA355586000; // 0x2058(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_265D1A994968580F27AB749FD97E774B; // 0x2160(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_663D543D49BEA62B90154E82A33871BE; // 0x21D0(0x01B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1A9AD66640851DC90186DE905C956FBB; // 0x2380(0x0068)()

public:
	void ExecuteUbergraph_BP_SafeHouseNPCAnim_Interact_3pTest(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SafeHouseNPCAnim_Interact_3pTest_AnimGraphNode_TransitionResult_8118E62A4B2E82886244F48D199CEA40(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SafeHouseNPCAnim_Interact_3pTest_AnimGraphNode_TransitionResult_9D9AE9C74F6DA70F5A4582BB16EBD51F(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SafeHouseNPCAnim_Interact_3pTest_AnimGraphNode_TransitionResult_C1CA0DAA4419590B25595A85F4EE0CD3(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SafeHouseNPCAnim_Interact_3pTest_AnimGraphNode_TransitionResult_3B8890EA40B1DE216A4100B975F59E09(); // (BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_SafeHouseNPCAnim_Interact_3pTest_AnimGraphNode_TransitionResult_0408B1CE49C8FC9AA12524918285EECC(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SafeHouseNPCAnim_Interact_3pTest_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SafeHouseNPCAnim_Interact_3pTest_C")
	}
	static class UBP_SafeHouseNPCAnim_Interact_3pTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SafeHouseNPCAnim_Interact_3pTest_C>();
	}
};
DUMPER7_ASSERTS_UBP_SafeHouseNPCAnim_Interact_3pTest_C;

}

