#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StreamingComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AreaContainer_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StreamingComponent.BP_StreamingComponent_C
// 0x00B8 (0x01B0 - 0x00F8)
class UBP_StreamingComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FString>                         区域;                                              // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<TSoftObjectPtr<class UWorld>>          子关卡;                                            // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FTimerHandle                           UnloadingTimerHandle;                              // 0x0120(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBP_StreamingCallbackInterface_C> callback;                               // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TMap<class FString, struct FAreaContainer>    LoadedAreas;                                       // 0x0138(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 UpdatingArea;                                      // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          是否区分HD和Mobile;                                // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UWorld>>          子关卡HD;                                          // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor)

public:
	void ExecuteUbergraph_BP_StreamingComponent(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void 注册回调(TScriptInterface<class IBP_StreamingCallbackInterface_C> 回调接口); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void 加载(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void 卸载(float 延迟_秒_); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void 访问Wiki(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Unload(); // (Private, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetLevelPacakgesToStream(TArray<class FString>* 子关卡组); // (Private, HasOutParams, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void CacheLoadedArea(); // (Private, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnLoadingCompleted(); // (Private, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnUnloadingCompleted(); // (Private, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnAreaLevelUp(const class FText& 区域名); // (Private, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetAreaSublevels(const class FString& AreaName, TArray<class FString>* OutputSublevels); // (Private, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnOldAreaLevelUnloaded(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnNewAreaLevelLoaded(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void _作者(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StreamingComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StreamingComponent_C")
	}
	static class UBP_StreamingComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_StreamingComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_StreamingComponent_C;

}

