#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Safehouse_LogisticsOffice_1

#include "Basic.hpp"

#include "SafeHouse_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Safehouse_LogisticsOffice_1.BP_Safehouse_LogisticsOffice_1_C
// 0x0038 (0x0418 - 0x03E0)
class ABP_Safehouse_LogisticsOffice_1_C final : public ASafeHouseBuilding
{
public:
	class UWidgetComponent*                       Interaction3DTip;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Interaction3DTipBg;                                // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USHBuildingCameraComponent*             SHBuildingCamera;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_EFX_SafeHouse_ComponentUpgrade;                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USHBuildingWhiteDotComponent*           SHBuildingWhiteDot;                                // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Safehouse_LogisticsOffice_1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Safehouse_LogisticsOffice_1_C")
	}
	static class ABP_Safehouse_LogisticsOffice_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Safehouse_LogisticsOffice_1_C>();
	}
};
DUMPER7_ASSERTS_ABP_Safehouse_LogisticsOffice_1_C;

}

