#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SafeHouse_Elevator

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SafeHouse_Elevator.BP_SafeHouse_Elevator_C
// 0x0028 (0x0640 - 0x0618)
class ABP_SafeHouse_Elevator_C final : public ASOLRadarStationElevator
{
public:
	class UBoxComponent*                          ElevatorOverlapBox;                                // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGameAkComponent*                       GameAk;                                            // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGPPathFollowComponent*                 GPPathFollow;                                      // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SafeHouse_Elevator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SafeHouse_Elevator_C")
	}
	static class ABP_SafeHouse_Elevator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SafeHouse_Elevator_C>();
	}
};
DUMPER7_ASSERTS_ABP_SafeHouse_Elevator_C;

}

