#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponModular_ChargeGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_WeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponModular_ChargeGun.BP_WeaponModular_ChargeGun_C
// 0x0080 (0x1490 - 0x1410)
class ABP_WeaponModular_ChargeGun_C final : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChargeGunDataCompAmmoAppearance*       ChargeGunDataCompAmmoAppearance;                   // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_SizeScaler_1C53E0FF4D8D2E88A1127FB9ED6CD7CC; // 0x1418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_1C53E0FF4D8D2E88A1127FB9ED6CD7CC; // 0x141C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141D[0x3];                                     // 0x141D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x1420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurAmmo;                                           // 0x1428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurAmmoPercent;                                    // 0x142C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Scout_C201_ElectromagneticGun_04_1P;               // 0x1430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Number_Color00;                                    // 0x1438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Number_Color01;                                    // 0x1448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Number_Color02;                                    // 0x1458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChargePercent;                                     // 0x1468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Number_Move_V;                                     // 0x146C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Number_Scale_U;                                    // 0x1470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Number_Scale_V;                                    // 0x1474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Use_Point_Mask;                                    // 0x1478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Point_Mask_UV_Scale;                               // 0x147C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGPSkeletalMeshComponent*               Scout_C201_ElectromagneticGun_05_1P;               // 0x1480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WeaponModular_ChargeGun(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void ReceiveEndPlay(EEndPlayReason EndPlayReason); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnAmmoCountChange(float WeaponAmmoCount, float CarryWeaponAmmoCount); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnChargeStateChanged(bool ischarging); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Timeline_1__UpdateFunc(); // (BlueprintEvent) // @ 0x14B5B5E20
	void Timeline_1__FinishedFunc(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SetAmmo(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetChargePercent(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponModular_ChargeGun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponModular_ChargeGun_C")
	}
	static class ABP_WeaponModular_ChargeGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponModular_ChargeGun_C>();
	}
};
DUMPER7_ASSERTS_ABP_WeaponModular_ChargeGun_C;

}

