#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponModular_C301Launcher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_WeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponModular_C301Launcher.BP_WeaponModular_C301Launcher_C
// 0x0020 (0x1430 - 0x1410)
class ABP_WeaponModular_C301Launcher_C final : public ABP_WeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_WeaponDataComponentPreviewLine_C*   BP_WeaponDataComponentPreviewLine;                 // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULauncherDataComponentEffect*           LauncherDataComponentEffect;                       // 0x1418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGPSequenceMannequinAssemblyComponent*  GPSequenceMannequinAssembly;                       // 0x1420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGPSequenceBindingComponent*            GPSequenceBinding;                                 // 0x1428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WeaponModular_C301Launcher(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponModular_C301Launcher_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponModular_C301Launcher_C")
	}
	static class ABP_WeaponModular_C301Launcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponModular_C301Launcher_C>();
	}
};
DUMPER7_ASSERTS_ABP_WeaponModular_C301Launcher_C;

}

