#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponThrow_IntelligentSmoke

#include "Basic.hpp"

#include "DFMAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponThrow_IntelligentSmoke.BP_WeaponThrow_IntelligentSmoke_C
// 0x0050 (0x1430 - 0x13E0)
class ABP_WeaponThrow_IntelligentSmoke_C final : public AHeavyAttackThrowableWeapon
{
public:
	class UDFMWeaponThrowableDataComponentCore*   DFMWeaponThrowableDataComponentCore;               // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGPWeaponSkillComponent*                GPWeaponSkill;                                     // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentZoom*      WeaponThrowableDataComponentZoom;                  // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowBunkerDataComponentAnim*    WeaponThrowBunkerDataComponentAnim;                // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UThrowWeaponDataAppearanceComp*         ThrowWeaponDataAppearanceComp;                     // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentFiring*    WeaponThrowableDataComponentFiring;                // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponDataComponentDamage*          DFMWeaponDataComponentDamage;                      // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponThrow_IntelligentSmoke_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponThrow_IntelligentSmoke_C")
	}
	static class ABP_WeaponThrow_IntelligentSmoke_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponThrow_IntelligentSmoke_C>();
	}
};
DUMPER7_ASSERTS_ABP_WeaponThrow_IntelligentSmoke_C;

}

