#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponBaseBoss05

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponBaseBoss05.BP_WeaponBaseBoss05_C
// 0x0040 (0x1420 - 0x13E0)
#pragma pack(push, 0x1)
class alignas(0x10) ABP_WeaponBaseBoss05_C : public ADFMAIBoss05Weapon
{
public:
	class UBoss05WeaponFuncComponentEffect*       Boss05WeaponFuncComponentEffect;                   // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMAIBoss05WeaponDataComponentFiring*  DFMAIBoss05WeaponDataComponentFiring;              // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentAdapter*            WeaponDataComponentAdapter;                        // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentZoom*               WeaponDataComponentZoom;                           // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentCore*               WeaponDataComponentCore;                           // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponBaseBoss05_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponBaseBoss05_C")
	}
	static class ABP_WeaponBaseBoss05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponBaseBoss05_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_WeaponBaseBoss05_C;

}

