#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponHeavyMachineGun

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponHeavyMachineGun.BP_WeaponHeavyMachineGun_C
// 0x0060 (0x1D10 - 0x1CB0)
class ABP_WeaponHeavyMachineGun_C final : public ADFMSceneWeapon
{
public:
	class UWeaponFuncComponentEffect*             WeaponFuncComponentEffect;                         // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentAmmo*               WeaponDataComponentAmmo;                           // 0x1CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGeneralSignificanceComponent*          GeneralSignificance;                               // 0x1CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGPWeaponDataComponentOverHeat*         GPWeaponDataComponentOverHeat;                     // 0x1CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_Interact_HeavyMachineGun;                       // 0x1CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponHeavyMachineGunDataComponentAnim* WeaponHeavyMachineGunDataComponentAnim;           // 0x1CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentFiring*             WeaponDataComponentFiring;                         // 0x1CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponDataComponentDamage*          DFMWeaponDataComponentDamage;                      // 0x1CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentAppearance*         WeaponDataComponentAppearance;                     // 0x1CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentCore*               WeaponDataComponentCore;                           // 0x1D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponHeavyMachineGun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponHeavyMachineGun_C")
	}
	static class ABP_WeaponHeavyMachineGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponHeavyMachineGun_C>();
	}
};
DUMPER7_ASSERTS_ABP_WeaponHeavyMachineGun_C;

}

