#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_NetSpider

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_NetSpider.BP_Weapon_NetSpider_C
// 0x0050 (0x1420 - 0x13D0)
class ABP_Weapon_NetSpider_C final : public ADFMWeapon
{
public:
	uint8                                         Pad_13C8[0x8];                                     // 0x13C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPWeaponSkillComponent*                GPWeaponSkill;                                     // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentZoom*      WeaponThrowableDataComponentZoom;                  // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UThrowWeaponDataAppearanceComp*         ThrowWeaponDataAppearanceComp;                     // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentFiring*    WeaponThrowableDataComponentFiring;                // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentCore*               WeaponDataComponentCore;                           // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponDataComponentDamage*          DFMWeaponDataComponentDamage;                      // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentAnim*      WeaponThrowableDataComponentAnim;                  // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Weapon_NetSpider_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Weapon_NetSpider_C")
	}
	static class ABP_Weapon_NetSpider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_NetSpider_C>();
	}
};
DUMPER7_ASSERTS_ABP_Weapon_NetSpider_C;

}

