#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponRCVAIWeaponBase

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponRCVAIWeaponBase.BP_WeaponRCVAIWeaponBase_C
// 0x0030 (0x1410 - 0x13E0)
class ABP_WeaponRCVAIWeaponBase_C : public ADFMAIRCVWeapon
{
public:
	class UWeaponFuncComponentEffect*             WeaponFuncComponentEffect;                         // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentCore*               WeaponDataComponentCore;                           // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentZoom*               WeaponDataComponentZoom;                           // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentFiring*             WeaponDataComponentFiring;                         // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponRCVAIWeaponBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponRCVAIWeaponBase_C")
	}
	static class ABP_WeaponRCVAIWeaponBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponRCVAIWeaponBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_WeaponRCVAIWeaponBase_C;

}

