#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterInteractionManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterInteractionManager.BP_WaterInteractionManager_C
// 0x0048 (0x0478 - 0x0430)
class ABP_WaterInteractionManager_C final : public ADFMWaterInteractionManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextureRenderTarget2D*                 RTCurrent;                                         // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RTPrevious;                                        // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RTPrePrevious;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RTCapture;                                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VehicleTravelSpeed;                                // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultTravelSpeed;                                // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultSimParam;                                   // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SwimTravelSpeed;                                   // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaterSystemNotValid;                               // 0x0474(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_WaterInteractionManager(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void ReceiveEndPlay(EEndPlayReason EndPlayReason); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void WaterInteractiveRenderTargetChangedEvent(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnWaterInteractionStateChanged(EDFMWaterInteractionState NewState); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTick(float DeltaSeconds); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveBeginPlay(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ClearRT(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateSimParam(float TravelSpeed); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetRT(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WaterInteractionManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WaterInteractionManager_C")
	}
	static class ABP_WaterInteractionManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaterInteractionManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_WaterInteractionManager_C;

}

