#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponHumveeAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "DFMGameplay_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_WeaponHumveeAnim.BP_WeaponHumveeAnim_C
// 0x0B00 (0x0D90 - 0x0290)
class UBP_WeaponHumveeAnim_C final : public UDFMMachineGunAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F6D48FD74CC83BE9DAFE3495244B35D9; // 0x0298(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_02EB0E4540F34B28307CEC99E79B1821; // 0x0308(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C31E48744089041C082725BEF2587BD7; // 0x0430(0x0088)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E02754CF44951892E87B26B167D6DFA6; // 0x04B8(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6FD386764419A6F092E6BBAD60CDA55E; // 0x0520(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_626E91EC4879B665F27103BDF3C5A317; // 0x0588(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E4726CD349D008B070605C8BC980C1CC; // 0x0688(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C46C2BCA4A6EC1F227869FB4D3D3FFCE; // 0x06F0(0x0100)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_78201E784FFC63D7C7A1C8B89E875CC1; // 0x07F0(0x0088)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_968742374D498C4116143F89D3789D70; // 0x0878(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E947448B4CAEE8F6026F12AE82375278; // 0x08D8(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_CD06AE334A77D1686E6A739850BF0CD0; // 0x0938(0x0160)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C96000174CA9E81D6BA6619C5033ABD7; // 0x0A98(0x0108)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_C6922E5240ECBC3DD9320882753500DE; // 0x0BA0(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_B01C15D74AAD917E6B73BE91E04340B5; // 0x0C80(0x0110)()

public:
	void ExecuteUbergraph_BP_WeaponHumveeAnim(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WeaponHumveeAnim_AnimGraphNode_ModifyBone_CD06AE334A77D1686E6A739850BF0CD0(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponHumveeAnim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponHumveeAnim_C")
	}
	static class UBP_WeaponHumveeAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WeaponHumveeAnim_C>();
	}
};
DUMPER7_ASSERTS_UBP_WeaponHumveeAnim_C;

}

