#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponModularFlameThrower

#include "Basic.hpp"

#include "BP_WeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponModularFlameThrower.BP_WeaponModularFlameThrower_C
// 0x0020 (0x1430 - 0x1410)
class ABP_WeaponModularFlameThrower_C final : public ABP_WeaponBase_C
{
public:
	class UGPWeaponSkillComponent*                GPWeaponSkill;                                     // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponFuncComponentAudioFlameThrower*  WeaponFuncComponentAudioFlameThrower;              // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponFuncComponentFlameThrowerFiringAnim* WeaponFuncComponentFlameThrowerFiringAnim;     // 0x1418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponFlameThrowerDataComponentAnim*   WeaponFlameThrowerDataComponentAnim;               // 0x1420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentFlameThrower*       WeaponDataComponentFlameThrower;                   // 0x1428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponModularFlameThrower_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponModularFlameThrower_C")
	}
	static class ABP_WeaponModularFlameThrower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponModularFlameThrower_C>();
	}
};
DUMPER7_ASSERTS_ABP_WeaponModularFlameThrower_C;

}

