#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponThrowC4

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponThrowC4.BP_WeaponThrowC4_C
// 0x0050 (0x1420 - 0x13D0)
class ABP_WeaponThrowC4_C final : public ADFMWeaponC4
{
public:
	class UDFMWeaponThrowableDataComponentCore*   DFMWeaponThrowableDataComponentCore;               // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SkillWeaponDataAppearanceC4_C*      BP_SkillWeaponDataAppearanceC4;                    // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ThrowablePreviewCom_C*              BP_ThrowablePreviewCom;                            // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentZoom*      WeaponThrowableDataComponentZoom;                  // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentFiring*    WeaponThrowableDataComponentFiring;                // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentAnim*      WeaponThrowableDataComponentAnim;                  // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponDataComponentDamage*          DFMWeaponDataComponentDamage;                      // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_WeaponThrowC4_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_WeaponThrowC4_C")
	}
	static class ABP_WeaponThrowC4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponThrowC4_C>();
	}
};
DUMPER7_ASSERTS_ABP_WeaponThrowC4_C;

}

