#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_BionicBird

#include "Basic.hpp"

#include "DFMAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_BionicBird.BP_Weapon_BionicBird_C
// 0x0060 (0x1430 - 0x13D0)
class ABP_Weapon_BionicBird_C final : public ABionicBirdWeapon
{
public:
	class UWeaponBindHUDFuncComponent*            WeaponBindHUDFunc;                                 // 0x13D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponThrowableDataComponentCore*   DFMWeaponThrowableDataComponentCore;               // 0x13D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGPWeaponSkillComponent*                GPWeaponSkill;                                     // 0x13E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_ThrowablePreviewCom_C*              BP_ThrowablePreviewCom;                            // 0x13E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentZoom*      WeaponThrowableDataComponentZoom;                  // 0x13F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UThrowWeaponDataAppearanceComp*         ThrowWeaponDataAppearanceComp;                     // 0x13F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentFiring*    WeaponThrowableDataComponentFiring;                // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentAnim*      WeaponThrowableDataComponentAnim;                  // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponDataComponentDamage*          DFMWeaponDataComponentDamage;                      // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Weapon_BionicBird_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Weapon_BionicBird_C")
	}
	static class ABP_Weapon_BionicBird_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_BionicBird_C>();
	}
};
DUMPER7_ASSERTS_ABP_Weapon_BionicBird_C;

}

