#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Swarms

#include "Basic.hpp"

#include "DFMAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Swarms.BP_Weapon_Swarms_C
// 0x0050 (0x1450 - 0x1400)
class ABP_Weapon_Swarms_C final : public AZoyaSwarmsWeapon
{
public:
	class UGPWeaponSkillComponent*                GPWeaponSkill;                                     // 0x1400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentZoom*      WeaponThrowableDataComponentZoom;                  // 0x1408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UThrowWeaponDataAppearanceComp*         ThrowWeaponDataAppearanceComp;                     // 0x1410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentFiring*    WeaponThrowableDataComponentFiring;                // 0x1418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponThrowableDataComponentAnim*      WeaponThrowableDataComponentAnim;                  // 0x1420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDFMWeaponDataComponentDamage*          DFMWeaponDataComponentDamage;                      // 0x1428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAttributesCenterComponent*       WeaponAttributesCenter;                            // 0x1430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentState*              WeaponDataComponentState;                          // 0x1438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponDataComponentCore*               WeaponDataComponentCore;                           // 0x1440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Weapon_Swarms_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Weapon_Swarms_C")
	}
	static class ABP_Weapon_Swarms_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_Swarms_C>();
	}
};
DUMPER7_ASSERTS_ABP_Weapon_Swarms_C;

}

