#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bracket_anibp

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass bracket_anibp.bracket_anibp_C
// 0x0880 (0x0AF0 - 0x0270)
class Ubracket_anibp_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0F08DC9846E16A04CC016C9A154D025B; // 0x0278(0x0070)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_411F8C6D406A7D6549201E89B4FA5CA0; // 0x02E8(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_DA78BF52424F4235367B7FA6889B0ACF; // 0x0348(0x0060)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_595BF9204F3888EC1841DBAED71705FF; // 0x03A8(0x0088)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_553EE4AF4A193893E387DE9533C38CB7; // 0x0430(0x0060)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_09B59D804F77315B7C83B98E94C7459A; // 0x0490(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_F58E710C420BB8A9F80B1086D483C3C8; // 0x04F0(0x0160)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6248262E4A4DFBE64E012E81FA077F6C; // 0x0650(0x0108)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_466464964BA02F727B8218A446CEA3A8; // 0x0758(0x0070)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D924C0014042EEEC50D2E8B8C82CD12B; // 0x07C8(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1F74C9044DDFAB260AB49DBC8DD971CC; // 0x0978(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4509856047E33195FF66799F060D3C2E; // 0x0A78(0x0068)()
	bool                                          Shake;                                             // 0x0AE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCustomRotate;                                     // 0x0AE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE2[0x2];                                      // 0x0AE2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomYaw;                                         // 0x0AE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_bracket_anibp(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BlueprintUpdateAnimation(float DeltaTimeX); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void EvaluateGraphExposedInputs_ExecuteUbergraph_bracket_anibp_AnimGraphNode_ModifyBone_F58E710C420BB8A9F80B1086D483C3C8(); // (BlueprintEvent) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("bracket_anibp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"bracket_anibp_C")
	}
	static class Ubracket_anibp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Ubracket_anibp_C>();
	}
};
DUMPER7_ASSERTS_Ubracket_anibp_C;

}

