#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CaptureStudio

#include "Basic.hpp"

#include "CaptureStudio_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CaptureStudio.CaptureEnv
// 0x09F0 (0x0D60 - 0x0370)
class ACaptureEnv final : public AActor
{
public:
	TSubclassOf<class AHallCharacter>             CharacterClass;                                    // 0x0370(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     BPLightEnvClass;                                   // 0x0378(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        RenderTargetSizeX;                                 // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        RenderTargetSizeY;                                 // 0x0384(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableWorldRender;                               // 0x0388(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureOnEndFrame;                                // 0x0389(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ALightEnv;                                         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneCaptureComponent2D*               Capture2DCom;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A0[0x10];                                     // 0x03A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        RootPoint;                                         // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCaptureTarget                         CaptureTarget;                                     // 0x03B8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   DefaultPostProcessSettings;                        // 0x03D0(0x0950)(NativeAccessSpecifierPrivate)
	TArray<class ULightComponent*>                AllLight;                                          // 0x0D20(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D30[0x30];                                     // 0x0D30(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTextureRenderTarget2D* Capture(bool bCaptureEveryFrame); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF11B0
	class UTextureRenderTarget2D* CaptureInEditor(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF1250
	void CharacterSetup(); // (Final, Native, Protected) // @ 0x14ADF1280
	void CheckShouldResizeTarget(); // (Final, Native, Protected) // @ 0x14ADF12A0
	void Clear(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF12C0
	class UTextureRenderTarget2D* GetCaptureRT(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF12E0
	class AHallCharacter* GetCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF1310
	class USceneComponent* GetRootPoint(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF1340
	void ResizeTarget(int32 SizeX, int32 SizeY); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF1370
	void ShowSkylight(bool bShow); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF1430
	class AHallCharacter* SpawnCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF14C0
	void StopCapture(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF14F0
	void UpdateCapture(); // (Final, Native, Public) // @ 0x14ADF1510
	void WeaponLoadComplete(); // (Final, Native, Protected) // @ 0x14ADF1530

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CaptureEnv")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CaptureEnv")
	}
	static class ACaptureEnv* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureEnv>();
	}
};
DUMPER7_ASSERTS_ACaptureEnv;

// Class CaptureStudio.CaptureLight
// 0x0000 (0x0370 - 0x0370)
class ACaptureLight final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CaptureLight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CaptureLight")
	}
	static class ACaptureLight* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureLight>();
	}
};
DUMPER7_ASSERTS_ACaptureLight;

// Class CaptureStudio.CaptureStudioManager
// 0x0028 (0x0058 - 0x0030)
class UCaptureStudioManager final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(class ACaptureEnv* CaptureEnv)> OnCaptureEnvLoaded;                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class ACaptureEnv*                            CaptureEnv;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCaptureStudioManager* Get(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADF1940

	class ACaptureEnv* GetCaptureEnv(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF1A00
	void LoadCaptureEnv(const class FString& CaptureEnvPath); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADF1A30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CaptureStudioManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CaptureStudioManager")
	}
	static class UCaptureStudioManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaptureStudioManager>();
	}
};
DUMPER7_ASSERTS_UCaptureStudioManager;

}

