#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothingSystemRuntimeInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ClothingSystemRuntimeInterface_structs.hpp"


namespace SDK
{

// Class ClothingSystemRuntimeInterface.ClothConfigBase
// 0x0000 (0x0028 - 0x0028)
class UClothConfigBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClothConfigBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClothConfigBase")
	}
	static class UClothConfigBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothConfigBase>();
	}
};
DUMPER7_ASSERTS_UClothConfigBase;

// Class ClothingSystemRuntimeInterface.ClothingAssetBase
// 0x0020 (0x0048 - 0x0028)
class UClothingAssetBase : public UObject
{
public:
	class FString                                 ImportedFilePath;                                  // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  AssetGuid;                                         // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClothingAssetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClothingAssetBase")
	}
	static class UClothingAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingAssetBase>();
	}
};
DUMPER7_ASSERTS_UClothingAssetBase;

// Class ClothingSystemRuntimeInterface.ClothingSimulationFactory
// 0x0000 (0x0028 - 0x0028)
class UClothingSimulationFactory : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClothingSimulationFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClothingSimulationFactory")
	}
	static class UClothingSimulationFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingSimulationFactory>();
	}
};
DUMPER7_ASSERTS_UClothingSimulationFactory;

// Class ClothingSystemRuntimeInterface.ClothingSimulationInteractor
// 0x0008 (0x0030 - 0x0028)
class UClothingSimulationInteractor : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClothConfigUpdated(); // (Native, Public, BlueprintCallable) // @ 0x140C99650
	void PhysicsAssetUpdated(); // (Native, Public, BlueprintCallable) // @ 0x140C98CF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClothingSimulationInteractor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClothingSimulationInteractor")
	}
	static class UClothingSimulationInteractor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothingSimulationInteractor>();
	}
};
DUMPER7_ASSERTS_UClothingSimulationInteractor;

// Class ClothingSystemRuntimeInterface.ClothPhysicalMeshDataBase
// 0x00B8 (0x00E0 - 0x0028)
class UClothPhysicalMeshDataBase : public UObject
{
public:
	TArray<struct FVector>                        Vertices;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Normals;                                           // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                Indices;                                           // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 InverseMasses;                                     // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FClothVertBoneData>             BoneData;                                          // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumFixedVerts;                                     // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxBoneWeights;                                    // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint32>                                SelfCollisionIndices;                              // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x50];                                      // 0x0090(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClothPhysicalMeshDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClothPhysicalMeshDataBase")
	}
	static class UClothPhysicalMeshDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClothPhysicalMeshDataBase>();
	}
};
DUMPER7_ASSERTS_UClothPhysicalMeshDataBase;

}

