#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataTableLoader

#include "Basic.hpp"

#include "GPGameFlow_structs.hpp"
#include "GameCore_structs.hpp"


namespace SDK
{

// Enum DataTableLoader.EDataTableHotfixFileState
// NumValues: 0x0006
enum class EDataTableHotfixFileState : uint8
{
	EState_Obsoleted                         = 0,
	EState_WaitSync                          = 1,
	EState_Synced                            = 2,
	EState_Overrided                         = 4,
	EState_WaitNofity                        = 8,
	EState_MAX                               = 9,
};

// Enum DataTableLoader.EDataTableLoaderGameScene
// NumValues: 0x0004
enum class EDataTableLoaderGameScene : uint8
{
	GameScene_None                           = 0,
	GameScene_SOL                            = 1,
	GameScene_BattleField                    = 2,
	GameScene_MAX                            = 3,
};

// ScriptStruct DataTableLoader.DataTableGameFlow2Scene
// 0x0008 (0x0018 - 0x0010)
struct FDataTableGameFlow2Scene final : public FDescRowBase
{
public:
	EDataTableUseScene                            UseScene;                                          // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameFlowStageType                            GameFlow;                                          // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataTableGameFlow2Scene;

// ScriptStruct DataTableLoader.DataTableHotfixedData
// 0x0030 (0x0030 - 0x0000)
struct FDataTableHotfixedData final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TableName;                                         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MD5;                                               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Keys;                                              // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableHotfixedData;

// ScriptStruct DataTableLoader.DataTableHotfixFilePackage
// 0x0068 (0x0068 - 0x0000)
struct alignas(0x08) FDataTableHotfixFilePackage final
{
public:
	uint8                                         Pad_0[0x68];                                       // 0x0000(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataTableHotfixFilePackage;

// ScriptStruct DataTableLoader.DataTableHotfixFile
// 0x0088 (0x0088 - 0x0000)
struct alignas(0x08) FDataTableHotfixFile final
{
public:
	uint8                                         Pad_0[0x88];                                       // 0x0000(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataTableHotfixFile;

// ScriptStruct DataTableLoader.DataTableHotfixCell
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FDataTableHotfixCell final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataTableHotfixCell;

// ScriptStruct DataTableLoader.DataTableHotfixNotifier
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FDataTableHotfixNotifier final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataTableHotfixNotifier;

// ScriptStruct DataTableLoader.DataTableHotfixEventHandle
// 0x0018 (0x0018 - 0x0000)
struct FDataTableHotfixEventHandle final
{
public:
	int64                                         Token;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FName& TableName)> Event;                                             // 0x0008(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableHotfixEventHandle;

// ScriptStruct DataTableLoader.DataTableHotfixEventBridge
// 0x0018 (0x0018 - 0x0000)
struct FDataTableHotfixEventBridge final
{
public:
	class FName                                   DataTableName;                                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDataTableHotfixEventHandle>    EventHandles;                                      // 0x0008(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableHotfixEventBridge;

// ScriptStruct DataTableLoader.CSVZipTable
// 0x0050 (0x0050 - 0x0000)
struct FCSVZipTable final
{
public:
	bool                                          bCompress;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        Source_CSV_Size;                                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CSV;                                               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CSV_Name;                                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCSVZipTable;

// ScriptStruct DataTableLoader.CSVZipPkg
// 0x0028 (0x0028 - 0x0000)
struct FCSVZipPkg final
{
public:
	uint64                                        Seq;                                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Idx;                                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Total;                                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCSVZipTable>                   Tables;                                            // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCSVZipPkg;

// ScriptStruct DataTableLoader.DataTableHotfixC2SParam
// 0x0020 (0x0020 - 0x0000)
struct FDataTableHotfixC2SParam final
{
public:
	uint64                                        Token;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableHotfixC2SParam;

// ScriptStruct DataTableLoader.DataTableHotfixParam
// 0x0040 (0x0040 - 0x0000)
struct FDataTableHotfixParam final
{
public:
	int32                                         ReceiveCount;                                      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HotfixCount;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TableName;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MD5;                                               // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Header;                                            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableHotfixParam;

}

