#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DestructionLevelRuntime

#include "Basic.hpp"

#include "DestructionLevelRuntime_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DestructionLevelRuntime.DesHLODLevelRuntimeMeshComponent
// 0x0010 (0x08D0 - 0x08C0)
class UDesHLODLevelRuntimeMeshComponent final : public UDestructibleStaticMeshComponent
{
public:
	TArray<struct FDesHLODSingleSourceCompInfo>   RefSourceCompInfos;                                // 0x08B8(0x0010)(Edit, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C8[0x8];                                      // 0x08C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesHLODLevelRuntimeMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesHLODLevelRuntimeMeshComponent")
	}
	static class UDesHLODLevelRuntimeMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesHLODLevelRuntimeMeshComponent>();
	}
};
DUMPER7_ASSERTS_UDesHLODLevelRuntimeMeshComponent;

// Class DestructionLevelRuntime.DesTerrainAreaVolume
// 0x0040 (0x03E8 - 0x03A8)
class ADesTerrainAreaVolume final : public AVolume
{
public:
	struct FDesTerrainAreaBuildConfig             BuildConfig;                                       // 0x03A8(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FDesTerrainAreaData                    BakeAreaData;                                      // 0x03C0(0x0028)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesTerrainAreaVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesTerrainAreaVolume")
	}
	static class ADesTerrainAreaVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADesTerrainAreaVolume>();
	}
};
DUMPER7_ASSERTS_ADesTerrainAreaVolume;

// Class DestructionLevelRuntime.DesTerrainLevelArea
// 0x0030 (0x0058 - 0x0028)
class UDesTerrainLevelArea final : public UObject
{
public:
	class FName                                   SectorID;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDesTerrainAreaData                    AreaData;                                          // 0x0030(0x0028)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesTerrainLevelArea")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesTerrainLevelArea")
	}
	static class UDesTerrainLevelArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesTerrainLevelArea>();
	}
};
DUMPER7_ASSERTS_UDesTerrainLevelArea;

// Class DestructionLevelRuntime.DesBatchBuildConfig
// 0x0060 (0x0088 - 0x0028)
class UDesBatchBuildConfig final : public UObject
{
public:
	TArray<TSoftObjectPtr<class UDataTable>>      ResTables;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bEnableHLOD;                                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBatchHLOD;                                        // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableISM;                                        // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDesBatchHLODConfig>            HLODLayersConfig;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDesBatchISMConfig                     ISMConfig;                                         // 0x0050(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevel*                                 RuntimeLevel;                                      // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevel*                                 InterActorLevel;                                   // 0x0068(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesBatchBuildConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesBatchBuildConfig")
	}
	static class UDesBatchBuildConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesBatchBuildConfig>();
	}
};
DUMPER7_ASSERTS_UDesBatchBuildConfig;

}

