#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFCommonDroDownItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GPUserInterface_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DFCommonDroDownItem.DFCommonDroDownItem_C
// 0x0120 (0x2A30 - 0x2910)
class UDFCommonDroDownItem_C final : public UDFCommonCheckButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAni;                                        // 0x2918(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAni;                                         // 0x2920(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedHoveredAni;                               // 0x2928(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedHoveredAni;                                 // 0x2930(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedDownAni;                                  // 0x2938(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedUpAni;                                    // 0x2940(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedDownAni;                                    // 0x2948(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedUpAni;                                      // 0x2950(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            NewVar_0;                                          // 0x2958(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_1;                                          // 0x2980(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_2;                                          // 0x29A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_3;                                          // 0x29D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_4;                                          // 0x29F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDFImage*                               ImageColor;                                        // 0x2A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsColor;                                           // 0x2A28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DFCommonDroDownItem(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DFCommonDroDownItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCommonDroDownItem_C")
	}
	static class UDFCommonDroDownItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCommonDroDownItem_C>();
	}
};
DUMPER7_ASSERTS_UDFCommonDroDownItem_C;

}

