#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFCommonCheckButton_TabV3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterface_structs.hpp"
#include "GPUserInterface_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DFCommonCheckButton_TabV3.DFCommonCheckButton_TabV3_C
// 0x0088 (0x2998 - 0x2910)
class UDFCommonCheckButton_TabV3_C final : public UDFCommonCheckButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CheckedNormal;                                     // 0x2918(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedNormal;                                   // 0x2920(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverUncheckedHoveredAni;                        // 0x2928(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverCheckedHoveredAni;                          // 0x2930(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAni;                                        // 0x2938(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAni;                                         // 0x2940(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedHoveredAni;                               // 0x2948(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedHoveredAni;                                 // 0x2950(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedDownAni;                                  // 0x2958(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedUpAni;                                    // 0x2960(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedDownAni;                                    // 0x2968(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedUpAni;                                      // 0x2970(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFImage*                               DFImage_71;                                        // 0x2978(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULine*                                  DFImage_Line;                                      // 0x2980(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_Lock;                                      // 0x2988(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Image;                                    // 0x2990(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DFCommonCheckButton_TabV3(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void OnSetThemeIDChanged(const class FString& InThemeID); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetIsLockedStyle(bool bIsLockState); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateCheckStateAnim(ECheckButtonState CurCheckState); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnCheckButtonStateChanged_Event_0(const ECheckButtonState& CurCheckState); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetIsLocked(bool bLocked); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetShowSpacerLine(bool bShow); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_Set_Main_Title_Default_Policy(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DFCommonCheckButton_TabV3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCommonCheckButton_TabV3_C")
	}
	static class UDFCommonCheckButton_TabV3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCommonCheckButton_TabV3_C>();
	}
};
DUMPER7_ASSERTS_UDFCommonCheckButton_TabV3_C;

}

