#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFColorDroDownItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GPUserInterface_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DFColorDroDownItem.DFColorDroDownItem_C
// 0x0178 (0x2A88 - 0x2910)
class UDFColorDroDownItem_C final : public UDFCommonCheckButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOutAni;                                        // 0x2918(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAni;                                         // 0x2920(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedHoverAni;                                 // 0x2928(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedHoverAni;                                   // 0x2930(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedDownAni;                                  // 0x2938(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedUpAni;                                    // 0x2940(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedDownAni;                                    // 0x2948(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedUpAni;                                      // 0x2950(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFImage*                               Image_Color;                                       // 0x2958(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            NewVar_0;                                          // 0x2960(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_1;                                          // 0x2988(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_2;                                          // 0x29B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_3;                                          // 0x29D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_4;                                          // 0x2A00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDFImage*                               ImageColor;                                        // 0x2A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TableName;                                         // 0x2A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FSlateColor>       ColorMap;                                          // 0x2A38(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_DFColorDroDownItem(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetColor(const class FString& Index_0); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void InitColorMap(); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DFColorDroDownItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFColorDroDownItem_C")
	}
	static class UDFColorDroDownItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFColorDroDownItem_C>();
	}
};
DUMPER7_ASSERTS_UDFColorDroDownItem_C;

}

