#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFCommonDroDownBox_Pc

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GPUserInterface_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DFCommonDroDownBox_Pc.DFCommonDroDownBox_Pc_C
// 0x0118 (0x2A28 - 0x2910)
class UDFCommonDroDownBox_Pc_C final : public UDFCommonCheckButton
{
public:
	class UWidgetAnimation*                       RecoverCheckedHoveredAni;                          // 0x2910(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverUncheckedHoveredAni;                        // 0x2918(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOutAni;                                        // 0x2920(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInAni;                                         // 0x2928(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedHoveredAni;                               // 0x2930(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedHoveredAni;                                 // 0x2938(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedDownAni;                                  // 0x2940(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UncheckedUpAni;                                    // 0x2948(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedDownAni;                                    // 0x2950(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckedUpAni;                                      // 0x2958(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            NewVar_0;                                          // 0x2960(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_1;                                          // 0x2988(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_2;                                          // 0x29B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_3;                                          // 0x29D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NewVar_4;                                          // 0x2A00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DFCommonDroDownBox_Pc_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCommonDroDownBox_Pc_C")
	}
	static class UDFCommonDroDownBox_Pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCommonDroDownBox_Pc_C>();
	}
};
DUMPER7_ASSERTS_UDFCommonDroDownBox_Pc_C;

}

