#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMAbility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "Engine_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "GPWeaponDefineForPlugin_structs.hpp"
#include "GPDeformable_structs.hpp"
#include "GPResource_structs.hpp"
#include "GPAudioRuntime_structs.hpp"


namespace SDK
{

// Enum DFMAbility.ESpiderMoveMode
// NumValues: 0x0005
enum class ESpiderMoveMode : uint8
{
	MOVE_None                                = 0,
	MOVE_Walking                             = 1,
	MOVE_Falling                             = 2,
	MOVE_Climbing                            = 3,
	MOVE_MAX                                 = 4,
};

// Enum DFMAbility.EBionicSpyCastResult
// NumValues: 0x0007
enum class EBionicSpyCastResult : uint8
{
	Success                                  = 0,
	NoTarget                                 = 1,
	TargetDead                               = 2,
	TargetEscaped                            = 3,
	OtherError                               = 4,
	Discovered                               = 5,
	EBionicSpyCastResult_MAX                 = 6,
};

// Enum DFMAbility.ETouchWaterSurfaceEvent
// NumValues: 0x0004
enum class ETouchWaterSurfaceEvent : uint8
{
	None                                     = 0,
	EnterWaterSurface                        = 1,
	LeaveWaterSurface                        = 2,
	ETouchWaterSurfaceEvent_MAX              = 3,
};

// Enum DFMAbility.EWaterState
// NumValues: 0x0004
enum class EWaterState : uint8
{
	OnGround                                 = 0,
	UnderWater                               = 1,
	AboveWater                               = 2,
	EWaterState_MAX                          = 3,
};

// Enum DFMAbility.EWaterEffectTriggerType
// NumValues: 0x0006
enum class EWaterEffectTriggerType : uint8
{
	None                                     = 0,
	EnterWaterSurface                        = 1,
	LeaveWaterSurface                        = 2,
	UnderWater                               = 3,
	AboveWater                               = 4,
	Max                                      = 5,
};

// Enum DFMAbility.EArtilleryShellDropMethod
// NumValues: 0x0003
enum class EArtilleryShellDropMethod : uint8
{
	RANDOM                                   = 0,
	ORDER                                    = 1,
	EArtilleryShellDropMethod_MAX            = 2,
};

// Enum DFMAbility.EChainHookCheckEndType
// NumValues: 0x0006
enum class EChainHookCheckEndType : uint8
{
	None                                     = 0,
	ActorLocation                            = 1,
	HitLocation                              = 2,
	ClientBindLocation                       = 3,
	PawnViewLocation                         = 4,
	EChainHookCheckEndType_MAX               = 5,
};

// Enum DFMAbility.EChainHookCheckStartType
// NumValues: 0x0006
enum class EChainHookCheckStartType : uint8
{
	None                                     = 0,
	ActorLocation                            = 1,
	PawnViewLocation                         = 2,
	GrenadeStartLocation                     = 3,
	WeaponSocket                             = 4,
	EChainHookCheckStartType_MAX             = 5,
};

// Enum DFMAbility.EBattleFieldPropType
// NumValues: 0x000B
enum class EBattleFieldPropType : uint8
{
	None                                     = 0,
	ADS                                      = 1,
	RebornFlag                               = 2,
	Bunker                                   = 3,
	MedicalBox                               = 4,
	AmmoBox                                  = 5,
	AntiTankMine                             = 6,
	ClayMoreMine                             = 7,
	FlameThrowerArea                         = 8,
	ElectricShock                            = 9,
	EBattleFieldPropType_MAX                 = 10,
};

// Enum DFMAbility.EAbilityDetectorTriggerType
// NumValues: 0x0005
enum class EAbilityDetectorTriggerType : uint8
{
	None                                     = 0,
	Recycle                                  = 1,
	ManualActive                             = 2,
	Both                                     = 3,
	EAbilityDetectorTriggerType_MAX          = 4,
};

// Enum DFMAbility.EDiffuseAreaCellCheckState
// NumValues: 0x0005
enum class EDiffuseAreaCellCheckState : uint8
{
	Default                                  = 0,
	PassTrace                                = 1,
	Failed                                   = 2,
	Success                                  = 3,
	EDiffuseAreaCellCheckState_MAX           = 4,
};

// Enum DFMAbility.EDiffuseAreaCellDiffuseType
// NumValues: 0x0006
enum class EDiffuseAreaCellDiffuseType : uint8
{
	Default                                  = 0,
	X                                        = 1,
	Nx                                       = 2,
	Y                                        = 3,
	Ny                                       = 4,
	EDiffuseAreaCellDiffuseType_MAX          = 5,
};

// Enum DFMAbility.EDiffuseAreaType
// NumValues: 0x0004
enum class EDiffuseAreaType : uint8
{
	None                                     = 0,
	Incendiary                               = 1,
	BarbedWire                               = 2,
	EDiffuseAreaType_MAX                     = 3,
};

// Enum DFMAbility.EAbilityLevelActorType
// NumValues: 0x0005
enum class EAbilityLevelActorType : uint8
{
	ENone                                    = 0,
	EADS                                     = 1,
	ERebornFlag                              = 2,
	EBunker                                  = 3,
	EAbilityLevelActorType_MAX               = 4,
};

// Enum DFMAbility.EVehicleBehaviorForbit
// NumValues: 0x0007
enum class EVehicleBehaviorForbit : uint8
{
	None                                     = 0,
	Move                                     = 1,
	Jump                                     = 2,
	Boom                                     = 4,
	TurnRate                                 = 8,
	LookUpTurnRate                           = 16,
	EVehicleBehaviorForbit_MAX               = 17,
};

// Enum DFMAbility.EDFMAbilityCastFailedReason
// NumValues: 0x0009
enum class EDFMAbilityCastFailedReason : uint8
{
	inCooldown                               = 0,
	StateFailed                              = 1,
	Disable                                  = 2,
	Forbit                                   = 3,
	CampNum                                  = 4,
	Score                                    = 5,
	TeamNum                                  = 6,
	Sector                                   = 7,
	EDFMAbilityCastFailedReason_MAX          = 8,
};

// Enum DFMAbility.EAbilitySmokeActorDetectionStage
// NumValues: 0x0004
enum class EAbilitySmokeActorDetectionStage : uint8
{
	DetectionStage_None                      = 0,
	DetectionStage_Course                    = 1,
	DetectionStage_Voxel                     = 2,
	DetectionStage_MAX                       = 3,
};

// Enum DFMAbility.ESmokeWallUASStage
// NumValues: 0x0005
enum class ESmokeWallUASStage : uint8
{
	UASStage_None                            = 0,
	UASStage_Equip                           = 1,
	UASStage_Idle                            = 2,
	UASStage_Fly                             = 3,
	UASStage_MAX                             = 4,
};

// Enum DFMAbility.EVehicleBoss04FireMode
// NumValues: 0x0004
enum class EVehicleBoss04FireMode : uint8
{
	Default                                  = 0,
	MachineGun                               = 1,
	StingerMissile                           = 2,
	EVehicleBoss04FireMode_MAX               = 3,
};

// Enum DFMAbility.EVehicleBoss04WeaponType
// NumValues: 0x0004
enum class EVehicleBoss04WeaponType : uint8
{
	None                                     = 0,
	MachineGun                               = 1,
	StingerMissle                            = 2,
	EVehicleBoss04WeaponType_MAX             = 3,
};

// Enum DFMAbility.EAudioRoleType
// NumValues: 0x0004
enum class EAudioRoleType : uint8
{
	ET_ALL                                   = 0,
	EE_1P                                    = 1,
	EE_3P                                    = 2,
	EAudioRoleType_MAX                       = 3,
};

// Enum DFMAbility.ERopeTriggerType
// NumValues: 0x000D
enum class ERopeTriggerType : uint8
{
	RopeToggle                               = 0,
	RopeStart                                = 1,
	RopeEnd                                  = 2,
	RopeBeginEnd                             = 3,
	RopeNoBeginToEnd                         = 4,
	RopeMove                                 = 5,
	RopeRescue                               = 6,
	RopeClearRescue                          = 7,
	RopeLeaveHanging                         = 8,
	RopeRecordPressMove                      = 9,
	RopeRecordHitMove                        = 10,
	ClearRope                                = 11,
	ERopeTriggerType_MAX                     = 12,
};

// Enum DFMAbility.EAbilitySwithWeaponType
// NumValues: 0x000E
enum class EAbilitySwithWeaponType : uint8
{
	DefaultWeapon                            = 0,
	MainWeapon                               = 1,
	MeleeWeapon                              = 2,
	EmptyHand                                = 3,
	LastUsedWeapon                           = 4,
	NextWeapon                               = 5,
	PreWeapon                                = 6,
	PositionWeapon                           = 7,
	AnyWeapon                                = 8,
	LastThenAnyUsedWeapon                    = 9,
	LastUsedWeaponOrEmpty                    = 10,
	SkillWeapon                              = 11,
	SkillEnd                                 = 12,
	EAbilitySwithWeaponType_MAX              = 13,
};

// Enum DFMAbility.ERebornFlagType
// NumValues: 0x0004
enum class ERebornFlagType : uint8
{
	EAbility                                 = 0,
	EVehicle                                 = 1,
	ERankSkill                               = 2,
	ERebornFlagType_MAX                      = 3,
};

// Enum DFMAbility.ESpiderAttackMode
// NumValues: 0x0003
enum class ESpiderAttackMode : uint8
{
	SpiderAttackMode_Projectile              = 0,
	SpiderAttackMode_Explode                 = 1,
	SpiderAttackMode_MAX                     = 2,
};

// Enum DFMAbility.ESpiderState
// NumValues: 0x0008
enum class ESpiderState : uint8
{
	SpiderState_Sleep                        = 0,
	SpiderState_Awake                        = 1,
	SpiderState_Detect                       = 2,
	SpiderState_Follow                       = 3,
	SpiderState_ReadyAttack                  = 4,
	SpiderState_Attack                       = 5,
	SpiderState_ReadyDestroyed               = 6,
	SpiderState_Max                          = 7,
};

// Enum DFMAbility.ESpiderControlMode
// NumValues: 0x0004
enum class ESpiderControlMode : uint8
{
	None                                     = 0,
	Server                                   = 1,
	ClientSimulate                           = 2,
	ESpiderControlMode_MAX                   = 3,
};

// Enum DFMAbility.FThreatDetectionCheckResult
// NumValues: 0x0004
enum class EFThreatDetectionCheckResult : uint8
{
	BaseCheckFailed                          = 0,
	BlockCheckFailed                         = 1,
	Pass                                     = 2,
	FThreatDetectionCheckResult_MAX          = 3,
};

// Enum DFMAbility.EThrowBlockingPartState
// NumValues: 0x0006
enum class EThrowBlockingPartState : uint8
{
	Initial                                  = 0,
	Spawn                                    = 1,
	Normal                                   = 2,
	Damaged                                  = 3,
	Destroyed                                = 4,
	EThrowBlockingPartState_MAX              = 5,
};

// Enum DFMAbility.EThrowBlockingExpansionType
// NumValues: 0x0004
enum class EThrowBlockingExpansionType : uint8
{
	FullyExpanded                            = 0,
	OnGround                                 = 1,
	OnWall                                   = 2,
	EThrowBlockingExpansionType_MAX          = 3,
};

// ScriptStruct DFMAbility.WayPointConstraint
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FWayPointConstraint final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWayPointConstraint;

// ScriptStruct DFMAbility.BreakthroughEventRange
// 0x0008 (0x0008 - 0x0000)
struct FBreakthroughEventRange final
{
public:
	int32                                         Max;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Min;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBreakthroughEventRange;

// ScriptStruct DFMAbility.AbilityDataBase
// 0x0010 (0x0010 - 0x0000)
struct FAbilityDataBase : public FAbilityFragment
{
public:
	int32                                         skillEntityIndex;                                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LogicID;                                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UQA_AbilityLogicTask>    QA;                                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAbilityDataBase;

// ScriptStruct DFMAbility.AbilityTimerHandle
// 0x0008 (0x0018 - 0x0010)
struct FAbilityTimerHandle final : public FAbilityDataBase
{
public:
	struct FTimerHandle                           TimerHandle;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAbilityTimerHandle;

// ScriptStruct DFMAbility.PathSegmentConstraint
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FPathSegmentConstraint final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPathSegmentConstraint;

// ScriptStruct DFMAbility.DFMAbilityArrowData
// 0x0030 (0x0030 - 0x0000)
struct FDFMAbilityArrowData final
{
public:
	EDFMGamePlayMode                              GameMode;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckRadius;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CheckRadiusInWater;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         AttackValueId;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         AttackValueIdInWater;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         BarbedWireAttackValueId;                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBarbedWireAttackHitSelf;                          // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MakeDamageInterval;                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMAbilityArrowData;

// ScriptStruct DFMAbility.BendingConstraint
// 0x0014 (0x0014 - 0x0000)
struct alignas(0x04) FBendingConstraint final
{
public:
	uint8                                         Pad_0[0x14];                                       // 0x0000(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBendingConstraint;

// ScriptStruct DFMAbility.LevelAbilityActorInfo
// 0x0018 (0x0018 - 0x0000)
struct FLevelAbilityActorInfo final
{
public:
	uint64                                        ID;                                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CampId;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamID;                                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HP;                                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomValue;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLevelAbilityActorInfo;

// ScriptStruct DFMAbility.AbilityProjectileActorData
// 0x0048 (0x0048 - 0x0000)
struct FAbilityProjectileActorData final
{
public:
	TSubclassOf<class UObject>                    ProjectileActorClass;                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ProjectileActorClassSoftPath;                      // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x4];                                       // 0x0030(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartPosistion;                                    // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  Target;                                            // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAbilityProjectileActorData;

// ScriptStruct DFMAbility.DistanceConstraint
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FDistanceConstraint final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDistanceConstraint;

// ScriptStruct DFMAbility.AttachRopeNode
// 0x004C (0x004C - 0x0000)
struct FAttachRopeNode final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PreviousPosition;                                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PredictedPosition;                                 // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mass;                                              // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InverseMass;                                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InverseDistanceContraintMass;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ExternalForce;                                     // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFixed;                                          // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAttachRopeNode;

// ScriptStruct DFMAbility.VehicleBoss04SkillState
// 0x0010 (0x0010 - 0x0000)
struct FVehicleBoss04SkillState final
{
public:
	EVehicleBoss04FireMode                        FireMode;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FireDelta;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreTime;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostTime;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVehicleBoss04SkillState;

// ScriptStruct DFMAbility.AttachRopeConfig
// 0x0020 (0x0020 - 0x0000)
struct FAttachRopeConfig final
{
public:
	bool                                          bEnablePhysics;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSegments;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RopeLegth;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSides;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SolverIterations;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SegmentStiffness;                                  // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WayPointStiffness;                                 // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SegmentMaxScale;                                   // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAttachRopeConfig;

// ScriptStruct DFMAbility.AbilityTaskRepData
// 0x0040 (0x0040 - 0x0000)
struct FAbilityTaskRepData final
{
public:
	class FString                                 ClassPath;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TaskName;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 BaseData;                                          // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ParamData;                                         // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAbilityTaskRepData;

// ScriptStruct DFMAbility.SpySwitchMapData
// 0x0008 (0x0008 - 0x0000)
struct FSpySwitchMapData final
{
public:
	int32                                         MapID;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSpySwitchMapData;

// ScriptStruct DFMAbility.EnemyPlayerInfo
// 0x0010 (0x0010 - 0x0000)
struct FEnemyPlayerInfo final
{
public:
	class ADFMCharacter*                          PlayerCharacter;                                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEnemyPlayerInfo;

// ScriptStruct DFMAbility.BionicBirdAnimInstanceProxy
// 0x0020 (0x07C0 - 0x07A0)
struct FBionicBirdAnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	struct FVector                                Velocity;                                          // 0x0798(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MoveInput;                                         // 0x07A4(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pitch;                                             // 0x07B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Roll;                                              // 0x07B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBionicBirdAnimInstanceProxy;

// ScriptStruct DFMAbility.CallAIConfigElem
// 0x0068 (0x0068 - 0x0000)
struct FCallAIConfigElem final
{
public:
	TSoftObjectPtr<class UDataTable>              NpcTemplateTable;                                  // 0x0000(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NpcName;                                           // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountPerEnemy;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountPerEnemyTeam;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxCount;                                          // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinCount;                                          // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UEnvQuery>               SpawnPositionEnvQuery;                             // 0x0040(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCallAIConfigElem;

// ScriptStruct DFMAbility.AISpawnInfo
// 0x00F8 (0x00F8 - 0x0000)
struct FAISpawnInfo final
{
public:
	struct FCallAIConfigElem                      Config;                                            // 0x0000(0x0068)(NativeAccessSpecifierPublic)
	class UEnvQuery*                              SpawnPositionEnvQuery;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAINpcSelector                         NpcSelector;                                       // 0x0070(0x0088)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAISpawnInfo;

// ScriptStruct DFMAbility.AbilityProjectilData
// 0x0028 (0x0028 - 0x0000)
struct FAbilityProjectilData final
{
public:
	int32                                         UpdateCount;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                pos;                                               // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rot;                                               // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAbilityProjectilData;

// ScriptStruct DFMAbility.SpiderRepMovement
// 0x0040 (0x0040 - 0x0000)
struct FSpiderRepMovement final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CurrentNormal;                                     // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpiderMoveMode                               MoveMode;                                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BounceTimes;                                       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseBaseMove;                                       // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    MovementBase;                                      // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalLocation;                                     // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpiderRepMovement;

// ScriptStruct DFMAbility.CallAIConfig
// 0x0010 (0x0010 - 0x0000)
struct FCallAIConfig final
{
public:
	TArray<struct FCallAIConfigElem>              CallAIList;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCallAIConfig;

// ScriptStruct DFMAbility.AbilityMineAnimInstanceProxy
// 0x0010 (0x07B0 - 0x07A0)
struct FAbilityMineAnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	class ADFMAbilitySuppressionMine*             SuppressionMine;                                   // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsActivate;                                       // 0x07A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsExplode;                                        // 0x07A1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A2[0xE];                                      // 0x07A2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAbilityMineAnimInstanceProxy;

// ScriptStruct DFMAbility.WaterEffectBroadcastMsg
// 0x0008 (0x0008 - 0x0000)
struct FWaterEffectBroadcastMsg final
{
public:
	EWaterState                                   WaterState;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWaterState                                   NewWaterState;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastWaterHeight;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWaterEffectBroadcastMsg;

// ScriptStruct DFMAbility.WaterEffectFX
// 0x0048 (0x0048 - 0x0000)
struct FWaterEffectFX final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        AttachComponent;                                   // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXResourceContainerComponent*          FXComp;                                            // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADFMWaterRippleEffect*                  RippleEffect;                                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMInteractiveWaterComponent*          InteractiveWaterComponent;                         // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWaterEffectFX;

// ScriptStruct DFMAbility.ProjectileExplodeInfo
// 0x0018 (0x0018 - 0x0000)
struct FProjectileExplodeInfo final
{
public:
	struct FVector                                HitProjectilePosition;                             // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ProjectileName;                                    // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasProcessed;                                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProjectileExplodeInfo;

// ScriptStruct DFMAbility.ArtilleryShellHitFXSurfaceAttribute
// 0x0020 (0x0020 - 0x0000)
struct FArtilleryShellHitFXSurfaceAttribute final
{
public:
	TArray<EPhysicalSurface>                      SurfaceTypes;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           HitEffectIds;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArtilleryShellHitFXSurfaceAttribute;

// ScriptStruct DFMAbility.ArtilleryShellMovementParameter
// 0x0048 (0x0048 - 0x0000)
struct FArtilleryShellMovementParameter final
{
public:
	int32                                         SkillId;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Destination;                                       // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Accelerate;                                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FireTime;                                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPCharacter*                           MakerInstigator;                                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CampId;                                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RebasedDestination;                                // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArtilleryShellMovementParameter;

// ScriptStruct DFMAbility.BionicBirdMarkingJoint
// 0x0010 (0x0010 - 0x0000)
struct FBionicBirdMarkingJoint final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentIndex;                                       // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         size;                                              // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBionicBirdMarkingJoint;

// ScriptStruct DFMAbility.BionicBirdMarkingAnimInstanceProxy
// 0x0030 (0x07D0 - 0x07A0)
struct FBionicBirdMarkingAnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	struct FPoseSnapshot                          TargetCharacterSnapshot;                           // 0x0798(0x0038)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBionicBirdMarkingAnimInstanceProxy;

// ScriptStruct DFMAbility.BuffForbiddenData
// 0x0038 (0x0038 - 0x0000)
struct FBuffForbiddenData final
{
public:
	TArray<ECharacterStateMask>                   LockAbility;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EFSMForbidReason                              LockReason;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCancelWeaponOperate;                              // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponCancelCurrentStateReason               CancelReason;                                      // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopLooting;                                      // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopUseItem;                                      // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopRescue;                                       // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrowdControl;                                     // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKnockBackAI;                                      // 0x0017(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBreakCurrentSkill;                                // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBreakFirefighting;                                // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBreakClimbLadder;                                 // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBreakSlide;                                       // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBreakInteracting;                                 // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 MakerActor;                                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPCharacter*                           Target;                                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBuffForbiddenData;

// ScriptStruct DFMAbility.C203MarkData
// 0x0038 (0x0038 - 0x0000)
struct FC203MarkData final
{
public:
	TArray<EBuffGameRole>                         AllGameRoles;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         MapMarkEnemyTime;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CheckCD;                                           // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MarkTargetCD;                                      // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle;                                          // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxNotRenderTime;                                  // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckSilenceZone;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckBlock;                                       // 0x0029(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoubleSidedCheck;                                 // 0x002A(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             BlockCheckChannel;                                 // 0x002B(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUesC203Mark;                                      // 0x002C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMarkLockCountDown;                             // 0x002D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MarkLockCountDownCheckCD;                          // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseMarkBuffID;                                    // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FC203MarkData;

// ScriptStruct DFMAbility.ChainHookAnimInstanceProxy
// 0x0000 (0x07A0 - 0x07A0)
struct FChainHookAnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	bool                                          bIsShowHook;                                       // 0x0798(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChainHookAnimInstanceProxy;

// ScriptStruct DFMAbility.ChainHookBendCheckData
// 0x0002 (0x0002 - 0x0000)
struct FChainHookBendCheckData final
{
public:
	EChainHookCheckStartType                      StartType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChainHookCheckEndType                        EndType;                                           // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChainHookBendCheckData;

// ScriptStruct DFMAbility.ChainHookRoleData
// 0x0020 (0x0020 - 0x0000)
struct FChainHookRoleData final
{
public:
	TArray<EBuffGameRole>                         AllGameRoles;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         PullBackDelayBuffID;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PullBackDelay;                                     // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitOtherPullBackDelay;                             // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitBoxMaxHP;                                       // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChainHookRoleData;

// ScriptStruct DFMAbility.MultiBendPointsData
// 0x0018 (0x0018 - 0x0000)
struct FMultiBendPointsData final
{
public:
	bool                                          bIsCutOff;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        KeyPoints;                                         // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMultiBendPointsData;

// ScriptStruct DFMAbility.ChainHookItemAnimInstanceProxy
// 0x0030 (0x07D0 - 0x07A0)
struct FChainHookItemAnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	EChainHookState                               HookState;                                         // 0x0798(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartLocation;                                     // 0x079C(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HookLocation;                                      // 0x07A8(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBend;                                           // 0x07B4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B5[0x3];                                      // 0x07B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BendLocation;                                      // 0x07B8(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C4[0xC];                                      // 0x07C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChainHookItemAnimInstanceProxy;

// ScriptStruct DFMAbility.AbilityBarbedWireAreaData
// 0x0028 (0x0028 - 0x0000)
struct FAbilityBarbedWireAreaData final
{
public:
	TArray<EBuffGameRole>                         AllGameRoles;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         MaxCount;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftTime;                                          // 0x0014(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CenterHP;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDestroyCellNum;                                 // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDestroyRadialDamage;                            // 0x0020(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAbilityBarbedWireAreaData;

// ScriptStruct DFMAbility.DFMAbilityBarbedWireTarget
// 0x0018 (0x0018 - 0x0000)
struct FDFMAbilityBarbedWireTarget final
{
public:
	bool                                          bIsNeedCheck;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
