#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMAudio

#include "Basic.hpp"

#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "GPAudioRuntime_classes.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "DFMAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "GPResource_structs.hpp"
#include "GPWeaponDefineForPlugin_structs.hpp"
#include "GPWeaponRuntime_classes.hpp"


namespace SDK
{

// Class DFMAudio.AnimNotify_CharacterVoice
// 0x0018 (0x0050 - 0x0038)
class UAnimNotify_CharacterVoice : public UAnimNotify
{
public:
	class FString                                 CharacterVoiceTypeString;                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoopStopEvent;                                  // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_CharacterVoice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_CharacterVoice")
	}
	static class UAnimNotify_CharacterVoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_CharacterVoice>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_CharacterVoice;

// Class DFMAudio.AnimNotify_FootStepAudio
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_FootStepAudio final : public UAnimNotify_GPAudioBase
{
public:
	static void InnerProcessFPPFootstep(class UAnimSequenceBase* Animation, class ADFMCharacter* DFMCharacter, class UPhysicalMaterial* BindPhysMat, class UPhysicalMaterialAudioDataAsset* BindConfig, EGPAudioFootSoundType AudioType, bool bIsTPPNotify); // (Final, Native, Static, Protected, Const) // @ 0x14607BBF0
	static void InnerProcessSimulatedCharacterFootstep(class UAnimSequenceBase* Animation, class ADFMCharacter* DFMCharacter, class UPhysicalMaterial* BindPhysMat, class UPhysicalMaterialAudioDataAsset* BindConfig, EGPAudioFootSoundType AudioType); // (Final, Native, Static, Protected, Const) // @ 0x14607BDA0
	static void InnerProcessTPPFootstep(class UAnimSequenceBase* Animation, class ADFMCharacter* DFMCharacter, class UPhysicalMaterial* BindPhysMat, class UPhysicalMaterialAudioDataAsset* BindConfig, EGPAudioFootSoundType AudioType, bool bIsTPPNotify); // (Final, Native, Static, Protected, Const) // @ 0x14607BF10
	static void ReceivedNotifyFunc(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, class UPhysicalMaterial* BindPhysMat, class UPhysicalMaterialAudioDataAsset* BindConfig, EGPAudioFootSoundType AudioType); // (Final, Native, Static, Public, BlueprintCallable, Const) // @ 0x14607CFD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_FootStepAudio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_FootStepAudio")
	}
	static class UAnimNotify_FootStepAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_FootStepAudio>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_FootStepAudio;

// Class DFMAudio.AnimNotify_FPPFootStepAudio
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_FPPFootStepAudio : public UAnimNotify
{
public:
	bool                                          bIsLeftFootstep;                                   // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_FPPFootStepAudio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_FPPFootStepAudio")
	}
	static class UAnimNotify_FPPFootStepAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_FPPFootStepAudio>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_FPPFootStepAudio;

// Class DFMAudio.AnimNotify_GPAudioEvent
// 0x0060 (0x00A0 - 0x0040)
class UAnimNotify_GPAudioEvent : public UAnimNotify_GPAudioBase
{
public:
	bool                                          bTriggerSoundVisualization;                        // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESoundVisualizationType                       SoundVisualizationType;                            // 0x0041(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLogicPlayAudio;                                   // 0x0042(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UGPAudioEventAsset*>  AvatarEvents;                                      // 0x0048(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bProcessNoOwnerNotify;                             // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UGPAudioEventAsset* GetAvatarAudioEvent(class USkeletalMeshComponent* MeshComp, class UGPAudioEventAsset* AudioEvent) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14607B780
	class UGPAudioEventAsset* GetAvatarAudioEventByCharacter(class AGPCharacter* CHARACTER) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14607B840
	void ProcessNoOwnerEvent(class USkeletalMeshComponent* MeshComp, class UGPAudioEventAsset* AudioEventAsset, EGPAudioBlueprintType AudioType) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x14607CAD0
	void ReceivedGPAudioEventNotifyFunc(class USkeletalMeshComponent* MeshComp, class UGPAudioEventAsset* AudioEvent, bool bFollow, EGPAudioBlueprintType AudioType, class FName NotifyName, bool bOnlyFPP, bool bOnlyTPP, const struct FGPAudioEventAdditionalFunction& AddFunc, const class FString& AttachName) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x14607CC90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_GPAudioEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_GPAudioEvent")
	}
	static class UAnimNotify_GPAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_GPAudioEvent>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_GPAudioEvent;

// Class DFMAudio.AnimNotify_GPAudioEvent2D
// 0x0050 (0x0088 - 0x0038)
class UAnimNotify_GPAudioEvent2D final : public UAnimNotify
{
public:
	TMap<class FName, class UGPAudioEventAsset*>  AvatarEvents;                                      // 0x0038(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	class UGPAudioEventAsset* GetAvatarAudioEvent(class USkeletalMeshComponent* MeshComp, class UGPAudioEventAsset* AudioEvent) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14607B6C0
	void ReceivedGPAudioEventNotifyFunc(class USkeletalMeshComponent* MeshComp, class UGPAudioEventAsset* AudioEvent) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x14607CBD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_GPAudioEvent2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_GPAudioEvent2D")
	}
	static class UAnimNotify_GPAudioEvent2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_GPAudioEvent2D>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_GPAudioEvent2D;

// Class DFMAudio.AnimNotifyState_DFMAudioEvent
// 0x00D0 (0x0108 - 0x0038)
class UAnimNotifyState_DFMAudioEvent final : public UAnimNotifyState_AudioEventBase
{
public:
	TMap<class FName, struct FDFMAudioEventData>  AvatarEvents;                                      // 0x0038(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bStopOnlyStateInterrupt;                           // 0x0088(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConfigWithName;                                   // 0x0089(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     BeginAudioEvent;                                   // 0x0090(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BeginAudioName;                                    // 0x0098(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPAudioBlueprintType                         BeginAudioType;                                    // 0x00A0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bStopAudioOnSeqExit;                               // 0x00A8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     EndAudioEvent;                                     // 0x00B0(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndAudioName;                                      // 0x00B8(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPAudioBlueprintType                         EndAudioType;                                      // 0x00C0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyFPP;                                          // 0x00C1(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyTPP;                                          // 0x00C2(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AttachSocketName;                                  // 0x00C8(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedFollow;                                       // 0x00D8(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bVO_FPP;                                           // 0x00E0(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVO_TPP;                                           // 0x00E1(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VO_String;                                         // 0x00E8(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VO_StopString;                                     // 0x00F8(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UGPAudioEventAsset* GetAvatarCharacterEndAudioEvent(class AGPCharacter* GPOwner) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x14607B8D0
	class UGPAudioEventAsset* GetAvatarCharacterStartAudioEvent(class AGPCharacter* GPOwner) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x14607B960
	class UGPAudioEventAsset* GetAvatarEndAudioEvent(class USkeletalMeshComponent* MeshComp, class UGPAudioEventAsset* AudioEvent) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x14607B9F0
	class UGPAudioEventAsset* GetAvatarStartAudioEvent(class USkeletalMeshComponent* MeshComp, class UGPAudioEventAsset* AudioEvent) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x14607BAB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_DFMAudioEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_DFMAudioEvent")
	}
	static class UAnimNotifyState_DFMAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_DFMAudioEvent>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_DFMAudioEvent;

// Class DFMAudio.AnimNotifyState_SlideAudio
// 0x0000 (0x0030 - 0x0030)
class UAnimNotifyState_SlideAudio final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_SlideAudio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_SlideAudio")
	}
	static class UAnimNotifyState_SlideAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SlideAudio>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_SlideAudio;

// Class DFMAudio.BulletSoundActor
// 0x0088 (0x03F8 - 0x0370)
class ABulletSoundActor final : public AActor
{
public:
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     InFlybyAudioEvent;                                 // 0x0380(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGPAudioEventAsset*                     OutFlybyAudioEvent;                                // 0x0388(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PlayInEventSeconds;                                // 0x0390(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PlayOutEventSeconds;                               // 0x0394(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         KillSeconds;                                       // 0x0398(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                SpeedPerSecond;                                    // 0x039C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTravelerGameAk*                        TravelerAk;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B0[0x48];                                     // 0x03B0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BulletSoundActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BulletSoundActor")
	}
	static class ABulletSoundActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletSoundActor>();
	}
};
DUMPER7_ASSERTS_ABulletSoundActor;

// Class DFMAudio.DFAudioTrackHelper
// 0x0008 (0x0038 - 0x0030)
class UDFAudioTrackHelper final : public UEngineSubsystem
{
public:
	class UDataTable*                             UIAudioDataAsset;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFAudioTrackHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFAudioTrackHelper")
	}
	static class UDFAudioTrackHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFAudioTrackHelper>();
	}
};
DUMPER7_ASSERTS_UDFAudioTrackHelper;

// Class DFMAudio.DFMAudioComponent
// 0x0000 (0x00F8 - 0x00F8)
class UDFMAudioComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAudioComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAudioComponent")
	}
	static class UDFMAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAudioComponent>();
	}
};
DUMPER7_ASSERTS_UDFMAudioComponent;

// Class DFMAudio.DFMAudioComponentBase
// 0x0000 (0x00F8 - 0x00F8)
class UDFMAudioComponentBase final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAudioComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAudioComponentBase")
	}
	static class UDFMAudioComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAudioComponentBase>();
	}
};
DUMPER7_ASSERTS_UDFMAudioComponentBase;

// Class DFMAudio.AudioFootStepAnimProxyDataTableManager
// 0x0010 (0x0040 - 0x0030)
class UAudioFootStepAnimProxyDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioFootStepAnimProxyDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioFootStepAnimProxyDataTableManager")
	}
	static class UAudioFootStepAnimProxyDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioFootStepAnimProxyDataTableManager>();
	}
};
DUMPER7_ASSERTS_UAudioFootStepAnimProxyDataTableManager;

// Class DFMAudio.DFMAudioGMStatic
// 0x0000 (0x0028 - 0x0028)
class UDFMAudioGMStatic final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAudioGMStatic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAudioGMStatic")
	}
	static class UDFMAudioGMStatic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAudioGMStatic>();
	}
};
DUMPER7_ASSERTS_UDFMAudioGMStatic;

// Class DFMAudio.DFMAudioLevelSettingDataTableManager
// 0x0008 (0x0038 - 0x0030)
class UDFMAudioLevelSettingDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAudioLevelSettingDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAudioLevelSettingDataTableManager")
	}
	static class UDFMAudioLevelSettingDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAudioLevelSettingDataTableManager>();
	}
};
DUMPER7_ASSERTS_UDFMAudioLevelSettingDataTableManager;

// Class DFMAudio.DFMSceneAudioLevelSettingManager
// 0x0008 (0x0038 - 0x0030)
class UDFMSceneAudioLevelSettingManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMSceneAudioLevelSettingManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMSceneAudioLevelSettingManager")
	}
	static class UDFMSceneAudioLevelSettingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMSceneAudioLevelSettingManager>();
	}
};
DUMPER7_ASSERTS_UDFMSceneAudioLevelSettingManager;

// Class DFMAudio.DFMAudioMastering
// 0x0000 (0x0028 - 0x0028)
class UDFMAudioMastering final : public UBlueprintFunctionLibrary
{
public:
	static bool SetMobileHeadphones(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14607D140
	static bool SetMobileMobileSpeakers(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14607D170
	static bool SetPCHeadphones(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14607D1A0
	static bool SetPCHomeCinema(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14607D1D0
	static bool SetPCNightMode(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14607D200

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAudioMastering")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAudioMastering")
	}
	static class UDFMAudioMastering* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAudioMastering>();
	}
};
DUMPER7_ASSERTS_UDFMAudioMastering;

// Class DFMAudio.DFMAudioSubsystem
// 0x0000 (0x0030 - 0x0030)
class UDFMAudioSubsystem final : public UGPAudioSubsystem
{
public:
	static class UDFMAudioSubsystem* GetDFMAudioSubsystem(class UObject* WorldContext); // (Final, Native, Static, Public) // @ 0x14607BB70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAudioSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAudioSubsystem")
	}
	static class UDFMAudioSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAudioSubsystem>();
	}
};
DUMPER7_ASSERTS_UDFMAudioSubsystem;

// Class DFMAudio.DFMBuffPlayUIAudio
// 0x0008 (0x00F0 - 0x00E8)
class UDFMBuffPlayUIAudio final : public UGPEffectCueHandler
{
public:
	class FName                                   EnterAudioName;                                    // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMBuffPlayUIAudio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMBuffPlayUIAudio")
	}
	static class UDFMBuffPlayUIAudio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMBuffPlayUIAudio>();
	}
};
DUMPER7_ASSERTS_UDFMBuffPlayUIAudio;

// Class DFMAudio.DFMCharacterAudioComponent
// 0x0168 (0x0260 - 0x00F8)
class UDFMCharacterAudioComponent final : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 PlayTypeRTPC;                                      // 0x0100(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 CameraModeRTPC;                                    // 0x0128(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ADSRTPC;                                           // 0x0150(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     BornAudioEvent;                                    // 0x0178(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FoliageOverlapCD;                                  // 0x0180(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGPAudioEventAsset*>             PreLoadEvents;                                     // 0x0188(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_198[0x50];                                     // 0x0198(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGPAudioEventAsset*>             FootstepAudioAssetCache;                           // 0x01E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x10];                                     // 0x01F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGPWeaponInterface>    LastFireWeapon;                                    // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_218[0x48];                                     // 0x0218(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void ChangeUnderWaterMasking(bool bUnderWater, bool bNeedCheckAlive, const class AGPCharacter* FocusedCharacter); // (Final, Native, Static, Public) // @ 0x14607B5C0

	void OnCharacterDead(class AGPCharacterBase* CHARACTER, class AController* Killer, const class UDamageType* DamageType); // (Final, Native, Public) // @ 0x14607C0C0
	void OnCharacterPVSVisibilityChanged(bool bNewVisibility); // (Final, Native, Public) // @ 0x14607C1C0
	void OnCharacterReborn(); // (Final, Native, Public) // @ 0x14607C250
	void OnFootstepEventsLoadedFinished(const TArray<struct FSoftObjectPath>& ObjectPaths); // (Final, Native, Public) // @ 0x14607C270
	void OnLocalCharacterPlayUIAudio(const class FName& AudioName); // (Final, Native, Public, HasOutParams) // @ 0x14607C480
	void OnLocalCharacterStopUIAudio(const class FName& AudioName); // (Final, Native, Public, HasOutParams) // @ 0x14607C510
	void OnLocalPlayerPawnChanged(class AActor* OldCharacter, class AActor* NewCharacter); // (Final, Native, Public) // @ 0x14607C5A0
	void OnPickupAmmoSucc(int32 AmmoNum); // (Final, Native, Public) // @ 0x14607C7B0
	void OnUnderWaterStateChanged(bool bUnderWater); // (Final, Native, Public) // @ 0x14607C9B0
	void OnXPPChange(bool bNewFPP); // (Final, Native, Public) // @ 0x14607CA40
	void SetSameCamp_AI(); // (Final, Native, Public, BlueprintCallable) // @ 0x14607D230
	void UpdateUnderWaterMaskingByOnwer(); // (Final, Native, Public) // @ 0x14607D340

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMCharacterAudioComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMCharacterAudioComponent")
	}
	static class UDFMCharacterAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMCharacterAudioComponent>();
	}
};
DUMPER7_ASSERTS_UDFMCharacterAudioComponent;

// Class DFMAudio.DFMControllerAudioComponent
// 0x01C8 (0x0428 - 0x0260)
class UDFMControllerAudioComponent final : public UGPControllerAudioComponent
{
public:
	uint8                                         Pad_260[0xA8];                                     // 0x0260(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AIntCharacter*, struct FPVSAudioActorInfo> ServerPVSActorInfo;                        // 0x0308(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<uint64, struct FPVSAudioActorInfo>       ClientPVSActorInfo;                                // 0x0358(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EStateAudioEventType, struct FCharacterStateAudioEventConfig> StateAudioEventConfigMap;     // 0x03B8(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerStateGroupName;                              // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AsyncLoadAssetDataFinished(const TArray<struct FSoftObjectPath>& OutPaths, const struct FGPClippedWeaponFakeEventNeededInfo& FakeEventInfo); // (Final, Native, Public) // @ 0x14607B3A0
	void OnGamePlayModeChanged(EDFMGamePlayMode NewGamePlayMode); // (Final, Native, Public) // @ 0x14607C400
	void OnLocalPlayerPawnChanged(class AActor* OldCharacter, class AActor* NewCharacter); // (Final, Native, Public) // @ 0x14607C660
	void OnMatchOver(const EMatchOverReason& MatchOverReason); // (Final, Native, Public, HasOutParams) // @ 0x14607C720
	void OnStartLocalFocus(class AActor* TargetActor); // (Final, Native, Public) // @ 0x14607C830
	void OnStateAudioTypeChanged(EStateAudioEventType InType); // (Final, Native, Public) // @ 0x14607C8B0
	void OnStopLocalFocus(class AActor* TargetActor); // (Final, Native, Public) // @ 0x14607C930
	void UpdateClientPVSActorInfo(uint64 CharacterUin, const struct FPVSAudioActorInfo& PVSAudioActorInfo); // (Net, Native, Event, Protected, NetClient) // @ 0x14607D250

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMControllerAudioComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMControllerAudioComponent")
	}
	static class UDFMControllerAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMControllerAudioComponent>();
	}
};
DUMPER7_ASSERTS_UDFMControllerAudioComponent;

// Class DFMAudio.DFMFSM_SpecialStateAudioControlAction
// 0x0008 (0x0110 - 0x0108)
class UDFMFSM_SpecialStateAudioControlAction final : public UDFMFSMAction
{
public:
	bool                                          isDeath;                                           // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsImpendingDeath;                                  // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMFSM_SpecialStateAudioControlAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMFSM_SpecialStateAudioControlAction")
	}
	static class UDFMFSM_SpecialStateAudioControlAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMFSM_SpecialStateAudioControlAction>();
	}
};
DUMPER7_ASSERTS_UDFMFSM_SpecialStateAudioControlAction;

// Class DFMAudio.DFMListenerComponent
// 0x00D0 (0x01C8 - 0x00F8)
class UDFMListenerComponent final : public UActorComponent
{
public:
	TArray<struct FWeaponFireAudioEventRecord>    LeftNearAudioWeapon;                               // 0x00F8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    LeftMedAudioWeapon;                                // 0x0108(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    LeftFarAudioWeapon;                                // 0x0118(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    LeftSuperFarAudioWeapon;                           // 0x0128(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    RightNearAudioWeapon;                              // 0x0138(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    RightMedAudioWeapon;                               // 0x0148(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    RightFarAudioWeapon;                               // 0x0158(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    RightSuperFarAudioWeapon;                          // 0x0168(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    MiddleNearAudioWeapon;                             // 0x0178(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    MiddleMedAudioWeapon;                              // 0x0188(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    MiddleFarAudioWeapon;                              // 0x0198(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponFireAudioEventRecord>    MiddleSuperFarAudioWeapon;                         // 0x01A8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class ACHARACTER*                             OwnerCharacter;                                    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           ClearDirtyDataTimerHandle;                         // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMListenerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMListenerComponent")
	}
	static class UDFMListenerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMListenerComponent>();
	}
};
DUMPER7_ASSERTS_UDFMListenerComponent;

// Class DFMAudio.DFMUIAudioPlayer
// 0x0208 (0x0238 - 0x0030)
class UDFMUIAudioPlayer final : public UEngineSubsystem
{
public:
	TMulticastInlineDelegate<void(const class FString& EvtName)> OnUIAudioPlayEnd;                   // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& EvtName)> OnUIAudioBeginPlay;                 // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(EGPEventCallbackType EventCallbackType, int32 PlayingId)> OnGPAudioFinished;      // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0xA0];                                      // 0x0060(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSeekAudioContext>   SeekAudioMap;                                      // 0x0100(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bIsPreloading;                                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        PreloadHandle;                                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EUIAudioPreloadState UIAudioPreloadState)> OnUIAudioPreloadFinished; // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class FString, class UGPAudioEventAsset*> AudioAssetCache;                                  // 0x0170(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UDataTable*                             UIAudioDataAsset;                                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, uint64>                   AudioLoadingMap;                                   // 0x01C8(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_218[0x20];                                     // 0x0218(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFMUIAudioPlayer* Get(const class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1460808A0
	static bool PlayUIAudio(class UObject* WorldContext, const class FString& EvtName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x146081A70
	static bool StopUIAudio(class UObject* WorldContext, const class FString& EvtName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1460824C0

	bool AsyncPlay2DGlobalAudio(TSoftObjectPtr<class UGPAudioEventAsset> AssetSoftPtr, const class FName& EvtName, bool bIsStopEvent, bool bNeedGetPosion); // (Final, Native, Public, HasOutParams) // @ 0x146080220
	bool AsyncPlayUIAudioWithEndCallback(const class FName& EvtName, const TSoftObjectPtr<class UGPAudioEventAsset> AssetSoftPtr); // (Final, Native, Public, HasOutParams) // @ 0x1460805A0
	void CancelLoading(const class FString& InAssetPath); // (Final, Native, Public) // @ 0x146080780
	void ClearLoadingAsset(); // (Final, Native, Public) // @ 0x146080860
	void DumpCachedAudioInfo(); // (Final, Native, Public) // @ 0x146080880
	bool GetIsAssetInit(); // (Final, Native, Public) // @ 0x146080920
	int32 GetUIEventPlayPosition(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146080B40
	void Init(); // (Final, Native, Public, BlueprintCallable) // @ 0x146080BE0
	void InitAudioAsset(); // (Final, Native, Public, BlueprintCallable) // @ 0x146080C00
	void OnAudioPreloadFinished(const TArray<struct FSoftObjectPath>& PreloadedAssets, EUIAudioPreloadState UIAudioPreloadState); // (Final, Native, Private) // @ 0x146080D10
	void OnGPAudioPlayFinishEnd(EGPEventCallbackType EventCallbackType, int32 PlayingId); // (Final, Native, Public) // @ 0x1460810D0
	void OnPlayUIEventByName(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x1460812B0
	void OnSingleAudioPreloadFinished(const struct FSoftObjectPath& AudioPath); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x146081340
	void OnStopUIEventByName(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146081420
	void PauseUIAudio(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x1460814B0
	int32 PlayAudioWithEndCallback(class UGPAudioEventAsset* InAudioAsset); // (Final, Native, Public) // @ 0x146081540
	void PlayIngameMusicByName(const class FString& MusicEventName); // (Final, Native, Public, BlueprintCallable) // @ 0x1460815F0
	void PlayMusicByName(const class FName& MusicEventName); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x146081790
	void PlayUIAudioWithCallback(const struct FSoftObjectPath& AudioSoftPath); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x146081B70
	bool PlayUIAudioWithEndCallback(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146081C50
	bool PlayUIEventByName(const class FName& EvtName, bool bNeedGetPosion); // (Final, Native, Public, HasOutParams) // @ 0x146081CF0
	bool PlayUIEventByNameWrapper(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146081DD0
	void PlayUIEventWithSeek(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146081E70
	void PreloadAssetsByName(const class FName& EvtName); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x146081F00
	void PreloadAudioAssets(EUIAudioPreloadState UIAudioPreloadState); // (Final, Native, Public) // @ 0x146081F90
	void ProcessUIAudioAction(const class FName& EvtName, EGPAudioActionOnEventType InType); // (Final, Native, Public, HasOutParams) // @ 0x146082010
	void ReleaseCachedAudio(); // (Final, Native, Public) // @ 0x1460820E0
	void Reset(); // (Final, Native, Public, BlueprintCallable) // @ 0x146082100
	void ResumeUIAudio(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146082140
	void SeekUIAudioToPercent(const class FName& EvtName, const float Percent); // (Final, Native, Public, HasOutParams) // @ 0x1460822B0
	bool StopUIEventByName(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x1460825C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMUIAudioPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMUIAudioPlayer")
	}
	static class UDFMUIAudioPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMUIAudioPlayer>();
	}
};
DUMPER7_ASSERTS_UDFMUIAudioPlayer;

// Class DFMAudio.DFMusicPlayer
// 0x0160 (0x0190 - 0x0030)
class UDFMusicPlayer final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(const struct FSoftObjectPath& EventPath)> OnMainMusicPlayBegin;    // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UDataTable*                             MusicAudioTable;                                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, class UDFMusicPlayWrapper*> LoadingMusicAsset;                      // 0x0048(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, struct FGPAudioFuturePlayingID> DependenciesMusicPlayingMap;        // 0x0098(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, struct FGPAudioFuturePlayingID> PlayingMusic;                       // 0x00E8(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, class UGPAudioEventAsset*> PlayingMusicAsset;                       // 0x0138(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class AActor*                                 LobbyMusicPlayerActor;                             // 0x0188(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UDFMusicPlayer* GetMusicPlayer(const class UObject* Context); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x146080AC0

	void AsyncPlayMusic(const struct FSoftObjectPath& InAudioAssetPath, const bool bIs3DPlay); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x146080480
	class AActor* GetLobbyMusicPlayerActor(); // (Final, Native, Public) // @ 0x146080950
	float GetMusicDuration(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146080980
	float GetMusicPlayPercent(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146080A20
	void InitAudioAsset(); // (Final, Native, Public, BlueprintCallable) // @ 0x146080C20
	bool IsMusicPlaying(const class FName& EvtName); // (Final, Native, Public, HasOutParams) // @ 0x146080C70
	void OnDependedMusicBeginPlay(const struct FSoftObjectPath& AudioAssetPath, int32 PlayingId); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x146080EF0
	void OnMusicAssetLoadCompleted(const struct FSoftObjectPath& InAudioAssetPath, const bool bIs3DPlay); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x146081190
	void PlayLobbyMusicByName(const class FName InMusicName); // (Final, Native, Public, BlueprintCallable) // @ 0x146081710
	void PlayMusicByName(const class FName InMusicName); // (Final, Native, Public, BlueprintCallable) // @ 0x146081820
	void PlayMusicWithDependencyAsset(const struct FSoftObjectPath& InDependencyMusicAssetPath, const struct FSoftObjectPath& InAudioMusicAssetPath, const bool bIs3DPlay); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x1460818A0
	void Reset(); // (Final, Native, Public, BlueprintCallable) // @ 0x146082120
	bool SeekMusicToPercent(const class FName& EvtName, float InPercent); // (Final, Native, Public, HasOutParams) // @ 0x1460821D0
	void StopAllMusicForce(int32 TransitionMS); // (Final, Native, Public, BlueprintCallable) // @ 0x146082380
	void StopMusicByName(const class FName InMusicName, int32 TransitionMS); // (Final, Native, Public, BlueprintCallable) // @ 0x146082400

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMusicPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMusicPlayer")
	}
	static class UDFMusicPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMusicPlayer>();
	}
};
DUMPER7_ASSERTS_UDFMusicPlayer;

// Class DFMAudio.DFMusicPlayWrapper
// 0x0060 (0x0088 - 0x0028)
class UDFMusicPlayWrapper final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelLoading(); // (Final, Native, Public) // @ 0x146080840
	void OnDependencyAudioBeginPlay(EGPEventCallbackType EventCallbackType, int32 PlayingId); // (Final, Native, Public) // @ 0x146081010
	void UpdateLoadingId(uint64 InLoadingId); // (Final, Native, Public) // @ 0x146082660

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMusicPlayWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMusicPlayWrapper")
	}
	static class UDFMusicPlayWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMusicPlayWrapper>();
	}
};
DUMPER7_ASSERTS_UDFMusicPlayWrapper;

// Class DFMAudio.WeaponFuncComponentAudio
// 0x15F0 (0x1750 - 0x0160)
class UWeaponFuncComponentAudio : public UGPWeaponViewComponentBase
{
public:
	uint8                                         Pad_160[0x10];                                     // 0x0160(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAmmoDataRow                           CurrentAmmoDataRow;                                // 0x0170(0x0158)(NativeAccessSpecifierPublic)
	float                                         BulletFlyDistance;                                 // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x14];                                     // 0x02CC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponControlAudioRow                 WeaponControlAudioData;                            // 0x02E0(0x03E0)(NativeAccessSpecifierPublic)
	uint8                                         Pad_6C0[0x8];                                      // 0x06C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponMainAudioDataRow                AudioData;                                         // 0x06C8(0x08B8)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F80[0xB0];                                     // 0x0F80(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGPWeaponInterface>    LastFireWeapon;                                    // 0x1030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1040[0x90];                                    // 0x1040(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WeaponFireTimerHandle;                             // 0x10D0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           Start3PWeaponLoopFireTimerHandle;                  // 0x10D8(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           End3PWeaponLoopFireTimerHandle;                    // 0x10E0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           Check3PWeaponLoopFireTimerHandle;                  // 0x10E8(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           LoopFireCheckTimerHandle;                          // 0x10F0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           LoopFireCountTimerHandle;                          // 0x10F8(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGPAudioMIDIEventAsset                 MIDIFireEvent;                                     // 0x1100(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	class UGPAudioEventAsset*                     CandidateFireAudio;                                // 0x1140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGPAudioMIDIEventAsset                 FinalMIDIFireEvent3P;                              // 0x1148(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1188[0x8];                                     // 0x1188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGPAudioEventAsset*>             Fire3PLoopWaitToEndArray;                          // 0x1190(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UGPAudioEventAsset*                     CommonFire3PLoopEndEvent;                          // 0x11A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGPAudioMIDIEventAsset                 DefaultFireEvent3P;                                // 0x11A8(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponLoopEventConfigAsset>    LoopAudioEvent;                                    // 0x11E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FWeaponLoopEventConfigAsset>    PostedLoopEvents;                                  // 0x11F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, struct FWeaponAudioPriority> LoadedAudioEventData;                  // 0x1208(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        WeaponControlAudioCache;                           // 0x1258(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<EGPWeaponInnerEvent, struct FWeaponLoopEventConfigAsset> WeaponLoopEventConfig;             // 0x1268(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FWeaponAudioConfigAsset                WeaponAudio;                                       // 0x12B8(0x0010)(NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UDFMCharacterAudioComponent> CharacterAudioComponent;                       // 0x12C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGPAudioCompositeParam                 CompositeParam;                                    // 0x12D0(0x0058)(NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGPAudioAnimationNotifyPlayer> AnimationNotifyPlayer;                       // 0x1328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWeaponTypeAudioDataAsset*              BulletAudioData;                                   // 0x1330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGPAudioMIDIEventAsset                 CloseMIDIFireEvent;                                // 0x1338(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FGPAudioMIDIEventAsset                 MedMIDIFireEvent;                                  // 0x1378(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FGPAudioMIDIEventAsset                 FarMIDIFireEvent;                                  // 0x13B8(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FGPAudioMIDIEventAsset                 DistMIDIFireEvent;                                 // 0x13F8(0x0040)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1438[0x8];                                     // 0x1438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FWeaponTypeAudioPriority> LoadedBulletAudioData;             // 0x1440(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UShellDropAudioDataAsset*               ShellBounceAudioData;                              // 0x1490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UGPAudioEventAsset*>  AnimationAudios;                                   // 0x1498(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<struct FSoftObjectPath, struct FShellDropAudioPriority> LoadedShellBounceAudioData;         // 0x14E8(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           AIStableFireEndTimerHandle;                        // 0x1538(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           AIStableFireTimerHandle;                           // 0x1540(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           ThirdPlayerStableFireTimerHandle;                  // 0x1548(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           CheckLoopAudioNotStopTimerHandle;                  // 0x1550(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           OutFlybyAudioTimerHandle;                          // 0x1558(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         fCheckLoopAudioNotStopTickTime;                    // 0x1560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1564[0x18];                                    // 0x1564(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableMagazineDropAudio;                          // 0x157C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_157D[0x3];                                     // 0x157D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     DefaultMagazineDropEvent;                          // 0x1580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UPhysicalMaterial*, class UGPAudioEventAsset*> MagazineDropMap;                       // 0x1588(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FVector                                MagazineDropDeltaPos;                              // 0x15D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15E4[0x4];                                     // 0x15E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EChracterPoseType, float>                DropMagazineAudioDelay;                            // 0x15E8(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         MagazineDropAudioDisSqr;                           // 0x1638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_163C[0xC];                                     // 0x163C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AGPCharacter*, struct FCharacterAudioComponents> CharacterAudioComponents;            // 0x1648(0x0050)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                          IsSoundSuppressorTriggerBulletCrack;               // 0x1698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1699[0x37];                                    // 0x1699(0x0037)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Cached3PAudioNear;                                 // 0x16D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        Cached3PAudioMed;                                  // 0x16E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        Cached3PAudioFar;                                  // 0x16F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        Cached3PAudioDist;                                 // 0x1700(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
