#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMAudio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameCore_structs.hpp"
#include "GPWeaponDefineForPlugin_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "GPGlobalDefines_structs.hpp"


namespace SDK
{

// Enum DFMAudio.FCharacterAudioState
// NumValues: 0x0007
enum class EFCharacterAudioState : uint8
{
	EState_1P                                = 0,
	EState_3P                                = 1,
	EState_TEAMATE_3P                        = 2,
	EState_ENEMY_3P                          = 3,
	EState_AIM_1P                            = 4,
	EState_AIM_3P                            = 5,
	EState_MAX                               = 6,
};

// Enum DFMAudio.EDFMAudioAniNotifyType
// NumValues: 0x0037
enum class EDFMAudioAniNotifyType : uint8
{
	EANI_CHANGLE_CLIP                        = 0,
	EANI_CHANGLE_1                           = 1,
	EANI_CHANGLE_2                           = 2,
	EANI_CHANGLE_3                           = 3,
	EANI_CHANGLE_4                           = 4,
	EANI_CHANGLE_5                           = 5,
	EANI_CHANGLE_6                           = 6,
	EANI_CHANGLE_7                           = 7,
	EANI_CHANGLE_8                           = 8,
	EANI_CHANGLE_9                           = 9,
	EANI_CHANGLE_10                          = 10,
	EANI_CHANGLE_11                          = 11,
	EANI_CHANGLE_12                          = 12,
	EANI_CHANGLE_13                          = 13,
	EANI_CHANGLE_14                          = 14,
	EANI_CHANGLE_15                          = 15,
	EANI_CHANGLE_16                          = 16,
	EANI_CHANGLE_17                          = 17,
	EANI_CHANGLE_18                          = 18,
	EANI_CHANGLE_19                          = 19,
	EANI_CHANGLE_20                          = 20,
	EANI_CHANGLE_21                          = 21,
	EANI_CHANGLE_22                          = 22,
	EANI_CHANGLE_23                          = 23,
	EANI_CHANGLE_24                          = 24,
	EANI_CHANGLE_25                          = 25,
	EANI_CHANGLE_26                          = 26,
	EANI_CHANGLE_27                          = 27,
	EANI_CHANGLE_28                          = 28,
	EANI_CHANGLE_29                          = 29,
	EANI_CHANGLE_30                          = 30,
	EANI_CHANGLE_31                          = 31,
	EANI_CHANGLE_40                          = 32,
	EANI_CHANGLE_41                          = 33,
	EANI_CHANGLE_42                          = 34,
	EANI_CHANGLE_43                          = 35,
	EANI_CHANGLE_44                          = 36,
	EANI_CHANGLE_45                          = 37,
	EANI_CHANGLE_46                          = 38,
	EANI_CHANGLE_47                          = 39,
	EANI_CHANGLE_48                          = 40,
	EANI_CHANGLE_49                          = 41,
	EANI_CHANGLE_50                          = 42,
	EANI_CHANGLE_51                          = 43,
	EANI_CHANGLE_52                          = 44,
	EANI_CHANGLE_53                          = 45,
	EANI_CHANGLE_54                          = 46,
	EANI_CHANGLE_55                          = 47,
	EANI_CHANGLE_56                          = 48,
	EANI_CHANGLE_57                          = 49,
	EANI_CHANGLE_58                          = 50,
	EANI_CHANGLE_59                          = 51,
	EANI_CHANGLE_60                          = 52,
	EANI_CHANGLE_61                          = 53,
	EANI_CHANGLE_MAX                         = 54,
};

// Enum DFMAudio.EUIAudioEvent
// NumValues: 0x0017
enum class EUIAudioEvent : uint8
{
	NONE                                     = 0,
	EBGM_GlobalInit                          = 1,
	EBGM_Login                               = 2,
	EBGM_Lobby                               = 3,
	EBGM_NONE                                = 4,
	EUI_ClickNormal                          = 5,
	EUI_ItemSearchWhite                      = 6,
	EUI_ItemSearchBlue                       = 7,
	EUI_ItemSearchPurple                     = 8,
	EUI_ItemSearchOrange                     = 9,
	EUI_MoveInContainer                      = 10,
	EUI_MoveAcrossContainer                  = 11,
	EUI_MoveIntoSafeBox                      = 12,
	EUI_CommonItemClick                      = 13,
	EUI_Drop_Ammo                            = 14,
	EUI_Drop_Consumable                      = 15,
	EUI_Drop_Equipment                       = 16,
	EUI_Drop_Weapon                          = 17,
	EUI_Drop_Common                          = 18,
	EUI_Login_Vedio_Sound                    = 19,
	EUI_Lobby_Vedio_Sound                    = 20,
	EUI_ModeHall_Vedio_Sound                 = 21,
	EUIAudioEvent_MAX                        = 22,
};

// Enum DFMAudio.EWeapon3PFireType
// NumValues: 0x0006
enum class EWeapon3PFireType : uint8
{
	ENone                                    = 0,
	ENear                                    = 1,
	EMedium                                  = 2,
	EFar                                     = 3,
	EDist                                    = 4,
	EWeapon3PFireType_MAX                    = 5,
};

// Enum DFMAudio.EAudioArea
// NumValues: 0x0007
enum class EAudioArea : uint8
{
	EClsInView                               = 0,
	EClsOutView                              = 1,
	EFarInView                               = 2,
	EFarOutView                              = 3,
	ETeamMateInView                          = 4,
	ETeamMateOutView                         = 5,
	EAudioArea_MAX                           = 6,
};

// Enum DFMAudio.EBulletFlyTraceDistance
// NumValues: 0x0005
enum class EBulletFlyTraceDistance : uint8
{
	ENear                                    = 0,
	EMedium                                  = 1,
	EFar                                     = 2,
	EOutOfRange                              = 3,
	EBulletFlyTraceDistance_MAX              = 4,
};

// Enum DFMAudio.FWeaponAudioMode
// NumValues: 0x0004
enum class EFWeaponAudioMode : uint8
{
	EWeapMode_None                           = 0,
	EWeapMode_1P                             = 1,
	EWeapMode_3P                             = 2,
	EWeapMode_MAX                            = 3,
};

// ScriptStruct DFMAudio.DFMAudioEventData
// 0x0010 (0x0010 - 0x0000)
struct FDFMAudioEventData final
{
public:
	class UGPAudioEventAsset*                     BeginAudioEvent;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     EndAudioEvent;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMAudioEventData;

// ScriptStruct DFMAudio.SceneAudioLevelSettingRow
// 0x0010 (0x0020 - 0x0010)
struct FSceneAudioLevelSettingRow final : public FDescRowBase
{
public:
	class FName                                   SceneName;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SceneFactor;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSceneAudioLevelSettingRow;

// ScriptStruct DFMAudio.AudioLevelSettingDataTableRow
// 0x0028 (0x0038 - 0x0010)
struct FAudioLevelSettingDataTableRow final : public FDescRowBase
{
public:
	uint64                                        AudioLevelSettingID;                               // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireAttenuationScalingFactor;          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireCloseDistance;                     // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireMedDistance;                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireFarDistance;                       // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireAttenuationScalingFactor_Silencer; // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireCloseDistance_Silencer;            // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireMedDistance_Silencer;              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireFarDistance_Silencer;              // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAudioLevelSettingDataTableRow;

// ScriptStruct DFMAudio.WeaponFireAudioEventRecord
// 0x0020 (0x0020 - 0x0000)
struct FWeaponFireAudioEventRecord final
{
public:
	class UWeaponFuncComponentAudio*              WeaponAudioSourse;                                 // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ACHARACTER*                             CHARACTER;                                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponFireAudioEventRecord;

// ScriptStruct DFMAudio.SeekAudioContext
// 0x0018 (0x0018 - 0x0000)
struct FSeekAudioContext final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     EventAsset;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSeekAudioContext;

// ScriptStruct DFMAudio.UIAudioEvent
// 0x0018 (0x0018 - 0x0000)
struct FUIAudioEvent final
{
public:
	EUIAudioEvent                                 EventType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     AudioEvent;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventPriority;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUIAudioEvent;

// ScriptStruct DFMAudio.WeaponLoopEventConfig
// 0x0068 (0x0068 - 0x0000)
struct FWeaponLoopEventConfig final
{
public:
	EGPWeaponInnerEvent                           WeaponEvent;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      LoopAudioEventStart;                               // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      LoopAudioEventEnd;                                 // 0x0030(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x005C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponLoopEventConfig;

// ScriptStruct DFMAudio.WeaponLoopEventConfigList
// 0x0010 (0x0010 - 0x0000)
struct FWeaponLoopEventConfigList final
{
public:
	TArray<struct FWeaponLoopEventConfig>         LoopEvents;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponLoopEventConfigList;

// ScriptStruct DFMAudio.WeaponLoopEventConfigAsset
// 0x0030 (0x0030 - 0x0000)
struct FWeaponLoopEventConfigAsset final
{
public:
	EGPWeaponInnerEvent                           WeaponEvent;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     LoopAudioEventStart;                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     LoopAudioEventEnd;                                 // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PlayingId;                                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAudioCharacterViewState                      LastPostedCharacterState;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponLoopEventConfigAsset;

// ScriptStruct DFMAudio.WeaponAudioEventAsset
// 0x0018 (0x0018 - 0x0000)
struct FWeaponAudioEventAsset final
{
public:
	EGPWeaponInnerEvent                           EventType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     AudioEvent;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventPriority;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponAudioEventAsset;

// ScriptStruct DFMAudio.WeaponAudioConfigAsset
// 0x0010 (0x0010 - 0x0000)
struct FWeaponAudioConfigAsset final
{
public:
	TArray<struct FWeaponAudioEventAsset>         AudioEvent;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponAudioConfigAsset;

// ScriptStruct DFMAudio.WeaponAudioEvent
// 0x0038 (0x0038 - 0x0000)
struct FWeaponAudioEvent final
{
public:
	EGPWeaponInnerEvent                           EventType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      AudioEvent;                                        // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventPriority;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponAudioEvent;

// ScriptStruct DFMAudio.WeaponAudioConfig
// 0x0010 (0x0010 - 0x0000)
struct FWeaponAudioConfig final
{
public:
	TArray<struct FWeaponAudioEvent>              AudioEvent;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponAudioConfig;

// ScriptStruct DFMAudio.WeaponControlAudioRow
// 0x03D8 (0x03E0 - 0x0008)
struct FWeaponControlAudioRow final : public FTableRowBase
{
public:
	uint64                                        ControlAudioID;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      EnterAudio;                                        // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      ExitAudio;                                         // 0x0038(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      ZoomInAudio;                                       // 0x0060(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      ZoomOutAudio;                                      // 0x0088(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      RotateEndHorizontalAudio;                          // 0x00B0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      RotateEndVerticalAudio;                            // 0x00D8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      RotateStartAudio;                                  // 0x0100(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      RotateStopAudio;                                   // 0x0128(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateHitCD;                                       // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RotateHorizontalSpeed;                             // 0x0158(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RotateVerticalSpeed;                               // 0x0168(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      DestroyBeginAudio;                                 // 0x0178(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      DestroyEndAudio;                                   // 0x01A0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      ExplodeAudio;                                      // 0x01C8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      LowHPStartAudio;                                   // 0x01F0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      LowHPStopAudio;                                    // 0x0218(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      BeginOverHeatAudio;                                // 0x0240(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      EndOverHeatAudio;                                  // 0x0268(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      CoolDownBeginAudio;                                // 0x0290(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      CoolDownEndOAudio;                                 // 0x02B8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverHeatRTPC;                                      // 0x02E0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      AimAudio;                                          // 0x02F0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      StartLockLoopAudio;                                // 0x0318(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      StopLockLoopAudio;                                 // 0x0340(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      BeAimedAudio;                                      // 0x0368(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      StartBeLockedLoopAudio;                            // 0x0390(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      StopBeLockedLoopAudio;                             // 0x03B8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponControlAudioRow;

// ScriptStruct DFMAudio.WeaponGameModeAudioEventRow
// 0x0060 (0x0068 - 0x0008)
struct FWeaponGameModeAudioEventRow final : public FTableRowBase
{
public:
	EDFMGamePlayMode                              GameMode;                                          // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      EventOfGameModeBegin;                              // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      EventOfGameModeEnd;                                // 0x0038(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RTPCName;                                          // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponGameModeAudioEventRow;

// ScriptStruct DFMAudio.WeaponMainAudioDataRow
// 0x08B0 (0x08B8 - 0x0008)
struct FWeaponMainAudioDataRow final : public FTableRowBase
{
public:
	class FName                                   ResourceID;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGPAudioMIDIEvent                      MIDIFireEvent;                                     // 0x0020(0x00B0)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      LastFireOfClipAudioEvent;                          // 0x00D0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWeaponLoopEventConfig>         LoopAudioEvent;                                    // 0x00F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bForce3PSingleFire;                                // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGPAudio3PFireEvent                    Close3PFireEvent;                                  // 0x0110(0x00C8)(Edit, NativeAccessSpecifierPublic)
	struct FGPAudio3PFireEvent                    Med3PFireEvent;                                    // 0x01D8(0x00C8)(Edit, NativeAccessSpecifierPublic)
	struct FGPAudio3PFireEvent                    Far3PFireEvent;                                    // 0x02A0(0x00C8)(Edit, NativeAccessSpecifierPublic)
	struct FGPAudio3PFireEvent                    Dist3PFireEvent;                                   // 0x0368(0x00C8)(Edit, NativeAccessSpecifierPublic)
	bool                                          CanUseDefault3PFire;                               // 0x0430(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      DryfireAudioEvent;                                 // 0x0438(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      RicochetEvent;                                     // 0x0460(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      UnEquipEvent;                                      // 0x0488(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnEquipDelay;                                      // 0x04B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      EquipEvent;                                        // 0x04B8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EquipDelay;                                        // 0x04E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      SwitchFireModeEvent;                               // 0x04E8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwitchFireModeDelay;                               // 0x0510(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SwitchFireMode_EnemyAudible;                       // 0x0514(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SwitchFireMode_FriendAudible;                      // 0x0515(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_516[0x2];                                      // 0x0516(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      SwitchScopeEvent;                                  // 0x0518(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwitchScopeDelay;                                  // 0x0540(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      ZoomInEvent;                                       // 0x0548(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoomInDelay;                                       // 0x0570(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      ZoomOutEvent;                                      // 0x0578(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoomOutDelay;                                      // 0x05A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ZoomInOrOut_EnemyAudible;                          // 0x05A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ZoomInOrOut_FriendAudible;                         // 0x05A5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A6[0x2];                                      // 0x05A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      SwitchSildeAimEvent;                               // 0x05A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwitchSildeAimDelay;                               // 0x05D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      SwitchSecondaryAimEvent;                           // 0x05D8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwitchSecondaryAimDelay;                           // 0x0600(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      SwitchZoomRateEvent;                               // 0x0608(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      SwitchTacticalEquipEvent;                          // 0x0630(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwitchTacticalEquipDelay;                          // 0x0658(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SwitchTacticalEquip_EnemyAudible;                  // 0x065C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SwitchTacticalEquip_FriendAudible;                 // 0x065D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65E[0x2];                                      // 0x065E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreThrowDelay;                                     // 0x0660(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      PreThrowEvent;                                     // 0x0668(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThrowDelay;                                        // 0x0690(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      ThrowEvent;                                        // 0x0698(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FastThrowDelay;                                    // 0x06C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      FastThrowEvent;                                    // 0x06C8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      PrefireStartEvent;                                 // 0x06F0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      PrefireEndEvent;                                   // 0x0718(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      HoldIdleStartEvent;                                // 0x0740(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      HoldIdleEndEvent;                                  // 0x0768(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSlowBulletFlyByFunc;                              // 0x0790(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWeaponTypeAudioDataAsset> BulletAudioDataAsset;                            // 0x0798(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UGPAudioEventAsset>> AnimationAudios;                     // 0x07C0(0x0050)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bEnableShellBounceAudioAfterfire;                  // 0x0810(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UShellDropAudioDataAsset> ShellBounceAudioDataAsset;                        // 0x0818(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWeaponAudioConfig                     WeaponAudio;                                       // 0x0840(0x0010)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      BulletWooshEvent;                                  // 0x0850(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceAISingleFire;                                // 0x0878(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_879[0x3];                                      // 0x0879(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         fAILoopTailTime;                                   // 0x087C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAIStableFire;                                  // 0x0880(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_881[0x3];                                      // 0x0881(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         fAIStableFireTailTime;                             // 0x0884(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomAIFireInterval;                              // 0x0888(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CustomContinuousFireNum;                           // 0x088C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      AutoAddAmmoEvent;                                  // 0x0890(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponMainAudioDataRow;

// ScriptStruct DFMAudio.Weapon1PFireCache
// 0x0020 (0x0020 - 0x0000)
struct FWeapon1PFireCache final
{
public:
	TArray<class UObject*>                        CacheAudioAssetsInUse;                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        CacheAudioAssetsNoInUse;                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeapon1PFireCache;

// ScriptStruct DFMAudio.WeaponAudioAssetSet
// 0x0001 (0x0001 - 0x0000)
struct FWeaponAudioAssetSet final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponAudioAssetSet;

// ScriptStruct DFMAudio.CharacterAudioComponents
// 0x0018 (0x0018 - 0x0000)
struct FCharacterAudioComponents final
{
public:
	class UDFMListenerComponent*                  ListenerComponent;                                 // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMCharacterAmbientAudioFSM*           CharacterAmbientAudioFSM;                          // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMCharacterAudioComponent*            CharacterAudioComponent;                           // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCharacterAudioComponents;

// ScriptStruct DFMAudio.ShellDropAudioPriority
// 0x0010 (0x0010 - 0x0000)
struct FShellDropAudioPriority final
{
public:
	class UShellDropAudioDataAsset*               ShellBounceAudioData;                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShellDropAudioPriority;

// ScriptStruct DFMAudio.WeaponTypeAudioPriority
// 0x0010 (0x0010 - 0x0000)
struct FWeaponTypeAudioPriority final
{
public:
	class UWeaponTypeAudioDataAsset*              BulletAudioDataAsset;                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponTypeAudioPriority;

// ScriptStruct DFMAudio.WeaponAudioPriority
// 0x0010 (0x0010 - 0x0000)
struct FWeaponAudioPriority final
{
public:
	class UGPAudioEventAsset*                     AudioEventAssetData;                               // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponAudioPriority;

// ScriptStruct DFMAudio.GPAudioBulletFlyTraceResult
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x04) FGPAudioBulletFlyTraceResult final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAudioBulletFlyTraceResult;

// ScriptStruct DFMAudio.GPAudioBulletFlyTraceParam
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x04) FGPAudioBulletFlyTraceParam final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAudioBulletFlyTraceParam;

}

