#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMAnalysTool

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DFMAnalysTool_structs.hpp"


namespace SDK
{

// Class DFMAnalysTool.AnalyseSettings
// 0x0010 (0x0038 - 0x0028)
class UAnalyseSettings final : public UObject
{
public:
	class FString                                 DefaultJsonFileName;                               // 0x0028(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnalyseSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnalyseSettings")
	}
	static class UAnalyseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnalyseSettings>();
	}
};
DUMPER7_ASSERTS_UAnalyseSettings;

// Class DFMAnalysTool.DFMAnalyseManager
// 0x00B8 (0x00E8 - 0x0030)
class UDFMAnalyseManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xB8];                                      // 0x0030(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFMAnalyseManager* GetIns(const class UObject* Context); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141362E10

	void AddArrayData(const class FString& InKey, const TArray<class FString>& inArray); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x141361EA0
	void AddArrayData2Section(const class FString& SectionName, const class FString& InKey, const TArray<class FString>& inArray); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x141361C90
	void AddData2Section(const class FString& SectionName, const class FString& InKey, const class FString& InData); // (Native, Public, BlueprintCallable) // @ 0x141362040
	void AddEntryData_Double(const class FString& InKey, const double InData); // (Native, Public) // @ 0x141362200
	void AddEntryData_Float(const class FString& InKey, const float InData); // (Native, Public, BlueprintCallable) // @ 0x141362310
	void AddEntryData_Int(const class FString& InKey, const int32 InData); // (Native, Public, BlueprintCallable) // @ 0x141362420
	void AddEntryData_String(const class FString& InKey, const class FString& InData); // (Native, Public, BlueprintCallable) // @ 0x141362530
	void AddMapData2Section(const class FString& SectionName, const class FString& InKey, const TMap<class FString, class FString>& InMap); // (Native, Public, HasOutParams) // @ 0x141362680
	void SaveData(const class FString& InDataPath); // (Native, Public, BlueprintCallable) // @ 0x141362FC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAnalyseManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAnalyseManager")
	}
	static class UDFMAnalyseManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAnalyseManager>();
	}
};
DUMPER7_ASSERTS_UDFMAnalyseManager;

// Class DFMAnalysTool.DFUICostMonitor
// 0x00B8 (0x00E8 - 0x0030)
class UDFUICostMonitor final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMonitorMoreFramesCost;                            // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MonitorMoreFramesNum;                              // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UIEmitThreshold;                                   // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProtoEmitThreshold;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0xA0];                                      // 0x0048(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFUICostMonitor* Get(class UObject* WorldContextObj); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141362D60
	static void HeavyTaskMonitorInShipping(const class FString& TaskKey, const class FString& TaskPath); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141362E90

	void DataTimerEnd(const class FString& SectionName, const class FString& InKey); // (Native, Public, BlueprintCallable) // @ 0x141362870
	void DataTimerEndWithStartTime(int64 StartTime, const class FString& SectionName, const class FString& InKey, EUICostType CostType, float EmitThreshold); // (Native, Public) // @ 0x1413629C0
	void DataTimerStart(const class FString& SectionName, const class FString& InKey, EUICostType CostType, float EmitThreshold); // (Native, Public, BlueprintCallable) // @ 0x141362BB0
	int64 GetCurTime(); // (Final, Native, Public) // @ 0x141362DE0
	void SaveData(const class FString& InFilePath); // (Native, Public, BlueprintCallable) // @ 0x141363090

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFUICostMonitor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFUICostMonitor")
	}
	static class UDFUICostMonitor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFUICostMonitor>();
	}
};
DUMPER7_ASSERTS_UDFUICostMonitor;

}

