#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMAbility

#include "Basic.hpp"

#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DFMAbility_structs.hpp"
#include "AIModule_classes.hpp"
#include "GPWeaponDefineForPlugin_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "GPWeaponRuntime_structs.hpp"
#include "GPWeaponRuntime_classes.hpp"
#include "GPResource_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "GPQuest_structs.hpp"
#include "GPDeformable_structs.hpp"
#include "GPDeformable_classes.hpp"
#include "PerfGear_structs.hpp"
#include "DFMVehicle_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameCore_classes.hpp"
#include "DFMGlobalDefines_structs.hpp"


namespace SDK
{

// Class DFMAbility.DFMAbilityActor
// 0x0050 (0x0400 - 0x03B0)
class ADFMAbilityActor : public AGPAbilityActor
{
public:
	TWeakObjectPtr<class ADFMCharacter>           AbilityActorOwner;                                 // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SinglePlayerMaxExistNum;                           // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AllCampNearbyMaxExistNum;                          // 0x03BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AllCampNearbyCheckRad;                             // 0x03C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBattleFieldPropType                          AbilityActorType;                                  // 0x03C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WaterRippleID;                                     // 0x03C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMInteractiveWaterComponent*          RippleEffectComponent;                             // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 MainMesh;                                          // 0x03D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ResourceKey;                                       // 0x03E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseWeaponSkinData;                                // 0x03E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUse1PMeshOnFPP;                                   // 0x03E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        MeshAsyncRequestId;                                // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        MaterialAsyncRequestId;                            // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	float GetWaterSurfaceDistance(); // (Final, Native, Public, BlueprintCallable) // @ 0x145F2CB60
	void InitSkinInternal(const struct FCharacterHeroResourceAttachMeshData& SkinData); // (Native, Public, HasOutParams) // @ 0x145F2CCF0
	bool IsUnderWater(); // (Native, Public, BlueprintCallable) // @ 0x145F2CF10
	void OnSetSkinResult(bool bReturnValue); // (Native, Public) // @ 0x145F2D330

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAbilityActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAbilityActor")
	}
	static class ADFMAbilityActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFMAbilityActor>();
	}
};
DUMPER7_ASSERTS_ADFMAbilityActor;

// Class DFMAbility.DFMAbilityDetectorBase
// 0x0240 (0x0640 - 0x0400)
class ADFMAbilityDetectorBase : public ADFMAbilityActor
{
public:
	uint8                                         Pad_400[0x10];                                     // 0x0400(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFMBuffDetectComponent*                BuffDetectComponent;                               // 0x0410(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyParam;                                        // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           IgnoreTags;                                        // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           AddTags;                                           // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           EnermyAddTags;                                     // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ADFMCharacter>           OwnerChar;                                         // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LeftTime;                                          // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClientAutoDestroy;                                // 0x0464(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LeftCount;                                         // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProcessDelay;                                      // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestroyDelay;                                      // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCheckBlock;                                      // 0x0474(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475[0x13];                                     // 0x0475(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	class UShapeComponent*                        RangeCheckCache;                                   // 0x0488(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UAnimSequenceBase>> AnimConfig;                           // 0x0490(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UGPAudioEventAsset>> AudioConfig;                         // 0x04E0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bOverlapCheckHitBlock;                             // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RayCheckHeadHeight;                                // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedBreakGlassWhenOverlap;                        // 0x0538(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_539[0x1];                                      // 0x0539(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDebug;                                            // 0x053A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53B[0x5];                                      // 0x053B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UAnimSequenceBase*>   AnimObjMap;                                        // 0x0540(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UGPAudioEventAsset*>  AudioObjMap;                                       // 0x0590(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FSkillSmokeBreakSetting                SmokeBreakSetting;                                 // 0x05E0(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkillSmokeBreakerInfo                 SmokeBreakerInfo;                                  // 0x05F4(0x0044)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_638[0x8];                                      // 0x0638(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_ApplyOverlapActors(const TArray<class AActor*>& AllOverlappingActors); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_LeftTimeUpdate(float CurLeftTime); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnAnimLoadFinished(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnAudioLoadFinished(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_StartDestroySelf(bool fromLifeTimeOrCount); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ClearTriggerActors(); // (Final, Native, Public) // @ 0x145F3B4C0
	void DestroySelf(); // (Final, Native, Public) // @ 0x145F3B990
	class UAnimSequenceBase* GetAnimByName(class FName AnimName); // (Final, Native, Public, BlueprintCallable) // @ 0x145F3B9D0
	class UGPAudioEventAsset* GetAudioByName(class FName AudioName); // (Final, Native, Public, BlueprintCallable) // @ 0x145F3BA60
	void InnerDestroySelf(); // (Final, Native, Public, BlueprintCallable) // @ 0x145F3BC10
	void InnerDestroySelfWithDelay(float Delay); // (Final, Native, Public, BlueprintCallable) // @ 0x145F3BC30
	bool IsCharacterEnemy(class AGPCharacter* GPChar); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x145F3BD70
	bool IsEnemy(const class AGPCharacterBase* CharecterA, const class AGPCharacterBase* CharecterB); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x145F3BE60
	bool IsLocalEnemy(); // (Native, Public, BlueprintCallable, BlueprintPure) // @ 0x142B90BE0
	void OnAnimLoad(const TArray<struct FSoftObjectPath>& AssetRef); // (Native, Public) // @ 0x145F3C020
	void OnAudioLoad(const TArray<struct FSoftObjectPath>& AssetRef); // (Native, Public) // @ 0x145F3C1B0
	void OnDetectorDestroy(); // (Final, Native, Public) // @ 0x145F3C5E0
	void OnInnerDestroySelf(); // (Native, Public, BlueprintCallable) // @ 0x1419325B0

	void LogTriggerActors(bool bIsAdd, const class AActor* OtherActor) const; // (Final, Native, Public, Const) // @ 0x145F3BF20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAbilityDetectorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAbilityDetectorBase")
	}
	static class ADFMAbilityDetectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFMAbilityDetectorBase>();
	}
};
DUMPER7_ASSERTS_ADFMAbilityDetectorBase;

// Class DFMAbility.DFMAbilityBuffDetector
// 0x01F8 (0x0838 - 0x0640)
class ADFMAbilityBuffDetector : public ADFMAbilityDetectorBase
{
public:
	uint8                                         Pad_640[0x60];                                     // 0x0640(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAbilityDetectorBuffData>       AddBuffIDs;                                        // 0x06A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         AbilityId;                                         // 0x06B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnerCampID;                                       // 0x06B4(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OwnerTeamID;                                       // 0x06B8(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        OwnerUin;                                          // 0x06C0(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerElimated;                                   // 0x06C8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C9[0x3];                                      // 0x06C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkillId;                                           // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SkillEntityID;                                     // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickBuff;                                         // 0x06D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D5[0x3];                                      // 0x06D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickRate;                                          // 0x06D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CustomCountTime;                                   // 0x06E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnemyTrigger;                                     // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeammateTrigger;                                  // 0x06F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggerCheckEnemy;                                // 0x06F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F3[0x5];                                      // 0x06F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         HitEffectId;                                       // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitEffectDamge;                                    // 0x0700(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitEffectAnimTime;                                 // 0x0704(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitEffectScale;                                    // 0x0708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHP;                                             // 0x070C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrHP;                                            // 0x0710(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakeDamage;                                       // 0x0714(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_715[0x3];                                      // 0x0715(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DestroyFX;                                         // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DestroyFXUnderWater;                               // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeammateDamage;                                   // 0x0728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelfDamage;                                       // 0x0729(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72A[0x2];                                      // 0x072A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BindToAttachMeshName;                              // 0x072C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBindToAttachMesh;                                 // 0x0734(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnly3PBindToAttachMesh;                           // 0x0735(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_736[0x2];                                      // 0x0736(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HitBoneName;                                       // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHitEventType                                 ApplyHitEventType;                                 // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_741[0x3];                                      // 0x0741(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AIStaggerName;                                     // 0x0744(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AppyHitCD;                                         // 0x074C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyHit;                                          // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DamageApplyHit;                                    // 0x0751(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_752[0x2];                                      // 0x0752(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartApplyHitCnt;                                  // 0x0754(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyScoreWhenBeDestroy;                           // 0x0758(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScoreApplyed;                                     // 0x0759(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScoreName                                    BeDestroyScore;                                    // 0x075A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitByName;                                        // 0x075B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECharacterPart                                CharacterPart;                                     // 0x075C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75D[0x3];                                      // 0x075D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitTargetYaw;                                      // 0x0760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanBeResonance;                                   // 0x0764(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_765[0x3];                                      // 0x0765(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint64, float>                           StaggerCDMap;                                      // 0x0768(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ApplyHitCnt;                                       // 0x07B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXResourceContainerComponent*          DestroyFXComp;                                     // 0x07C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFXResourceContainerComponent> DestroyFXCompChecker;                        // 0x07C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7D0[0x4];                                      // 0x07D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        StickyTargetID;                                    // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStickyToTarget;                                 // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D9[0x7];                                      // 0x07D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        StickyCharUin;                                     // 0x07E0(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStickyInfo                            StickyInfo;                                        // 0x07E8(0x0038)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ADFMCharacter>           StickyChar;                                        // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StickyRelativePosition;                            // 0x0828(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStickyToTargetKeepRotation;                       // 0x0834(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStickyToTargetKeepRotationOnBone;                 // 0x0835(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResonance;                                        // 0x0836(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_837[0x1];                                      // 0x0837(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_AEffectBuff(class ADFMCharacter* DFMCharacter, bool Add); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_ClientStartDestroySelf(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_EnableTickBuff(bool Enable, bool Apply); // (Final, Native, Public, BlueprintCallable) // @ 0x145F36400
	ESkillLogicType BP_GetSkillLogicType(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x145F364D0
	void BP_HPEmpty(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_LimitStop(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnSetCharacterOwner(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnStickyToTarget(const struct FHitResult& ImpactResult); // (Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void BP_Resonance(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetAbilitOwner(int32 skillEntityIndex, class ADFMCharacter* Char); // (Final, Native, Public, BlueprintCallable) // @ 0x145F36500
	void BP_SetCharacterOwner(class ADFMCharacter* Char); // (Final, Native, Public, BlueprintCallable) // @ 0x145F365C0
	void ClientOnInnerDestroySelf(); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x144AD4740
	void ClientPlayCameraHitEffect(uint64 Uin); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x144B315F0
	void DamageTakerApplyDamageEffect(const bool& bIsServer, const struct FDamageResultInfo& DamageResult); // (Native, Public, HasOutParams) // @ 0x145F36740
	void DeactiveFXResourceContainerComponent(class UFXResourceContainerComponent* FX, int32 FXHandle); // (Final, Native, Public, BlueprintCallable) // @ 0x145F36860
	int32 GetAbility(); // (Native, Public, BlueprintCallable) // @ 0x145F36940
	class ADFMCharacter* GetAbilityCharacter(); // (Native, Public, BlueprintCallable) // @ 0x145F36970
	class UDFMAbilityInstance* GetAbilityInstance(); // (Final, Native, Public) // @ 0x145F369A0
	ENetRole GetAbilityRole(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x145F369D0
	class USkeletalMeshComponent* GetGPMesh(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FName GetResourcePath(class FName Key); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x145F36A00
	float GetTimerRemaining(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x145F36A90
	bool Is1P(); // (Final, Native, Public, BlueprintCallable) // @ 0x145F36AC0
	void OnClientStartDestroySelf(); // (Native, Public) // @ 0x141000850
	void OnRep_StickyInfo(); // (Native, Public) // @ 0x144B13190
	void OnStickyTargetDied(class AActor* Vehicle); // (Native, Public) // @ 0x145F36D20
	void OnStickyToTarget(const struct FHitResult& ImpactResult); // (Native, Public, HasOutParams) // @ 0x145F36DB0
	void RemovePostEffect(class FName PostEffectName); // (Final, Native, Public, BlueprintCallable) // @ 0x145F36E80
	void Rep_AbilityID(); // (Final, Native, Public) // @ 0x145F36F20
	void Rep_OwnerUin(); // (Final, Native, Public) // @ 0x145F36F40
	void Rep_ServerElimate(); // (Final, Native, Public) // @ 0x145F36F60
	void Rep_StickyToChar(); // (Native, Public) // @ 0x144B131F0
	void RequestStaggerByName(class ADFMCharacter* DFMCharacter, class FName StaggerName, const bool bOverrideCurStagger, const bool bShouldTurn, const float TargetYaw, float CD); // (Final, Native, Public, BlueprintCallable) // @ 0x145F36F80
	void SetAbility(int32 InSkillId); // (Native, Public, BlueprintCallable) // @ 0x145F37150
	void SetPostEffectActive(class FName PostEffectName); // (Final, Native, Public, BlueprintCallable) // @ 0x145F372E0
	void ShowHitAbilityActorMarker(const bool& bIsServer, const struct FDamageResultInfo& DamageResult); // (Final, Native, Public, HasOutParams) // @ 0x145F37360
	void StickyToTarget(const struct FHitResult& ImpactResult); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x145F37480
	void StickyToTargetEx(const struct FHitResult& ImpactResult, bool FixStick, bool OnlyFixCharacter); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x145F37550
	void SyncActor(class ADFMAbilityBuffDetector* Detector); // (Final, Native, Public, BlueprintCallable) // @ 0x145F376D0
	bool TryStickyToThrowAttachable(const struct FHitResult& ImpactResult); // (Final, Native, Public, HasOutParams) // @ 0x145F37790
	void UpdatePostEffectScalarParameters(class FName PostEffectName, class FName ParameterName, float Value); // (Final, Native, Public, BlueprintCallable) // @ 0x145F37870
	void UpdatePostEffectVectorParameters(class FName PostEffectName, class FName ParameterName, const struct FLinearColor& Value); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x145F37970

	bool CheckBuffTime(class ADFMCharacter* DFMCharacter, int32 BuffId, float MinTime) const; // (Final, Native, Private, Const) // @ 0x145F36640
	void SetBuffTime(class ADFMCharacter* DFMCharacter, int32 BuffId, float TargetTime) const; // (Final, Native, Private, Const) // @ 0x145F371E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAbilityBuffDetector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAbilityBuffDetector")
	}
	static class ADFMAbilityBuffDetector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFMAbilityBuffDetector>();
	}
};
DUMPER7_ASSERTS_ADFMAbilityBuffDetector;

// Class DFMAbility.SkillDeploymentBase
// 0x00C8 (0x0900 - 0x0838)
class ASkillDeploymentBase : public ADFMAbilityBuffDetector
{
public:
	uint8                                         Pad_838[0x20];                                     // 0x0838(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	EAbilityDetectorTriggerType                   CurrTriggerState;                                  // 0x0858(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_859[0x1C];                                     // 0x0859(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMaxDistanceToDestroyed;                           // 0x0875(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_876[0x6];                                      // 0x0876(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNeedAutoAttachToSurface;                          // 0x087C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87D[0x3];                                      // 0x087D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttachToSurfaceDis;                                // 0x0880(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MapIconColor_Self;                                 // 0x0884(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MapIconColor_TeamMate;                             // 0x088C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MapIconColor_CampMate;                             // 0x0894(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDFMMapIconType                               MapIconType;                                       // 0x089C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89D[0x3];                                      // 0x089D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceOffset;                                       // 0x08A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckImpendingDeathTargetSOL;                     // 0x08A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A5[0x3];                                      // 0x08A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EMPEffect;                                         // 0x08A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectByEmp;                                      // 0x08B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDeployInWater;                              // 0x08B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMobileUICheck;                              // 0x08B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanPickup;                                        // 0x08B3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PickUpDistance;                                    // 0x08B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedPickUpTrace;                                  // 0x08B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B9[0x7];                                      // 0x08B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RecycleText;                                       // 0x08C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         PickUpDirectionDegree;                             // 0x08D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanActivate;                                      // 0x08DC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8DD[0x3];                                      // 0x08DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActivateDistance;                                  // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveDirectionDegree;                             // 0x08E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValidateExtraDistance;                             // 0x08E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceToDestroy;                              // 0x08EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestroyDistanceCheckDelayTime;                     // 0x08F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestroyDistanceCheckUIOffsetTime;                  // 0x08F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkillRecycleType                             RecycleType;                                       // 0x08F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETacticalEquipmentMarkerType                  TacticalEquipmentMarker;                           // 0x08F9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8FA[0x2];                                      // 0x08FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ThreatId;                                          // 0x08FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BP_ClientEmpAffect(bool bAffected); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SpawnByHeavyAttack(); // (Final, Native, Public, BlueprintCallable) // @ 0x145F8B7A0
	void CheckAttachedParent(); // (Final, Native, Protected) // @ 0x145F8B7C0
	void DelayExit(); // (Native, Public, BlueprintCallable) // @ 0x145F33070
	void EMPDisable(float EMPAffectTime); // (Net, NetReliable, Native, Event, NetMulticast, Protected) // @ 0x144B52E50
	void EMPRecover(); // (Net, NetReliable, Native, Event, NetMulticast, Protected) // @ 0x144ABB1A0
	void OnCharacterArmedForceChanged(); // (Native, Public) // @ 0x145F36B50
	void OnCharacterBeKnockedDown(struct FKillInfo* KillInfo); // (Final, Native, Public, HasOutParams) // @ 0x145F8C210
	void OnCharacterDead(class AGPCharacterBase* CHARACTER, class AController* Killer, const class UDamageType* DamageType); // (Native, Public) // @ 0x145F32770
	void OnRep_TriggerState(); // (Final, Native, Protected) // @ 0x145F8C3E0
	void OnServerMatchEnd(EMatchOverReason EndReason, int64 Uin); // (Native, Public) // @ 0x145F36C50
	void TryAutoAttachToSurface(); // (Final, Native, Protected) // @ 0x145F8CDE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SkillDeploymentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SkillDeploymentBase")
	}
	static class ASkillDeploymentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASkillDeploymentBase>();
	}
};
DUMPER7_ASSERTS_ASkillDeploymentBase;

// Class DFMAbility.ChainHookWeapon
// 0x00B0 (0x1480 - 0x13D0)
class AChainHookWeapon : public AChainHookBaseWeapon
{
public:
	float                                         ChargeTime;                                        // 0x13C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ChargeStartEventName;                              // 0x13CC(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ChargeStopEventName;                               // 0x13D4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ChargeFinishEventName;                             // 0x13DC(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MoveLoopStartEventName;                            // 0x13E4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   MoveLoopStopEventName;                             // 0x13EC(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PullBackStartEventName;                            // 0x13F4(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PullBackStopEventName;                             // 0x13FC(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PullBackFinishEventName;                           // 0x1404(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PullBackFailedEventName;                           // 0x140C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PullBackBreakEventName;                            // 0x1414(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   HitCharacterEventName;                             // 0x141C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   HitOtherEventName;                                 // 0x1424(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_142C[0x4];                                     // 0x142C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HitEnemyVoiceString;                               // 0x1430(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 HitAllyVoiceString;                                // 0x1440(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 BrokenVoiceString;                                 // 0x1450(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChainHookComponent*                    HookComponent;                                     // 0x1460(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRegisterToSkillComponent;                         // 0x1468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1469[0x7];                                     // 0x1469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ChargeTimer;                                       // 0x1470(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasPlayHitSound;                                  // 0x1478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1479[0x7];                                     // 0x1479(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckSound(class FName EventName); // (Final, Native, Private) // @ 0x145F2C5D0
	void DoPlaySound(class FName EventName); // (Final, Native, Private) // @ 0x145F2C920
	void DoPlayVO(const class FString& VoiceString); // (Final, Native, Private) // @ 0x145F2C9A0
	void OnChargeTimer(); // (Final, Native, Private) // @ 0x145F2CF40
	void PlayBrokenVO(); // (Final, Native, Private) // @ 0x145F2D400
	void PlayChargeSound(bool IsStart); // (Final, Native, Public) // @ 0x145F2D420
	void PlayHitVO(bool IsHitEnemy); // (Final, Native, Private) // @ 0x145F2D650
	void PlayMoveForwardSound(bool IsStart); // (Final, Native, Public) // @ 0x145F2D6E0
	void PlayPullBackBreakSound(); // (Final, Native, Public) // @ 0x145F2D770
	void PlayPullBackFailedSound(); // (Final, Native, Public) // @ 0x145F2D790
	void PlayPullBackSound(bool IsStart, bool IsFinish); // (Final, Native, Public) // @ 0x145F2D8D0
	void PlayWeaponDisableSound(); // (Final, Native, Public) // @ 0x145F2D9A0
	void PlayWeaponEnableSound(); // (Final, Native, Public) // @ 0x145F2D9C0
	void PreloadAudio(); // (Final, Native, Public) // @ 0x145F2D9E0
	void RegisterToSkillComponent(bool bIsAdd); // (Final, Native, Public) // @ 0x145F2DA40
	void StartChargeTimerTimer(); // (Final, Native, Private) // @ 0x145F2E870
	void StopAllLoopSound(); // (Final, Native, Private) // @ 0x145F2E890
	void StopAllSound(); // (Final, Native, Public) // @ 0x145F2E8D0
	void StopChargeTimerTimer(); // (Final, Native, Private) // @ 0x145F2E8F0
	void TryPlayHitSound(class AActor* HitTarget); // (Final, Native, Public) // @ 0x145F2EB10
	void UseSkillComponentData(); // (Final, Native, Public) // @ 0x145F2ED70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChainHookWeapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChainHookWeapon")
	}
	static class AChainHookWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<AChainHookWeapon>();
	}
};
DUMPER7_ASSERTS_AChainHookWeapon;

// Class DFMAbility.AbilityAttachBaseMesh
// 0x0068 (0x03D8 - 0x0370)
class AAbilityAttachBaseMesh final : public AActor
{
public:
	uint8                                         Pad_370[0x18];                                     // 0x0370(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          IsSnapToTarget;                                    // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   StaticMeshSocketName;                              // 0x038C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SkeletalMeshSocketName;                            // 0x0394(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDefalutMeshIsStaticMesh;                          // 0x039C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetMasterPose;                                    // 0x039D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFromPool;                                      // 0x039E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeshEnable;                                       // 0x039F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAbiltyTemplateAttachMeshMode                 AttachMeshMode;                                    // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPSkeletalMeshComponent*               CurSkeletalMeshComponent;                          // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGPSkeletalMeshComponent*               CurSkeletalMeshComponentMasterPose;                // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   CurStaticMeshComponent;                            // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameAkComponent*                       CurGameAKComponent;                                // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurSkeletalMeshComponentEnable;                    // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurSkeletalMeshComponentMasterPoseEnable;          // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurStaticMeshComponentEnable;                      // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurGameAKComponentEnable;                          // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_PostBeginPlay(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetBPAnimIndex(int32 AnimIndex, float PlayRate, bool bLoopAnim); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMasterPose(bool Set); // (Final, Native, Public, BlueprintCallable) // @ 0x145F15660
	void BP_SetMaterialScaleParams(float Value); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UGPSkeletalMeshComponent* BP_SkeletalMesh(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UGPSkeletalMeshComponent* BP_SkeletalMeshMasterPose(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void CharacterAvatarChangeSignature(); // (Final, Native, Public) // @ 0x145F156F0
	void EnableAllMeshTick(bool Enable); // (Final, Native, Public, BlueprintCallable) // @ 0x145F159A0
	class USkeletalMeshComponent* GetMasterSkeletalMesh(); // (Final, Native, Protected) // @ 0x145F15A30
	bool Is3P(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x145F15AA0
	void RemovePostEffect(class FName PostEffectName); // (Final, Native, Public, BlueprintCallable) // @ 0x145F15D20
	void SetCurGameAKComponentEnable(bool Enable, bool fromLod); // (Final, Native, Protected) // @ 0x145F15E50
	void SetCurSkeletalMeshComponentEnable(bool Enable, bool fromLod); // (Final, Native, Protected) // @ 0x145F15F20
	void SetCurSkeletalMeshComponentMasterPoseEnable(bool Enable, bool fromLod); // (Final, Native, Protected) // @ 0x145F15FF0
	void SetCurStaticMeshComponentEnable(bool Enable, bool fromLod); // (Final, Native, Protected) // @ 0x145F160C0
	void SetPostEffectActive(class FName PostEffectName); // (Final, Native, Public, BlueprintCallable) // @ 0x145F16190
	void SwitchToMasterPoseMesh(); // (Final, Native, Public, BlueprintCallable) // @ 0x145F16480
	void SwitchToSkeletalMesh(); // (Final, Native, Public, BlueprintCallable) // @ 0x145F164A0
	void SwitchToStaticMesh(); // (Final, Native, Public, BlueprintCallable) // @ 0x145F164C0
	void UpdatePostEffectScalarParameters(class FName PostEffectName, class FName ParameterName, float Value); // (Final, Native, Public, BlueprintCallable) // @ 0x145F16670
	void UpdatePostEffectVectorParameters(class FName PostEffectName, class FName ParameterName, const struct FLinearColor& Value); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x145F16770

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityAttachBaseMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityAttachBaseMesh")
	}
	static class AAbilityAttachBaseMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbilityAttachBaseMesh>();
	}
};
DUMPER7_ASSERTS_AAbilityAttachBaseMesh;

// Class DFMAbility.DelayDestroySkeletalMesh
// 0x0000 (0x0F50 - 0x0F50)
