#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMCharacterFSM_Main_SafeHouse

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"
#include "SMSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "GPGameplay_structs.hpp"


namespace SDK
{

// SMBlueprintGeneratedClass DFMCharacterFSM_Main_SafeHouse.DFMCharacterFSM_Main_SafeHouse_C
// 0x7FE8 (0x87D0 - 0x07E8)
class UDFMCharacterFSM_Main_SafeHouse_C final : public UDFMFSMInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_20_89D5DF9942F68C32B1C04A86D2D1A4AA; // 0x07F0(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_12_66ACB29044A77FD97E969385E29B9DF8; // 0x0950(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_19_3520D4E845DF0831C482F38B26B4E9B7; // 0x0AF0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_18_2B8894474E31CB90ECFA14ABECE975CA; // 0x0C50(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_11_86AA26944094B48BF56FF79BEE7FA583; // 0x0DB0(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_17_755E731F4FD10546B1BC86BE65435021; // 0x0F50(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_10_6B46E7E143408FA05C92FFA19BD54C0D; // 0x10B0(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_9_6CB7AD094C1D3E3989B0A09D4B270D44; // 0x1250(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_16_326ED6764AFB26A151570EA20CBC6C66; // 0x13F0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_15_6F637C7E42A9D64E589A249FFF028AA9; // 0x1550(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_14_7D50F39E4226D35C08D5A4B8C22FF43A; // 0x16B0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_13_5223AB0D4D8A1FE85E70A194165FA105; // 0x1810(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_12_1E0F5D514696A52048C0F197A1BAC02D; // 0x1970(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_11_8C2DC4254642D9C803A1F9B172B3ACDA; // 0x1AD0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_10_454535404FAF69EFFEDEA5A21B739232; // 0x1C30(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_8_511FC83E49C7ED77D8BCB9837ED04FCF; // 0x1D90(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_7_3C0C7C0D4EC15AAB64CDE68B44CDC5AF; // 0x1F30(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_9_FE65BF14495D4A092B738A892EC5DCAF; // 0x20D0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_8_79A741424290D06973D7768488F289D4; // 0x2230(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_6_77CABC0C430A62C580660C9794F366E5; // 0x2390(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_5_577A5DC94A2563768EC776B7233294CB; // 0x2530(0x01A0)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_7_B670C06949E310429FACC09DA76A07A1; // 0x26D0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_6_714D227A4442F465F4B0BABF32AC74FF; // 0x2830(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_5_F00CB83E41ACA7A06D8139A1BEEFBC0F; // 0x2990(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_4_4F2FF13A40BC6443931949B848026F0C; // 0x2AF0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_3_EF871A31470ADE3E4311DFB5F32C084C; // 0x2C50(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_2_ED70CEC04E35A097C690339DBC0BA766; // 0x2DB0(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_1_4FCC0C674C85F5A8627A318D1DC1BCF8; // 0x2F10(0x0160)()
	struct FSMTransition                          SMGraphK2Node_TransitionResultNode_7FE9FEA04E16E95ED8717ABDDE4D48FD; // 0x3070(0x0160)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_4_4540D15046B935D0A63A49B796E5B838; // 0x31D0(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_3_08011E9745C6A583AB96CE8FF872C7C1; // 0x3370(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_2_E271419E4B2736D8BEDB19ADCC46B160; // 0x3510(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_1_1D194B864A916CBD396AF6938CB1A6D0; // 0x36B0(0x01A0)()
	struct FSMState                               SMGraphK2Node_StateEntryNode_DBD0636A4F5EA7760EAEA2ABDC075F44; // 0x3850(0x01A0)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_9_2802AAED414FEE27F7796C8E6069B031; // 0x39F0(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_8_FD1582E8483B2B53F0671AA729F7F0B0; // 0x3D28(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_7_0CE23161451B914BF062BD8BA5BC5B19; // 0x4060(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_6_E269EAA445809108A33B669154D9F059; // 0x4398(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_5_2496C1184B87B1D70388C4B01664DBDA; // 0x46D0(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_4_968A9F0944C26AD0FFB9F28FF8A49026; // 0x4A08(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_3_79F2A1B642F60F21BE51FBA1A67FA2C1; // 0x4D40(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_2_08A6A8E84F4F7393AB479E851C0973D3; // 0x5078(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_1_3FE6EFDD40D51B08EFF0F18C87A32C78; // 0x53B0(0x0338)()
	struct FSMStateMachine                        SMGraphK2Node_StateMachineEntryNode_6995DC334728C1AC2DB4C39178D2693B; // 0x56E8(0x0338)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_42_5018CD334986A0E34D37B1A23824B106; // 0x5A20(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_41_C4137F2C49B1B971C6A5F2AEF3F238F2; // 0x5B30(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_40_82F75BEC428AD86177203199D80FE077; // 0x5C40(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_39_36053B65446C5C40C98DA99688E8182F; // 0x5D50(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_38_CC0ED3844D1CECCD7876B9B6B6F1446D; // 0x5E60(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_37_BC212C624330E7B31257AEB169142982; // 0x5F70(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_36_FDA4846A469A9EA128F4CB9E61DE71FE; // 0x6080(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_35_0F6E7BB34242D02E1CB47F96FFBBEB11; // 0x6190(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_34_39C6BE4546A8812DDBEE2C886538334D; // 0x62A0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_33_DD491D80494F6243B99193A73FA11355; // 0x63B0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_32_1956771444C0723999AD90A2FDDE184B; // 0x64C0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_31_8467DA794FD767418E7AE2AE45F8C722; // 0x65D0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_30_461F19EF47807D204E258BB6B4512A70; // 0x66E0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_29_A44E477E4D83792FDBBF1DAB0AA87479; // 0x67F0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_28_1203AD8E42E599F7742447B9EFD2CA75; // 0x6900(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_27_607B266441492F929FF151A2E6BEE2A3; // 0x6A10(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_26_6C989AFF49BEAB21A18D118ECF74BDD5; // 0x6B20(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_25_B7762ED04E278BAF54978193C0915925; // 0x6C30(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_24_CF3E5E934ACB7501F5943DB5EE8537F9; // 0x6D40(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_23_EFA5E93D481D9E111BBBD4AD4F89A65D; // 0x6E50(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_22_CBCEEA7F4A7D673D3BA663B3249D620B; // 0x6F60(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_21_099772454D0198419DCEC59A1D1F7F9D; // 0x7070(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_20_7832A842427C8CD588F2E9A0A7643FEA; // 0x7180(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_19_897DAB4B47633C292C809FA37A375277; // 0x7290(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_18_A1E8C90D40CFFDD81B4109A964E5C62D; // 0x73A0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_17_5ACAF92C4AA47C1A1D9C68AACB8ED4F1; // 0x74B0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_16_BDD5BFD046A7A9A934F5CF8F3745A987; // 0x75C0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_15_3F73A2A84DA225837934C9ADB14F3174; // 0x76D0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_14_237717B3480C8F95D283BFBDB42EF097; // 0x77E0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_13_F620B17D41ABF7DB9A63D88C9F105CF8; // 0x78F0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_12_0694724742636AA8E89A26B9A2D47D79; // 0x7A00(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_11_554623C2441FC5FEDFD094B4D9D8C134; // 0x7B10(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_10_DA167C06438DFB92423A319B9A7A1276; // 0x7C20(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_9_12A8548D462D8B5D30A86FA85D88C4F8; // 0x7D30(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_8_A08FB40544E606E2E5509CB935AAC479; // 0x7E40(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_7_8967FC1D46D41F698B9509B7AF8552F1; // 0x7F50(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_6_B46371284407251AC6C278A972904FF3; // 0x8060(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_5_D7D5BD5240DA84DB0113949371B5A90E; // 0x8170(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_4_5D65A7FD476082CA753809BAB67207C9; // 0x8280(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_3_6496F71148CE49ABA748DEAF72469A31; // 0x8390(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_2_07C060CF48124ECE6AEDCE84C19BD845; // 0x84A0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_1_B382AB2D466C13F062A6A682FDBD4C6B; // 0x85B0(0x0110)()
	struct FSMGraphProperty                       SMGraphK2Node_GraphPropertyNode_E92FCB8D497D1C3130318095ED5DF047; // 0x86C0(0x0110)()

public:
	void SMGraphK2Node_TransitionResultNode_3AD2769A4F89B6F8E2B21898B923E208_Event_GPCharacterFSMGlobalEventSignature__DelegateSignature_1(const struct FGameplayTag& EventTag); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_3AD2769A4F89B6F8E2B21898B923E208_Event_GPCharacterFSMGlobalEventSignature__DelegateSignature(const struct FGameplayTag& EventTag); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_3AD2769A4F89B6F8E2B21898B923E208_Event_GPFSMTransitionEvent_Finish__DelegateSignature(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SMGraphK2Node_TransitionResultNode_3AD2769A4F89B6F8E2B21898B923E208_Event_GPCharacterFSMTransitionEvent__DelegateSignature_11(EGPFSMTransitionEvent EventType); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
