#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMDeviceSettings

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DFMDeviceSettings.DFMDeviceFrameDataAsset
// 0x0080 (0x00B0 - 0x0030)
class UDFMDeviceFrameDataAsset final : public UDataAsset
{
public:
	TArray<class FString>                         BlackListFor90fps;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         BlackListFor120fps;                                // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         BlackListFor144fps;                                // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         BlackListFor165fps;                                // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WhiteListFor90fps;                                 // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WhiteListFor120fps;                                // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WhiteListFor144fps;                                // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         WhiteListFor165fps;                                // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMDeviceFrameDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMDeviceFrameDataAsset")
	}
	static class UDFMDeviceFrameDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMDeviceFrameDataAsset>();
	}
};
DUMPER7_ASSERTS_UDFMDeviceFrameDataAsset;

// Class DFMDeviceSettings.DFMDeviceFrameSettings
// 0x0008 (0x0030 - 0x0028)
class UDFMDeviceFrameSettings final : public UObject
{
public:
	class UDFMDeviceFrameDataAsset*               DataAsset;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMDeviceFrameSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMDeviceFrameSettings")
	}
	static class UDFMDeviceFrameSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMDeviceFrameSettings>();
	}
};
DUMPER7_ASSERTS_UDFMDeviceFrameSettings;

}

