#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMFoliage

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DFMFoliage.EFoliageCollisionName
// NumValues: 0x0005
enum class EFoliageCollisionName : uint8
{
	FoliageCollisionName_None                = 0,
	FoliageCollisionName_AI                  = 1,
	FoliageCollisionName_Sound               = 2,
	FoliageCollisionType_Max                 = 3,
	EFoliageCollisionName_MAX                = 4,
};

// Enum DFMFoliage.EFoliageCollisionType
// NumValues: 0x0003
enum class EFoliageCollisionType : uint8
{
	FoliageCollisionType_BoundBox            = 0,
	FoliageCollisionType_Voxel               = 1,
	FoliageCollisionType_Max                 = 2,
};

// ScriptStruct DFMFoliage.FoliageData
// 0x0090 (0x0090 - 0x0000)
struct FFoliageData final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBox                                   Box;                                               // 0x0040(0x001C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             FoliageMesh;                                       // 0x0060(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFoliageData;

// ScriptStruct DFMFoliage.FoliageCollisionCategory
// 0x0058 (0x0058 - 0x0000)
struct FFoliageCollisionCategory final
{
public:
	class FName                                   Category;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<TSoftObjectPtr<class UStaticMesh>>       ImportFoliageTypes;                                // 0x0008(0x0050)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFoliageCollisionCategory;

}

