#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMFoliage

#include "Basic.hpp"

#include "DFMFoliage_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DFMFoliage.FoliageCollisionData
// 0x0490 (0x0800 - 0x0370)
class alignas(0x10) AFoliageCollisionData final : public AActor
{
public:
	EFoliageCollisionName                         Name_0;                                            // 0x0370(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFoliageCollisionType                         CollisionType;                                     // 0x0371(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_372[0x2];                                      // 0x0372(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VoxelSize;                                         // 0x0374(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VoxelNum;                                          // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawDebug;                                        // 0x037C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSneakOpt;                                         // 0x037D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37E[0x2];                                      // 0x037E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawGrassRange;                                    // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            BlockRateDistanceCurve;                            // 0x0388(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFoliageCollisionCategory>      ImportFoliage;                                     // 0x0390(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFoliageData>                   Foliages;                                          // 0x03A0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FFoliageData>                   SneakFoliages;                                     // 0x03B0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C0[0x440];                                    // 0x03C0(0x0440)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddFoliage(class UStaticMesh* FoliageMesh, const struct FTransform& Transform); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460AFBD0
	void AddFoliages(class UStaticMesh* FoliageMesh, TArray<struct FTransform>& InFoliageInstacenTransforms); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1460AFD10
	void Build(); // (Final, Native, Public, BlueprintCallable) // @ 0x1460AFE20
	void BuildAndSave(); // (Final, Native, Public, BlueprintCallable) // @ 0x1460AFE40
	void ChangeSneakOpt(bool _bSneakOpt); // (Final, Native, Public, BlueprintCallable) // @ 0x1460AFE60
	bool GetSneakOpt(); // (Final, Native, Public, BlueprintCallable) // @ 0x1460B0090
	TArray<struct FFoliageData> OverlapBound(const struct FVector& Center, const struct FVector& HalfExtent); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B01D0
	TArray<struct FFoliageData> OverlapBoundCylinder(const struct FVector& Center, float radius, float HalfHeight); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0420
	TArray<struct FIntVector> OverlapSVO(const struct FVector& Center, const struct FVector& HalfExtent); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0710
	void PreBuild(); // (Final, Native, Public, BlueprintCallable) // @ 0x1460B08A0
	bool TestBlockBound(const struct FVector& Start, const struct FVector& End); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0B00
	float TestBlockRateBound(const struct FVector& Start, const struct FVector& End); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0D20
	float TestBlockRateSVO(const struct FVector& Start, const struct FVector& End); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0E10
	bool TestBlockSVO(const struct FVector& Start, const struct FVector& End); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0F00
	bool TestOverlapBound(const struct FVector& Center, const struct FVector& HalfExtent); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B1120
	bool TestOverlapSVO(const struct FVector& Center, const struct FVector& HalfExtent); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B1210

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FoliageCollisionData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FoliageCollisionData")
	}
	static class AFoliageCollisionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFoliageCollisionData>();
	}
};
DUMPER7_ASSERTS_AFoliageCollisionData;

// Class DFMFoliage.FoliageCollision
// 0x0018 (0x0048 - 0x0030)
class UFoliageCollision final : public UWorldSubsystem
{
public:
	TArray<class AFoliageCollisionData*>          FoliageDataTable;                                  // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFoliageCollision* Inst(const class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1460B0150

	void ChangeSneakOpt(EFoliageCollisionName Name_0, bool bSneakOpt); // (Final, Native, Public, BlueprintCallable) // @ 0x1460AFEF0
	bool GetEnableState(EFoliageCollisionName Name_0, bool bStatic); // (Final, Native, Public, BlueprintCallable) // @ 0x1460AFFC0
	bool GetSneakOpt(EFoliageCollisionName Name_0); // (Final, Native, Public, BlueprintCallable) // @ 0x1460B00C0
	TArray<struct FFoliageData> OverlapBound(EFoliageCollisionName Name_0, const struct FVector& Center, const struct FVector& HalfExtent); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B02D0
	TArray<struct FFoliageData> OverlapBoundCylinder(EFoliageCollisionName Name_0, const struct FVector& Center, float radius, float HalfHeight); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0570
	void SetEnableState(EFoliageCollisionName Name_0, bool bStatic, bool bValue); // (Final, Native, Public, BlueprintCallable) // @ 0x1460B08C0
	bool TestBlock(EFoliageCollisionName Name_0, const struct FVector& Start, const struct FVector& End); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B09D0
	float TestBlockRate(EFoliageCollisionName Name_0, const struct FVector& Start, const struct FVector& End); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0BF0
	bool TestOverlap(EFoliageCollisionName Name_0, const struct FVector& Center, const struct FVector& HalfExtent); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1460B0FF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FoliageCollision")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FoliageCollision")
	}
	static class UFoliageCollision* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFoliageCollision>();
	}
};
DUMPER7_ASSERTS_UFoliageCollision;

}

