#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGlobalDefines

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_classes.hpp"
#include "GameCore_classes.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "GPUserInterfaceCore_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "GPUserInterface_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GPGameInput_structs.hpp"
#include "GPGameFlow_structs.hpp"
#include "NetworkControl_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class DFMGlobalDefines.BreakthroughTextTypeManager
// 0x0010 (0x0040 - 0x0030)
class UBreakthroughTextTypeManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BreakthroughTextTypeManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BreakthroughTextTypeManager")
	}
	static class UBreakthroughTextTypeManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBreakthroughTextTypeManager>();
	}
};
DUMPER7_ASSERTS_UBreakthroughTextTypeManager;

// Class DFMGlobalDefines.ItemCoreUtil
// 0x0000 (0x0028 - 0x0028)
class UItemCoreUtil final : public UObject
{
public:
	static bool IsGoldNest(const uint64& ItemID); // (Final, Native, Static, Public, HasOutParams) // @ 0x1498A9C50

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemCoreUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemCoreUtil")
	}
	static class UItemCoreUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemCoreUtil>();
	}
};
DUMPER7_ASSERTS_UItemCoreUtil;

// Class DFMGlobalDefines.DFMLoadingManager
// 0x0018 (0x0040 - 0x0028)
class UDFMLoadingManager : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnStopLoading;                                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMLoadingManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMLoadingManager")
	}
	static class UDFMLoadingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMLoadingManager>();
	}
};
DUMPER7_ASSERTS_UDFMLoadingManager;

// Class DFMGlobalDefines.DFStreamMediaImage
// 0x00F8 (0x03C0 - 0x02C8)
class UDFStreamMediaImage final : public UImage
{
public:
	class FName                                   MediaName;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayNativeSound;                                  // 0x02D0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x02D1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayOnLoad;                                       // 0x02D2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaPlayMode                                PlayMode;                                          // 0x02D3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           MediaPlayer;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaTexture*                          MediaTexture;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurVolume;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaOpened;                    // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaPlayBegin;                 // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMediaPlayEnd;                                    // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(ESlateVisibility Status, const class FString& Subtitles)> OnSubtitlesSync; // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x50];                                     // 0x0330(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0380(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBinkMediaSrt*                          CurSubtitle;                                       // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_390[0x30];                                     // 0x0390(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckAudioSync(); // (Final, Native, Public) // @ 0x1498983C0
	void ClearMemory(); // (Final, Native, Public) // @ 0x1498983E0
	void DealWithNetworkControl(const ENetworkControlType& NetworkControlType, bool ControlNetworkOrNot); // (Final, Native, Public, HasOutParams) // @ 0x149898400
	int32 GetCurMediaTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898660
	class FString GetCurrentUrl(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898750
	int32 GetTotalTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898A10
	void InitDataByName(const class FName& MediaConfigRowName); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x149898B90
	bool IsPaused(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898C80
	bool IsPlaying(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898CE0
	void MediaOpened(const class FString& OpenedUrl); // (Final, Native, Public) // @ 0x149899040
	void MediaPlayEnd(); // (Final, Native, Public) // @ 0x149899160
	void OnMediaAudioPlayBegin(const class FName& AudioName); // (Final, Native, Public, HasOutParams) // @ 0x1498991A0
	void OnProcessEnterGameFlowStage(EGameFlowStageType InGameFlowStage); // (Final, Native, Public) // @ 0x149899230
	void OnSubTitleAssetLoaded(); // (Final, Native, Private) // @ 0x1498992B0
	void Pause(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899610
	void Play(const class FString& MediaConfigRowName); // (Final, Native, Public, BlueprintCallable) // @ 0x1498996F0
	void Resume(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899810
	void SeekTo(int32 TargetTime); // (Final, Native, Public, BlueprintCallable) // @ 0x1498998B0
	void SetVolume(const float InVolume); // (Final, Native, Public, BlueprintCallable) // @ 0x149899A80
	void SetVolumeFromConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899B00
	void StopMedia(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899BA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFStreamMediaImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFStreamMediaImage")
	}
	static class UDFStreamMediaImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFStreamMediaImage>();
	}
};
DUMPER7_ASSERTS_UDFStreamMediaImage;

// Class DFMGlobalDefines.DFMGameSingletonAttribute
// 0x0000 (0x0028 - 0x0028)
class UDFMGameSingletonAttribute : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameSingletonAttribute")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameSingletonAttribute")
	}
	static class UDFMGameSingletonAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameSingletonAttribute>();
	}
};
DUMPER7_ASSERTS_UDFMGameSingletonAttribute;

// Class DFMGlobalDefines.BreakthroughUIColorDataManager
// 0x0010 (0x0040 - 0x0030)
class UBreakthroughUIColorDataManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BreakthroughUIColorDataManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BreakthroughUIColorDataManager")
	}
	static class UBreakthroughUIColorDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBreakthroughUIColorDataManager>();
	}
};
DUMPER7_ASSERTS_UBreakthroughUIColorDataManager;

// Class DFMGlobalDefines.BreakthroughUIIconDataManager
// 0x0010 (0x0040 - 0x0030)
class UBreakthroughUIIconDataManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BreakthroughUIIconDataManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BreakthroughUIIconDataManager")
	}
	static class UBreakthroughUIIconDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBreakthroughUIIconDataManager>();
	}
};
DUMPER7_ASSERTS_UBreakthroughUIIconDataManager;

// Class DFMGlobalDefines.BattleFieldSectorAnchorIconManager
// 0x0010 (0x0040 - 0x0030)
class UBattleFieldSectorAnchorIconManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleFieldSectorAnchorIconManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleFieldSectorAnchorIconManager")
	}
	static class UBattleFieldSectorAnchorIconManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleFieldSectorAnchorIconManager>();
	}
};
DUMPER7_ASSERTS_UBattleFieldSectorAnchorIconManager;

// Class DFMGlobalDefines.BreakthroughUIConfig
// 0x0000 (0x0028 - 0x0028)
class UBreakthroughUIConfig final : public UObject
{
public:
	static struct FLinearColor GetColorByType(EBreakthroughUIColorType InColorType); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14987BF40
	static struct FSoftObjectPath GetIconPathByType(EBreakthroughUIIconType InIconType); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14987BFC0
	static struct FSoftObjectPath GetSameTeamIconByTeamID(const int32 InTeamId, bool bVehicle); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14987C050
	static struct FSoftObjectPath GetSameTeamIconByTeamIDSelfRoom(const int32 InTeamId, bool bVehicle); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14987C120
	static struct FSoftObjectPath GetSectorAnchorIconByName(const class FName& InSectorAnchorString); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14987C1F0
	static struct FSoftObjectPath GetTeamIconByTeamID(const int32 InTeamId); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14987C290
	static struct FSoftObjectPath GetTeamIconByTeamIDSelfRoom(const int32 InTeamId); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14987C320
	static class FName GetTextStyleByType(EBreakthroughTextType InTextType); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14987C3B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BreakthroughUIConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BreakthroughUIConfig")
	}
	static class UBreakthroughUIConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBreakthroughUIConfig>();
	}
};
DUMPER7_ASSERTS_UBreakthroughUIConfig;

// Class DFMGlobalDefines.CarrayItemsDataMgr
// 0x0010 (0x0040 - 0x0030)
class UCarrayItemsDataMgr final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CarrayItemsDataMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CarrayItemsDataMgr")
	}
	static class UCarrayItemsDataMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCarrayItemsDataMgr>();
	}
};
DUMPER7_ASSERTS_UCarrayItemsDataMgr;

// Class DFMGlobalDefines.CarrayItem_HealArmorConfigDataMgr
// 0x0010 (0x0040 - 0x0030)
class UCarrayItem_HealArmorConfigDataMgr final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CarrayItem_HealArmorConfigDataMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CarrayItem_HealArmorConfigDataMgr")
	}
	static class UCarrayItem_HealArmorConfigDataMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCarrayItem_HealArmorConfigDataMgr>();
	}
};
DUMPER7_ASSERTS_UCarrayItem_HealArmorConfigDataMgr;

// Class DFMGlobalDefines.CharacterBodyPartMeshStatics
// 0x0000 (0x0028 - 0x0028)
class UCharacterBodyPartMeshStatics final : public UObject
{
public:
	static void SetMeshByConfig(class UMeshComponent* Mesh, class FName Name_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149880900

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterBodyPartMeshStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterBodyPartMeshStatics")
	}
	static class UCharacterBodyPartMeshStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterBodyPartMeshStatics>();
	}
};
DUMPER7_ASSERTS_UCharacterBodyPartMeshStatics;

// Class DFMGlobalDefines.CharacterHeroResourceTracingLineManager
// 0x0010 (0x0040 - 0x0030)
class UCharacterHeroResourceTracingLineManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterHeroResourceTracingLineManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterHeroResourceTracingLineManager")
	}
	static class UCharacterHeroResourceTracingLineManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterHeroResourceTracingLineManager>();
	}
};
DUMPER7_ASSERTS_UCharacterHeroResourceTracingLineManager;

// Class DFMGlobalDefines.CollectionRoomConstantWrap
// 0x0000 (0x0028 - 0x0028)
class UCollectionRoomConstantWrap final : public UObject
{
public:
	static class FName GetConstantByName(class FName ConstantName); // (Final, Native, Static, Public) // @ 0x14988B290

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CollectionRoomConstantWrap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CollectionRoomConstantWrap")
	}
	static class UCollectionRoomConstantWrap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionRoomConstantWrap>();
	}
};
DUMPER7_ASSERTS_UCollectionRoomConstantWrap;

// Class DFMGlobalDefines.CollectionRoomLimitedCollectionWrap
// 0x0000 (0x0028 - 0x0028)
class UCollectionRoomLimitedCollectionWrap final : public UObject
{
public:
	static struct FVector GetLocationByItemID(class FName ItemID); // (Final, Native, Static, Public, HasDefaults) // @ 0x14988B320
	static struct FRotator GetRotatorByItemID(class FName ItemID); // (Final, Native, Static, Public, HasDefaults) // @ 0x14988B3B0
	static struct FVector GetScaleByItemID(class FName ItemID); // (Final, Native, Static, Public, HasDefaults) // @ 0x14988B440

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CollectionRoomLimitedCollectionWrap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CollectionRoomLimitedCollectionWrap")
	}
	static class UCollectionRoomLimitedCollectionWrap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionRoomLimitedCollectionWrap>();
	}
};
DUMPER7_ASSERTS_UCollectionRoomLimitedCollectionWrap;

// Class DFMGlobalDefines.GPCollectionWeaponDataConfig
// 0x0058 (0x0088 - 0x0030)
class UGPCollectionWeaponDataConfig final : public UWorldSubsystem
{
public:
	TMap<class FName, class UDataTable*>          CollectionWeaponDataTable;                         // 0x0030(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGPCollectionWeaponDataConfig* Get(const class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14988B1D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPCollectionWeaponDataConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPCollectionWeaponDataConfig")
	}
	static class UGPCollectionWeaponDataConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPCollectionWeaponDataConfig>();
	}
};
DUMPER7_ASSERTS_UGPCollectionWeaponDataConfig;

// Class DFMGlobalDefines.CSVChangeUtil
// 0x0000 (0x0370 - 0x0370)
class ACSVChangeUtil final : public AActor
{
public:
	static void RefreshTableFromCSV(const class UDataTable* DataTable, const class FString& CSVFileName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149894F90
	static void SaveStringToCSV(const TArray<class FString>& str, const class FString& CSVFileName, bool Append); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1498951B0
	static void SaveTableToCSV(const class UDataTable* DataTable, const class FString& CSVFileName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149895390

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CSVChangeUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CSVChangeUtil")
	}
	static class ACSVChangeUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACSVChangeUtil>();
	}
};
DUMPER7_ASSERTS_ACSVChangeUtil;

// Class DFMGlobalDefines.CustomListView
// 0x0000 (0x03B8 - 0x03B8)
class UCustomListView final : public UDFCustomListView
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomListView")
	}
	static class UCustomListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomListView>();
	}
};
DUMPER7_ASSERTS_UCustomListView;

// Class DFMGlobalDefines.DataTableRuntimeUtil
// 0x0010 (0x0038 - 0x0028)
class UDataTableRuntimeUtil final : public UObject
{
public:
	TArray<class FString>                         AllowSplitTables;                                  // 0x0028(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class FString CSVDir(); // (Final, Native, Static, Public) // @ 0x149894190
	static class FString DataTableDir(); // (Final, Native, Static, Public) // @ 0x149894230
	static void RefeshDataTableFromCSV(const class UDataTable* DataTable, const class FString& CSVFileName); // (Final, Native, Static, Public) // @ 0x149894EA0
	static void SaveDataTableToCSV(const class UDataTable* DataTable, const class FString& CSVFileName); // (Final, Native, Static, Public) // @ 0x1498950C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableRuntimeUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableRuntimeUtil")
	}
	static class UDataTableRuntimeUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataTableRuntimeUtil>();
	}
};
DUMPER7_ASSERTS_UDataTableRuntimeUtil;

// Class DFMGlobalDefines.DFCustomerServiceLibrary
// 0x0000 (0x0028 - 0x0028)
class UDFCustomerServiceLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FName GetEntranceName(ECustomerServicesEntranceType EntranceType); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149894430
	static int32 GetSupportPlatforms(const class FString& SupportPlatformStr); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1498944E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFCustomerServiceLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCustomerServiceLibrary")
	}
	static class UDFCustomerServiceLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCustomerServiceLibrary>();
	}
};
DUMPER7_ASSERTS_UDFCustomerServiceLibrary;

// Class DFMGlobalDefines.DFMButton
// 0x0000 (0x0498 - 0x0498)
class UDFMButton final : public UButton
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMButton")
	}
	static class UDFMButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMButton>();
	}
};
DUMPER7_ASSERTS_UDFMButton;

// Class DFMGlobalDefines.CharacterAmbientLightGroupDataManager
// 0x0008 (0x0038 - 0x0030)
class UCharacterAmbientLightGroupDataManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterAmbientLightGroupDataManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterAmbientLightGroupDataManager")
	}
	static class UCharacterAmbientLightGroupDataManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterAmbientLightGroupDataManager>();
	}
};
DUMPER7_ASSERTS_UCharacterAmbientLightGroupDataManager;

// Class DFMGlobalDefines.DFMColorDefineBlueprintHelper
// 0x0000 (0x0028 - 0x0028)
class UDFMColorDefineBlueprintHelper final : public UBlueprintFunctionLibrary
{
public:
	static struct FDFMColorDefineRow GetColorByQualityId(int32 ID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1498942B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMColorDefineBlueprintHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMColorDefineBlueprintHelper")
	}
	static class UDFMColorDefineBlueprintHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMColorDefineBlueprintHelper>();
	}
};
DUMPER7_ASSERTS_UDFMColorDefineBlueprintHelper;

// Class DFMGlobalDefines.DFMCommonButton
// 0x0008 (0x04A0 - 0x0498)
class UDFMCommonButton final : public UButton
{
public:
	class FName                                   DefaultClickSound;                                 // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CloseDefaultSound(); // (Final, Native, Public, BlueprintCallable) // @ 0x149894210
	void OnPlayDefaultSound(); // (Final, Native, Private) // @ 0x149894AA0
	void OverLoadSound(const class FString& InSoundName); // (Final, Native, Public, BlueprintCallable) // @ 0x149894BB0
	void SetOpenDefaultSound(const bool bIsOpen); // (Final, Native, Public, BlueprintCallable) // @ 0x149895590

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMCommonButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMCommonButton")
	}
	static class UDFMCommonButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMCommonButton>();
	}
};
DUMPER7_ASSERTS_UDFMCommonButton;

// Class DFMGlobalDefines.DFMCommonHover
// 0x00B8 (0x03A8 - 0x02F0)
class UDFMCommonHover : public UUserWidget
{
public:
	ECommonHoverExtMode                           ExtensionMode;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonHoverStyleMode                         StyleMode;                                         // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFreeAnalogCursorHideFocusContentRoot;         // 0x02F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHoverEnabled;                                     // 0x02F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUserWidgetEvent;                               // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHoverSoundEnabled;                                // 0x02F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResponseClick;                                    // 0x02F6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoverNodeEffetApplyType                      NodeEffectApplyType;                               // 0x02F7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WidgetPath;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            HoverdScaleCurve;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparatedUnhoverCurve;                            // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            UnhoverdScaleCurve;                                // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocusLoopAnimDelay;                                // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPUIFocusEffectType                          FocusEffectType;                                   // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBPHovered;                                       // 0x0328(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBPUnhovered;                                     // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Bindable;                                          // 0x0350(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULuaUIBaseView*                         BindView;                                          // 0x0358(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                EffectApplyNode;                                   // 0x0360(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x10];                                     // 0x0368(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                HoverContentRoot;                                  // 0x0378(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                FocusContentRoot;                                  // 0x0380(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                ClickContentRoot;                                  // 0x0388(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_390[0x18];                                     // 0x0390(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindHoverEvents(); // (Final, Native, Public, BlueprintCallable) // @ 0x149894170
	void HandleInputTypeChanged(EGPInputType InInputType); // (Final, Native, Protected) // @ 0x149894630
	void OnHandleFocusLost(const struct FFocusEvent& InFocusEvent); // (Final, Native, Protected, HasOutParams) // @ 0x1498948B0
	void OnHandleFocusReceived(const struct FGeometry& InGeometry, const struct FFocusEvent& InFocusEvent); // (Final, Native, Protected, HasOutParams) // @ 0x149894950
	void OnHovered(); // (Final, Native, Protected) // @ 0x149894A60
	void OnParentHoverd(); // (Native, Event, Public, BlueprintEvent) // @ 0x141FA6350
	void OnParentPressed(); // (Native, Event, Public, BlueprintEvent) // @ 0x141FA6370
	void OnParentReleased(); // (Native, Event, Public, BlueprintEvent) // @ 0x142BE7B10
	void OnParentUnhoverd(); // (Native, Event, Public, BlueprintEvent) // @ 0x141FA6390
	void OnPressed(); // (Final, Native, Protected) // @ 0x149894AC0
	void OnProcessEnableStyleChanged(bool bInActivated); // (Final, Native, Protected) // @ 0x149894AE0
	void OnReleased(); // (Final, Native, Protected) // @ 0x149894B70
	void OnUnhovered(); // (Final, Native, Protected) // @ 0x149894B90
	class UUMGSequencePlayer* PlayAutoAnimation(class FName AnimationName, int32 NumberOfLoops, EUMGSequencePlayMode PlayMode, bool bJumpToEnd); // (Final, Native, Protected, BlueprintCallable) // @ 0x149894D50
	void SetHideFreeAnalogCursorHideFocusContentRoot(bool InHideFreeAnalogCursorHideFocusContentRoot); // (Final, Native, Public) // @ 0x149895500
	void StopAutoAnimation(class FName AnimationName); // (Final, Native, Protected, BlueprintCallable) // @ 0x1498956C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMCommonHover")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMCommonHover")
	}
	static class UDFMCommonHover* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMCommonHover>();
	}
};
DUMPER7_ASSERTS_UDFMCommonHover;

// Class DFMGlobalDefines.DFMCommonImage
// 0x0000 (0x0338 - 0x0338)
class UDFMCommonImage : public UDFImage
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMCommonImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMCommonImage")
	}
	static class UDFMCommonImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMCommonImage>();
	}
};
DUMPER7_ASSERTS_UDFMCommonImage;

// Class DFMGlobalDefines.DFMCommonMediaImage
// 0x00A8 (0x0370 - 0x02C8)
class UDFMCommonMediaImage final : public UImage
{
public:
	class FName                                   MediaName;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBinkMediaPlayer*                       MediaPlayer;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialBase;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateMaterialInstanceDynamic;                    // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoMatchMediaSize;                               // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayNativeSound;                                  // 0x02EA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x02EB(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayOnLoad;                                       // 0x02EC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TextureShowTime;                                   // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaPlayMode                                PlayMode;                                          // 0x02F4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurVolume;                                         // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaOpened;                    // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaPlayBegin;                 // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMediaPlayEnd;                                    // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x40];                                     // 0x0330(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetCurMediaTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x149894380
	class FString GetCurrentUrl(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498943B0
	int32 GetTotalTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x149894600
	void InitDataByName(const class FName& MediaConfigRowName); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1498946B0
	bool IsPlaying(); // (Final, Native, Public, BlueprintCallable) // @ 0x149894740
	void MediaOpened(const class FString& OpenedUrl); // (Final, Native, Private) // @ 0x149894770
	void MediaPlayEnd(); // (Final, Native, Private) // @ 0x149894890
	void OnLegacyTextureShowEnd(); // (Final, Native, Private) // @ 0x149894A80
	void Pause(); // (Final, Native, Public, BlueprintCallable) // @ 0x149894C70
	void Play(const class FString& MediaConfigRowName); // (Final, Native, Public, BlueprintCallable) // @ 0x149894C90
	void Resume(); // (Final, Native, Public, BlueprintCallable) // @ 0x149895080
	void SafeCloseMedia(); // (Final, Native, Public) // @ 0x1498950A0
	void SeekTo(int32 TargetTime); // (Final, Native, Public, BlueprintCallable) // @ 0x149895480
	void SetVolume(const float InVolume); // (Final, Native, Public, BlueprintCallable) // @ 0x149895620
	void SetVolumeFromConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498956A0
	void StopMedia(); // (Final, Native, Public, BlueprintCallable) // @ 0x149895740

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMCommonMediaImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMCommonMediaImage")
	}
	static class UDFMCommonMediaImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMCommonMediaImage>();
	}
};
DUMPER7_ASSERTS_UDFMCommonMediaImage;

// Class DFMGlobalDefines.DFMGameSingleton
// 0x0020 (0x0048 - 0x0028)
class UDFMGameSingleton : public UObject
{
public:
	TArray<class UDFMGameSingletonAttribute*>     SingletonAttributes;                               // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UDFMGameSingletonAttribute>> SingletonAttributeClassArray;              // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameSingleton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameSingleton")
	}
	static class UDFMGameSingleton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameSingleton>();
	}
};
DUMPER7_ASSERTS_UDFMGameSingleton;

// Class DFMGlobalDefines.DFMImage
// 0x0230 (0x0568 - 0x0338)
class UDFMImage final : public UDFMCommonImage
{
public:
	TMulticastInlineDelegate<void(DFMGlobalDefines::EIconState IconState)> OnIconStateChange;        // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UDFMImage* DFMImage, class URuntimeTile* Tile)> OnIconLoaded; // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector2D& DFMImageSize)> OnIconSizeChange;           // 0x0358(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_368[0x10];                                     // 0x0368(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFMImageParam                         DFMImageParam;                                     // 0x0378(0x0178)(NativeAccessSpecifierPublic)
	uint8                                         Pad_4F0[0x8];                                      // 0x04F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               RTIDefaultTexture;                                 // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_500[0x18];                                     // 0x0500(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeTile*                           Tile;                                              // 0x0518(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               IconDynamicMaterial;                               // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_528[0x8];                                      // 0x0528(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFMImageLoadingWidget*                 SlotCompIconFX_Loading_Widget;                     // 0x0530(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                            DebugTextWidget;                                   // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetSwitcher*                        WidgetSwitcher_Debug;                              // 0x0540(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Text_Debug;                                        // 0x0548(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Image_DontMerge;                                   // 0x0550(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Image_Merge;                                       // 0x0558(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             Text_Merge;                                        // 0x0560(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool IsRotated(); // (Final, Native, Public) // @ 0x149898D10
	void SetRotated(bool InRotated); // (Final, Native, Public) // @ 0x149899930

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMImage")
	}
	static class UDFMImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMImage>();
	}
};
DUMPER7_ASSERTS_UDFMImage;

// Class DFMGlobalDefines.DFMImageLoadingWidget
// 0x0008 (0x02F8 - 0x02F0)
class UDFMImageLoadingWidget : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x8];                                      // 0x02F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnIconSizeChange(const struct FVector2D& GridSize); // (Event, Protected, HasDefaults, BlueprintEvent) // @ 0x14B5B5E20
	void PlayLoadingAnim(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498997B0
	void PlayLoadingAnim_BP(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void StopLoadingAnim(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899B60
	void StopLoadingAnim_BP(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMImageLoadingWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMImageLoadingWidget")
	}
	static class UDFMImageLoadingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMImageLoadingWidget>();
	}
};
DUMPER7_ASSERTS_UDFMImageLoadingWidget;

// Class DFMGlobalDefines.DFMSDKWebBrowserWidget
// 0x0070 (0x01C0 - 0x0150)
class UDFMSDKWebBrowserWidget final : public UWidget
{
public:
	uint8                                         Pad_150[0x10];                                     // 0x0150(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowControls;                                     // 0x0160(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsTransparency;                             // 0x0161(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMouseTransparency;                                // 0x0162(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_163[0x1];                                      // 0x0163(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransparencyThreadshold;                           // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowInitialThrobber;                              // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FText& Text)> OnUrlChanged;                            // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& URL, const class FString& Frame)> OnBeforePopup; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Param)> OnCallback;                           // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadError;                                       // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadCompleted;                                   // 0x01B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	bool CanGoBack(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898360
	bool CanGoForward(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898390
	void ExecuteJavascript(const class FString& ScriptText); // (Final, Native, Public, BlueprintCallable) // @ 0x1498984D0
	float GetSystemDPIScaleFactor(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898930
	class FString GetTitleText(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898960
	void GoBack(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898AC0
	void GoForward(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898AE0
	void LoadString(const class FString& Contents, const class FString& DummyURL); // (Final, Native, Public, BlueprintCallable) // @ 0x149898D40
	void LoadURL(const class FString& URL); // (Final, Native, Public, BlueprintCallable) // @ 0x149898F20
	void OnWebBrowserCallback(const class FString& Param); // (Final, Native, Public, BlueprintCallable) // @ 0x1498992F0
	void Reload(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498997D0
	void StopLoad(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899B40

	class FText GetAddressBarUrlText() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149898590
	class FString GetUrl() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149898A40
	bool IsLoaded() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149898C20
	bool IsLoading() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149898C50

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMSDKWebBrowserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMSDKWebBrowserWidget")
	}
	static class UDFMSDKWebBrowserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMSDKWebBrowserWidget>();
	}
};
DUMPER7_ASSERTS_UDFMSDKWebBrowserWidget;

// Class DFMGlobalDefines.DFMTextBlock
// 0x0000 (0x03A8 - 0x03A8)
class UDFMTextBlock final : public UDFTextBlock
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMTextBlock")
	}
	static class UDFMTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMTextBlock>();
	}
};
DUMPER7_ASSERTS_UDFMTextBlock;

// Class DFMGlobalDefines.DFMWebMediaPlayer
// 0x00A8 (0x01F8 - 0x0150)
class UDFMWebMediaPlayer final : public UWidget
{
public:
	class FName                                   MediaName;                                         // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayNativeSound;                                  // 0x0158(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0159(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayOnLoad;                                       // 0x015A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMediaPlayMode                                PlayMode;                                          // 0x015B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4C];                                     // 0x015C(0x004C)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaOpened;                    // 0x01A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaPlayBegin;                 // 0x01B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMediaPlayEnd;                                    // 0x01C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D8[0x20];                                     // 0x01D8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetCurMediaTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898630
	class FString GetCurrentUrl(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498986D0
	int32 GetTotalTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498989E0
	void InitDataByName(const class FName& MediaConfigRowName); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x149898B00
	bool IsPlaying(); // (Final, Native, Public, BlueprintCallable) // @ 0x149898CB0
	void OnWebMediaFunctionCall(const class FString& Function, const class FString& Params_0); // (Final, Native, Public, BlueprintCallable) // @ 0x149899410
	void Pause(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498995F0
	void Play(const class FString& MediaConfigRowName); // (Final, Native, Public, BlueprintCallable) // @ 0x149899630
	void Resume(); // (Final, Native, Public, BlueprintCallable) // @ 0x1498997F0
	void SeekTo(int32 TargetTime); // (Final, Native, Public, BlueprintCallable) // @ 0x149899830
	void StopCurMedia(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899B20
	void StopMedia(); // (Final, Native, Public, BlueprintCallable) // @ 0x149899B80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMWebMediaPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMWebMediaPlayer")
	}
	static class UDFMWebMediaPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMWebMediaPlayer>();
	}
};
DUMPER7_ASSERTS_UDFMWebMediaPlayer;

// Class DFMGlobalDefines.DFPermissionConfigLibrary
// 0x0000 (0x0028 - 0x0028)
class UDFPermissionConfigLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetSupportPlatforms(const class FString& SupportPlatformStr); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149898810

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFPermissionConfigLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFPermissionConfigLibrary")
	}
	static class UDFPermissionConfigLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFPermissionConfigLibrary>();
	}
};
DUMPER7_ASSERTS_UDFPermissionConfigLibrary;

// Class DFMGlobalDefines.DFRouletteBaseView
// 0x0038 (0x0640 - 0x0608)
class UDFRouletteBaseView final : public ULuaUIBaseView
{
public:
	float                                         RadiusFactor;                                      // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableDynamicCenter;                               // 0x060C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseHoverAnim;                                      // 0x060D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60E[0x2];                                      // 0x060E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DynamicCenter;                                     // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CurPressedPosition;                                // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_620[0x1];                                      // 0x0620(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableHoverEffect;                                // 0x0621(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_622[0x6];                                      // 0x0622(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 HoverEffect;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       Hover;                                             // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       UnHover;                                           // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static float CalculateAngle(const struct FVector2D& InVecA, const struct FVector2D& InVecB); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x149898280

	struct FVector2D GetCurPressedLocation(); // (Final, Native, Public, HasDefaults) // @ 0x149898690
	struct FVector2D GetPressedStartLocation(); // (Final, Native, Public, HasDefaults) // @ 0x1498987D0
	void OnHovered(); // (Final, Native, Public) // @ 0x149899180
	void OnUnhovered(); // (Final, Native, Public) // @ 0x1498992D0
	void SetRouletteHoverAndSliderAngle(float InSelectAngle, float InSliderAngle); // (Final, Native, Public) // @ 0x1498999C0
	void UpdateDragOffset(); // (Final, Native, Public) // @ 0x149899BC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFRouletteBaseView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFRouletteBaseView")
	}
	static class UDFRouletteBaseView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFRouletteBaseView>();
	}
};
DUMPER7_ASSERTS_UDFRouletteBaseView;

// Class DFMGlobalDefines.BagFuncManager
// 0x0010 (0x0040 - 0x0030)
class UBagFuncManager final : public UDataTableSystemManagerBase
{
