#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGameLoading

#include "Basic.hpp"

#include "GPGameFlow_structs.hpp"
#include "GameCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DFMGameHud_structs.hpp"


namespace SDK
{

// Enum DFMGameLoading.EFlowResult
// NumValues: 0x0005
enum class EFlowResult : uint8
{
	EFR_None                                 = 0,
	EFR_Success                              = 1,
	EFR_Failed                               = 2,
	ERF_TimeOut                              = 3,
	EFlowResult_MAX                          = 4,
};

// Enum DFMGameLoading.ELoadingTypeInner
// NumValues: 0x0005
enum class ELoadingTypeInner : uint8
{
	LT_None                                  = 0,
	LT_LoadingMapPreLoading                  = 1,
	LT_LoadingMapPostLoading                 = 2,
	LT_TargetMapPostLoading                  = 3,
	LT_MAX                                   = 4,
};

// Enum DFMGameLoading.EMapLoadStage
// NumValues: 0x0006
enum class EMapLoadStage : uint8
{
	MLS_None                                 = 0,
	MLS_LoadingMapPreLoad                    = 1,
	MLS_LoadingMapPostLoad                   = 2,
	MLS_TargetMapPreLoad                     = 3,
	MLS_TargetMapPostLoad                    = 4,
	MLS_MAX                                  = 5,
};

// Enum DFMGameLoading.EFlowStatus
// NumValues: 0x0004
enum class EFlowStatus : uint8
{
	EFS_None                                 = 0,
	EFS_Running                              = 1,
	EFS_Finish                               = 2,
	EFS_MAX                                  = 3,
};

// Enum DFMGameLoading.ELoadingType
// NumValues: 0x0004
enum class ELoadingType : uint8
{
	LT_None                                  = 0,
	LT_LoadingMapLoading                     = 1,
	LT_TargetMapLoading                      = 2,
	LT_MAX                                   = 3,
};

// ScriptStruct DFMGameLoading.LoadingNetFailureRow
// 0x0038 (0x0048 - 0x0010)
struct FLoadingNetFailureRow final : public FDescRowBase
{
public:
	ENetworkFailure                               NetWorkFailureType;                                // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TypeName;                                          // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayErrorText;                                  // 0x0028(0x0018)(Edit, NativeAccessSpecifierPublic)
	uint32                                        ErrorCode;                                         // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadingNetFailureRow;

// ScriptStruct DFMGameLoading.LoadingTravelFailureRow
// 0x0038 (0x0048 - 0x0010)
struct FLoadingTravelFailureRow final : public FDescRowBase
{
public:
	ETravelFailure                                TravelFailureType;                                 // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TypeName;                                          // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayErrorText;                                  // 0x0028(0x0018)(Edit, NativeAccessSpecifierPublic)
	uint32                                        ErrorCode;                                         // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadingTravelFailureRow;

// ScriptStruct DFMGameLoading.LoadingContext
// 0x0010 (0x0010 - 0x0000)
struct FLoadingContext final
{
public:
	int32                                         LevelMapID;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        DSRoomId;                                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadingContext;

// ScriptStruct DFMGameLoading.OpenLevelParameters
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FOpenLevelParameters final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOpenLevelParameters;

// ScriptStruct DFMGameLoading.LoadingFlowContext
// 0x0002 (0x0002 - 0x0000)
struct FLoadingFlowContext final
{
public:
	uint8                                         Pad_0[0x2];                                        // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadingFlowContext;

// ScriptStruct DFMGameLoading.RunningFlowContext
// 0x0040 (0x0040 - 0x0000)
struct FRunningFlowContext final
{
public:
	class UDFMFlowBase*                           RunningMainFlow;                                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDFMSubFlowBase*>                RunningSubFlows;                                   // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x4];                                       // 0x0018(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ELoadingTypeInner                             LoadingType;                                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFlowResult                                   MainFlowResult;                                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProgressStart;                                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProgressEnd;                                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(ELoadingTypeInner LoadingType, EFlowResult FlowResult)> OnLoadingMainFlowFinished; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRunningFlowContext;

// ScriptStruct DFMGameLoading.LoadingGameFlowPreLoadData
// 0x0020 (0x0020 - 0x0000)
struct FLoadingGameFlowPreLoadData final
{
public:
	EGameFlowStageType                            TargetGameFlow;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                PendingLoadRes;                                    // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ELoadingDestination                           TargetDestination;                                 // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadingGameFlowPreLoadData;

// ScriptStruct DFMGameLoading.LoadingGameFlowStageConfig
// 0x0018 (0x0020 - 0x0008)
struct FLoadingGameFlowStageConfig final : public FTableRowBase
{
public:
	EGameFlowStageType                            CurFlowType;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLoadingGameFlowPreLoadData>    PreloadData;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadingGameFlowStageConfig;

// ScriptStruct DFMGameLoading.LoadingSubFlowTypeConfig
// 0x0020 (0x0020 - 0x0000)
struct FLoadingSubFlowTypeConfig final
{
public:
	TSubclassOf<class UDFMSubFlowBase>            DFMFlowType;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlowWeight;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeLimits;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FlowParam;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadingSubFlowTypeConfig;

// ScriptStruct DFMGameLoading.LoadingFlowTypeConfig
// 0x0038 (0x0038 - 0x0000)
struct FLoadingFlowTypeConfig final
{
public:
	TSubclassOf<class UDFMFlowBase>               DFMFlowType;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlowWeight;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTimeLimits;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FlowParam;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAsyncCheckableSubFlow;                          // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLoadingSubFlowTypeConfig>      SubFlows;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadingFlowTypeConfig;

// ScriptStruct DFMGameLoading.InnerLoadingFlowStep
// 0x0020 (0x0020 - 0x0000)
struct FInnerLoadingFlowStep final
{
public:
	ELoadingTypeInner                             LoadingType;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLoadingFlowTypeConfig>         LoadingFlowTypeConfigs;                            // 0x0008(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	float                                         FlowStepProgressRangeEnd;                          // 0x0018(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FInnerLoadingFlowStep;

// ScriptStruct DFMGameLoading.LoadingFlowStep
// 0x0018 (0x0018 - 0x0000)
struct FLoadingFlowStep final
{
public:
	TArray<struct FLoadingFlowTypeConfig>         LoadingFlowTypeConfigs;                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	float                                         FlowStepProgressRangeEnd;                          // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadingFlowStep;

// ScriptStruct DFMGameLoading.LoadingFlowSteps
// 0x0048 (0x0048 - 0x0000)
struct FLoadingFlowSteps final
{
public:
	struct FLoadingFlowStep                       LoadingLevelFlowSteps;                             // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FLoadingFlowStep                       OpenTargetLevelFlowSteps;                          // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	struct FLoadingFlowStep                       TargetLevelFlowSteps;                              // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadingFlowSteps;

}

