#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGameLaunch

#include "Basic.hpp"

#include "DFMGameSDK_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DFMGameLaunch_structs.hpp"


namespace SDK
{

// Class DFMGameLaunch.DFBHDSubEnergyController
// 0x0008 (0x0030 - 0x0028)
class UDFBHDSubEnergyController : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBHDSubEnergyController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBHDSubEnergyController")
	}
	static class UDFBHDSubEnergyController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBHDSubEnergyController>();
	}
};
DUMPER7_ASSERTS_UDFBHDSubEnergyController;

// Class DFMGameLaunch.DFBHDMemoryController
// 0x00A0 (0x00D0 - 0x0030)
class UDFBHDMemoryController final : public UDFBHDSubEnergyController
{
public:
	TMulticastInlineDelegate<void(bool bMinimize)> OnMinimizeSwapchainStateChanged;                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x40];                                      // 0x0040(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHandleBinLock;                                    // 0x0080(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandleWorkingSet;                                 // 0x0081(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandlePSO;                                        // 0x0082(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMinimizeSwapchainSize;                            // 0x0083(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntPoint                              MinSwapchainSize;                                  // 0x0084(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReleaseRenderResource;                            // 0x008C(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ETextureGroup>                         TextureGroupsToRelease;                            // 0x0090(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         OverrideResourceCVars;                             // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bDisableGC;                                        // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LongGCTime;                                        // 0x00B4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLoopClearWorkingSet;                              // 0x00B8(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CheckWorkingSetDuration;                           // 0x00C0(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         WorkingSetThresholdMB;                             // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMemreport;                                        // 0x00CC(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHideWindow;                                       // 0x00CD(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBHDMemoryController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBHDMemoryController")
	}
	static class UDFBHDMemoryController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBHDMemoryController>();
	}
};
DUMPER7_ASSERTS_UDFBHDMemoryController;

// Class DFMGameLaunch.DFBHDCPUController
// 0x00C8 (0x00F8 - 0x0030)
class UDFBHDCPUController final : public UDFBHDSubEnergyController
{
public:
	TMulticastInlineDelegate<void(bool bLimited)> OnFPSLimitStateChanged;                            // 0x0030(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x68];                                      // 0x0040(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MsUnit;                                            // 0x00A8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeRed;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         ThreadsToIgnore;                                   // 0x00B0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FString>                         ThreadsToSuspend;                                  // 0x00C0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           LogCategoryWhitelist;                              // 0x00D0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                          bHandleProcessPriority;                            // 0x00E0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandleThreadTime;                                 // 0x00E1(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHandleAffinities;                                 // 0x00E2(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxAffinitiesCores;                                // 0x00E4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLimitFPS;                                         // 0x00E8(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxFPSBackground;                                  // 0x00EC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisableLog;                                       // 0x00F0(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMuteAudio;                                        // 0x00F1(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFBHDCPUController* Get(class UObject* WorldContext); // (Final, Native, Static, Public) // @ 0x146CBF4A0

	int32 GetMaxFPSBackground(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF860
	bool IsLimitingMaxFPS(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBFC40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBHDCPUController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBHDCPUController")
	}
	static class UDFBHDCPUController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBHDCPUController>();
	}
};
DUMPER7_ASSERTS_UDFBHDCPUController;

// Class DFMGameLaunch.DFBHDEnergyController
// 0x0058 (0x0080 - 0x0028)
class UDFBHDEnergyController final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDFBHDSubEnergyController*>      SubControllers;                                    // 0x0030(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x38];                                      // 0x0040(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabledInEditor;                                  // 0x0078(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x0079(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugAutoRecoverTime;                              // 0x007C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UDFBHDSubEnergyController* GetSubControllerByClass(class UClass* InClass); // (Final, Native, Public) // @ 0x146CBF9D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBHDEnergyController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBHDEnergyController")
	}
	static class UDFBHDEnergyController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBHDEnergyController>();
	}
};
DUMPER7_ASSERTS_UDFBHDEnergyController;

// Class DFMGameLaunch.DFBHDHelper
// 0x00C0 (0x00F0 - 0x0030)
class alignas(0x10) UDFBHDHelper final : public UGameInstanceSubsystem
{
public:
	bool                                          bEnterSleep;                                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x17];                                      // 0x0031(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFBHDHelperRunnable*                   BHDRunnable;                                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFBHDEnergyController*                 EnergyController;                                  // 0x0050(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool bExist)>   DFConnectBHDExistDelegate;                         // 0x0058(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool IsCreated)> ProcCreatedDelegate;                              // 0x0068(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(bool IsLosted)> ProcLostDelegate;                                  // 0x0078(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseSocketV2;                                      // 0x00A0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFSocketServer*                        DFSocketServer;                                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFSocketServerV2*                      DFSocketServerV2;                                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x18];                                      // 0x00B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& RemoteIP, int32 RemotePort)> OnClientConnectedDelegate; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& JsonString)> DFReceiveBHDJsonDelegate;        // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class FString FindGameExeUnderDir(const class FString& Dir, const class FString& RegexPattern); // (Final, Native, Static, Public) // @ 0x146CBEF20
	static class FString GetBHDBinRelativePath(); // (Final, Native, Static, Public) // @ 0x146CBF520
	static class FString GetDlcBinaryPath(); // (Final, Native, Static, Public) // @ 0x146CBF620
	static class FString GetDlcRootPath(); // (Final, Native, Static, Public) // @ 0x146CBF620
	static int32 GetFreePort(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x146CBF6A0
	static class UDFBHDHelper* GetInstance(class UObject* Context); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x146CBF780

	void CloseListenServer(); // (Final, Native, Protected, BlueprintCallable) // @ 0x146CBE6F0
	void CreateBHD(const class FString& UE5ProgramPath, const class FString& CommandLineArgs, int32 Port); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBE710
	void CreateBHDSingleProc(const class FString& UE5ProgramPath, const class FString& CommandLineArgs); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBE920
	bool CreateListenServer(const class FString& ServerIP, int32 ServerPort, int32 ReceiveBufferSize, int32 SendBufferSize); // (Final, Native, Protected, BlueprintCallable) // @ 0x146CBEB00
	class UDFBHDSubEnergyController* GetSubEnergyControllerByClass(class UClass* InClass); // (Final, Native, Public) // @ 0x146CBFA60
	void KillBHD(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBFC70
	void OnClientConnected(const class FString& ClientIP, int32 ClientPort); // (Final, Native, Protected) // @ 0x146CBFCC0
	void OnCreateBHDProc(bool IsCreated); // (Final, Native, Protected) // @ 0x146CBFE60
	void OnLostBHDProc(bool IsLost); // (Final, Native, Protected) // @ 0x146CC04F0
	void OnSocketRecvMessage(const class FString& JsonString); // (Final, Native, Protected) // @ 0x146CC05C0
	void OnSocketSendMessage(const class FString& Data, bool bSuccess); // (Final, Native, Protected) // @ 0x146CC06E0
	void SendJsonString(const class FString& JsonStr); // (Final, Native, Protected, BlueprintCallable) // @ 0x146CC0BA0
	void SetDFExhibitionChange(bool bConnectBHD); // (Final, Native, Public, BlueprintCallable) // @ 0x146CC0C60
	void StoreJsonString(const class FString& MessageType, const class FString& JsonStr); // (Final, Native, Protected, BlueprintCallable) // @ 0x146CC0FB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBHDHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBHDHelper")
	}
	static class UDFBHDHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBHDHelper>();
	}
};
DUMPER7_ASSERTS_UDFBHDHelper;

// Class DFMGameLaunch.DFBHDHelperRunnable
// 0x0080 (0x00A8 - 0x0028)
class UDFBHDHelperRunnable final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThreadLostTime;                                    // 0x0050(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x54];                                      // 0x0054(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBHDHelperRunnable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBHDHelperRunnable")
	}
	static class UDFBHDHelperRunnable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBHDHelperRunnable>();
	}
};
DUMPER7_ASSERTS_UDFBHDHelperRunnable;

// Class DFMGameLaunch.DFDevopsTest
// 0x0000 (0x0028 - 0x0028)
class UDFDevopsTest final : public UBlueprintFunctionLibrary
{
public:
	static class FString Echo(const class FString& InInfo); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x146CBEC80
	static bool IsBlueprintClassExist(const class FString& InClassPath); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x146CBFAF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFDevopsTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFDevopsTest")
	}
	static class UDFDevopsTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFDevopsTest>();
	}
};
DUMPER7_ASSERTS_UDFDevopsTest;

// Class DFMGameLaunch.DFGameLaunchManager
// 0x0078 (0x00A8 - 0x0030)
class UDFGameLaunchManager final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnGameLaunchFlowEnd;                               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName StepName)> OnLaunchStepBegin;                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName StepName, ELaunchStepResult Result)> OnLaunchStepEnd;  // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UDFGameLaunchStepFlowManager*           FlowManager;                                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDFGameLaunchUserCache*                 UserCache;                                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x28];                                      // 0x0070(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFGameLaunchSettings*                  GameLaunchSettings;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFGameLaunchManager* GetGameLaunchManager(class UObject* Context); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x146CBF700

	void FinishStep(const class FName& StepName, ELaunchStepResult InStepResult, const class FString& CustomMsg); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x146CBF100
	class FName GetCurRunningFlowName(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF5A0
	class FName GetCurRunningStepName(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF5E0
	bool GetIsFirstLaunch(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF800
	class FString GetPSODoneVersion(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF890
	bool IsEnablePreCompilePSOOnDownloading(); // (Final, Native, Public) // @ 0x146CBFC10
	int32 LastReportID(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBFC90
	void OnSettingsDataLoaded(); // (Final, Native, Private) // @ 0x146CC05A0
	void ReportException(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0
	void ReportGameLaunchStepEnd(const class FString& InOpenId); // (Final, Native, Public, BlueprintCallable) // @ 0x146CC0870
	void ReportGameLaunchStepOutOfLogin(const class FString& InStepName, const class FString& InMsg, ELaunchStepResult Result); // (Final, Native, Public, BlueprintCallable) // @ 0x146CC0930
	void RunFlow(const class FName& FlowName); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x146CC0AF0
	void SetFirstLaunchEnd(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CC0CF0
	void SetPreCompilePSOBegin(const bool bHasBegin); // (Final, Native, Public) // @ 0x146CC0EB0
	void SetPSODoneVersion(const class FString& InVerStr); // (Final, Native, Public, BlueprintCallable) // @ 0x146CC0D30
	bool ShouldPreCompilePSO(); // (Final, Native, Public) // @ 0x146CC0F40
	void StartPreCompilePSO(); // (Final, Native, Public) // @ 0x146CC0F70

	void OnFlowEnd() const; // (Final, Native, Private, Const) // @ 0x146CBFEF0
	void OnFlowStepBegin(const class FName& InStepName) const; // (Final, Native, Private, HasOutParams, Const) // @ 0x146CBFF10
	void OnFlowStepEnd(const class FName& InStepName, ELaunchStepResult InResult) const; // (Final, Native, Private, HasOutParams, Const) // @ 0x146CBFFA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameLaunchManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameLaunchManager")
	}
	static class UDFGameLaunchManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameLaunchManager>();
	}
};
DUMPER7_ASSERTS_UDFGameLaunchManager;

// Class DFMGameLaunch.DFGameLaunchSettings
// 0x0010 (0x0038 - 0x0028)
class UDFGameLaunchSettings : public UObject
{
public:
	TArray<struct FDFGameLaunchStepFlow>          Settings;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameLaunchSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameLaunchSettings")
	}
	static class UDFGameLaunchSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameLaunchSettings>();
	}
};
DUMPER7_ASSERTS_UDFGameLaunchSettings;

// Class DFMGameLaunch.DFGameLaunchConfig
// 0x0030 (0x0058 - 0x0028)
class UDFGameLaunchConfig final : public UObject
{
public:
	struct FSoftClassPath                         DFGameLaunchSettings;                              // 0x0028(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SpaceLimitViewPath;                                // 0x0040(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameLaunchConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameLaunchConfig")
	}
	static class UDFGameLaunchConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameLaunchConfig>();
	}
};
DUMPER7_ASSERTS_UDFGameLaunchConfig;

// Class DFMGameLaunch.DFGameLaunchUserCache
// 0x0018 (0x0040 - 0x0028)
class UDFGameLaunchUserCache final : public UObject
{
public:
	bool                                          bIsFirstLaunch;                                    // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PSODoneVersion;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool GetIsFirstLaunch(); // (Final, Native, Public) // @ 0x146CBF830
	class FString GetPSODoneVersion(); // (Final, Native, Public) // @ 0x146CBF910
	void SetIsFirstLaunch(); // (Final, Native, Public) // @ 0x146CC0D10
	void SetPSODoneVersion(const class FString& InVerStr); // (Final, Native, Public) // @ 0x146CC0DF0
	void UpdateConfig(); // (Final, Native, Public) // @ 0x146CC1210

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameLaunchUserCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameLaunchUserCache")
	}
	static class UDFGameLaunchUserCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameLaunchUserCache>();
	}
};
DUMPER7_ASSERTS_UDFGameLaunchUserCache;

// Class DFMGameLaunch.DFGameLaunchStepBase
// 0x0028 (0x0050 - 0x0028)
class UDFGameLaunchStepBase : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFGameLaunchStepFlowManager*           StepFlowManager;                                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CallLuaGlobalFunction(const class FString& FuncName); // (Native, Public, BlueprintCallable) // @ 0x146CBE600
	void CallLuaModuleFunction(const class FString& ModuleFunc, const class FString& ArgStr); // (Native, Public, BlueprintCallable) // @ 0x141362530
	class FName GetStepName(); // (Native, Public, BlueprintCallable) // @ 0x146CBF990
	void GLS_ClearAllTimer(); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF250
	void GLS_RemoveTimerByHandle(const struct FTimerHandle& TimerHandle); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF270
	struct FTimerHandle GLS_SetTimerByEvent(TDelegate<void()> Delegate, float Time, bool bLooping, float InitialStartDelay, float InitialStartDelayVariance); // (Final, Native, Public, BlueprintCallable) // @ 0x146CBF2F0
	void UpdateBackgroundInfo(const class FText& InTipText, const float InLoadingPercent); // (Final, Native, Public, BlueprintCallable) // @ 0x146CC10F0

	class UGameInstance* GetGameInstance() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x146CBF6D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameLaunchStepBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameLaunchStepBase")
	}
	static class UDFGameLaunchStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameLaunchStepBase>();
	}
};
DUMPER7_ASSERTS_UDFGameLaunchStepBase;

// Class DFMGameLaunch.DFGameLaunchStepBPBase
// 0x0000 (0x0050 - 0x0050)
class UDFGameLaunchStepBPBase : public UDFGameLaunchStepBase
{
public:
	void BP_Init(); // (Native, Event, Public, BlueprintEvent) // @ 0x140C99510
	void BP_OnStepBegin(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnStepEnd(ELaunchStepResult Result, const class FString& ErrorCode); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void EndStep(ELaunchStepResult Result, const class FString& ErrorCode); // (Native, Public, BlueprintCallable) // @ 0x146CBEDF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameLaunchStepBPBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameLaunchStepBPBase")
	}
	static class UDFGameLaunchStepBPBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameLaunchStepBPBase>();
	}
};
DUMPER7_ASSERTS_UDFGameLaunchStepBPBase;

// Class DFMGameLaunch.DFGameLaunchStepFlowManager
// 0x0108 (0x0130 - 0x0028)
class UDFGameLaunchStepFlowManager final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFGameLaunchStepBase*                  CurStepIns;                                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameInstance*                          CachedGameInstance;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0xB0];                                      // 0x0080(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RunStep(); // (Final, Native, Private) // @ 0x146CC0B80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameLaunchStepFlowManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameLaunchStepFlowManager")
	}
	static class UDFGameLaunchStepFlowManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameLaunchStepFlowManager>();
	}
};
DUMPER7_ASSERTS_UDFGameLaunchStepFlowManager;

// Class DFMGameLaunch.GLS_CheckNetStatus
// 0x0008 (0x0058 - 0x0050)
class UGLS_CheckNetStatus final : public UDFGameLaunchStepBase
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnConfirmBtnClicked(); // (Final, Native, Private) // @ 0x146CBFE20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GLS_CheckNetStatus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GLS_CheckNetStatus")
	}
	static class UGLS_CheckNetStatus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGLS_CheckNetStatus>();
	}
};
DUMPER7_ASSERTS_UGLS_CheckNetStatus;

// Class DFMGameLaunch.GLS_CheckPhysicSpace
// 0x0000 (0x0050 - 0x0050)
class UGLS_CheckPhysicSpace final : public UDFGameLaunchStepBase
{
public:
	void OnConfirmBtnClicked(); // (Final, Native, Private) // @ 0x146CBFE40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GLS_CheckPhysicSpace")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GLS_CheckPhysicSpace")
	}
	static class UGLS_CheckPhysicSpace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGLS_CheckPhysicSpace>();
	}
};
DUMPER7_ASSERTS_UGLS_CheckPhysicSpace;

// Class DFMGameLaunch.GLS_OpenHealthTip
// 0x0010 (0x0060 - 0x0050)
class UGLS_OpenHealthTip final : public UDFGameLaunchStepBase
{
public:
	class UUserWidget*                            HealthTipView;                                     // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BaseWaitTime;                                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckAppVersionChanged(); // (Final, Native, Private) // @ 0x146CBE6D0
	void EndStep_Manual(); // (Final, Native, Private) // @ 0x146CBEF00
	void OpenHealthTip(); // (Final, Native, Private) // @ 0x146CC0850
	void WarmupSteps(); // (Final, Native, Private) // @ 0x146CC1250

	void WarmupMaple() const; // (Final, Native, Private, Const) // @ 0x146CC1230

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GLS_OpenHealthTip")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GLS_OpenHealthTip")
	}
	static class UGLS_OpenHealthTip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGLS_OpenHealthTip>();
	}
};
DUMPER7_ASSERTS_UGLS_OpenHealthTip;

// Class DFMGameLaunch.GLS_RequestCDNMeta
// 0x0000 (0x0050 - 0x0050)
class UGLS_RequestCDNMeta : public UDFGameLaunchStepBPBase
{
public:
	void BP_OnGetMetaData(const struct FMetaInfo& MetaInfo); // (Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnGetMetaDataFailed(EMetaError MetaError, int32 InErrorCode); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnGetMetaData(const struct FMetaInfo& MetaInfo); // (Final, Native, Private, HasOutParams) // @ 0x146CC02F0
	void OnGetMetaDataFailed(EMetaError MetaError, int32 InErrorCode); // (Final, Native, Private) // @ 0x146CC03B0
	void OnLoadConfigEnd(EConfigState ConfigState); // (Final, Native, Private) // @ 0x146CC0470
	void RequestMetaFile(); // (Final, Native, Private) // @ 0x146CC0AD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GLS_RequestCDNMeta")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GLS_RequestCDNMeta")
	}
	static class UGLS_RequestCDNMeta* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGLS_RequestCDNMeta>();
	}
};
DUMPER7_ASSERTS_UGLS_RequestCDNMeta;

// Class DFMGameLaunch.GLS_RequestMapleData
// 0x0018 (0x0068 - 0x0050)
class UGLS_RequestMapleData final : public UDFGameLaunchStepBase
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSDKManager*                        CachedSDKManager;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnGetMapleData(const struct FMapleData& MapleData); // (Final, Native, Private) // @ 0x146CC0070
	void OnGetMapleDataFailed(const EMapleError InErrorCode); // (Final, Native, Private) // @ 0x146CC0270
	void OnPopWindowConfirmBtnClicked(); // (Final, Native, Private) // @ 0x146CC0580
	void RequestMapleData(); // (Final, Native, Private) // @ 0x146CC0AB0
	void StartRequestMapleData(); // (Final, Native, Private) // @ 0x146CC0F90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GLS_RequestMapleData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GLS_RequestMapleData")
	}
	static class UGLS_RequestMapleData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGLS_RequestMapleData>();
	}
};
DUMPER7_ASSERTS_UGLS_RequestMapleData;

// Class DFMGameLaunch.GLS_UnpakShader
// 0x0010 (0x0060 - 0x0050)
class UGLS_UnpakShader final : public UDFGameLaunchStepBase
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GLS_UnpakShader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GLS_UnpakShader")
	}
	static class UGLS_UnpakShader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGLS_UnpakShader>();
	}
};
DUMPER7_ASSERTS_UGLS_UnpakShader;

}

