#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGameSDK

#include "Basic.hpp"

#include "PerfGear_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DFMGameSDK_structs.hpp"
#include "GPGameFlow_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DFMGameSDK.DFMSDKBase
// 0x0008 (0x0030 - 0x0028)
class UDFMSDKBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMSDKBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMSDKBase")
	}
	static class UDFMSDKBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMSDKBase>();
	}
};
DUMPER7_ASSERTS_UDFMSDKBase;

// Class DFMGameSDK.PufferManager
// 0x0188 (0x01B8 - 0x0030)
class UPufferManager final : public UDFMSDKBase
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UPufferQuest*                           PtrCurrentDownloadQuest;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPufferQuest*                           PtrCurrentCheckQuest;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPufferQuest*>                   DownloadQuestQueue;                                // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPufferQuest*>                   CancelQuestQueue;                                  // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPufferQuest*>                   CheckQuestQueue;                                   // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x70];                                      // 0x0098(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CachSetFileNameAndMD5;                             // 0x0108(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_158[0x60];                                     // 0x0158(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPufferManager* Get(const class UGameInstance* GameInstance); // (Final, Native, Static, Public) // @ 0x149739950

	bool CheckFileIsInPuffer(const class FString& PakName); // (Final, Native, Public) // @ 0x1497381B0
	void CheckModuleListState(const TArray<class FString>& ModuleNames); // (Final, Native, Public) // @ 0x149738300
	void CheckModuleState(const class FString& ModuleName); // (Final, Native, Public) // @ 0x149738430
	struct FVector2D CubicBezier(const struct FVector2D& p0, const struct FVector2D& p1, const struct FVector2D& p2, const struct FVector2D& p3, float T); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x1497385B0
	bool DeleteFileByModuleName(const class FString& ModuleName); // (Final, Native, Public) // @ 0x149738A10
	bool DeleteFileByPakName(const class FString& PakName); // (Final, Native, Public) // @ 0x149738B40
	void DownloadTest(const class FString& ModuleName); // (Final, Native, Public) // @ 0x149739180
	void GenerateAllModulePaksForWholePackage(); // (Final, Native, Public) // @ 0x1497393C0
	TArray<class FString> GetAllChildModuleName(); // (Final, Native, Public) // @ 0x149739A50
	TArray<class FString> GetAllPakNames(); // (Final, Native, Public) // @ 0x149739B20
	TArray<class FString> GetChildModuleNamesByMultiModule(const class FString& ModuleNam); // (Final, Native, Public) // @ 0x149739DF0
	class FString GetCurQuestTitle(); // (Final, Native, Public) // @ 0x149739FB0
	int32 GetCurrentDownloadPercent(); // (Final, Native, Public) // @ 0x14973A030
	int32 GetFakeProgress(); // (Final, Native, Public) // @ 0x14973A200
	float GetFakeProgressWithPercent(float Percent); // (Final, Native, Public) // @ 0x14973A230
	uint64 GetFileSize(const class FString& PakName, uint64* TotalSize); // (Final, Native, Public, HasOutParams) // @ 0x14973A650
	bool GetFileStateAndSize(const class FString& PakName, uint64* NowSize, uint64* TotalSize); // (Final, Native, Public, HasOutParams) // @ 0x14973A7D0
	TArray<class FString> GetMultiModuleByChildModuleName(const class FString& ModuleName); // (Final, Native, Public) // @ 0x14973A990
	int32 GetNetworkState(); // (Final, Native, Public) // @ 0x14973AB50
	TArray<class FString> GetPakNamesByModuleName(const class FString& ModuleNam, bool IgnoreRuntime); // (Final, Native, Public) // @ 0x14973AB80
	struct FVector2D GetPointFromLUT(float T); // (Final, Native, Public, HasDefaults) // @ 0x14973AD70
	uint64 GetPufferInitErrorCode(); // (Final, Native, Public) // @ 0x14973AE10
	void GMEnableEditorDownload(bool Enable); // (Final, Native, Public) // @ 0x1497392A0
	void GMSwicthEditorLitePackage(bool IsOpen); // (Final, Native, Public) // @ 0x149739330
	void InitPufferDownloader(); // (Final, Native, Public) // @ 0x14973AE80
	bool IsPufferInitSucceed(); // (Final, Native, Public) // @ 0x14973B190
	bool IsSupportLitePackage(); // (Final, Native, Public) // @ 0x14973B1C0
	void PrecomputeCurve(const TArray<struct FVector2D>& Points, int32 Segments); // (Final, Native, Public, HasOutParams) // @ 0x14973B2D0
	void RegisterRuntimeMultiModule(const class FString& MultiModuleName, const TArray<class FString>& Paks, bool IsReset); // (Final, Native, Public) // @ 0x14973B3F0
	void RegisterRuntimeMultiModuleByChildModule(const class FString& MultiModuleName, const TArray<class FString>& ChildModules, bool IsReset); // (Final, Native, Public) // @ 0x14973B630
	void ReleasePufferDownloader(); // (Final, Native, Public) // @ 0x14973B8B0
	void ReloadLiteConfig(); // (Final, Native, Public) // @ 0x14973B8F0
	void ReloadLiteConfig2(); // (Final, Native, Public) // @ 0x14973B8D0
	void SetBGDEnabled(bool IsEnabled); // (Final, Native, Public) // @ 0x14973B9E0
	void SetCurQuestTitle(const class FString& Title); // (Final, Native, Public) // @ 0x14973BA70
	void SetCurrentDownloadProgress(uint64 NowSize, uint64 TotalSize); // (Final, Native, Public) // @ 0x14973BB90
	void SetDownloadMaxSpeed(uint64 Speed); // (Final, Native, Public) // @ 0x14973BD90
	void SetImmDLMaxDownloadsPerTask(uint64 MaxDownloadsPerTask); // (Final, Native, Public) // @ 0x14973BE10
	void SetImmDLMaxTask(uint64 MaxTask); // (Final, Native, Public) // @ 0x14973BE90
	void SetSimulateVersion(const class FString& SimulateVersionNew); // (Final, Native, Public) // @ 0x14973BF50
	void SetTickFromBGD(bool IsTrue); // (Final, Native, Public) // @ 0x14973C150
	void StartDownload(const class FString& ModuleName); // (Final, Native, Public) // @ 0x14973C1E0
	void StartDownloadForce(const class FString& ModuleName, bool Force); // (Final, Native, Public) // @ 0x14973C300
	void StartDownloadImmediately(const class FString& ModuleName); // (Final, Native, Public) // @ 0x14973C470
	void StopAll(); // (Final, Native, Public) // @ 0x14973C5D0
	void StopDownload(const class FString& ModuleName); // (Final, Native, Public) // @ 0x14973C5F0

	bool GetBGDEnabled() const; // (Final, Native, Public, Const) // @ 0x149739BF0
	bool IsTickFromBGD() const; // (Final, Native, Public, Const) // @ 0x14973B1F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PufferManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PufferManager")
	}
	static class UPufferManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPufferManager>();
	}
};
DUMPER7_ASSERTS_UPufferManager;

// Class DFMGameSDK.CommonTipView
// 0x0058 (0x0348 - 0x02F0)
class UCommonTipView : public UUserWidget
{
public:
	TMulticastInlineDelegate<void()>              OnCancelBtnClicked;                                // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnConfirmBtnClicked;                               // 0x0300(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnWidgetHide;                                      // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bHasCloseAnim;                                     // 0x0320(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFCommonButton*                        CancelBtn;                                         // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFCommonButton*                        ConfirmBtn;                                        // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URichTextBlock*                         ShowText;                                          // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCloseSelfAfterConfirm;                          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CallCancelBtnClickEvent(); // (Final, Native, Public) // @ 0x1497073F0
	void CallConfirmBtnClickEvent(); // (Final, Native, Public) // @ 0x149707410
	void InitDataWithBtn(const class FText& InShowText, const class FText& InConfirmText, const class FText& InCancelText, const bool bIsOnlyOneBtn); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x149708080
	void InitDataWithoutBtn(const class FText& InShowText); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x1497082D0
	void OnCancelBtnClick(); // (Final, Native, Protected) // @ 0x1497083C0
	void OnCloseCalled(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnConfirmBtnClick(); // (Final, Native, Protected) // @ 0x1497083E0
	void RemoveSelf(); // (Native, Public, BlueprintCallable) // @ 0x141FAA0B0
	void SetCancelBtnVisibility(const bool bIsVisible); // (Native, Public, BlueprintCallable) // @ 0x144AC04D0
	void SetCancelText(const class FText& InText); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x149709390
	void SetCloseSelfAfterConfirm(bool InClose); // (Native, Public, BlueprintCallable) // @ 0x149709460
	void SetConfirmBtnVisibility(const bool bIsVisible); // (Native, Public, BlueprintCallable) // @ 0x142A88F50
	void SetConfirmText(const class FText& InText); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x1497094F0
	void SetShowText(const class FText& InText); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x14970A190

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonTipView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonTipView")
	}
	static class UCommonTipView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonTipView>();
	}
};
DUMPER7_ASSERTS_UCommonTipView;

// Class DFMGameSDK.BaseBackground
// 0x0068 (0x0358 - 0x02F0)
class UBaseBackground final : public UUserWidget
{
public:
	class FName                                   DefaultMovieRowName;                               // 0x02F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             LoadingPercent_Text;                               // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UProgressBar*                           LoadingProgress;                                   // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             LoadingLeftTime_Text;                              // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             LoadingTips_Text;                                  // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                   DefaultPercentText;                                // 0x0318(0x0018)(NativeAccessSpecifierPrivate)
	class UProgressBar*                           LoadingProgressBar_PCMaterial;                     // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDFCommonMediaView*                     CommonMediaView;                                   // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 BgImage;                                           // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             VersionInfo_Text;                                  // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCanvasPanel*                           LoadingPanel;                                      // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMediaClosedUnexpected(const class FString& PlayingUrl); // (Native, Public, BlueprintCallable) // @ 0x149708600
	void PauseMovie(); // (Native, Public, BlueprintCallable) // @ 0x140EE3BC0
	void PlayMovieByName(const class FName InMovieName); // (Native, Public, BlueprintCallable) // @ 0x144E69AA0
	void RemoveSelf(); // (Native, Public, BlueprintCallable) // @ 0x142A87380
	void ResumeMovie(); // (Native, Public, BlueprintCallable) // @ 0x140EE3BA0
	void SetLeftTimeVisibility(const bool bIsVisible); // (Native, Public, BlueprintCallable) // @ 0x149709B10
	void SetLoadingPanelVisibility(const bool bIsVisible); // (Native, Public, BlueprintCallable) // @ 0x149709460
	void SetLoadingPercentTextVisibility(const bool InIsVisible); // (Native, Public, BlueprintCallable) // @ 0x142A88F50
	void UpdateLeftTimeText(const class FText& InText); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x1497082D0
	void UpdateLoadingPercent(const int32 InPercent); // (Native, Public, BlueprintCallable) // @ 0x141FAA0F0
	void UpdateLoadingPercentFloat(const double InPercent); // (Native, Public) // @ 0x14970A550
	void UpdateLoadingTips(const class FText& InText); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x14970A5D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseBackground")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseBackground")
	}
	static class UBaseBackground* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseBackground>();
	}
};
DUMPER7_ASSERTS_UBaseBackground;

// Class DFMGameSDK.CDNInfoManager
// 0x01B0 (0x01E0 - 0x0030)
class UCDNInfoManager final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(const struct FMetaInfo& MetaInfo)> OnGetMetaData;                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMetaInfo& MetaInfo)> OnGetMetaData2MoLi;             // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGetMaple2MoLi;                                   // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const int32 MapleError)> OnGetMapleFailed2MoLi;                    // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EMetaError MetaError, int32 HttpResponceCodes)> OnMetaFailed;      // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnConfigDownloadSuccess;                           // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EConfigState ConfigState)> OnConfigFileLoaded;                     // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x60];                                      // 0x00A0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UCDNPathConfig*                         CDNPathConfig;                                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAPPUpdateInfo                         APPUpdateInfo;                                     // 0x0108(0x0028)(NativeAccessSpecifierPrivate)
	struct FCDNNoticeInfo                         CDNNoticeInfo;                                     // 0x0130(0x0038)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_168[0x78];                                     // 0x0168(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UCDNInfoManager* GetCDNInfoMgrIns(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1497077B0

	bool EnableCDNInfo(); // (Final, Native, Public, BlueprintCallable) // @ 0x149707430
	const class FString GetCDNUrl(); // (Final, Native, Public, BlueprintCallable) // @ 0x1497078B0
	int32 GetInfoByName_AsInt(const class FString& InName); // (Final, Native, Public, BlueprintCallable) // @ 0x149707CB0
	class FString GetInfoByName_AsString(const class FString& InName); // (Final, Native, Public, BlueprintCallable) // @ 0x149707D80
	const bool GetInited(); // (Final, Native, Public, BlueprintCallable) // @ 0x149707EA0
	void HandleMeta_Config(const struct FMetaInfo& MetaData); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x149707F90
	void HandleMetaData_Internal(const struct FMetaInfo& MetaInfo); // (Final, Native, Private, HasOutParams) // @ 0x149707EC0
	bool HasConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x149708060
	void LoadDynamicConfigFile(); // (Final, Native, Private) // @ 0x1497083A0
	void RequestDownload(const class FString& URL, const bool bIsMeta); // (Native, Public, BlueprintCallable) // @ 0x1497090E0
	void RequestMetaFile(); // (Native, Public, BlueprintCallable) // @ 0x140D2F400
	void ResetInfo(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0

	const struct FAPPUpdateInfo GetAppUpdateInfo() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1497074E0
	int32 GetCachedMetaVersion() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149707990
	TArray<class FString> GetCDNFallbackUrls() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149707630
	class FString GetCdnHeader(const class FString& InDomain) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1497079C0
	const struct FCDNNoticeInfo GetCDNNoticeInfo() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149707830
	class FString GetCustomData(const class FString& InCustomKey) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x149707AE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CDNInfoManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CDNInfoManager")
	}
	static class UCDNInfoManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCDNInfoManager>();
	}
};
DUMPER7_ASSERTS_UCDNInfoManager;

// Class DFMGameSDK.MapleSavedInfo
// 0x0008 (0x0030 - 0x0028)
class UMapleSavedInfo final : public UObject
{
public:
	int64                                         LastTimeStamp;                                     // 0x0028(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MapleSavedInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MapleSavedInfo")
	}
	static class UMapleSavedInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapleSavedInfo>();
	}
};
DUMPER7_ASSERTS_UMapleSavedInfo;

// Class DFMGameSDK.CDNPathConfig
// 0x0038 (0x0060 - 0x0028)
class UCDNPathConfig final : public UObject
{
public:
	class FString                                 BaseRootPath;                                      // 0x0028(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultMetaFile;                                   // 0x0038(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultConfigFile;                                 // 0x0048(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMapleSavedInfo*                        SavedInfo;                                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	const class FString GetBaseRootPath(); // (Final, Native, Public) // @ 0x1497075B0
	const class FString GetDefaultConfigFilePath(); // (Final, Native, Public) // @ 0x149707C00

	void UpdateTimeStamp(const int64& InNewTimestamp) const; // (Final, Native, Public, HasOutParams, Const) // @ 0x14970A6A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CDNPathConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CDNPathConfig")
	}
	static class UCDNPathConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCDNPathConfig>();
	}
};
DUMPER7_ASSERTS_UCDNPathConfig;

// Class DFMGameSDK.DFGameMatchReport
// 0x0000 (0x0030 - 0x0030)
class UDFGameMatchReport final : public UDFMSDKBase
{
public:
	static int32 GetGameMode(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149707C80
	static void ReportMatchStep(int32 StepId, int32 Status, int32 Code, const class FString& Msg, bool Finish); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149708EE0
	static void SetGameMode(int32 GameMode); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149709830

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGameMatchReport")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGameMatchReport")
	}
	static class UDFGameMatchReport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGameMatchReport>();
	}
};
DUMPER7_ASSERTS_UDFGameMatchReport;

// Class DFMGameSDK.DFMBackGroundDownload
// 0x0020 (0x0050 - 0x0030)
class UDFMBackGroundDownload final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(bool bActive)>  BGDOnApplicationActiveDelegate;                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMBackGroundDownload")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMBackGroundDownload")
	}
	static class UDFMBackGroundDownload* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMBackGroundDownload>();
	}
};
DUMPER7_ASSERTS_UDFMBackGroundDownload;

// Class DFMGameSDK.DFMCrashSight
// 0x01B0 (0x01E0 - 0x0030)
class UDFMCrashSight final : public UDFMSDKBase
{
public:
	uint8                                         Pad_30[0x1B0];                                     // 0x0030(0x01B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFMCrashSight* Get(const class UGameInstance* GameInstanceContext); // (Final, Native, Static, Public) // @ 0x149707460
	static void OnHandleGpuCrash(const class FString& ErrorMessage, const class FString& GpuCallstack, const class FString& GpuDumpPath); // (Final, Native, Static, Public) // @ 0x149708400
	static void OnHandleShutdownAfterError(); // (Final, Native, Static, Public) // @ 0x1497085A0
	static void OnHandleSystemEnsure(); // (Final, Native, Static, Public) // @ 0x1497085C0
	static void OnHandleSystemError(); // (Final, Native, Static, Public) // @ 0x1497085E0
	static void PrintAsyncLoadingContext(); // (Final, Native, Static, Public) // @ 0x140DA94D0
	static void PrintLog(const class FString& logContext); // (Final, Native, Static, Public) // @ 0x149708740
	static void ReportException(int32 Type, const class FString& Name_0, const class FString& reason, const class FString& StackTrace, const class FString& extras, bool quit); // (Final, Native, Static, Public) // @ 0x149708850
	static void ReportFrameGen(); // (Final, Native, Static, Private) // @ 0x149708C30
	static void ReportHeavyTaskInGameException(const class FString& InErrorMsg, const class FString& InStackTrace); // (Final, Native, Static, Public) // @ 0x149708C50
	static void ReportLuaException(const class FString& StackTrace, bool bAttachLog); // (Final, Native, Static, Public) // @ 0x149708D80
	static void SetUserId(const class FString& OpenId); // (Final, Native, Static, Public) // @ 0x14970A260

	void OnGameFlowEnter(EGameFlowStageType GameFlowStage); // (Final, Native, Public) // @ 0x141334EA0
	void PrintExtraData(); // (Final, Native, Public) // @ 0x149708720
	void ResetDeviceLevelUserValue(const int32 InDeviceLevel); // (Final, Native, Public) // @ 0x1497091F0
	void ResetFPSLevelUserValue(const EPerfGearQualityLevel InFpsLevel); // (Final, Native, Public) // @ 0x149709270
	void ResetPerfGearUserValue(); // (Final, Native, Public) // @ 0x1497092F0
	void ResetQualityLevelUserValue(const EPerfGearQualityLevel InQualityLevel); // (Final, Native, Public) // @ 0x149709310
	void SetGameInfoData(const class FString& Key, const class FString& Value); // (Final, Native, Public) // @ 0x1497095C0
	void SetHotfixData(const class FString& Key, const class FString& Value); // (Final, Native, Public) // @ 0x1497098A0
	void SetLoadingFlowData(const class FString& Key, const class FString& Value); // (Final, Native, Public) // @ 0x149709BA0
	void SetPerfGearData(const class FString& Key, const class FString& Value); // (Final, Native, Public) // @ 0x149709E10
	void SetPlayerPos(float X, float Y, float Z); // (Final, Native, Public) // @ 0x14970A080
	void SetUserValue(const class FString& Key, const class FString& Value); // (Final, Native, Public) // @ 0x14970A370

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMCrashSight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMCrashSight")
	}
	static class UDFMCrashSight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMCrashSight>();
	}
};
DUMPER7_ASSERTS_UDFMCrashSight;

// Class DFMGameSDK.DFMGameAnnounce
// 0x00A0 (0x00D0 - 0x0030)
class UDFMGameAnnounce final : public UDFMSDKBase
{
public:
	TMulticastInlineDelegate<void(const struct FDFNoticeRet& DFNoticeRet)> OnLoadNoticeDataDelegate; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x90];                                      // 0x0040(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAnnounceDataCache(); // (Final, Native, Public) // @ 0x14970CD00
	class FString LoadNoticeData(const class FString& NoticeGroup, const class FString& Language, const class FString& Region, const class FString& Partition, const class FString& extraJson, float CacheClearInterval); // (Final, Native, Public) // @ 0x14970D9D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameAnnounce")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameAnnounce")
	}
	static class UDFMGameAnnounce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameAnnounce>();
	}
};
DUMPER7_ASSERTS_UDFMGameAnnounce;

// Class DFMGameSDK.DFMGameBeacon
// 0x0000 (0x0030 - 0x0030)
class UDFMGameBeacon final : public UDFMSDKBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameBeacon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameBeacon")
	}
	static class UDFMGameBeacon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameBeacon>();
	}
};
DUMPER7_ASSERTS_UDFMGameBeacon;

// Class DFMGameSDK.DFMGameBrowser
// 0x0000 (0x0030 - 0x0030)
class UDFMGameBrowser final : public UDFMSDKBase
{
public:
	static void CallJS(const class FString& JsonJsParam); // (Final, Native, Static, Public) // @ 0x14970CBD0
	static class FString GetEncodeUrl(class FString* URL); // (Final, Native, Static, Public, HasOutParams) // @ 0x14970D1D0
	static class FString GetMD5Hash(const class FString& InputString); // (Final, Native, Static, Public) // @ 0x14970D4D0
	static void LaunchURL(const class FString& URL, const class FString& Parms_0, const class FString& Error); // (Final, Native, Static, Public) // @ 0x14970D740
	static void OpenAmsCenter(class FString* gameName, class FString* CampaignId, class FString* AreaId, class FString* PlatformId, class FString* partitionId, class FString* RoleId, int32 screenType, const class FString& extraJson); // (Final, Native, Static, Public, HasOutParams) // @ 0x14970DE90
	static void OpenPrajnaWebView(class FString* URL); // (Final, Native, Static, Public, HasOutParams) // @ 0x14970E320
	static void OpenUrl(class FString* URL, int32 screenType, bool isFullScreen, bool isUseURLEncode, class FString* extraJson, bool isBrowser); // (Final, Native, Static, Public, HasOutParams) // @ 0x14970E3E0
	static void SimpleOpenUrl(class FString* URL); // (Final, Native, Static, Public, HasOutParams) // @ 0x14970E320

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameBrowser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameBrowser")
	}
	static class UDFMGameBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameBrowser>();
	}
};
DUMPER7_ASSERTS_UDFMGameBrowser;

// Class DFMGameSDK.DFMGameCentauri
// 0x00B0 (0x00E0 - 0x0030)
class UDFMGameCentauri final : public UDFMSDKBase
{
public:
	bool                                          EnableLog;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSaveLog;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BusinessId;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OfferId;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenId;                                            // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IDCInfo;                                           // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RegionCode;                                        // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrencyCode;                                      // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSandbox;                                          // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PayInfo;                                           // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PaymentMethod;                                     // 0x00C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         SkuLists;                                          // 0x00C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFMGameCentauri* Get(const class UGameInstance* GameInstance); // (Final, Native, Static, Public) // @ 0x14970CF90

	void GetProductInfo(); // (Final, Native, Public) // @ 0x14970D640
	void GetPromotionInfo(); // (Final, Native, Public) // @ 0x14970D660
	void Init(); // (Final, Native, Public) // @ 0x14970D6A0
	void Pay(); // (Final, Native, Public) // @ 0x14970E640
	void ReapplyReceipt(); // (Final, Native, Public) // @ 0x14970E9C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameCentauri")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameCentauri")
	}
	static class UDFMGameCentauri* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameCentauri>();
	}
};
DUMPER7_ASSERTS_UDFMGameCentauri;

// Class DFMGameSDK.DFMGameConnect
// 0x0318 (0x0348 - 0x0030)
class UDFMGameConnect final : public UDFMSDKBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FLuaRecvBufferInfo& LuaRecvBufferInfo)> OnPackRecvDelegate; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectServerInfo& ConnectServerInfo)> OnConnectBeginDelegate; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectorResultInfo& ConnectorResultInfo)> OnConnectedDelegate; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectorResultInfo& ConnectorResultInfo)> OnStateChangedDelegate; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectorResultInfo& ConnectorResultInfo)> OnRelayConnectedDelegate; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectorResultInfo& ConnectorResultInfo)> OnDisconnectDelegate; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float DeltaTime)> OnSendHeartbeatProtoDelegate;                    // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectServerInfo& ConnectServerInfo)> OnACEConnectBeginDelegate; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectorResultInfo& ConnectorResultInfo)> OnACEConnectedDelegate; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FConnectorResultInfo& ConnectorResultInfo)> OnACEDisconnectDelegate; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const bool isSuccess)> OnRestartReconnectedDelegate;               // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCommonTipView*                         ConnectQueueTipView;                               // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0xF8];                                      // 0x00F8(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        GapTime;                                           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseNewProtoSystem;                                // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F5[0x153];                                    // 0x01F5(0x0153)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFMGameConnect* Get(const class UGameInstance* GameInstanceContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14970D010

	bool BindLuaFunctions(); // (Final, Native, Public) // @ 0x14970CB10
	void CancelStayInQueue(); // (Final, Native, Public) // @ 0x14970CCE0
	struct FOnlineConnectResult ConnectServer(const struct FConnectServerInfo& Info); // (Final, Native, Public, HasOutParams) // @ 0x14970CD20
	struct FOnlineConnectResult ConnectServerWithLastConnectedInfo(); // (Final, Native, Public) // @ 0x14970CE20
	void DeinitConnector(); // (Final, Native, Public) // @ 0x14970CE60
	void DisConnectServer(); // (Final, Native, Public) // @ 0x14970CE80
	void EnableHeartbeatThread(); // (Final, Native, Public) // @ 0x14970CF70
	struct FConnectorResultInfo GetConnectInfo(); // (Final, Native, Public) // @ 0x14970D110
	bool GetEnableHeartbeatThread(); // (Final, Native, Public) // @ 0x14970D1B0
	uint32 GetHeartbeatGapTime(); // (Final, Native, Public) // @ 0x14970D2F0
	int32 GetHeartbeatSeqId(); // (Final, Native, Public) // @ 0x149463000
	struct FConnectServerInfo GetLastConnectedInfo(); // (Final, Native, Public) // @ 0x14970D330
	void InitConnector(); // (Final, Native, Public) // @ 0x14970D6C0
	void InitHeartBeatThread(); // (Final, Native, Public) // @ 0x14970D700
	void InitOnConnected(); // (Final, Native, Public) // @ 0x14970D720
	void RelayConnectServer(); // (Final, Native, Public) // @ 0x14970E9E0
	void SetHeartbeatGapTime(uint32 _gapTime); // (Final, Native, Public) // @ 0x14970FDB0
	void SetRunningHeartbeat(bool bFlag); // (Final, Native, Public) // @ 0x14970FE30
	void Shutdown(); // (Final, Native, Public) // @ 0x149710A00
	void TestChar(const TMap<class FString, class FString>& ntf); // (Final, Native, Public) // @ 0x149710A20

	void BroadcastRestartReconnected(const bool bIsSuccess) const; // (Final, Native, Public, Const) // @ 0x14970CB40
	bool GetIsDisconnected() const; // (Final, Native, Public, Const) // @ 0x14970D310
	uint64 GetRTT() const; // (Final, Native, Public, Const) // @ 0x14970D680

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameConnect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameConnect")
	}
	static class UDFMGameConnect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameConnect>();
	}
};
DUMPER7_ASSERTS_UDFMGameConnect;

// Class DFMGameSDK.DFMGameFriend
// 0x0030 (0x0060 - 0x0030)
class UDFMGameFriend final : public UDFMSDKBase
{
public:
	TMulticastInlineDelegate<void(int32 method_id, int32 ret_code, const class FString& ret_msg, int32 third_code, const class FString& third_msg, const class FString& extra_json)> OnBaseResultNotifyEvent; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 method_id, int32 ret_code, const class FString& ret_msg, int32 third_code, const class FString& third_msg, const class FString& extra_json)> OnDiscordBaseResultNotifyEvent; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FDFDiscordFriendResult& DiscordFriendRes)> OnDiscordQueryFriendNotifyEvent; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static void AddFriend(struct FDfmFriendReqInfo* reqInfo, const class FString& Channel); // (Final, Native, Static, Public, HasOutParams) // @ 0x14970C960
	static void DiscordAuthorize(); // (Final, Native, Static, Public) // @ 0x14970CEA0
	static void DiscordQueryFriends(int32 page, int32 Count); // (Final, Native, Static, Public) // @ 0x14970CEC0
	static class UDFMGameFriend* Get(const class UWorld* WorldContextObject); // (Final, Native, Static, Public) // @ 0x14970D090
	static void QueryFriends(int32 page, int32 Count, bool IsInGame, const class FString& Channel, const class FString& subChannel, const class FString& extraJson); // (Final, Native, Static, Public) // @ 0x14970E660
	static void SendImageMessage(const class FString& Channel, int32 Type, const class FString& User, const class FString& Title, const class FString& Desc, const class FString& Link, const class FString& ThumbPath, const class FString& extraJson, const class FString& ImagePath); // (Final, Native, Static, Public) // @ 0x14970EA00
	static void SendMessage(const class FString& Channel, int32 Type, const class FString& User, const class FString& Title, const class FString& Desc, const class FString& Link, const class FString& ThumbPath, const class FString& extraJson); // (Final, Native, Static, Public) // @ 0x14970F0C0
	static void SendMessageLua(const class FString& Channel, int32 Type, const class FString& User, const class FString& Title, const class FString& Desc, const class FString& Link, const class FString& ThumbPath, const class FString& MediaPath, const class FString& extraJson); // (Final, Native, Static, Public) // @ 0x14970F6D0
	static void SetDiscordOnline(); // (Final, Native, Static, Public) // @ 0x14970FD90
	static void Share(struct FDfmFriendReqInfo* reqInfo, const class FString& Channel); // (Final, Native, Static, Public, HasOutParams) // @ 0x14970FEB0
	static void ShareImageMessage(const class FString& Channel, int32 Type, const class FString& ImagePath); // (Final, Native, Static, Public) // @ 0x149710060
	static void ShareLua(const class FString& Channel, int32 Type, const class FString& User, const class FString& Title, const class FString& Desc, const class FString& Link, const class FString& ThumbPath, const class FString& MediaPath, const class FString& extraJson, const class FString& ImagePath); // (Final, Native, Static, Public) // @ 0x149710270

	void InitGameFriend(); // (Final, Native, Public) // @ 0x14970D6E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameFriend")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameFriend")
	}
	static class UDFMGameFriend* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameFriend>();
	}
};
DUMPER7_ASSERTS_UDFMGameFriend;

// Class DFMGameSDK.DFMGameGarena
// 0x0110 (0x0140 - 0x0030)
class UDFMGameGarena final : public UDFMSDKBase
{
public:
	bool                                          EnableLog;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSaveLog;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OfferId;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenId;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneID;                                            // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 pf;                                                // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Env;                                               // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IDC;                                               // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IDCInfo;                                           // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurContry;                                         // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurCurrency;                                       // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSandbox;                                          // 0x00C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RoleId;                                            // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductId;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PayChannel;                                        // 0x0100(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Local;                                             // 0x0110(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ChannelExtras;                                     // 0x0120(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ProductLists;                                      // 0x0130(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)

public:
	static class UDFMGameGarena* Get(const class UGameInstance* GameInstance); // (Final, Native, Static, Public) // @ 0x149714370

	void GetProductInfo(); // (Final, Native, Public) // @ 0x149714D00
	void Init(); // (Final, Native, Public) // @ 0x149714E60
	void Pay(); // (Final, Native, Public) // @ 0x149715860
	void PayGoods(); // (Final, Native, Public) // @ 0x149715880

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameGarena")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameGarena")
	}
	static class UDFMGameGarena* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameGarena>();
	}
};
DUMPER7_ASSERTS_UDFMGameGarena;

// Class DFMGameSDK.DFMGameGPM
// 0x0010 (0x0040 - 0x0030)
class UDFMGameGPM final : public UDFMSDKBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void BeginExclude(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149713510
	static void BeginExtTag(const class FString& TagName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149713530
	static void BeginTag(const class FString& TagName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149713640
	static bool CheckDeviceGameScene(const class FString& GameScene); // (Final, Native, Static, Public) // @ 0x149713990
	static void EndExclude(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149713F30
	static void EndExtTag(const class FString& TagName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149713F50
	static void EndTag(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149714060
	static class UDFMGameGPM* Get(const class UWorld* WorldContextObject); // (Final, Native, Static, Public) // @ 0x1497142F0
	static class FString GetCAID(); // (Final, Native, Static, Public) // @ 0x149714570
	static int32 GetDeviceLevelByQcc(const class FString& ConfigName); // (Final, Native, Static, Public) // @ 0x1497146A0
	static class FString GetOAID(); // (Final, Native, Static, Public) // @ 0x149714B80
	static class FString GetXID(); // (Final, Native, Static, Public) // @ 0x149714D80
	static void MarkLevelFin(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149715300
	static void MarkLevelLoad(const class FString& SceneName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149715320
	static void MarkLevelLoadCompleted(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149715430
	static void PostFrame(float DeltaTime, uint32 FrameIndex); // (Final, Native, Static, Public) // @ 0x1497158A0
	static void PostStepEvent(const class FString& eventCategory, int32 StepId, int32 Status, int32 Code, const class FString& Msg, const class FString& extraKey, bool authorize, bool Finish); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149715960
	static void ReportEventIS(int32 Key, const class FString& Info); // (Final, Native, Static, Public) // @ 0x149716060
	static void ReportOneParam(const class FString& Category, const class FString& Key, float valueA, uint32 FrameIndex); // (Final, Native, Static, Public) // @ 0x1497161B0
	static void ReportOneParamI(const class FString& Category, const class FString& Key, int32 valueA, uint32 FrameIndex); // (Final, Native, Static, Public) // @ 0x1497163E0
	static void ReportStringParam(const class FString& Category, const class FString& Key, const class FString& Value, uint32 FrameIndex); // (Final, Native, Static, Public) // @ 0x149716610
	static void ReportTwoParams(const class FString& Category, const class FString& Key, float valueA, float valueB, uint32 FrameIndex); // (Final, Native, Static, Public) // @ 0x1497168E0
	static void SetOpenId(const class FString& OpenId, const class FString& channelID, const class FString& APPID); // (Final, Native, Static, Public) // @ 0x149717460
	static void SetRoomId(uint64 InRoomId); // (Final, Native, Static, Public) // @ 0x149717890
	static void UpdateGameScene(int32 Key, const class FString& SceneID); // (Final, Native, Static, Public) // @ 0x149717E60
	static void UpdateGameSceneByInt(int32 Key, int32 value1, int32 value2, int32 Value3); // (Final, Native, Static, Public) // @ 0x149717FB0
	static void UpdateStoryStateGameInfo(int32 State); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1497180E0

	void InitGPM(); // (Final, Native, Public) // @ 0x149714E80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameGPM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameGPM")
	}
	static class UDFMGameGPM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameGPM>();
	}
};
DUMPER7_ASSERTS_UDFMGameGPM;

// Class DFMGameSDK.DFMGameIdcSelector
// 0x0158 (0x0188 - 0x0030)
class UDFMGameIdcSelector final : public UDFMSDKBase
{
public:
	uint8                                         Pad_30[0x90];                                      // 0x0030(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFMGameUdpMgr*                         udpMgrIns;                                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IdcIPArray;                                        // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 IdcPortArray;                                      // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 udpSequenceIdArray;                                // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         timeoutTimeConfig;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         tickTimeConfig;                                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x78];                                     // 0x0110(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddUdpIpAddr(const class FString& TheIP, int32 ThePort, uint32 SeqId); // (Final, Native, Public) // @ 0x1497132E0
	void CleanCacheInfo(); // (Final, Native, Public, BlueprintCallable) // @ 0x149713BD0
	uint64 GetCurrentTime(); // (Final, Native, Public) // @ 0x149714670
	TMap<class FString, float> GetIdcNameTimeMap(); // (Final, Native, Public) // @ 0x149714840
	float GetIdcTimeByIdcName(const class FString& IdcName); // (Final, Native, Public) // @ 0x149714990
	class FString GetLocalIPAddr(); // (Final, Native, Public) // @ 0x149714AC0
	uint64 GetUdpPlayerId(); // (Final, Native, Public) // @ 0x149714D50
	void RecordIdcTimeMap(const class FString& IdcName, float Time); // (Final, Native, Public) // @ 0x149715DD0
	void SetCacheInfo(float Time, int32 SeqId, int32 totalReceive); // (Final, Native, Public, BlueprintCallable) // @ 0x149716EA0
	void SetEnable(bool bEnable); // (Final, Native, Public, BlueprintCallable) // @ 0x149717040
	void SetUdpConfig(float TickTime, float timeoutTime, bool bUseUdpPing, int32 pingTimes); // (Final, Native, Public) // @ 0x149717AE0
	void SetUdpPlayerId(const class FString& _playerId); // (Final, Native, Public) // @ 0x149717C30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameIdcSelector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameIdcSelector")
	}
	static class UDFMGameIdcSelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameIdcSelector>();
	}
};
DUMPER7_ASSERTS_UDFMGameIdcSelector;

// Class DFMGameSDK.DFMGameLBS
// 0x0040 (0x0070 - 0x0030)
class UDFMGameLBS final : public UDFMSDKBase
{
public:
	TMulticastInlineDelegate<void(double longitude, double latitude)> OnLBSLocationDelegate;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FLBSRelationRet>& LBSRelationRetArr)> OnLBSRelationDelegate; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
