#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGameLaunch

#include "Basic.hpp"


namespace SDK
{

// Enum DFMGameLaunch.ELaunchStepResult
// NumValues: 0x0006
enum class ELaunchStepResult : uint8
{
	ELSR_None                                = 0,
	ELSR_Success                             = 1,
	ELSR_Warning                             = 2,
	ELSR_Failed                              = 3,
	ELSR_Restart                             = 4,
	ELSR_MAX                                 = 5,
};

// ScriptStruct DFMGameLaunch.GPMReportSettings
// 0x0004 (0x0004 - 0x0000)
struct FGPMReportSettings final
{
public:
	int32                                         StepId;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPMReportSettings;

// ScriptStruct DFMGameLaunch.DFGameLaunchStep
// 0x0028 (0x0028 - 0x0000)
struct FDFGameLaunchStep final
{
public:
	class FName                                   StepName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDFGameLaunchStepBase>      Step;                                              // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StepDesc;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStopFlow;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnableMSDKReport;                               // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnableGPMReport;                                // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGPMReportSettings                     GPMReportSettings;                                 // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFGameLaunchStep;

// ScriptStruct DFMGameLaunch.DFGameLaunchStepFlow
// 0x0028 (0x0028 - 0x0000)
struct FDFGameLaunchStepFlow final
{
public:
	class FName                                   FlowName;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDFGameLaunchStep>              Steps;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 GPMCategory;                                       // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFGameLaunchStepFlow;

}

