#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGamepadInput

#include "Basic.hpp"

#include "GPWeaponDefineForPlugin_structs.hpp"
#include "Engine_structs.hpp"
#include "GameCore_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "InputCore_structs.hpp"
#include "GPGameHud_structs.hpp"


namespace SDK
{

// Enum DFMGamepadInput.EDFMInputMappingTableType
// NumValues: 0x000A
enum class EDFMInputMappingTableType : uint8
{
	BaseInput                                = 0,
	AimingInput                              = 1,
	VehicleBaseInput                         = 2,
	VehicleInput                             = 3,
	HelicopterInput                          = 4,
	JetInput                                 = 5,
	WatchFightInput                          = 6,
	MapInput                                 = 7,
	DynamicInput                             = 8,
	EDFMInputMappingTableType_MAX            = 9,
};

// Enum DFMGamepadInput.EAdaptiveTriggerEffectType
// NumValues: 0x0008
enum class EAdaptiveTriggerEffectType : uint8
{
	Off                                      = 0,
	Feedback                                 = 1,
	MultiPositionFeedback                    = 2,
	SlopeFeedback                            = 3,
	Weapon                                   = 4,
	Vibration                                = 5,
	MultiPositionVibration                   = 6,
	EAdaptiveTriggerEffectType_MAX           = 7,
};

// Enum DFMGamepadInput.EInputDeviceTriggerMask
// NumValues: 0x0004
enum class EInputDeviceTriggerMask : uint8
{
	None                                     = 0,
	Left                                     = 1,
	Right                                    = 2,
	EInputDeviceTriggerMask_MAX              = 3,
};

// Enum DFMGamepadInput.EDFMInputSettingVisibility
// NumValues: 0x0004
enum class EDFMInputSettingVisibility : uint8
{
	Visible                                  = 0,
	Disable                                  = 1,
	Hidden                                   = 2,
	EDFMInputSettingVisibility_MAX           = 3,
};

// Enum DFMGamepadInput.EDFMInputPresetDisplayGrouping
// NumValues: 0x0005
enum class EDFMInputPresetDisplayGrouping : uint8
{
	Foot                                     = 0,
	Vehicle                                  = 1,
	Helicopter                               = 2,
	Jet                                      = 3,
	EDFMInputPresetDisplayGrouping_MAX       = 4,
};

// Enum DFMGamepadInput.EDFMInputPriority
// NumValues: 0x0005
enum class EDFMInputPriority : uint8
{
	Low                                      = 0,
	Middle                                   = 1,
	High                                     = 2,
	VeryHigh                                 = 3,
	EDFMInputPriority_MAX                    = 4,
};

// Enum DFMGamepadInput.ETriggerSuperSprintType
// NumValues: 0x0004
enum class ETriggerSuperSprintType : uint8
{
	TapWhenSprint                            = 0,
	TapWhenRun                               = 1,
	DoubleClickWhenSprint                    = 2,
	ETriggerSuperSprintType_MAX              = 3,
};

// Enum DFMGamepadInput.ESlideAndProneTriggerType
// NumValues: 0x0005
enum class ESlideAndProneTriggerType : uint8
{
	TapSlideAndLongPressProne                = 0,
	TapProneAndLongPressSlide                = 1,
	OnlySlide                                = 2,
	OnlyProne                                = 3,
	ESlideAndProneTriggerType_MAX            = 4,
};

// Enum DFMGamepadInput.EAutoSprintSettingType
// NumValues: 0x0004
enum class EAutoSprintSettingType : uint8
{
	Close                                    = 0,
	AutoSprint                               = 1,
	AutoSuperSprint                          = 2,
	EAutoSprintSettingType_MAX               = 3,
};

// Enum DFMGamepadInput.EDFMInputModifierTargetKey
// NumValues: 0x0004
enum class EDFMInputModifierTargetKey : uint8
{
	Key1                                     = 0,
	Key2                                     = 1,
	Both                                     = 2,
	EDFMInputModifierTargetKey_MAX           = 3,
};

// Enum DFMGamepadInput.EDFMInputTriggerState
// NumValues: 0x0007
enum class EDFMInputTriggerState : uint8
{
	None                                     = 0,
	Ongoing                                  = 1,
	Triggered                                = 2,
	WaitingCombKey                           = 3,
	WaitingRelease                           = 4,
	WaitingReset                             = 5,
	EDFMInputTriggerState_MAX                = 6,
};

// Enum DFMGamepadInput.EInterceptKeyOccupiedReason
// NumValues: 0x0003
enum class EInterceptKeyOccupiedReason : uint8
{
	ByWatingComb                             = 0,
	ByLongPressing                           = 1,
	EInterceptKeyOccupiedReason_MAX          = 2,
};

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectBase
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FDFMAdaptiveTriggerEffectBase
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectBase;

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectFeedback
// 0x0008 (0x0058 - 0x0050)
struct FDFMAdaptiveTriggerEffectFeedback final : public FDFMAdaptiveTriggerEffectBase
{
public:
	uint8                                         Position;                                          // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Strength;                                          // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectFeedback;

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectSlopeFeedback
// 0x0008 (0x0058 - 0x0050)
struct FDFMAdaptiveTriggerEffectSlopeFeedback final : public FDFMAdaptiveTriggerEffectBase
{
public:
	uint8                                         StartPosition;                                     // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         EndPosition;                                       // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         StartStrength;                                     // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         EndStrength;                                       // 0x0053(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectSlopeFeedback;

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectMultiPositionFeedback
// 0x0010 (0x0060 - 0x0050)
struct FDFMAdaptiveTriggerEffectMultiPositionFeedback final : public FDFMAdaptiveTriggerEffectBase
{
public:
	TArray<uint8>                                 Strengths;                                         // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectMultiPositionFeedback;

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectWeapon
// 0x0008 (0x0058 - 0x0050)
struct FDFMAdaptiveTriggerEffectWeapon final : public FDFMAdaptiveTriggerEffectBase
{
public:
	uint8                                         StartPosition;                                     // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         EndPosition;                                       // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Strength;                                          // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectWeapon;

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectVibration
// 0x0008 (0x0058 - 0x0050)
struct FDFMAdaptiveTriggerEffectVibration final : public FDFMAdaptiveTriggerEffectBase
{
public:
	bool                                          bUseFrequencyBasedOnFireInternal;                  // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowVibrationWhenEquipping;                      // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Position;                                          // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Amplitude;                                         // 0x0053(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         frequency;                                         // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectVibration;

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectMultiPositionVibration
// 0x0018 (0x0068 - 0x0050)
struct FDFMAdaptiveTriggerEffectMultiPositionVibration final : public FDFMAdaptiveTriggerEffectBase
{
public:
	bool                                          bUseFrequencyBasedOnFireInternal;                  // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowVibrationWhenEquipping;                      // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         frequency;                                         // 0x0052(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Amplitudes;                                        // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectMultiPositionVibration;

// ScriptStruct DFMGamepadInput.DFMWeaponAdaptiveTriggerFireModeConfig
// 0x0238 (0x0238 - 0x0000)
struct FDFMWeaponAdaptiveTriggerFireModeConfig final
{
public:
	float                                         FireTriggerPressDepth;                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FireTriggerReleaseDepth;                           // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAdaptiveTriggerEffectType                    TriggerEffectType;                                 // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFMAdaptiveTriggerEffectFeedback      Feedback;                                          // 0x0010(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FDFMAdaptiveTriggerEffectSlopeFeedback SlopeFeedback;                                     // 0x0068(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FDFMAdaptiveTriggerEffectMultiPositionFeedback MultiPositionFeedback;                     // 0x00C0(0x0060)(Edit, NativeAccessSpecifierPublic)
	struct FDFMAdaptiveTriggerEffectWeapon        Weapon;                                            // 0x0120(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FDFMAdaptiveTriggerEffectVibration     Vibration;                                         // 0x0178(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FDFMAdaptiveTriggerEffectMultiPositionVibration MultiPositionVibration;                   // 0x01D0(0x0068)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMWeaponAdaptiveTriggerFireModeConfig;

// ScriptStruct DFMGamepadInput.WeaponAdaptiveTriggerPropertyTableRow
// 0x0060 (0x0070 - 0x0010)
struct FWeaponAdaptiveTriggerPropertyTableRow final : public FDescRowBase
{
public:
	uint64                                        RecId;                                             // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StrengthMultiplierWithSilencer;                    // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EGPWeaponFiringMode, struct FDFMWeaponAdaptiveTriggerFireModeConfig> ApplicableDeviceProperties; // 0x0020(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponAdaptiveTriggerPropertyTableRow;

// ScriptStruct DFMGamepadInput.AdaptiveTriggerPropertyTableRow
// 0x0058 (0x0068 - 0x0010)
struct FAdaptiveTriggerPropertyTableRow final : public FDescRowBase
{
public:
	EWeaponItemType                               WeaponType;                                        // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StrengthMultiplierWithSilencer;                    // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EGPWeaponFiringMode, struct FDFMWeaponAdaptiveTriggerFireModeConfig> ApplicableDeviceProperties; // 0x0018(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAdaptiveTriggerPropertyTableRow;

// ScriptStruct DFMGamepadInput.WeaponAdaptiveTriggerDetailInfo
// 0x0030 (0x0030 - 0x0000)
struct FWeaponAdaptiveTriggerDetailInfo final
{
public:
	uint64                                        WeaponID;                                          // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeaponName;                                        // 0x0008(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        WeaponGuid;                                        // 0x0018(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponItemType                               WeaponType;                                        // 0x0020(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPWeaponFiringMode                           FireType;                                          // 0x0021(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FireInterval;                                      // 0x0024(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSceneWeapon;                                    // 0x0028(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanFire;                                          // 0x0029(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOverHeat;                                       // 0x002A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponAdaptiveTriggerDetailInfo;

// ScriptStruct DFMGamepadInput.DFMAdaptiveTriggerEffectOff
// 0x0000 (0x0050 - 0x0050)
struct FDFMAdaptiveTriggerEffectOff final : public FDFMAdaptiveTriggerEffectBase
{
};
DUMPER7_ASSERTS_FDFMAdaptiveTriggerEffectOff;

// ScriptStruct DFMGamepadInput.DFMInputKeyActionLogic
// 0x0010 (0x0020 - 0x0010)
struct FDFMInputKeyActionLogic final : public FDescRowBase
{
public:
	class FName                                   ActionOrAxisName;                                  // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKeyActionLogic                               KeyActionLogic;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMInputKeyActionLogic;

// ScriptStruct DFMGamepadInput.DFMJoystickInputPresetData
// 0x0048 (0x0048 - 0x0000)
struct FDFMJoystickInputPresetData final
{
public:
	TSoftObjectPtr<class UDataTable>              InputMappingTable;                                 // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDefaultEnabled;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0030(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMJoystickInputPresetData;

// ScriptStruct DFMGamepadInput.DFMJoystickInputPresetGroupRow
// 0x0068 (0x0078 - 0x0010)
struct FDFMJoystickInputPresetGroupRow final : public FDescRowBase
{
public:
	TMap<class FName, struct FDFMJoystickInputPresetData> InputPresetDatas;                          // 0x0010(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0060(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMJoystickInputPresetGroupRow;

// ScriptStruct DFMGamepadInput.DFMInputPresetRow
// 0x0048 (0x0058 - 0x0010)
struct FDFMInputPresetRow final : public FDescRowBase
{
public:
	TSoftObjectPtr<class UDataTable>              InputMappingTable;                                 // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDefaultEnabled;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCommonInput;                                    // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DisplayName;                                       // 0x0040(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMInputPresetRow;

// ScriptStruct DFMGamepadInput.DFMInputKeyRebindingInfo
// 0x0088 (0x0088 - 0x0000)
struct FDFMInputKeyRebindingInfo final
{
public:
	EDFMInputMappingTableType                     IMTableType;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionOrAxisName;                                  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Key1;                                              // 0x0010(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key2;                                              // 0x0028(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   RebindingKey1;                                     // 0x0040(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   RebindingKey2;                                     // 0x0058(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDFMInputTrigger>           InputTriggerType;                                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 KeyFunctionTypeList;                               // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMInputKeyRebindingInfo;

// ScriptStruct DFMGamepadInput.DFMInputMappingInstance
// 0x0020 (0x0020 - 0x0000)
struct FDFMInputMappingInstance final
{
public:
	class UDFMInputTrigger*                       InputTrigger;                                      // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDFMInputModifier*>              InputModifiers;                                    // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMInputMappingInstance;

// ScriptStruct DFMGamepadInput.DFMInputMappingContext
// 0x0058 (0x0058 - 0x0000)
struct FDFMInputMappingContext final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FDFMInputMappingInstance> InputMappingInstances;                        // 0x0008(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMInputMappingContext;

// ScriptStruct DFMGamepadInput.DFMInputModifierData
// 0x0128 (0x0128 - 0x0000)
struct FDFMInputModifierData final
{
public:
	EDFMInputModifierTargetKey                    TargetKeySelector;                                 // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   TargetKey;                                         // 0x0008(0x0018)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDFMInputMappingTableType                     IMCId;                                             // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGameHUDSate>                          GameStates;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      NameToOptionFloatValue;                            // 0x0038(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, class FName>                NameToOptionNameValue;                             // 0x0088(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, EDFMInputMappingTableType>  NameToOptionIMCId;                                 // 0x00D8(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMInputModifierData;

// ScriptStruct DFMGamepadInput.DFMInputMappingRow
// 0x00F8 (0x0108 - 0x0010)
struct FDFMInputMappingRow final : public FDescRowBase
{
public:
	EDFMInputMappingTableType                     InputMappingTableType;                             // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionOrAxisName;                                  // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   OldInputEvent;                                     // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDFMInputPriority                             InputPriority;                                     // 0x001D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDFMInputTrigger>           InputTrigger;                                      // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key1;                                              // 0x0028(0x0018)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKey                                   Key2;                                              // 0x0040(0x0018)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumeInput;                                     // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRebindCombKeys;                              // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LongPressedHoldTime;                               // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitPairCombKeyTime;                               // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWaitOtherCombKeyWaitTime;                       // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UDFMInputModifier>, struct FDFMInputModifierData> InputModifiers;         // 0x0068(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EDFMInputPresetDisplayGrouping>        DisplayGroupingForInputPreset;                     // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	EDFMInputSettingVisibility                    Visibility;                                        // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   FunctionName;                                      // 0x00E8(0x0018)(Edit, NativeAccessSpecifierPublic)
	int32                                         KeyFunctionType;                                   // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMInputMappingRow;

}

