#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGameHud

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GameCore_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "GPWeaponDefineForPlugin_structs.hpp"


namespace SDK
{

// Enum DFMGameHud.EDFMWidgetEventType
// NumValues: 0x0007
enum class EDFMWidgetEventType : uint8
{
	None                                     = 0,
	UISystemSetting_Close                    = 1,
	UISystemSetting_Logout                   = 2,
	UISystemSetting_QuitMatch                = 3,
	UISystemSetting_QuitGame                 = 4,
	Common_LastMsgID                         = 5,
	EDFMWidgetEventType_MAX                  = 6,
};

// Enum DFMGameHud.EAmmoUpdateType
// NumValues: 0x0006
enum class EAmmoUpdateType : uint8
{
	FirstGun                                 = 0,
	SecondGun                                = 1,
	AbilityItem                              = 2,
	PVE                                      = 3,
	None                                     = 4,
	EAmmoUpdateType_MAX                      = 5,
};

// Enum DFMGameHud.EWeaponTipsType
// NumValues: 0x0005
enum class EWeaponTipsType : uint8
{
	None                                     = 0,
	AmmoTipEmpty                             = 1,
	StingerNoTarget                          = 2,
	AmmoTipLow                               = 3,
	EWeaponTipsType_MAX                      = 4,
};

// Enum DFMGameHud.EAmmoTipState
// NumValues: 0x0004
enum class EAmmoTipState : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Empty                                    = 2,
	EAmmoTipState_MAX                        = 3,
};

// Enum DFMGameHud.EAnimDebugType
// NumValues: 0x0003
enum class EAnimDebugType : uint8
{
	None                                     = 0,
	Anim                                     = 1,
	EAnimDebugType_MAX                       = 2,
};

// Enum DFMGameHud.EBattlefieldPlayerDeathType
// NumValues: 0x0004
enum class EBattlefieldPlayerDeathType : uint8
{
	NONE                                     = 0,
	TeamMate                                 = 1,
	SameCamp                                 = 2,
	EBattlefieldPlayerDeathType_MAX          = 3,
};

// Enum DFMGameHud.EBionicSpyHudSwitchState
// NumValues: 0x0005
enum class EBionicSpyHudSwitchState : uint8
{
	None                                     = 0,
	Loading                                  = 1,
	LoadFinish                               = 2,
	BlackFinish                              = 3,
	EBionicSpyHudSwitchState_MAX             = 4,
};

// Enum DFMGameHud.EWeaponIconType
// NumValues: 0x0008
enum class EWeaponIconType : uint8
{
	None                                     = 0,
	Default                                  = 1,
	Gun                                      = 2,
	Melee                                    = 3,
	Throw                                    = 4,
	Vehicles                                 = 5,
	FallingDown                              = 6,
	EWeaponIconType_MAX                      = 7,
};

// Enum DFMGameHud.EBroadcastNameColorType
// NumValues: 0x000B
enum class EBroadcastNameColorType : uint8
{
	None                                     = 0,
	Self                                     = 1,
	Team                                     = 2,
	Enemy                                    = 3,
	Game                                     = 4,
	BattleField_Self                         = 5,
	BattleField_Team                         = 6,
	BattleField_Camp                         = 7,
	BattleField_Enemy                        = 8,
	ObserverModeTeamColor                    = 9,
	EBroadcastNameColorType_MAX              = 10,
};

// Enum DFMGameHud.EBroadcastKillIconType
// NumValues: 0x0006
enum class EBroadcastKillIconType : uint8
{
	None                                     = 0,
	KnockDown                                = 1,
	HeadShotAndKnockDown                     = 2,
	HeadShot                                 = 3,
	PenetrationKill                          = 4,
	EBroadcastKillIconType_MAX               = 5,
};

// Enum DFMGameHud.EKillInfoMemberType
// NumValues: 0x0009
enum class EKillInfoMemberType : uint8
{
	None                                     = 0,
	All                                      = 1,
	NormalAI                                 = 2,
	SpecialAI                                = 3,
	AllPlayer                                = 4,
	CampMember                               = 5,
	TeamMember                               = 6,
	Self                                     = 7,
	EKillInfoMemberType_MAX                  = 8,
};

// Enum DFMGameHud.ECommonIconMapZOrder
// NumValues: 0x0004
enum class ECommonIconMapZOrder : uint8
{
	Detector                                 = 19,
	Enemy                                    = 19,
	EnemyBeKilled                            = 19,
	ECommonIconMapZOrder_MAX                 = 20,
};

// Enum DFMGameHud.ECommonIconMapMarkerType
// NumValues: 0x0006
enum class ECommonIconMapMarkerType : uint8
{
	None                                     = 0,
	Enemy                                    = 1,
	EnemyBeKilled                            = 2,
	Detector                                 = 3,
	EnemySpotted                             = 4,
	ECommonIconMapMarkerType_MAX             = 5,
};

// Enum DFMGameHud.EDFRouletteActivateType
// NumValues: 0x0006
enum class EDFRouletteActivateType : uint8
{
	EImmediately                             = 0,
	ELongPressed                             = 1,
	EPressedMove                             = 2,
	EPlaceHolder1                            = 4,
	EPlaceHolder2                            = 8,
	EDFRouletteActivateType_MAX              = 9,
};

// Enum DFMGameHud.ETipsActionPriority
// NumValues: 0x000C
enum class ETipsActionPriority : uint8
{
	Default                                  = 1,
	ReleaseRope                              = 2,
	AbilitySkill                             = 3,
	CarryBody                                = 4,
	BionicSpy                                = 5,
	ZoyaSwarms                               = 6,
	Firefighting                             = 7,
	NetRemove                                = 8,
	PullOutArrow                             = 9,
	DropCarryBody                            = 10,
	Assassinate                              = 11,
	ETipsActionPriority_MAX                  = 12,
};

// Enum DFMGameHud.EActionTipsAnimType
// NumValues: 0x0003
enum class EActionTipsAnimType : uint8
{
	OpenParachuteWarning                     = 0,
	EActionTipsAnimType_Count                = 1,
	EActionTipsAnimType_MAX                  = 2,
};

// Enum DFMGameHud.EPlayerStatePC
// NumValues: 0x000A
enum class EPlayerStatePC : uint8
{
	Normal                                   = 0,
	Dying                                    = 1,
	BeingRescue                              = 2,
	DeadWaitingRevive                        = 3,
	BeingRevive                              = 4,
	Escaped                                  = 5,
	DeadCompletely                           = 6,
	QuitGame                                 = 7,
	MaxCount                                 = 8,
	EPlayerStatePC_MAX                       = 9,
};

// Enum DFMGameHud.EMainKeyType
// NumValues: 0x0006
enum class EMainKeyType : uint8
{
	Keyboard                                 = 0,
	MouseButton                              = 1,
	MouseWheel                               = 2,
	MouseAxis                                = 3,
	Invalid                                  = 10,
	EMainKeyType_MAX                         = 11,
};

// Enum DFMGameHud.ETestEmitterAudioType
// NumValues: 0x0007
enum class ETestEmitterAudioType : uint8
{
	DEFAULT                                  = 0,
	FOOTSTEP_RUN                             = 1,
	FOOTSTEP_WALK                            = 2,
	FOOTSTEP_SPRINT                          = 3,
	WEAPON_AK                                = 4,
	WEAPON_AK_SUP                            = 5,
	ETestEmitterAudioType_MAX                = 6,
};

// Enum DFMGameHud.ETestEmitterMoveMode
// NumValues: 0x0003
enum class ETestEmitterMoveMode : uint8
{
	Static                                   = 0,
	Circular                                 = 1,
	ETestEmitterMoveMode_MAX                 = 2,
};

// Enum DFMGameHud.ETestEmitterPlayMode
// NumValues: 0x0003
enum class ETestEmitterPlayMode : uint8
{
	Loop                                     = 0,
	PlayOnce                                 = 1,
	ETestEmitterPlayMode_MAX                 = 2,
};

// Enum DFMGameHud.EButtonViewState
// NumValues: 0x0006
enum class EButtonViewState : uint8
{
	ButtonViewState_None                     = 0,
	ButtonViewState_Normal                   = 1,
	ButtonViewState_Activated                = 2,
	ButtonViewState_Forbidden                = 3,
	ButtonViewState_Cooldown                 = 4,
	ButtonViewState_MAX                      = 5,
};

// Enum DFMGameHud.ECountDownColorType
// NumValues: 0x0005
enum class ECountDownColorType : uint8
{
	None                                     = 0,
	White                                    = 1,
	Red                                      = 2,
	Green                                    = 3,
	ECountDownColorType_MAX                  = 4,
};

// Enum DFMGameHud.ECrosshairFeedbackPlaceType
// NumValues: 0x0003
enum class ECrosshairFeedbackPlaceType : uint8
{
	ScreenCenter                             = 0,
	FrontSight                               = 1,
	ECrosshairFeedbackPlaceType_MAX          = 2,
};

// Enum DFMGameHud.EFeedbackAnimType
// NumValues: 0x000A
enum class EFeedbackAnimType : uint8
{
	NONE                                     = 0,
	HitHead                                  = 1,
	HitBody                                  = 2,
	KilledWithHead                           = 3,
	KilledWithBody                           = 4,
	HitVehicle                               = 5,
	KillVehicle                              = 6,
	HitADS                                   = 7,
	HitSkillActor                            = 8,
	EFeedbackAnimType_MAX                    = 9,
};

// Enum DFMGameHud.ECrosshairFeedbackTypes
// NumValues: 0x0006
enum class ECrosshairFeedbackTypes : uint8
{
	CrosshairFeedback_Damage                 = 0,
	CrosshairFeedback_Kill                   = 1,
	CrosshairFeedback_Shock                  = 2,
	CrosshairFeedback_Vehicle                = 3,
	CrosshairFeedback_Ability                = 4,
	CrosshairFeedback_MAX                    = 5,
};

// Enum DFMGameHud.ECurveKind
// NumValues: 0x0004
enum class ECurveKind : uint8
{
	None                                     = 0,
	Up                                       = 1,
	Down                                     = 2,
	ECurveKind_MAX                           = 3,
};

// Enum DFMGameHud.EFeedbackTipsAnimType
// NumValues: 0x000D
enum class EFeedbackTipsAnimType : uint8
{
	None                                     = 0,
	KnockDown                                = 1,
	HitArmor                                 = 2,
	HitArmorAndDamageHp                      = 3,
	HitArmorBroken                           = 4,
	HitHelmet                                = 5,
	HitHelmetAndDamageHp                     = 6,
	HitHelmetBroken                          = 7,
	HitSkillActor                            = 8,
	BreakShieldGlass                         = 9,
	CounterProjectile                        = 10,
	C304Invincible                           = 11,
	EFeedbackTipsAnimType_MAX                = 12,
};

// Enum DFMGameHud.EHudModuleType
// NumValues: 0x0003
enum class EHudModuleType : uint8
{
	None                                     = 0,
	Redeploy                                 = 1,
	EHudModuleType_MAX                       = 2,
};

// Enum DFMGameHud.EProgressType
// NumValues: 0x0003
enum class EProgressType : uint8
{
	Cutting                                  = 0,
	Repairing                                = 1,
	EProgressType_MAX                        = 2,
};

// Enum DFMGameHud.EWhiteDotAnimaStatus
// NumValues: 0x0009
enum class EWhiteDotAnimaStatus : uint8
{
	Small                                    = 0,
	Small2Medium                             = 1,
	Medium                                   = 2,
	Medium2Small                             = 3,
	Medium2Tiny                              = 4,
	Tiny                                     = 5,
	Tiny2Medium                              = 6,
	LootFailed2Medium                        = 7,
	EWhiteDotAnimaStatus_MAX                 = 8,
};

// Enum DFMGameHud.EBowControlType
// NumValues: 0x0005
enum class EBowControlType : uint32
{
	Bow                                      = 0,
	ThrowBlocking                            = 1,
	BlastShieldHeavyAttack                   = 2,
	ToggleSkillWeaponExtraFunc               = 3,
	EBowControlType_MAX                      = 4,
};

// Enum DFMGameHud.CarryBodyButtonViewType
// NumValues: 0x000B
enum class ECarryBodyButtonViewType : uint32
{
	None                                     = 0,
	DropBody                                 = 1,
	DropBox                                  = 2,
	PullOutArrow                             = 4,
	NetRemove                                = 8,
	Firefighting                             = 16,
	ZoyaSwarms                               = 32,
	BionicSpy                                = 64,
	CarryBody                                = 128,
	CarryBox                                 = 256,
	CarryBodyButtonViewType_MAX              = 257,
};

// Enum DFMGameHud.EFireIconType
// NumValues: 0x0004
enum class EFireIconType : uint8
{
	Normal                                   = 0,
	Throw                                    = 1,
	MeleeNotEmptyHand                        = 2,
	EFireIconType_MAX                        = 3,
};

// Enum DFMGameHud.EHelmetImageType
// NumValues: 0x0004
enum class EHelmetImageType : uint8
{
	Surface                                  = 0,
	Damage                                   = 1,
	Border                                   = 2,
	EHelmetImageType_MAX                     = 3,
};

// Enum DFMGameHud.EDFMScopeBtnType
// NumValues: 0x0004
enum class EDFMScopeBtnType : uint8
{
	EZoomRate                                = 0,
	EIconWithArrow                           = 1,
	EIconWithoutArrow                        = 2,
	EDFMScopeBtnType_MAX                     = 3,
};

// Enum DFMGameHud.EExpandableButtonType
// NumValues: 0x0004
enum class EExpandableButtonType : uint8
{
	None                                     = 0,
	ThrowableWeapon                          = 1,
	MedicalItem                              = 2,
	EExpandableButtonType_MAX                = 3,
};

// Enum DFMGameHud.ETypeState
// NumValues: 0x0004
enum class ETypeState : uint8
{
	None                                     = 0,
	NotActive                                = 1,
	Active                                   = 2,
	ETypeState_MAX                           = 3,
};

// Enum DFMGameHud.EAnimPlayConfig
// NumValues: 0x0003
enum class EAnimPlayConfig : uint8
{
	HighConfig                               = 0,
	LowConfig                                = 1,
	EAnimPlayConfig_MAX                      = 2,
};

// Enum DFMGameHud.ECurActiveWeaponType
// NumValues: 0x0007
enum class ECurActiveWeaponType : uint8
{
	EmptyHand                                = 0,
	Gun                                      = 1,
	AbilityItem                              = 2,
	PVEWeapon                                = 3,
	MeleeWeapon                              = 4,
	ThrowableWeapon                          = 5,
	ECurActiveWeaponType_MAX                 = 6,
};

// Enum DFMGameHud.ECancelRescueMySelfType
// NumValues: 0x0004
enum class ECancelRescueMySelfType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	SpeedUp                                  = 2,
	ECancelRescueMySelfType_MAX              = 3,
};

// Enum DFMGameHud.EVoiceChannelType
// NumValues: 0x0005
enum class EVoiceChannelType : uint8
{
	None                                     = 0,
	TeamOutOfGame                            = 1,
	TeamInGame                               = 2,
	CampInGame                               = 3,
	EVoiceChannelType_MAX                    = 4,
};

// Enum DFMGameHud.EMarkerState
// NumValues: 0x0006
enum class EMarkerState : uint8
{
	Init                                     = 0,
	Translucent                              = 1,
	Opaque                                   = 2,
	Flicker                                  = 3,
	Sticky                                   = 4,
	EMarkerState_MAX                         = 5,
};

// Enum DFMGameHud.ESTipsCommonButtonAnimType
// NumValues: 0x0004
enum class ESTipsCommonButtonAnimType : uint8
{
	UT_None                                  = 0,
	UT_InLoop                                = 1,
	UT_InOnce                                = 2,
	UT_MAX                                   = 3,
};

// Enum DFMGameHud.EWeakNetWorkWaitFunctionID
// NumValues: 0x0008
enum class EWeakNetWorkWaitFunctionID : uint8
{
	None                                     = 0,
	EPreload                                 = 1,
	ERequestRedeploy                         = 2,
	ERequestWeaponStore                      = 3,
	ERequestVehicleModificationRules         = 4,
	ERequestUnlockedVehicleAndPartIDs        = 5,
	ERequestSwitchVehiclePart                = 6,
	EWeakNetWorkWaitFunctionID_MAX           = 7,
};

// Enum DFMGameHud.EPlayerMarkerType
// NumValues: 0x0007
enum class EPlayerMarkerType : uint8
{
	Permanent                                = 0,
	PermanentAndCovered                      = 1,
	Aimed                                    = 2,
	AimedAndCovered                          = 3,
	ScoutMarkPermanent                       = 4,
	ScoutMarkPermanentAndCovered             = 5,
	EPlayerMarkerType_MAX                    = 6,
};

// Enum DFMGameHud.EExitHudType
// NumValues: 0x0004
enum class EExitHudType : uint8
{
	NONE                                     = 0,
	ESCAPING                                 = 1,
	UNOPEN                                   = 2,
	EExitHudType_MAX                         = 3,
};

// Enum DFMGameHud.EFootprintSearchTargetState
// NumValues: 0x0005
enum class EFootprintSearchTargetState : uint8
{
	None                                     = 0,
	Active                                   = 1,
	Dead                                     = 2,
	Exit                                     = 3,
	EFootprintSearchTargetState_MAX          = 4,
};

// Enum DFMGameHud.EFootprintSearchState
// NumValues: 0x0005
enum class EFootprintSearchState : uint8
{
	None                                     = 0,
	Enemy                                    = 1,
	Footprint                                = 2,
	PickupContainer                          = 3,
	EFootprintSearchState_MAX                = 4,
};

// Enum DFMGameHud.ELoadingDestination
// NumValues: 0x0009
enum class ELoadingDestination : uint8
{
	ELD_NONE                                 = 0,
	ELD_Login                                = 1,
	ELD_MainHall                             = 2,
	ELD_BattlefieldHall                      = 3,
	ELD_SOLHall                              = 4,
	ELD_SOLGame                              = 5,
	ELD_MPGame                               = 6,
	ELD_RaidGame                             = 7,
	ELD_MAX                                  = 8,
};

// Enum DFMGameHud.EKillTipWidgetType
// NumValues: 0x0004
enum class EKillTipWidgetType : uint8
{
	ETipWidgetType_Kill                      = 0,
	ETipWidgetType_HeadShot                  = 1,
	ETipwidgetType_KillStreak                = 2,
	EKillTipWidgetType_MAX                   = 3,
};

// Enum DFMGameHud.EKillTipsShowType
// NumValues: 0x0003
enum class EKillTipsShowType : uint8
{
	HeadShot                                 = 0,
	MultiKill                                = 1,
	EKillTipsShowType_MAX                    = 2,
};

// Enum DFMGameHud.ERippleType
// NumValues: 0x0003
enum class ERippleType : uint8
{
	None                                     = 0,
	TrackingLoc                              = 1,
	ERippleType_MAX                          = 2,
};

// Enum DFMGameHud.ESoundWaveSourceType
// NumValues: 0x0006
enum class ESoundWaveSourceType : uint8
{
	SilentWalk                               = 0,
	Run                                      = 1,
	Sprint                                   = 2,
	Gun                                      = 3,
	GunWithSilencer                          = 4,
	ESoundWaveSourceType_MAX                 = 5,
};

// Enum DFMGameHud.EBodyPartType
// NumValues: 0x0007
enum class EBodyPartType : uint8
{
	Head                                     = 0,
	Throax                                   = 1,
	LeftArm                                  = 2,
	RightArm                                 = 3,
	LeftLeg                                  = 4,
	RightLeg                                 = 5,
	EBodyPartType_MAX                        = 6,
};

// Enum DFMGameHud.EMiniMapTipsType
// NumValues: 0x0006
enum class EMiniMapTipsType : uint8
{
	None                                     = 0,
	Hide                                     = 1,
	Sneaking                                 = 2,
	Alert                                    = 3,
	Fight                                    = 4,
	EMiniMapTipsType_MAX                     = 5,
};

// Enum DFMGameHud.EImpendingDeathMarkerType
// NumValues: 0x0007
enum class EImpendingDeathMarkerType : uint8
{
	None                                     = 0,
	SOL_ImpendingDeath                       = 1,
	SOL_FirstDeath                           = 2,
	SOL_Death                                = 3,
	BT_SameTeamImpendingDeath                = 4,
	BT_SameCampImpendingDeath                = 5,
	EImpendingDeathMarkerType_MAX            = 6,
};

// Enum DFMGameHud.EPlayerReviveButtonState
// NumValues: 0x0006
enum class EPlayerReviveButtonState : uint8
{
	None                                     = 0,
	White                                    = 1,
	Green                                    = 2,
	Red                                      = 3,
	Forbidden                                = 4,
	EPlayerReviveButtonState_MAX             = 5,
};

// Enum DFMGameHud.ECancelRescueType
// NumValues: 0x0004
enum class ECancelRescueType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	SpeedUp                                  = 2,
	ECancelRescueType_MAX                    = 3,
};

// Enum DFMGameHud.ECharacterSoundInfoType
// NumValues: 0x0008
enum class ECharacterSoundInfoType : uint8
{
	NoSound                                  = 0,
	Sprint                                   = 1,
	SilentWalk                               = 2,
	CrouchRun                                = 3,
	ProneRun                                 = 4,
	StandRun                                 = 5,
	Gun                                      = 6,
	ECharacterSoundInfoType_MAX              = 7,
};

// Enum DFMGameHud.ERaidLiveTabType
// NumValues: 0x0004
enum class ERaidLiveTabType : uint8
{
	None                                     = 0,
	DataBoard                                = 1,
	Advantages                               = 2,
	ERaidLiveTabType_MAX                     = 3,
};

// Enum DFMGameHud.ERankSkillUIStyle
// NumValues: 0x0006
enum class ERankSkillUIStyle : uint8
{
	E_None                                   = 0,
	E_Ready                                  = 1,
	E_NoReady                                = 2,
	E_ReadySelected                          = 3,
	E_NoReadySelected                        = 4,
	E_MAX                                    = 5,
};

// Enum DFMGameHud.EMatchTimeState
// NumValues: 0x0003
enum class EMatchTimeState : uint8
{
	EMatchTimeState_Normal                   = 0,
	EMatchTimeState_Urgent                   = 1,
	EMatchTimeState_MAX                      = 2,
};

// Enum DFMGameHud.ERouletteActionType
// NumValues: 0x0009
enum class ERouletteActionType : uint8
{
	RA_None                                  = 0,
	RA_FlashLight                            = 1,
	RA_OperateLaser                          = 2,
	RA_OperateMask                           = 3,
	RA_OperateTool                           = 4,
	RA_PlayEmote                             = 5,
	RA_OperateBipod                          = 6,
	RA_WeaponInspect                         = 7,
	RA_MAX                                   = 8,
};

// Enum DFMGameHud.EShopType
// NumValues: 0x0004
enum class EShopType : uint8
{
	EWeaponShop                              = 0,
	EAmmorShop                               = 1,
	EPropShop                                = 2,
	EShopType_MAX                            = 3,
};

// Enum DFMGameHud.ESOLSidePanelType
// NumValues: 0x0007
enum class ESOLSidePanelType : uint8
{
	None                                     = 0,
	Quest                                    = 1,
	Wish                                     = 2,
	Contract                                 = 3,
	SeasonQuest                              = 4,
	SeamlessMapNoContract                    = 5,
	ESOLSidePanelType_MAX                    = 6,
};

// Enum DFMGameHud.ESOLMapInfoSwitchType
// NumValues: 0x0006
enum class ESOLMapInfoSwitchType : uint8
{
	None                                     = 0,
	Boss                                     = 1,
	POI                                      = 2,
	SupplyStation                            = 3,
	UnlockPoint                              = 4,
	ESOLMapInfoSwitchType_MAX                = 5,
};

// Enum DFMGameHud.EEvacuateBtnType
// NumValues: 0x0003
enum class EEvacuateBtnType : uint8
{
	Exit                                     = 0,
	Trigger                                  = 1,
	EEvacuateBtnType_MAX                     = 2,
};

// Enum DFMGameHud.ESOLLiveTabType
// NumValues: 0x0007
enum class ESOLLiveTabType : uint8
{
	None                                     = 0,
	Exit                                     = 1,
	Quest                                    = 2,
	Resource                                 = 3,
	Key                                      = 4,
	Wish                                     = 5,
	ESOLLiveTabType_MAX                      = 6,
};

// Enum DFMGameHud.EQuestPlayerExitState
// NumValues: 0x0005
enum class EQuestPlayerExitState : uint8
{
	None                                     = 0,
	Exist                                    = 1,
	NoExist                                  = 2,
	NoActive                                 = 3,
	EQuestPlayerExitState_MAX                = 4,
};

// Enum DFMGameHud.ESOLEvacuationEventHUDViewState
// NumValues: 0x0006
enum class ESOLEvacuationEventHUDViewState : uint8
{
	Inactive                                 = 0,
	Start                                    = 1,
	Waiting                                  = 2,
	Ready                                    = 3,
	Finish                                   = 4,
	ESOLEvacuationEventHUDViewState_MAX      = 5,
};

// Enum DFMGameHud.EProgressTipsState
// NumValues: 0x0006
enum class EProgressTipsState : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	CannotCopy                               = 2,
	NotCopy                                  = 3,
	Copied                                   = 4,
	EProgressTipsState_MAX                   = 5,
};

// Enum DFMGameHud.ESOLTimelineTipHUDViewState
// NumValues: 0x0007
enum class ESOLTimelineTipHUDViewState : uint8
{
	Ready                                    = 0,
	Inactive                                 = 1,
	NoticeBegin                              = 2,
	NoticeEnd                                = 3,
	EventBegin                               = 4,
	EventEnd                                 = 5,
	ESOLTimelineTipHUDViewState_MAX          = 6,
};

// Enum DFMGameHud.FDebugCommandLineType
// NumValues: 0x0004
enum class EFDebugCommandLineType : uint8
{
	Toggle                                   = 0,
	Attribute                                = 1,
	AttributeInput                           = 2,
	FDebugCommandLineType_MAX                = 3,
};

// Enum DFMGameHud.EWeaponDebugType
// NumValues: 0x0014
enum class EWeaponDebugType : uint8
{
	None                                     = 0,
	Base                                     = 1,
	Recoil                                   = 2,
	AssistedAiming                           = 3,
	Anim                                     = 4,
	Effect                                   = 5,
	Audio                                    = 6,
	Setting                                  = 7,
	Modular                                  = 8,
	Spread                                   = 9,
	DataModifier                             = 10,
	AttributeDisplay                         = 11,
	Damage                                   = 12,
	AttributeDetailDisplay                   = 13,
	HotReflashDisplay                        = 14,
	PreViewTimeLine                          = 15,
	UI                                       = 16,
	Spawn                                    = 17,
	Mesh                                     = 18,
	EWeaponDebugType_MAX                     = 19,
};

// ScriptStruct DFMGameHud.AIMsgWidgetInfo
// 0x0030 (0x0030 - 0x0000)
struct FAIMsgWidgetInfo final
{
public:
	class ADFMCharacter*                          AICharacter;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIMsgType                                    AIMsgType;                                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIMsgWidgetBase*                       MsgWidget;                                         // 0x0010(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerMarkerAIWarnWidget*              MarkerWidget;                                      // 0x0018(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCountDown;                                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainTime;                                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedRemove;                                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFight;                                          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSniper;                                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIMsgWidgetInfo;

// ScriptStruct DFMGameHud.AIMsgWidgets
// 0x0050 (0x0050 - 0x0000)
struct FAIMsgWidgets final
{
public:
	TMap<EAIMsgType, struct FAIMsgWidgetInfo>     AIMsgWidgetMap;                                    // 0x0000(0x0050)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIMsgWidgets;

// ScriptStruct DFMGameHud.CrossHairAssetInfo
// 0x0018 (0x0018 - 0x0000)
struct FCrossHairAssetInfo final
{
public:
	class UObject*                                AssetObject;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                RootWidget;                                        // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCrosshairViewProxy*                    ViewProxy;                                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrossHairAssetInfo;

// ScriptStruct DFMGameHud.ThreatDetectionTargetInfo
// 0x000C (0x000C - 0x0000)
struct FThreatDetectionTargetInfo final
{
public:
	bool                                          bIsUse;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValid;                                          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemoveTime;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TargetGUID;                                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThreatDetectionTargetInfo;

// ScriptStruct DFMGameHud.DFMWidgetEvent
// 0x0010 (0x0010 - 0x0000)
struct FDFMWidgetEvent final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDFMWidgetEventType                           EventType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMWidgetEvent;

// ScriptStruct DFMGameHud.ActorTipsConfig
// 0x0020 (0x0020 - 0x0000)
struct FActorTipsConfig final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                TipsWdigetClass;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightOffset;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFilterByDistance;                                 // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FilterDistance;                                    // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFilterByVisibility;                               // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorTipsConfig;

// ScriptStruct DFMGameHud.BigMapClickParameter
// 0x0010 (0x0010 - 0x0000)
struct FBigMapClickParameter final
{
public:
	struct FVector2D                              TargetWorldPosition;                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LocationOnCanvas;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBigMapClickParameter;

// ScriptStruct DFMGameHud.ScoreFeedbackEvent
// 0x0060 (0x0060 - 0x0000)
struct FScoreFeedbackEvent final
{
public:
	int32                                         ScoreType;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Score;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Sprite;                                            // 0x0008(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SpriteColor;                                       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Desc;                                              // 0x0030(0x0018)(NativeAccessSpecifierPublic)
	class FString                                 Audio;                                             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Distance;                                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHighPriority;                                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHeadKill;                                         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FScoreFeedbackEvent;

// ScriptStruct DFMGameHud.SOLQuestObjectiveTipData
// 0x00A8 (0x00A8 - 0x0000)
struct FSOLQuestObjectiveTipData final
{
public:
	bool                                          IsUpdateObjective;                                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DescText;                                          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BriefDescText;                                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProgressText;                                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESOLQuestObjectionState                       ObjState;                                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGoalType                                     ObjType;                                           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         QuestObjectiveID;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTimerStart;                                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeLimitSec;                                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeoutSec;                                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bQuestIsActivity;                                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuestID;                                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 QuestName;                                         // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   QuestDesc;                                         // 0x0070(0x0018)(NativeAccessSpecifierPublic)
	ESOLQuestState                                QuestState;                                        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         QuestReward;                                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ForbbidenQuestConditionDes;                        // 0x0090(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSOLQuestObjectiveTipData;

// ScriptStruct DFMGameHud.LoadedCache
// 0x0010 (0x0010 - 0x0000)
struct FLoadedCache final
{
public:
	TArray<class UObject*>                        LoadedAssets;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoadedCache;

// ScriptStruct DFMGameHud.WeaponDebugLogInfoBase
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FWeaponDebugLogInfoBase
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UWorld>                  GameWorld;                                         // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UWeaponDebugLogView>     DebugView;                                         // 0x0014(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponDebugLogInfoBase;

// ScriptStruct DFMGameHud.WeaponPreViewTimeLineLogInfo
// 0x0000 (0x0020 - 0x0020)
struct FWeaponPreViewTimeLineLogInfo final : public FWeaponDebugLogInfoBase
{
};
DUMPER7_ASSERTS_FWeaponPreViewTimeLineLogInfo;

// ScriptStruct DFMGameHud.GameMarkerPool2
// 0x0010 (0x0010 - 0x0000)
struct FGameMarkerPool2 final
{
public:
	TArray<class UAbilityLockerItemBase*>         Widgets;                                           // 0x0000(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameMarkerPool2;

// ScriptStruct DFMGameHud.WeaponDebugMeshLogInfo
// 0x0000 (0x0020 - 0x0020)
struct FWeaponDebugMeshLogInfo final : public FWeaponDebugLogInfoBase
{
};
DUMPER7_ASSERTS_FWeaponDebugMeshLogInfo;

// ScriptStruct DFMGameHud.AIMarkerWidgetConfig
// 0x0010 (0x0010 - 0x0000)
struct FAIMarkerWidgetConfig final
{
public:
	class UPlayerMarkerAIMakerWidget*             AIMarkerWidget;                                    // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeLeft;                                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIMarkerWidgetConfig;

// ScriptStruct DFMGameHud.AnimDebugLogInfoBase
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FAnimDebugLogInfoBase
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UWorld>                  GameWorld;                                         // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UAnimDebugLogView>       DebugView;                                         // 0x0014(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimDebugLogInfoBase;

// ScriptStruct DFMGameHud.WeaponInputDisableNotice
// 0x0020 (0x0020 - 0x0000)
struct FWeaponInputDisableNotice final
{
public:
	TSubclassOf<class UUserWidget>                TipClass;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TipContent;                                        // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponInputDisableNotice;

// ScriptStruct DFMGameHud.AnimDebugLogInfo
// 0x0000 (0x0020 - 0x0020)
struct FAnimDebugLogInfo final : public FAnimDebugLogInfoBase
{
};
DUMPER7_ASSERTS_FAnimDebugLogInfo;

// ScriptStruct DFMGameHud.WeaponDebugEffectLogInfo
// 0x0000 (0x0020 - 0x0020)
struct FWeaponDebugEffectLogInfo final : public FWeaponDebugLogInfoBase
{
};
DUMPER7_ASSERTS_FWeaponDebugEffectLogInfo;

// ScriptStruct DFMGameHud.AssistedAimingDebugViewInfo
// 0x0030 (0x0050 - 0x0020)
struct FAssistedAimingDebugViewInfo final : public FWeaponDebugLogInfoBase
{
public:
	TWeakObjectPtr<class UAssistedAimingDebugLogView> AssistedAimingDebugView;                       // 0x0020(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StickyParam;                                       // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeed;                                         // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceHorizontal;                                // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReduceScale;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitPreventMissEnable;                             // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HitContinueMissNumber;                             // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitPreventMissStartTime;                           // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitBulletRadius;                                   // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAssistedAimingDebugViewInfo;

// ScriptStruct DFMGameHud.GlitchEffectParameters
// 0x0018 (0x0018 - 0x0000)
struct FGlitchEffectParameters final
{
public:
	float                                         ColorClipOffset;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepLevelClip;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockWeight;                                       // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPixelSize;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RateParam;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BigMapIconGlitchAlpha;                             // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGlitchEffectParameters;

// ScriptStruct DFMGameHud.BigMapQuestTipData
// 0x0028 (0x0028 - 0x0000)
struct FBigMapQuestTipData final
{
public:
	class FString                                 QuestName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 QuestObjectDesc;                                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGoalType                                     QuestObjType;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RequiredCount;                                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBigMapQuestTipData;

// ScriptStruct DFMGameHud.BionicSpyGCConfig
// 0x0010 (0x0010 - 0x0000)
struct FBionicSpyGCConfig final
{
public:
	bool                                          bDoFlush;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoGC;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetShadowCacheFOV;                                // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinGCDistance;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinBlackTime;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBlackTime;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBionicSpyGCConfig;

// ScriptStruct DFMGameHud.BroadcastHudNameColor
// 0x0038 (0x0038 - 0x0000)
struct FBroadcastHudNameColor final
{
public:
	struct FSlateColor                            NameColor;                                         // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutlineColor;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBroadcastHudNameColor;

// ScriptStruct DFMGameHud.KillInfoRelationInfo
// 0x0002 (0x0002 - 0x0000)
struct FKillInfoRelationInfo final
{
public:
	EKillInfoMemberType                           KillerType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKillInfoMemberType                           VictimType;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKillInfoRelationInfo;

// ScriptStruct DFMGameHud.BroadcastInfoConfig
// 0x0100 (0x0100 - 0x0000)
struct FBroadcastInfoConfig final
{
public:
	TArray<EDeadType>                             DeadTypeBlackList;                                 // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FKillInfoRelationInfo, bool>      KillBroadCastCache;                                // 0x0010(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FKillInfoRelationInfo, bool>      ObserverKillBroadCastCache;                        // 0x0060(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<EBroadcastGameInfoType, bool>            GameInfoBroadCastCache;                            // 0x00B0(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBroadcastInfoConfig;

// ScriptStruct DFMGameHud.BroadcastConfig
// 0x0108 (0x0118 - 0x0010)
struct FBroadcastConfig final : public FDescRowBase
{
public:
	EDFMGamePlayMode                              GamePlayMode;                                      // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowMyKillInfo;                                   // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTeamKillInfo;                                 // 0x0012(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEnemyKillInfo;                                // 0x0013(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
