#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMGamepadInput

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameCore_classes.hpp"
#include "DFMGamepadInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "GPGameInput_classes.hpp"
#include "GPWeaponDefineForPlugin_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "GPGameFlow_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DFMGamepadInput.DFMInputModifier
// 0x0138 (0x0160 - 0x0028)
class UDFMInputModifier : public UObject
{
public:
	uint8                                         Pad_28[0x138];                                     // 0x0028(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifier")
	}
	static class UDFMInputModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifier>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifier;

// Class DFMGamepadInput.DFMInputModifierForScaleValue
// 0x0000 (0x0160 - 0x0160)
class UDFMInputModifierForScaleValue final : public UDFMInputModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForScaleValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForScaleValue")
	}
	static class UDFMInputModifierForScaleValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForScaleValue>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForScaleValue;

// Class DFMGamepadInput.DFMAdaptiveTriggerDataTableManager
// 0x0010 (0x0040 - 0x0030)
class UDFMAdaptiveTriggerDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAdaptiveTriggerDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAdaptiveTriggerDataTableManager")
	}
	static class UDFMAdaptiveTriggerDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAdaptiveTriggerDataTableManager>();
	}
};
DUMPER7_ASSERTS_UDFMAdaptiveTriggerDataTableManager;

// Class DFMGamepadInput.DFMWeaponAdaptiveTriggerDataTableManager
// 0x0010 (0x0040 - 0x0030)
class UDFMWeaponAdaptiveTriggerDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMWeaponAdaptiveTriggerDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMWeaponAdaptiveTriggerDataTableManager")
	}
	static class UDFMWeaponAdaptiveTriggerDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMWeaponAdaptiveTriggerDataTableManager>();
	}
};
DUMPER7_ASSERTS_UDFMWeaponAdaptiveTriggerDataTableManager;

// Class DFMGamepadInput.DFMAdaptiveTriggerManager
// 0x0738 (0x0768 - 0x0030)
class UDFMAdaptiveTriggerManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFMWeaponAdaptiveTriggerFireModeConfig CurrentAdaptiveTriggerEffect;                     // 0x0048(0x0238)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x14];                                     // 0x0280(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         currentTriggerPressDepth;                          // 0x0294(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         currentTriggerReleaseDepth;                        // 0x0298(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29C[0x1];                                      // 0x029C(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAdaptiveTriggerEnabled;                           // 0x029D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFMWeaponAdaptiveTriggerFireModeConfig DebugAdaptiveTriggerEffect;                       // 0x02A0(0x0238)(Transient, NativeAccessSpecifierPrivate)
	struct FDFMWeaponAdaptiveTriggerFireModeConfig DebugOriginalAdaptiveTriggerEffect;               // 0x04D8(0x0238)(Transient, NativeAccessSpecifierPrivate)
	class FString                                 DebugEffectConfigSource;                           // 0x0710(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         DebugTriggerDepth;                                 // 0x0720(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DebugWeaponEventHistory;                           // 0x0728(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint32                                        DebugMaxWeaponEventHistoryItem;                    // 0x0738(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DebugWeaponStateHistory;                           // 0x0740(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint32                                        DebugMaxWeaponStateHistoryItem;                    // 0x0750(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugCurrentInputMode;                             // 0x0758(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UDFMAdaptiveTriggerManager* Get(const class UObject* InGameInstanceContext); // (Final, Native, Static, Public) // @ 0x146D59990

	void Debug_ClearWeaponEventHistory(); // (Final, Native, Private) // @ 0x146D59520
	void Debug_ClearWeaponStateHistory(); // (Final, Native, Private) // @ 0x146D59540
	struct FWeaponAdaptiveTriggerDetailInfo Debug_GetWeaponDetailInfo(); // (Final, Native, Private) // @ 0x146D59560
	bool Debug_LoadCurrentWeaponEffectToDebugEffect(); // (Final, Native, Private) // @ 0x146D59620
	bool Debug_RefreshAdaptiveTriggerEffect(); // (Final, Native, Private) // @ 0x146D59650
	bool Debug_SaveToAdaptiveTriggerConfig(EWeaponItemType WeaponType, EGPWeaponFiringMode FireMode); // (Final, Native, Private) // @ 0x146D59680
	bool Debug_SaveToWeaponAdaptiveTriggerConfig(uint64 WeaponID, EGPWeaponFiringMode FireMode); // (Final, Native, Private) // @ 0x146D59750
	void Debug_SetMultiPositionFeedbackValue(int32 Index_0, uint8 Value); // (Final, Native, Private) // @ 0x146D59810
	void Debug_SetMultiPositionVibrationValue(int32 Index_0, uint8 Value); // (Final, Native, Private) // @ 0x146D598D0
	void HandleInputModeChanged(EGPInputModeType OldType, EGPInputModeType NewType); // (Final, Native, Private) // @ 0x146D5A2E0
	bool IsAdaptiveTriggerDeviceConnected(); // (Final, Native, Public, BlueprintCallable) // @ 0x146D5A450
	bool IsDebugEnabled(); // (Final, Native, Private) // @ 0x146D5A480
	void OnNotifyActiveWeaponChanged(class AWeaponBase* PreWeapon, class AWeaponBase* NewWeapon); // (Final, Native, Private) // @ 0x146D5A9B0
	void SetDebugEnabled(bool Value); // (Final, Native, Private) // @ 0x146D5AFB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMAdaptiveTriggerManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMAdaptiveTriggerManager")
	}
	static class UDFMAdaptiveTriggerManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMAdaptiveTriggerManager>();
	}
};
DUMPER7_ASSERTS_UDFMAdaptiveTriggerManager;

// Class DFMGamepadInput.DFMGameplayInputManager
// 0x0338 (0x0368 - 0x0030)
class UDFMGameplayInputManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x158];                                     // 0x0030(0x0158)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const TArray<class UDFMInputTrigger*>& RebindInputTriggers, const TArray<class UDFMInputTrigger*>& SwapInputTriggers)> NotifyKeyRebindingApplied; // 0x0188(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	class UDFMInputKeyRebindingSaveGame*          KeyRebindingSaveGame;                              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x50];                                     // 0x01A0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EGamepadReloadInteractMode OldMode, EGamepadReloadInteractMode NewMode)> GamepadReloadInteractModeChangeDelegate; // 0x01F0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x8];                                      // 0x0200(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName ActionAxisName, EKeyActionLogic TargetFunctionMode)> ApplyGamepadActionLogicDelegate; // 0x0208(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 GamePadSetting)> ApplyGamepadAutoSprintSettingDelegate;      // 0x0218(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bGamePadSetting)> ApplyGamepadAutoHoldBreathDelegate;         // 0x0228(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 GamePadSetting)> ApplyGamepadAutoSlideAndProneTriggerTypeDelegate; // 0x0238(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 GamePadSetting)> ApplyGamepadSideAimingControlModeDelegate;  // 0x0248(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 GamePadSetting)> ApplyGamePadTriggerSuperSprintTypeDelegate; // 0x0258(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0xB0];                                     // 0x0268(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              NotifyRefreshKeyIcons;                             // 0x0318(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FKey& Key, float HoldTime)> IAHoldProgressDelegate;   // 0x0328(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName ActionOrAxisName)> IAHoldFinishedDelegate;             // 0x0338(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName ActionOrAxisName)> IAHoldCancelledDelegate;            // 0x0348(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName ActionOrAxisName, float InPercent)> IAHoldPercentDelegate; // 0x0358(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UDFMGameplayInputManager* Get(const class UObject* InGameInstanceContext); // (Final, Native, Static, Public) // @ 0x146D59A10
	static void GetActionPossibleRedirectName(const class FName InActionOrAxisName, class FName* OutRedirectedName); // (Final, Native, Static, Public, HasOutParams) // @ 0x146D59A90
	static bool IsActionInjected(const class FName InActionOrAxisName); // (Final, Native, Static, Public) // @ 0x146D5A3D0

	void ApplyInputSettings(); // (Final, Native, Public) // @ 0x146D59500
	TArray<class UDFMInputTrigger*> GetInputTriggersByGrouping(EDFMInputPresetDisplayGrouping GroupingType); // (Final, Native, Public) // @ 0x146D5A1D0
	bool IsRowAllowBindCombKeys(const struct FDFMInputMappingRow& InRow); // (Final, Native, Public, HasOutParams) // @ 0x146D5A540
	void OnGameFlowEnter(EGameFlowStageType GameFlowStage); // (Final, Native, Private) // @ 0x146D5A610
	void OnGameFlowLeave(EGameFlowStageType GameFlowStage); // (Final, Native, Private) // @ 0x141334EA0
	void OnGameHudStateChanged(); // (Final, Native, Protected) // @ 0x146D5A690
	void OnIAHoldCancelled(class FName ActionOrAxisName); // (Final, Native, Private) // @ 0x146D5A6B0
	void OnIAHoldFinished(class FName ActionOrAxisName); // (Final, Native, Private) // @ 0x146D5A730
	void OnIAHoldPercent(class FName ActionOrAxisName, float InPercent); // (Final, Native, Private) // @ 0x146D5A7B0
	void OnInputModeChanged(EGPInputModeType OldType, EGPInputModeType NewType); // (Final, Native, Public) // @ 0x146D5A870
	void OnInputTypeChanged(EGPInputType InputType); // (Native, Public) // @ 0x146D5A930
	void OnSafeHouseInteractSecondaryTipsShow(bool bIsShow); // (Final, Native, Private) // @ 0x146D5AA70
	void OnSafeHouseInteractTipsShow(bool bIsShow); // (Final, Native, Private) // @ 0x146D5AB00
	void OnSetGamePadAutoSprintType(EAutoSprintSettingType InAutoSprintSettingType); // (Final, Native, Public) // @ 0x146D5AB90
	void OnSetGamePadKeyActionLogicByName(class FName InSettingKeyName, int32 InSettingValue); // (Final, Native, Public) // @ 0x146D5AC10
	void OnSetGamePadSideAimingControlMode(int32 InSideAimingControlMode); // (Final, Native, Public) // @ 0x146D5ACD0
	void OnSetGamePadSlideDiveTriggerType(int32 InSlideAndProneTriggerType); // (Final, Native, Public) // @ 0x146D5AD50
	void OnSetGamePadTriggerSuperSprintType(int32 InTriggerSuperSprintType); // (Final, Native, Public) // @ 0x146D5ADD0
	void OnWeaponZoomStateChange(bool bZoom); // (Final, Native, Protected) // @ 0x146D5AE50
	void ReapplyKeyRebindings(); // (Final, Native, Public) // @ 0x146D5AEE0
	void ResetGamePadSettings(bool bSave); // (Final, Native, Public) // @ 0x146D5AF00
	void ResetKeyRebindings(); // (Final, Native, Public) // @ 0x146D5AF90
	void SetEnableForKeyRebindings(bool bEnable); // (Final, Native, Public) // @ 0x146D5B040
	void SetGamepadReloadInteractMode(const EGamepadReloadInteractMode& Mode, const bool ChangeWithoutNotify); // (Final, Native, Public, HasOutParams) // @ 0x146D5B0D0
	void SetInputPreset(const class FName PresetName); // (Final, Native, Public) // @ 0x146D5B1A0
	void SetJoystickInputPreset(EDFMInputMappingTableType IMCId, const class FName PresetName); // (Final, Native, Public) // @ 0x146D5B220
	void UpdateActionStateForDynamic(class FName InActionOrAxisName, bool bEnable); // (Final, Native, Public) // @ 0x146D5B2E0

	class FName GetActivatedInputPresetName() const; // (Final, Native, Public, Const) // @ 0x144A5DD50
	TMap<EDFMInputMappingTableType, class FName> GetActivatedJoystickInputPresetNames() const; // (Final, Native, Public, Const) // @ 0x146D59B50
	TMap<class FName, struct FDFMInputPresetRow> GetAllInputPresetRows() const; // (Final, Native, Public, Const) // @ 0x146D59CA0
	class UDFMInputTrigger* GetBestInputTriggerByName(const class FName InActionOrAxisName, bool bForce) const; // (Final, Native, Public, Const) // @ 0x146D59DE0
	struct FDFMInputMappingRow GetBestKeyMappingForAction(const class FName InActionName) const; // (Final, Native, Public, Const) // @ 0x146D59EB0
	class FText GetInputMappingRowDisplayName(const struct FDFMInputMappingRow& TriggerData, bool bClusterAxis) const; // (Final, Native, Public, HasOutParams, Const) // @ 0x146D59F80
	TArray<class UDFMInputTrigger*> GetInputTriggersByFunctionType(int32 KeyFunctionType) const; // (Final, Native, Public, Const) // @ 0x146D5A0F0
	class FName GetKeyRebindingSelectedPresetName() const; // (Final, Native, Public, Const) // @ 0x146D5A2A0
	bool HasKeyRebindings() const; // (Final, Native, Public, Const) // @ 0x146D5A3A0
	bool IsEnableAutoHoldBreath() const; // (Final, Native, Public, Const) // @ 0x146D5A4B0
	bool IsEnableForKeyRebindings() const; // (Final, Native, Public, Const) // @ 0x146D5A4E0
	bool IsEnableSwapL1L2AndR1R2() const; // (Final, Native, Public, Const) // @ 0x146D5A510

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGameplayInputManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGameplayInputManager")
	}
	static class UDFMGameplayInputManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGameplayInputManager>();
	}
};
DUMPER7_ASSERTS_UDFMGameplayInputManager;

// Class DFMGamepadInput.DFMInputComponent
// 0x0108 (0x0288 - 0x0180)
class UDFMInputComponent final : public UInputComponent
{
public:
	uint8                                         Pad_180[0x20];                                     // 0x0180(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EDFMInputMappingTableType, struct FDFMInputMappingContext> InputMappingContexts;            // 0x01A0(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<EDFMInputMappingTableType, bool>         InputMappingContextsEnableState;                   // 0x01F0(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UDFMInputTrigger*>               InputTriggerPool;                                  // 0x0240(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UDFMInputTrigger*>               UsedInputTriggerPool;                              // 0x0250(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UDFMInputModifier*>              InputModifierPool;                                 // 0x0260(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_270[0x18];                                     // 0x0270(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputComponent")
	}
	static class UDFMInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputComponent>();
	}
};
DUMPER7_ASSERTS_UDFMInputComponent;

// Class DFMGamepadInput.DFMInputKeyRebindingSaveGame
// 0x0078 (0x00A0 - 0x0028)
class UDFMInputKeyRebindingSaveGame final : public UObject
{
public:
	class FName                                   SelectedPresetName;                                // 0x0028(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EDFMInputMappingTableType, class FName>  SelectedJoystickInputPresetNames;                  // 0x0030(0x0050)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bIsKeyRebindingEnabled;                            // 0x0080(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   KeyRebindingSelectedPresetName;                    // 0x0084(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDFMInputKeyRebindingInfo>      KeyRebindingInfos;                                 // 0x0090(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputKeyRebindingSaveGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputKeyRebindingSaveGame")
	}
	static class UDFMInputKeyRebindingSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputKeyRebindingSaveGame>();
	}
};
DUMPER7_ASSERTS_UDFMInputKeyRebindingSaveGame;

// Class DFMGamepadInput.DFMInputModifierForDisableInput
// 0x0028 (0x0188 - 0x0160)
class UDFMInputModifierForDisableInput : public UDFMInputModifier
{
public:
	uint8                                         Pad_160[0x28];                                     // 0x0160(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForDisableInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForDisableInput")
	}
	static class UDFMInputModifierForDisableInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForDisableInput>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForDisableInput;

// Class DFMGamepadInput.DFMInputModifierForDisableInputV2
// 0x0000 (0x0188 - 0x0188)
class UDFMInputModifierForDisableInputV2 final : public UDFMInputModifierForDisableInput
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForDisableInputV2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForDisableInputV2")
	}
	static class UDFMInputModifierForDisableInputV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForDisableInputV2>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForDisableInputV2;

// Class DFMGamepadInput.DFMInputModifierForGameState
// 0x0000 (0x0160 - 0x0160)
class UDFMInputModifierForGameState final : public UDFMInputModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForGameState")
	}
	static class UDFMInputModifierForGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForGameState>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForGameState;

// Class DFMGamepadInput.DFMInputModifierForAxisRestrict
// 0x0000 (0x0160 - 0x0160)
class UDFMInputModifierForAxisRestrict final : public UDFMInputModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForAxisRestrict")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForAxisRestrict")
	}
	static class UDFMInputModifierForAxisRestrict* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForAxisRestrict>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForAxisRestrict;

// Class DFMGamepadInput.DFMInputModifierForDeadZone
// 0x0000 (0x0160 - 0x0160)
class UDFMInputModifierForDeadZone final : public UDFMInputModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForDeadZone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForDeadZone")
	}
	static class UDFMInputModifierForDeadZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForDeadZone>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForDeadZone;

// Class DFMGamepadInput.GamepadSensitivityCurveManager
// 0x0008 (0x0038 - 0x0030)
class UGamepadSensitivityCurveManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GamepadSensitivityCurveManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GamepadSensitivityCurveManager")
	}
	static class UGamepadSensitivityCurveManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamepadSensitivityCurveManager>();
	}
};
DUMPER7_ASSERTS_UGamepadSensitivityCurveManager;

// Class DFMGamepadInput.DFMInputModifierForSensitivity
// 0x0050 (0x01B0 - 0x0160)
class UDFMInputModifierForSensitivity final : public UDFMInputModifier
{
public:
	TMap<EGamepadSensitivityCurveType, class UCurveFloat*> CacheCurvesMap;                           // 0x0160(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void OnDataLoadComplete(const struct FSoftObjectPath& Asset, EGamepadSensitivityCurveType Type); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x146D610C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForSensitivity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForSensitivity")
	}
	static class UDFMInputModifierForSensitivity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForSensitivity>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForSensitivity;

// Class DFMGamepadInput.DFMInputModifierForSmooth
// 0x0100 (0x0260 - 0x0160)
class UDFMInputModifierForSmooth final : public UDFMInputModifier
{
public:
	uint8                                         Pad_160[0x100];                                    // 0x0160(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputModifierForSmooth")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputModifierForSmooth")
	}
	static class UDFMInputModifierForSmooth* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputModifierForSmooth>();
	}
};
DUMPER7_ASSERTS_UDFMInputModifierForSmooth;

// Class DFMGamepadInput.DFMInputTrigger
// 0x0150 (0x0178 - 0x0028)
class UDFMInputTrigger : public UObject
{
public:
	uint8                                         Pad_28[0x150];                                     // 0x0028(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetSameKeyTriggersMaxWaitOtherCombKeyWaitTime(); // (Final, Native, Public) // @ 0x146D60F80

	const struct FDFMInputMappingRow GetDefaultInputMappingData() const; // (Final, Native, Public, Const) // @ 0x146D60C90
	struct FKey GetKey1() const; // (Final, Native, Public, Const) // @ 0x146D60D60
	struct FKey GetKey2() const; // (Final, Native, Public, Const) // @ 0x146D60DD0
	bool HasKeyRebinding() const; // (Final, Native, Public, Const) // @ 0x146D61090

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTrigger")
	}
	static class UDFMInputTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTrigger>();
	}
};
DUMPER7_ASSERTS_UDFMInputTrigger;

// Class DFMGamepadInput.DFMInputTriggerForAxis
// 0x0008 (0x0180 - 0x0178)
class UDFMInputTriggerForAxis final : public UDFMInputTrigger
{
public:
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTriggerForAxis")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTriggerForAxis")
	}
	static class UDFMInputTriggerForAxis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTriggerForAxis>();
	}
};
DUMPER7_ASSERTS_UDFMInputTriggerForAxis;

// Class DFMGamepadInput.DFMInputTriggerSingleKey
// 0x0000 (0x0178 - 0x0178)
class UDFMInputTriggerSingleKey final : public UDFMInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTriggerSingleKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTriggerSingleKey")
	}
	static class UDFMInputTriggerSingleKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTriggerSingleKey>();
	}
};
DUMPER7_ASSERTS_UDFMInputTriggerSingleKey;

// Class DFMGamepadInput.DFMInputTriggerPressed
// 0x0000 (0x0178 - 0x0178)
class UDFMInputTriggerPressed final : public UDFMInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTriggerPressed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTriggerPressed")
	}
	static class UDFMInputTriggerPressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTriggerPressed>();
	}
};
DUMPER7_ASSERTS_UDFMInputTriggerPressed;

// Class DFMGamepadInput.DFMInputTriggerReleased
// 0x0000 (0x0178 - 0x0178)
class UDFMInputTriggerReleased final : public UDFMInputTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTriggerReleased")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTriggerReleased")
	}
	static class UDFMInputTriggerReleased* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTriggerReleased>();
	}
};
DUMPER7_ASSERTS_UDFMInputTriggerReleased;

// Class DFMGamepadInput.DFMInputTriggerLongPressed
// 0x0008 (0x0180 - 0x0178)
class UDFMInputTriggerLongPressed : public UDFMInputTrigger
{
public:
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTriggerLongPressed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTriggerLongPressed")
	}
	static class UDFMInputTriggerLongPressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTriggerLongPressed>();
	}
};
DUMPER7_ASSERTS_UDFMInputTriggerLongPressed;

// Class DFMGamepadInput.DFMInputTriggerBounceLongPressed
// 0x0008 (0x0188 - 0x0180)
class UDFMInputTriggerBounceLongPressed final : public UDFMInputTriggerLongPressed
{
public:
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTriggerBounceLongPressed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTriggerBounceLongPressed")
	}
	static class UDFMInputTriggerBounceLongPressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTriggerBounceLongPressed>();
	}
};
DUMPER7_ASSERTS_UDFMInputTriggerBounceLongPressed;

// Class DFMGamepadInput.DFMInputTriggerBounce
// 0x0008 (0x0180 - 0x0178)
class UDFMInputTriggerBounce final : public UDFMInputTrigger
{
public:
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMInputTriggerBounce")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMInputTriggerBounce")
	}
	static class UDFMInputTriggerBounce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMInputTriggerBounce>();
	}
};
DUMPER7_ASSERTS_UDFMInputTriggerBounce;

// Class DFMGamepadInput.DFMGamepadInputPresetMgr
// 0x0008 (0x0038 - 0x0030)
class UDFMGamepadInputPresetMgr final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMGamepadInputPresetMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMGamepadInputPresetMgr")
	}
	static class UDFMGamepadInputPresetMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMGamepadInputPresetMgr>();
	}
};
DUMPER7_ASSERTS_UDFMGamepadInputPresetMgr;

// Class DFMGamepadInput.DFMJoystickInputPresetGroupMgr
// 0x0008 (0x0038 - 0x0030)
class UDFMJoystickInputPresetGroupMgr final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMJoystickInputPresetGroupMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMJoystickInputPresetGroupMgr")
	}
	static class UDFMJoystickInputPresetGroupMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMJoystickInputPresetGroupMgr>();
	}
};
DUMPER7_ASSERTS_UDFMJoystickInputPresetGroupMgr;

// Class DFMGamepadInput.DFMobilePlayerInput
// 0x0008 (0x0690 - 0x0688)
class UDFMobilePlayerInput : public UMobilePlayerInput
{
public:
	uint8                                         Pad_688[0x8];                                      // 0x0688(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTimerForRefreshButtonOverlap(); // (Final, Native, Public) // @ 0x146D611E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMobilePlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMobilePlayerInput")
	}
	static class UDFMobilePlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMobilePlayerInput>();
	}
};
DUMPER7_ASSERTS_UDFMobilePlayerInput;

// Class DFMGamepadInput.DFMPlayerInput
// 0x00E8 (0x0800 - 0x0718)
class UDFMPlayerInput : public UDFHDPlayerInput
{
public:
	uint8                                         Pad_718[0x7C];                                     // 0x0718(0x007C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedFinalGamepadSensitivityX;                    // 0x0794(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CachedFinalGamepadSensitivityY;                    // 0x0798(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79C[0x64];                                     // 0x079C(0x0064)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetFinalKeyAxisValue(const class FName& AxisName); // (Final, Native, Public, HasOutParams) // @ 0x146D60CC0
	float GetKeyAxisValueAfterCurve(const class FName& AxisName); // (Final, Native, Public, HasOutParams) // @ 0x146D60E40
	float GetKeyAxisValueAfterRestrict(const class FName& AxisName); // (Final, Native, Public, HasOutParams) // @ 0x146D60EE0
	TArray<float> GetSticksState(int32 Type); // (Final, Native, Public) // @ 0x146D60FB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMPlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMPlayerInput")
	}
	static class UDFMPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMPlayerInput>();
	}
};
DUMPER7_ASSERTS_UDFMPlayerInput;

}

