#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMIrisSeamless

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum DFMIrisSeamless.EIrisEnterStageType
// NumValues: 0x000C
enum class EIrisEnterStageType : uint8
{
	None                                     = 0,
	Init                                     = 1,
	Match                                    = 2,
	SelectShow                               = 3,
	GetOn                                    = 4,
	EventShow                                = 5,
	PadShow                                  = 6,
	InfoInteract                             = 7,
	Abseil                                   = 8,
	Finish                                   = 9,
	Fail                                     = 10,
	Max                                      = 11,
};

// Enum DFMIrisSeamless.ESeamlessEntryMatchType
// NumValues: 0x0006
enum class ESeamlessEntryMatchType : uint8
{
	None                                     = 0,
	Tutorial                                 = 1,
	Scream                                   = 2,
	FirstN                                   = 3,
	Normal                                   = 4,
	ESeamlessEntryMatchType_MAX              = 5,
};

// Enum DFMIrisSeamless.ESeamlessDSConnectState
// NumValues: 0x0006
enum class ESeamlessDSConnectState : uint8
{
	None                                     = 0,
	Waiting                                  = 1,
	ReadyConnect                             = 2,
	Connecting                               = 3,
	Connected                                = 4,
	MAX                                      = 5,
};

// Enum DFMIrisSeamless.EClientSeamlessTravelStatus
// NumValues: 0x000D
enum class EClientSeamlessTravelStatus : uint8
{
	OnClientSeamlessTravelBegin              = 0,
	OnSeamlessStageEnter                     = 1,
	OnPreCleanupDynamicObjects               = 2,
	OnPostCleanupDynamicObjects              = 3,
	OnPreConnectDS                           = 4,
	OnPostConnectDS                          = 5,
	OnPreStandaloneInitialize                = 6,
	OnPostStandaloneInitialize               = 7,
	OnClientCreateNewPlayerController        = 8,
	OnSwitchClientPlayer                     = 9,
	OnClientSeamlessTravelEnd                = 10,
	OnNetDriverShutdown                      = 11,
	EClientSeamlessTravelStatus_MAX          = 12,
};

// ScriptStruct DFMIrisSeamless.SeamlessEntryCharacterAppearanceData
// 0x0020 (0x0020 - 0x0000)
struct FSeamlessEntryCharacterAppearanceData final
{
public:
	int64                                         PlayerId;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HeroSuitID;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Equipments;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSeamlessEntryCharacterAppearanceData;

// ScriptStruct DFMIrisSeamless.SeamlessEntryProgress
// 0x0014 (0x0014 - 0x0000)
struct FSeamlessEntryProgress final
{
public:
	bool                                          bIsWaitingMapInteract;                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLastSecond;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastDelta;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MapInteractTime;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentSeamlessEntryProgress;                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetSeamlessEntryProgress;                       // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSeamlessEntryProgress;

// ScriptStruct DFMIrisSeamless.SafeHouseHelicopterAnimInstanceProxy
// 0x0030 (0x07D0 - 0x07A0)
struct FSafeHouseHelicopterAnimInstanceProxy final : public FAnimInstanceProxy
{
public:
	struct FVector                                LeftDoorLocation;                                  // 0x0798(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightDoorLocation;                                 // 0x07A4(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          HelicopterIdleAnim;                                // 0x07B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopAnimation;                                     // 0x07B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASafeHouseHelicopter*                   SafeHouseHelicopter;                               // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C8[0x8];                                      // 0x07C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSafeHouseHelicopterAnimInstanceProxy;

}

