#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMLuaSupport

#include "Basic.hpp"


namespace SDK
{

// Enum DFMLuaSupport.ELuaFrontEndType
// NumValues: 0x0005
enum class ELuaFrontEndType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	FromSettlement                           = 2,
	WidgetTest                               = 10,
	ELuaFrontEndType_MAX                     = 11,
};

// ScriptStruct DFMLuaSupport.PerfStatData
// 0x0018 (0x0018 - 0x0000)
struct FPerfStatData final
{
public:
	float                                         GameThreadTime;                                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RenderThreadTime;                                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RHIThreadTime;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicResolution;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputLatencyTime;                                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GPUFrameTime;                                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfStatData;

// ScriptStruct DFMLuaSupport.LuaWidgetCreatedPool
// 0x0040 (0x0040 - 0x0000)
struct FLuaWidgetCreatedPool final
{
public:
	TArray<class UUserWidget*>                    CreatedWidgets;                                    // 0x0000(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UUserWidget*>                    BindLuaWidgets;                                    // 0x0010(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UUserWidget>>     UsingWidget;                                       // 0x0020(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLuaWidgetCreatedPool;

}

