#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMLocalization

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum DFMLocalization.ECommonTextType
// NumValues: 0x0003
enum class ECommonTextType : uint8
{
	InGame                                   = 0,
	OutGame                                  = 1,
	ECommonTextType_MAX                      = 2,
};

// Enum DFMLocalization.ETimeType
// NumValues: 0x0006
enum class ETimeType : uint8
{
	Default                                  = 0,
	Short                                    = 1,
	Medium                                   = 2,
	Long                                     = 3,
	Full                                     = 4,
	ETimeType_MAX                            = 5,
};

// Enum DFMLocalization.ECulturePlatformType
// NumValues: 0x0004
enum class ECulturePlatformType : uint8
{
	Default                                  = 0,
	Common                                   = 1,
	Console_Only                             = 2,
	ECulturePlatformType_MAX                 = 3,
};

// Enum DFMLocalization.EVersionType
// NumValues: 0x0004
enum class EVersionType : uint8
{
	None                                     = 0,
	Test                                     = 1,
	Shipping                                 = 2,
	EVersionType_MAX                         = 3,
};

// ScriptStruct DFMLocalization.AreaCultureSearchingData
// 0x0010 (0x0010 - 0x0000)
struct FAreaCultureSearchingData final
{
public:
	TArray<class FString>                         SearchingChain;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAreaCultureSearchingData;

// ScriptStruct DFMLocalization.ServerHotPatchData
// 0x0050 (0x0050 - 0x0000)
struct FServerHotPatchData final
{
public:
	class FString                                 Namespace;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceString;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CultureSign;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Trans;                                             // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FServerHotPatchData;

// ScriptStruct DFMLocalization.HotPatchVersionEntry
// 0x0018 (0x0018 - 0x0000)
struct FHotPatchVersionEntry final
{
public:
	class FString                                 CultureSign;                                       // 0x0000(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Version;                                           // 0x0010(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHotPatchVersionEntry;

// ScriptStruct DFMLocalization.LocalizeNumberConfigRow
// 0x0030 (0x0038 - 0x0008)
struct FLocalizeNumberConfigRow final : public FTableRowBase
{
public:
	class FString                                 Desc;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FormatStr;                                         // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UsingCultureList;                                  // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalizeNumberConfigRow;

// ScriptStruct DFMLocalization.LocalizeVoiceRow
// 0x0078 (0x0080 - 0x0008)
struct FLocalizeVoiceRow final : public FTableRowBase
{
public:
	int32                                         SortNum;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CultureWwise;                                      // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CultureWwiseDisplayName;                           // 0x0018(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FString                                 RowDescription;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EVersionType>                          Versions;                                          // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<ECulturePlatformType>                  Platforms;                                         // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 DownloadKey;                                       // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CultureSign;                                       // 0x0070(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalizeVoiceRow;

// ScriptStruct DFMLocalization.CurrencyCodeLUTRow
// 0x0040 (0x0048 - 0x0008)
struct FCurrencyCodeLUTRow final : public FTableRowBase
{
public:
	class FString                                 Desc;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrencyCode;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GoogleRegionCode;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AppleRegionCode;                                   // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCurrencyCodeLUTRow;

// ScriptStruct DFMLocalization.MidasbuyURLConfigRow
// 0x0030 (0x0038 - 0x0008)
struct FMidasbuyURLConfigRow final : public FTableRowBase
{
public:
	class FString                                 Desc;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RegionCode;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URLString;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMidasbuyURLConfigRow;

// ScriptStruct DFMLocalization.R13NRegionCodeConfigRow
// 0x0018 (0x0020 - 0x0008)
struct FR13NRegionCodeConfigRow final : public FTableRowBase
{
public:
	int32                                         RegionCode;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RegionDesc;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FR13NRegionCodeConfigRow;

// ScriptStruct DFMLocalization.ComputeTextConfigRow
// 0x0020 (0x0028 - 0x0008)
struct FComputeTextConfigRow final : public FTableRowBase
{
public:
	class FText                                   RandTextConfig;                                    // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         RandSeedConfig;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FComputeTextConfigRow;

// ScriptStruct DFMLocalization.LocalizeCultureRow
// 0x0050 (0x0058 - 0x0008)
struct FLocalizeCultureRow final : public FTableRowBase
{
public:
	class FName                                   CultureSign;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RowDescription;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CultureDisplayName;                                // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CultureWwise;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EVersionType>                          Versions;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<ECulturePlatformType>                  Platforms;                                         // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SecurityReportId;                                  // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IsGuideDownload;                                   // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalizeCultureRow;

// ScriptStruct DFMLocalization.LocalizeCommonTextConfigRow
// 0x0038 (0x0040 - 0x0008)
struct FLocalizeCommonTextConfigRow final : public FTableRowBase
{
public:
	class FString                                 TextKey;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0028(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalizeCommonTextConfigRow;

// ScriptStruct DFMLocalization.LocalizeTimeConfigRow
// 0x0070 (0x0078 - 0x0008)
struct FLocalizeTimeConfigRow final : public FTableRowBase
{
public:
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            TimeFormatConfig;                                  // 0x0028(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalizeTimeConfigRow;

}

