#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMLocalization

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DFMLocalization_structs.hpp"
#include "GameCore_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DFMLocalization.DFMLocalizationIniConfig
// 0x0030 (0x0058 - 0x0028)
class UDFMLocalizationIniConfig final : public UObject
{
public:
	struct FSoftClassPath                         DFMLocalizationConfigPath;                         // 0x0028(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DFDefaultCodeTablePath;                            // 0x0040(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMLocalizationIniConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMLocalizationIniConfig")
	}
	static class UDFMLocalizationIniConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMLocalizationIniConfig>();
	}
};
DUMPER7_ASSERTS_UDFMLocalizationIniConfig;

// Class DFMLocalization.DFMLocalizationConfig
// 0x0050 (0x0078 - 0x0028)
class UDFMLocalizationConfig final : public UObject
{
public:
	TMap<class FString, struct FAreaCultureSearchingData> CustomCultureSearchingChainMap;            // 0x0028(0x0050)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	void RefreshCustomCultureRedirects(); // (Final, Native, Public) // @ 0x141398A90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMLocalizationConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMLocalizationConfig")
	}
	static class UDFMLocalizationConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMLocalizationConfig>();
	}
};
DUMPER7_ASSERTS_UDFMLocalizationConfig;

// Class DFMLocalization.DFMLocalizationManager
// 0x0048 (0x0078 - 0x0030)
class UDFMLocalizationManager final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(const class FString& NewCulture)> OnCultureChanged;                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& NewCulture)> OnTextCultureChanged;            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 FallbackCulture;                                   // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMLocalizationSettings*               DFMLocalizationSettings;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBasePathConfig*                        LocalizeBasePath;                                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDFMLocalizationConfig*                 DFMLocalizationConfig;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UDFMLocalizationManager* Get(const class UObject* GameInst); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141395BC0

	bool AddPolyglotData(const class FString& Namespace, const class FString& Key, const class FString& SourceString, const TMap<class FString, class FString>& LocalizedData); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141395340
	bool AddServerHotPatchData(const TArray<struct FServerHotPatchData>& ServerHotPatchData, const int32 LastestVersion); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1413955A0
	void ApplyHotfix(const class FString& Filename); // (Final, Native, Public, BlueprintCallable) // @ 0x141395800
	void ApplyServerHotPatch(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413958C0
	void ClearFixDFMLocData(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413959C0
	void DumpTextLocalizationMemory(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395AB0
	int32 GetCurHotPatchVersion(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395E40
	class FString GetCurLanguageVoiceCulture(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395E70
	class FString GetCurrentCulture(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395EF0
	class FString GetCurrentVoiceCulture(); // (Final, Native, Public, BlueprintCallable) // @ 0x141396070
	class FString GetDBVersionByCulture(const class FString& InCulture); // (Final, Native, Public, BlueprintCallable) // @ 0x141396170
	class FString GetDisplayString(class FString* Namespace, class FString* Key); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141396630
	TArray<class FString> GetLocalizedCultures(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413967E0
	class FString GetNativeCulture(); // (Final, Native, Public, BlueprintCallable) // @ 0x141396980
	class FString GetRegionName(); // (Final, Native, Public, BlueprintCallable) // @ 0x141396C60
	int32 GetSecurityReportId(); // (Final, Native, Public, BlueprintCallable) // @ 0x141396CE0
	class FString GetSuitableCulture(const TArray<class FString>& AvalibleCultures, const class FString& CultureToMatch); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141396D10
	void HandleCultureChanged(const class FString& Culture); // (Final, Native, Private) // @ 0x141396F00
	void InitCurrentCulture(); // (Final, Native, Public) // @ 0x141397050
	bool IsChineseEnv(); // (Final, Native, Public, BlueprintCallable) // @ 0x141397070
	bool IsLoadCultureRes(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413971D0
	void LoadR13NLocalizationResource(); // (Final, Native, Public, BlueprintCallable) // @ 0x141397200
	bool SetCurrentCulture(const class FString& Culture, bool IsInit); // (Final, Native, Public, BlueprintCallable) // @ 0x141398AB0
	bool SetCurrentTextCulture(const class FString& Culture); // (Final, Native, Public, BlueprintCallable) // @ 0x141398CE0
	bool SetCurrentVoiceCulture(const class FString& Culture); // (Final, Native, Public, BlueprintCallable) // @ 0x141398ED0
	void SetHotPatchVersion(const int32 InVersion); // (Final, Native, Public) // @ 0x141399130
	bool UpdateDbVersionByCulture(const class FString& InCulture, const class FString& InVersion); // (Final, Native, Public, BlueprintCallable) // @ 0x141399290
	bool UpdateDisplayString(class FString* SourceString, class FString* NewString, class FString* Namespace, class FString* Key); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141399530

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMLocalizationManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMLocalizationManager")
	}
	static class UDFMLocalizationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMLocalizationManager>();
	}
};
DUMPER7_ASSERTS_UDFMLocalizationManager;

// Class DFMLocalization.DFMLocalizationSettings
// 0x00D0 (0x00F8 - 0x0028)
class UDFMLocalizationSettings final : public UObject
{
public:
	TArray<class FString>                         LocalizedCultures;                                 // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class FString                                 CurrentCulture;                                    // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentTextCulture;                                // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentVoiceCulture;                               // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultCulture;                                    // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultLanguage;                                   // 0x0078(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsFirstOpen;                                      // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CachedCulture2SqlDbVersion;                        // 0x0090(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	TArray<struct FHotPatchVersionEntry>          HotPatchVersion;                                   // 0x00E0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckPlatformUsable(const TArray<ECulturePlatformType>& InPlatformConfig); // (Final, Native, Public, HasOutParams) // @ 0x1413958E0
	class FString GetCurrentCulture(); // (Final, Native, Public) // @ 0x141395F70
	class FString GetCurrentTextCulture(); // (Final, Native, Public) // @ 0x141395FF0
	class FString GetCurrentVoiceCulture(); // (Final, Native, Public) // @ 0x1413960F0
	class FString GetDBVersionByCulture(const class FString& InCulture); // (Final, Native, Public, BlueprintCallable) // @ 0x141396290
	TArray<class FString> GetLocalizedCultures(); // (Final, Native, Public) // @ 0x1413968B0
	bool InitCultureList(); // (Final, Native, Private) // @ 0x141397020
	bool IsCultureExist(const class FString& Culture); // (Final, Native, Private) // @ 0x1413970A0
	void SetCurrentCulture(const class FString& Culture); // (Final, Native, Public) // @ 0x141398BC0
	void SetCurrentTextCulture(const class FString& Culture); // (Final, Native, Public) // @ 0x141398DB0
	void SetCurrentVoiceCulture(const class FString& Culture); // (Final, Native, Public) // @ 0x141398FA0
	void UpdateConfig(); // (Final, Native, Public) // @ 0x141399270
	bool UpdateDbVersionByCulture(const class FString& InCulture, const class FString& InVersion); // (Final, Native, Public, BlueprintCallable) // @ 0x1413993E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMLocalizationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMLocalizationSettings")
	}
	static class UDFMLocalizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMLocalizationSettings>();
	}
};
DUMPER7_ASSERTS_UDFMLocalizationSettings;

// Class DFMLocalization.BasePathConfig
// 0x0068 (0x0090 - 0x0028)
class UBasePathConfig final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BaseRootPath;                                      // 0x0030(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultIncrementalHotfixPath;                      // 0x0040(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultHotfixFile;                                 // 0x0050(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultServerDataFile;                             // 0x0060(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultServerHotPatchFile;                         // 0x0070(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DefaultPufferLocPath;                              // 0x0080(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class FString GetBaseRootPath(); // (Final, Native, Public) // @ 0x141395DC0
	class FString GetDefaultHotfixFilePath(); // (Final, Native, Public) // @ 0x141396430
	class FString GetDefaultIncrementalHotfixPath(); // (Final, Native, Public) // @ 0x1413964B0
	class FString GetDefaultServerDataFilePath(); // (Final, Native, Public) // @ 0x141396530
	class FString GetDefaultServerHotPatchFilePath(); // (Final, Native, Public) // @ 0x1413965B0
	class FString GetPathBasedPuffer(const class FString& InPath, const bool bIsContentDir); // (Final, Native, Public) // @ 0x141396A80
	class FString GetPufferLocPath(); // (Final, Native, Public) // @ 0x141396BE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BasePathConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BasePathConfig")
	}
	static class UBasePathConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasePathConfig>();
	}
};
DUMPER7_ASSERTS_UBasePathConfig;

// Class DFMLocalization.DFMTextFormatData
// 0x0088 (0x00B0 - 0x0028)
class UDFMTextFormatData final : public UObject
{
public:
	uint8                                         Pad_28[0x88];                                      // 0x0028(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFMTextFormatData* CreateNewFormatData(); // (Final, Native, Static, Public) // @ 0x1413959E0

	void AddArg_Double(const class FString& InName, const double InData); // (Final, Native, Public) // @ 0x141394EE0
	void AddArg_Float(const class FString& InName, const float InData); // (Final, Native, Public, BlueprintCallable) // @ 0x141394FF0
	void AddArg_Int(const class FString& InName, const int32 InData); // (Final, Native, Public, BlueprintCallable) // @ 0x1413950F0
	void AddArg_Text(const class FString& InName, const class FText& InData); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1413951F0
	class FText DoFormatText(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395A10
	void SetFormatText(const class FText& InText); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141399060

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMTextFormatData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMTextFormatData")
	}
	static class UDFMTextFormatData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMTextFormatData>();
	}
};
DUMPER7_ASSERTS_UDFMTextFormatData;

// Class DFMLocalization.DFStringTableManager
// 0x0000 (0x0030 - 0x0030)
class UDFStringTableManager final : public UGameInstanceSubsystem
{
public:
	static class UDFStringTableManager* Get(const class UGameInstance* InGameInstance); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141395D40

	bool EnableLoadStringTableFromBin(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395AD0
	bool EnableLocalizationSqlite(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395B00
	bool EnableReleaseStringTable(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395B30
	bool EnableSqlite(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395B60
	bool EnableStringTableSqlite(); // (Final, Native, Public, BlueprintCallable) // @ 0x141395B90
	void OnStringTableLoaded(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0
	void UnloadAllStringTables(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413991D0
	void UnloadAllStringTableStructs(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413991B0
	void UnloadStringTable(class FName InTableId); // (Final, Native, Public, BlueprintCallable) // @ 0x1413991F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFStringTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFStringTableManager")
	}
	static class UDFStringTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFStringTableManager>();
	}
};
DUMPER7_ASSERTS_UDFStringTableManager;

// Class DFMLocalization.KismetLocalizationLibrary
// 0x0000 (0x0028 - 0x0028)
class UKismetLocalizationLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FText Loc_BuildFTextWithNamespaceAndKey(const class FString& InNamespace, const class FString& InKey, const class FString& InSourceString); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397220
	static bool Loc_DecompressCultureDB(const class FString& InCultureName, bool bIsForceDecompress); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397430
	static class FText Loc_GetCommonText(ECommonTextType TextType, const class FString& InTextKey); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397530
	static class FString Loc_GetNormalizedTime(const struct FDateTime& InDateTime); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x1413976F0
	static class FString Loc_GetNormalizedTimeWithCulture(const struct FDateTime& InDateTime, const class FString& InTargetCulture, const ETimeType& InDateTimeStyle); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x1413977D0
	static class FString Loc_GetNormalizedTimeWithFormat(const struct FDateTime& InDateTime, const class FString& InFormat); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141397970
	static class FString Loc_GetStrMD5Hash(const class FString& InStr); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397AD0
	static class FName Loc_GetTableIdByName(const class FString& InTableName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397BE0
	static class FText Loc_GetTextFromBuffer(const class FString& InBuffer); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397CB0
	static class FText Loc_GetTextFromLoc(const class FString& InTableName, const class FString& InKey); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397DD0
	static class FString Loc_GetTimeFormatStr(const class FString& InRowName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141397F70
	static class FString Loc_GetTimeStrWithFormatName(const struct FDateTime& InDateTime, const class FString& InRowName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141398080
	static class FString Loc_NormalizeNumber2Percentage(const float InNum); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1413981E0
	static class FString Loc_NormalizeNumber2Str_Double(double InNum, const class FString& InTargetCulture, int32 MaximumFractionalDigits); // (Final, Native, Static, Public) // @ 0x1413982B0
	static class FString Loc_NormalizeNumber2Str_Float(float InNum, const class FString& InTargetCulture, int32 MaximumFractionalDigits); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141398480
	static class FString Loc_NormalizeNumber2Str_Int(int32 InNum, const class FString& InTargetCulture, int32 MaximumFractionalDigits); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141398820
	static class FString Loc_NormalizeNumber2Str_Int64(int64 InNum, const class FString& InTargetCulture, int32 MaximumFractionalDigits); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141398650
	static void Loc_OnDownloadCurrentCultureDB(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1413989F0
	static void Loc_SetBeforeLoginStage(bool IsBeforeLoginStage); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141398A10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KismetLocalizationLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KismetLocalizationLibrary")
	}
	static class UKismetLocalizationLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKismetLocalizationLibrary>();
	}
};
DUMPER7_ASSERTS_UKismetLocalizationLibrary;

// Class DFMLocalization.LocalizeTimeConfigManager
// 0x0008 (0x0038 - 0x0030)
class ULocalizeTimeConfigManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LocalizeTimeConfigManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LocalizeTimeConfigManager")
	}
	static class ULocalizeTimeConfigManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizeTimeConfigManager>();
	}
};
DUMPER7_ASSERTS_ULocalizeTimeConfigManager;

// Class DFMLocalization.LocalizeNumberConfigManager
// 0x0190 (0x01C0 - 0x0030)
class ULocalizeNumberConfigManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x190];                                     // 0x0030(0x0190)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetDecimalSeparatorStr(); // (Final, Native, Public) // @ 0x1413963B0
	class FString GetNumberSeparatorStr(); // (Final, Native, Public) // @ 0x141396A00
	void UpdateSeparatorStr(const class FString& InCulture); // (Final, Native, Private) // @ 0x1413997C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LocalizeNumberConfigManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LocalizeNumberConfigManager")
	}
	static class ULocalizeNumberConfigManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizeNumberConfigManager>();
	}
};
DUMPER7_ASSERTS_ULocalizeNumberConfigManager;

// Class DFMLocalization.LocalizeCommonTextOutGameConfigManager
// 0x0020 (0x0050 - 0x0030)
class ULocalizeCommonTextOutGameConfigManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LocalizeCommonTextOutGameConfigManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LocalizeCommonTextOutGameConfigManager")
	}
	static class ULocalizeCommonTextOutGameConfigManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizeCommonTextOutGameConfigManager>();
	}
};
DUMPER7_ASSERTS_ULocalizeCommonTextOutGameConfigManager;

// Class DFMLocalization.LocalizeCommonTextInGameConfigManager
// 0x0020 (0x0050 - 0x0030)
class ULocalizeCommonTextInGameConfigManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LocalizeCommonTextInGameConfigManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LocalizeCommonTextInGameConfigManager")
	}
	static class ULocalizeCommonTextInGameConfigManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocalizeCommonTextInGameConfigManager>();
	}
};
DUMPER7_ASSERTS_ULocalizeCommonTextInGameConfigManager;

}

