#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMMission

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DFMMission.ELayerActorCheck
// NumValues: 0x0004
enum class ELayerActorCheck : uint8
{
	Common                                   = 0,
	Alive                                    = 1,
	NoAWheeledVehicle                        = 2,
	ELayerActorCheck_MAX                     = 3,
};

// Enum DFMMission.EMissionLayerOperate
// NumValues: 0x0009
enum class EMissionLayerOperate : uint8
{
	None                                     = 0,
	Show                                     = 1,
	Hide                                     = 2,
	EnableInteract                           = 3,
	DisableInteract                          = 4,
	Destroy                                  = 5,
	Get                                      = 6,
	GetAlive                                 = 7,
	EMissionLayerOperate_MAX                 = 8,
};

// Enum DFMMission.EMissionSpawnerType
// NumValues: 0x0003
enum class EMissionSpawnerType : uint8
{
	Monster                                  = 0,
	NPC                                      = 1,
	EMissionSpawnerType_MAX                  = 2,
};

// Enum DFMMission.EMissionActionType
// NumValues: 0x0003
enum class EMissionActionType : uint8
{
	None                                     = 0,
	Quest                                    = 1,
	EMissionActionType_MAX                   = 2,
};

// Enum DFMMission.ERaidInterCondition
// NumValues: 0x0003
enum class ERaidInterCondition : uint8
{
	AllDie                                   = 0,
	TimeOut                                  = 1,
	ERaidInterCondition_MAX                  = 2,
};

// Enum DFMMission.EMissionQuestLifeType
// NumValues: 0x0004
enum class EMissionQuestLifeType : uint8
{
	Save                                     = 0,
	AutoRemove                               = 1,
	AutoClear                                = 2,
	MAX                                      = 3,
};

// Enum DFMMission.EMissionEventLayer
// NumValues: 0x0003
enum class EMissionEventLayer : uint8
{
	World                                    = 1,
	DaJieAn                                  = 2,
	MAX                                      = 3,
};

// Enum DFMMission.EMissionState
// NumValues: 0x0005
enum class EMissionState : uint32
{
	Init                                     = 0,
	UnActivate                               = 1,
	LoadLevel                                = 2,
	Activate                                 = 3,
	MAX                                      = 4,
};

// Enum DFMMission.ETriggerAreaFlag
// NumValues: 0x0004
enum class ETriggerAreaFlag : uint8
{
	None                                     = 0,
	InTriggerArea                            = 1,
	NotInTriggerArea                         = 2,
	ETriggerAreaFlag_MAX                     = 3,
};

// ScriptStruct DFMMission.WorldActorInfo
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FWorldActorInfo final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldActorInfo;

// ScriptStruct DFMMission.WorldActorContent
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FWorldActorContent final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldActorContent;

// ScriptStruct DFMMission.MissionStageTriggerInfo
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FMissionStageTriggerInfo final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMissionStageTriggerInfo;

// ScriptStruct DFMMission.MissionTriggerActionInfo
// 0x0001 (0x0001 - 0x0000)
struct FMissionTriggerActionInfo final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMissionTriggerActionInfo;

// ScriptStruct DFMMission.MissionTriggerInfo
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FMissionTriggerInfo final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMissionTriggerInfo;

// ScriptStruct DFMMission.TaskGroupState
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FTaskGroupState final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTaskGroupState;

// ScriptStruct DFMMission.WorldTargetState
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FWorldTargetState final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldTargetState;

// ScriptStruct DFMMission.MissionTargetRequest
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FMissionTargetRequest final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMissionTargetRequest;

// ScriptStruct DFMMission.MissionMapMarkerData
// 0x0002 (0x0002 - 0x0000)
struct FMissionMapMarkerData final
{
public:
	uint8                                         Pad_0[0x2];                                        // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMissionMapMarkerData;

// ScriptStruct DFMMission.PlayerLevelState
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FPlayerLevelState final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlayerLevelState;

// ScriptStruct DFMMission.LevelStreamInstanceInfo
// 0x0038 (0x0038 - 0x0000)
struct FLevelStreamInstanceInfo final
{
public:
	class FName                                   LevelName;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PackageName;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PackageNameToLoad;                                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bShouldBeLoaded : 1;                               // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldBeVisible : 1;                              // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldBlockOnLoad : 1;                            // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LodIndex;                                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLevelStreamInstanceInfo;

}

