#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMMission

#include "Basic.hpp"

#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "DFMQuest_structs.hpp"
#include "DFMQuest_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGameFlow_structs.hpp"
#include "GameCore_classes.hpp"
#include "Engine_classes.hpp"
#include "DFMMission_structs.hpp"
#include "DFMGameplay_structs.hpp"


namespace SDK
{

// Class DFMMission.MissionBaseSimpleAction
// 0x0010 (0x0038 - 0x0028)
class UMissionBaseSimpleAction : public UObject
{
public:
	class UDFMMissionSimpleAction*                Daddy;                                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDone;                                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear(); // (Native, Public) // @ 0x140D31FF0
	void DoSpawn(); // (Native, Public) // @ 0x140C99940
	void InitAction(); // (Native, Public) // @ 0x140C99650
	void InitArgs(struct FSimpleActionArgument* Args, struct FSimpleActionExtArgument* InArg2); // (Native, Public, HasOutParams) // @ 0x149A6D3B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionBaseSimpleAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionBaseSimpleAction")
	}
	static class UMissionBaseSimpleAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionBaseSimpleAction>();
	}
};
DUMPER7_ASSERTS_UMissionBaseSimpleAction;

// Class DFMMission.MissionStartQuest
// 0x0018 (0x0050 - 0x0038)
class UMissionStartQuest final : public UMissionBaseSimpleAction
{
public:
	class AGPQuest*                               Quest;                                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPreBegin(class AGPQuest* InQuest); // (Final, Native, Public) // @ 0x149A74690
	void OnQuestEnd(class AGPQuest* InQuest); // (Final, Native, Public) // @ 0x149A74890

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionStartQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionStartQuest")
	}
	static class UMissionStartQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionStartQuest>();
	}
};
DUMPER7_ASSERTS_UMissionStartQuest;

// Class DFMMission.IrisPlayerMissionComponent
// 0x0008 (0x0100 - 0x00F8)
class UIrisPlayerMissionComponent final : public UGPPlayerMissionComponent
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientFocusPlayerLocations(const struct FVector& pos); // (Net, NetReliable, Native, Event, Public, HasDefaults, NetClient) // @ 0x144B20370
	void ClientNextMissionWhenLoadComplete(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144A3B1E0
	void ClientOpenTurnInItem(int64 QuestID, const class FString& NPCTag); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x149A6D020
	void ClientSetPlayerControllerRotator(const struct FRotator& Rotator); // (Net, NetReliable, Native, Event, Public, HasDefaults, NetClient) // @ 0x144BEC830
	void ClientShowRaidEnd(); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x144AD8170
	void MissionSubLevelCompleteClient(const class FString& LevelName, int32 missionid, bool All); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149A6D640
	void ServerAcceptMission(uint64 missionid); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x146BB1850
	void ServerActivateMission(uint64 missionid); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144AE25B0
	void ServerChangeWorld(EGameRuleType Type); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149348F60
	void ServerCompleteMission(int32 ID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144B2E550
	void ServerForceAcceptMission(uint64 missionid); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x146BB1A00
	void ServerForceFinishMission(uint64 missionid); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x146BB1BF0
	void ServerGotoObjectiveMission(int32 ID, int32 objectiveId); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149A6E470
	void ServerLoadMission(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x142A87380
	void ServerMissionGMRewards(uint64 ids); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144B9D980
	void ServerNextObjectiveMission(int32 ID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149A6E530
	void ServerResetMission(int32 ID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149A6E5C0
	void ServerSetCurrentMission(int32 Current); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149A6E650
	void ServerTraceMission(uint64 missionid); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144E69AA0
	void ServerTransferToObjective(int32 ID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144B33050
	void SetClientShowRewards(const TArray<struct FMissionRewardsInfo>& rewards); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x149A6E6E0
	void TryActivateMission(int64 missionid); // (Final, Native, Public, BlueprintCallable) // @ 0x149A6E970
	void TryCommitMission(int32 QuestID, const TArray<struct FMissionTurnInItemInfo>& Items, const class FString& NPCTag); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149A6E9F0
	void TryCommitMissionItem(int32 QuestID, int64 ItemID, const class FString& NPCTag); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149A6EBB0
	void TryLoadMission(); // (Final, Native, Public, BlueprintCallable) // @ 0x149A6ECF0
	void TryTraceMission(int64 missionid); // (Final, Native, Public, BlueprintCallable) // @ 0x149A6ED10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisPlayerMissionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisPlayerMissionComponent")
	}
	static class UIrisPlayerMissionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisPlayerMissionComponent>();
	}
};
DUMPER7_ASSERTS_UIrisPlayerMissionComponent;

// Class DFMMission.MissionComponent
// 0x0348 (0x0588 - 0x0240)
class UMissionComponent final : public UGPMissionComponent
{
public:
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AGPPlayerState>>  SharePlayerStates;                                 // 0x0248(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<int32, int32>                            GameStates;                                        // 0x0258(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint64>                                FinishedMission;                                   // 0x02A8(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint64>                                CurrentMissions;                                   // 0x02B8(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<uint64, int32>                           AllMissions;                                       // 0x02C8(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMission*>                       AllMissionObjects;                                 // 0x0318(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMissionLevel*>                  MissionLevels;                                     // 0x0328(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_338[0x50];                                     // 0x0338(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          MissionModeActivate;                               // 0x0388(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMission*                               CurrentActiveMission;                              // 0x0390(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_398[0x38];                                     // 0x0398(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        LastOpenActivatedMissionId;                        // 0x03D0(0x0008)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D8[0x88];                                     // 0x03D8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMissionLevelRequest*>           LevelRequest;                                      // 0x0460(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_470[0x58];                                     // 0x0470(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMissionTurnInItem                     MissionTurnInItemData;                             // 0x04C8(0x0060)(Net, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_528[0x50];                                     // 0x0528(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Enable;                                            // 0x0578(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_579[0xF];                                      // 0x0579(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FetchLimitMission(); // (Final, Native, Public) // @ 0x149A6D1F0
	class UMissionLevelRequest* GetLevelRequest(int32 InArg); // (Final, Native, Public) // @ 0x149A6D290
	void LoadAllMission(); // (Final, Native, Public, BlueprintCallable) // @ 0x149A6D4E0
	void OnRep_LastOpenActivatedMissionId(); // (Final, Native, Public) // @ 0x149A6E130
	void OnRep_MissionModeActivate(); // (Final, Native, Public) // @ 0x149A6E150
	void OnRep_MissionTurnInItemData(); // (Final, Native, Public) // @ 0x149A6E170
	void OnTeamScoreInfoChange(class FName scroeType, int32 Score); // (Final, Native, Public) // @ 0x149A6E2B0
	void ShowPanel(bool Show); // (Final, Native, Public, BlueprintCallable) // @ 0x149A6E850

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionComponent")
	}
	static class UMissionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionComponent>();
	}
};
DUMPER7_ASSERTS_UMissionComponent;

// Class DFMMission.MissionLevel
// 0x0160 (0x0188 - 0x0028)
class UMissionLevel final : public UObject
{
public:
	TArray<class FString>                         PreSublevelName;                                   // 0x0028(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EGameRuleType                                 WorldType;                                         // 0x0048(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        missionid;                                         // 0x0050(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMission*                               Mission;                                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitSig;                                           // 0x0060(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoadSig;                                           // 0x0064(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         unLoadSig;                                         // 0x0068(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0xF4];                                      // 0x006C(0x00F4)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASubLevelInstanceActor*>         SubInstanceActors;                                 // 0x0160(0x0010)(Edit, Net, ZeroConstructor, EditConst, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameStateMissionComponent*             GSComp;                                            // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Init(); // (Final, Native, Public) // @ 0x149A73790
	void OnPreBeginStage(class AGPQuestStage* LoadedQuestStage); // (Final, Native, Public) // @ 0x149A74710
	void OnRep_PreSubLevelNames(); // (Final, Exec, Native, Public) // @ 0x149A74930
	void OnRep_SubInstanceActor(); // (Final, Native, Public) // @ 0x140C994B0
	void OnStreamingCompletedFunc(); // (Final, Native, Public) // @ 0x149A74A50
	void OnStreamingUnLoadCompletedFunc(); // (Final, Native, Public) // @ 0x149A74A70
	void OnSubLevelLoadComplete(); // (Final, Native, Public) // @ 0x149A74A90
	void UnLevels(); // (Final, Native, Public) // @ 0x149A74FE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionLevel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionLevel")
	}
	static class UMissionLevel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionLevel>();
	}
};
DUMPER7_ASSERTS_UMissionLevel;

// Class DFMMission.DFMMissionSimpleQuestTrigger
// 0x0108 (0x0198 - 0x0090)
class UDFMMissionSimpleQuestTrigger final : public UQASimpleQuestProxy
{
public:
	class UMissionCombineTrigger*                 MissionCombineTrigger;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x40];                                      // 0x0098(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UMission*                               Mission;                                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x28];                                      // 0x00E0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMissionBaseSimpleAction*>       SimpleQuestAction;                                 // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x28];                                     // 0x0118(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionCombineTrigger*                 TagAreaTrigger;                                    // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_148[0x30];                                     // 0x0148(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ADFMCharacter*>                  BindhealthActorUpdates;                            // 0x0178(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x10];                                     // 0x0188(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateBindHealthCB(int32 H); // (Final, Native, Public) // @ 0x141193CB0
	void UpdateObjective(bool B); // (Final, Native, Public) // @ 0x149A6ED90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMMissionSimpleQuestTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMMissionSimpleQuestTrigger")
	}
	static class UDFMMissionSimpleQuestTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMMissionSimpleQuestTrigger>();
	}
};
DUMPER7_ASSERTS_UDFMMissionSimpleQuestTrigger;

// Class DFMMission.MissionLevelRequest
// 0x0010 (0x0038 - 0x0028)
class UMissionLevelRequest final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionLevelRequest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionLevelRequest")
	}
	static class UMissionLevelRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionLevelRequest>();
	}
};
DUMPER7_ASSERTS_UMissionLevelRequest;

// Class DFMMission.WorldCruiseSpawnerInteraceface
// 0x0000 (0x0000 - 0x0000)
class IWorldCruiseSpawnerInteraceface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WorldCruiseSpawnerInteraceface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorldCruiseSpawnerInteraceface")
	}
	static class IWorldCruiseSpawnerInteraceface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IWorldCruiseSpawnerInteraceface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IWorldCruiseSpawnerInteraceface;

// Class DFMMission.MissionTurnInItemGameplayHelper
// 0x0000 (0x0028 - 0x0028)
class UMissionTurnInItemGameplayHelper final : public UBlueprintFunctionLibrary
{
public:
	static void CommitMission(int32 QuestID, const TArray<struct FMissionTurnInItemInfo>& Items); // (Final, Native, Static, Public) // @ 0x149A731A0
	static void CommitMissionItem(int32 QuestID, int64 ItemID); // (Final, Native, Static, Public) // @ 0x149A73370
	static void GetQuestName(int32 QuestID, class FString* QuestName); // (Final, Native, Static, Public, HasOutParams) // @ 0x149A73540
	static void GetTurnInItemInfo(int32 QuestID, TArray<struct FMissionTurnInItemInfo>* Items); // (Final, Native, Static, Public, HasOutParams) // @ 0x149A73640
	static void RemoveMissionTurnInItemInfo(int32 handl); // (Final, Native, Static, Public) // @ 0x149A74EA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionTurnInItemGameplayHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionTurnInItemGameplayHelper")
	}
	static class UMissionTurnInItemGameplayHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionTurnInItemGameplayHelper>();
	}
};
DUMPER7_ASSERTS_UMissionTurnInItemGameplayHelper;

// Class DFMMission.DFMMissionMgr
// 0x0000 (0x0028 - 0x0028)
class UDFMMissionMgr final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMMissionMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMMissionMgr")
	}
	static class UDFMMissionMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMMissionMgr>();
	}
};
DUMPER7_ASSERTS_UDFMMissionMgr;

// Class DFMMission.MissionGoto
// 0x0060 (0x0098 - 0x0038)
class UMissionGoto final : public UMissionBaseSimpleAction
{
public:
	uint8                                         Pad_38[0x60];                                      // 0x0038(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGmGoto(); // (Final, Native, Public) // @ 0x149A73F40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionGoto")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionGoto")
	}
	static class UMissionGoto* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionGoto>();
	}
};
DUMPER7_ASSERTS_UMissionGoto;

// Class DFMMission.DFMMissionSimpleAction
// 0x00C8 (0x0110 - 0x0048)
class UDFMMissionSimpleAction final : public UQASimpleActionProxy
{
public:
	uint8                                         Pad_48[0xB0];                                      // 0x0048(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMissionBaseSimpleAction*>       MissionActions;                                    // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMMissionSimpleAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMMissionSimpleAction")
	}
	static class UDFMMissionSimpleAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMMissionSimpleAction>();
	}
};
DUMPER7_ASSERTS_UDFMMissionSimpleAction;

// Class DFMMission.MissionEventBusSubSystem
// 0x0000 (0x0030 - 0x0030)
class UMissionEventBusSubSystem final : public UGameInstanceSubsystem
{
public:
	static class UMissionEventBusSubSystem* Get(class UWorld* WorldContext); // (Final, Native, Static, Public) // @ 0x149A6D210

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionEventBusSubSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionEventBusSubSystem")
	}
	static class UMissionEventBusSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionEventBusSubSystem>();
	}
};
DUMPER7_ASSERTS_UMissionEventBusSubSystem;

// Class DFMMission.MissionPlaySequence
// 0x0010 (0x0048 - 0x0038)
class UMissionPlaySequence final : public UMissionBaseSimpleAction
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginSequenceInternal(class AGPSequenceActor* SequencePlayer); // (Final, Native, Public) // @ 0x140C98C70
	void OnEndSequenceInternal(class AGPSequenceActor* SequencePlayer); // (Final, Native, Public) // @ 0x149A755B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionPlaySequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionPlaySequence")
	}
	static class UMissionPlaySequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionPlaySequence>();
	}
};
DUMPER7_ASSERTS_UMissionPlaySequence;

// Class DFMMission.MissionSubsystem
// 0x03C8 (0x03F8 - 0x0030)
class UMissionSubsystem final : public UGPMissionSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AGPQuestMarkerBase>         MarkerClass;                                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0xA0];                                      // 0x0058(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                YourDaddy;                                         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevel*                                 quest_AIConfig_level;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AGPQuest*, class UMission*>        QuestMissionMap;                                   // 0x0108(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UGameStateMissionComponent*             GSMissionComponent;                                // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMissionComponent*                      MissionComponent;                                  // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x20];                                     // 0x0168(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionActorLayer*                     MissionActorLayer;                                 // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x268];                                    // 0x0190(0x0268)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void MS_GetAllActorWithTag(class UObject* WorldContext, class FName Tag, TArray<class AActor*>* OutActors); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x149A6D500

	void AddMissionQuest(class AGPQuest* InArg1, class UMission* InArg2); // (Final, Native, Public) // @ 0x149A6CEE0
	class UMissionBaseTrigger* CreateTrigger(EGPSimpleQuestType MissionTrigerType, class UMission* InArg2); // (Final, Native, Public) // @ 0x149A6D130
	class UMission* GetQuestMission(class AGPQuest* InArg1); // (Final, Native, Public) // @ 0x149A6D320
	void HandleLevelsChanged(); // (Final, Native, Public) // @ 0x140C994B0
	void NotifyLevelAddedToWorld(class ULevel* InLevel, class UWorld* InWorld); // (Final, Native, Public) // @ 0x149A6D790
	void OnAIPlayerDiedEvent(class AController* cpc, class AController* KillerController); // (Final, Native, Public) // @ 0x149A6D850
	void OnHudInit(); // (Final, Native, Public) // @ 0x140C994B0
	void OnMissionAcception(class AGPPlayerController* cpc, int32 missionid); // (Final, Native, Public) // @ 0x149A6DA90
	void OnMissionAcceptionLocal(int32 missionid); // (Final, Native, Public) // @ 0x149A6DB50
	void OnMissionCheckBind(bool* Enable, uint64 missionid, uint64 objectiveId); // (Final, Native, Public, HasOutParams) // @ 0x149A6DBD0
	void OnMissionEnterOpenWorld(class AGPPlayerController* cpc); // (Final, Native, Public) // @ 0x149A6DCE0
	void OnMissionEnterRaidWorld(class AGPPlayerController* cpc); // (Final, Native, Public) // @ 0x140C98C70
	void OnMissionForceFinish(class AGPPlayerController* cpc, int32 missionid); // (Final, Native, Public) // @ 0x149A6DD60
	void OnMissionForceGoto(class AGPPlayerController* cpc, int32 missionid, int32 objectiveId); // (Final, Native, Public) // @ 0x149A6DE20
	void OnMissionGMRewards(class AGPPlayerController* cpc, TArray<uint64>* inventoryids); // (Final, Native, Public, HasOutParams) // @ 0x149A6DF20
	void OnMissionLevelloadSuccess(); // (Final, Native, Public) // @ 0x140C994B0
	void OnServerItemMoveNotify(const struct FItemMoveCmd& ItemMoveCmd); // (Final, Native, Public) // @ 0x149A6E1B0
	void RemoveMissionQuest(class AGPQuest* InArg1); // (Final, Native, Public) // @ 0x149A6E370
	void ServerOnResurrectCoinEmpty(uint64 PlayerId); // (Final, Native, Public) // @ 0x140C98C70
	void ServerPlayerFetchMission(class AGPPlayerController* Player); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144B273D0
	void WorldActorBoxOpenFinished(class AGPPlayerController* cpc, class AInventoryPickup_OpenBox* Box); // (Final, Native, Public) // @ 0x149A6EE20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionSubsystem")
	}
	static class UMissionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionSubsystem>();
	}
};
DUMPER7_ASSERTS_UMissionSubsystem;

// Class DFMMission.DFMMissionSubsystem
// 0x0068 (0x03D8 - 0x0370)
class ADFMMissionSubsystem final : public ALevelSubsystem
{
public:
	uint8                                         Pad_370[0x68];                                     // 0x0370(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHUDHealthDamaged(float Damage, const struct FTakeHitInfo& TakeHitInfo); // (Final, Native, Public, HasOutParams) // @ 0x149A6D910

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMMissionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMMissionSubsystem")
	}
	static class ADFMMissionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFMMissionSubsystem>();
	}
};
DUMPER7_ASSERTS_ADFMMissionSubsystem;

// Class DFMMission.MissionBaseTrigger
// 0x0170 (0x0198 - 0x0028)
class UMissionBaseTrigger : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Daddy;                                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionBaseAction*                     MissionStageSucAction;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMissionBaseAction*                     MissionStageFailedAction;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0xB8];                                      // 0x0078(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	class ACHARACTER*                             TriggerActor;                                      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x60];                                     // 0x0138(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTriggerChange(bool InArg); // (Native, Public) // @ 0x1494C0BB0
	void Toggle(bool InArg); // (Native, Public) // @ 0x149A6E8E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionBaseTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionBaseTrigger")
	}
	static class UMissionBaseTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionBaseTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionBaseTrigger;

// Class DFMMission.MissionBaseAction
// 0x0020 (0x0048 - 0x0028)
class UMissionBaseAction : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMission*                               Mission;                                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionBaseAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionBaseAction")
	}
	static class UMissionBaseAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionBaseAction>();
	}
};
DUMPER7_ASSERTS_UMissionBaseAction;

// Class DFMMission.MissionCombineAction
// 0x0010 (0x0058 - 0x0048)
class UMissionCombineAction final : public UMissionBaseAction
{
public:
	TArray<class UMissionBaseAction*>             Actions;                                           // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionCombineAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionCombineAction")
	}
	static class UMissionCombineAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionCombineAction>();
	}
};
DUMPER7_ASSERTS_UMissionCombineAction;

// Class DFMMission.MissionActionLoadGPQuest
// 0x0008 (0x0050 - 0x0048)
class UMissionActionLoadGPQuest final : public UMissionBaseAction
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPreBegin(class AGPQuest* Quest); // (Final, Native, Public) // @ 0x149A6E030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionActionLoadGPQuest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionActionLoadGPQuest")
	}
	static class UMissionActionLoadGPQuest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionActionLoadGPQuest>();
	}
};
DUMPER7_ASSERTS_UMissionActionLoadGPQuest;

// Class DFMMission.GameStateMissionComponent
// 0x0100 (0x01F8 - 0x00F8)
class UGameStateMissionComponent final : public UGPGameStateMissionComponent
{
public:
	class UMissionSubsystem*                      MissionSubsystem;                                  // 0x00F8(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InitFromServer;                                    // 0x0100(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PersistLevels;                                     // 0x0108(0x0010)(Edit, Net, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoadSig;                                           // 0x0128(0x0004)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12C[0xB4];                                     // 0x012C(0x00B4)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMissionLevel*>                  TickMissionLevels;                                 // 0x01E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          MissionModeActivate;                               // 0x01F0(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTickLevel(class UMissionLevel* InArg); // (Final, Native, Public) // @ 0x149A6CFA0
	void OnGameFlowStageTypeChange(EGameFlowStageType Type); // (Final, Native, Public) // @ 0x141334EA0
	void OnQuestEnd(class AGPQuest* Quest); // (Final, Native, Public) // @ 0x149A6E0B0
	void OnRep_MissionModeActivate(); // (Final, Native, Public) // @ 0x140C994B0
	void OnRep_PersistLevels(); // (Final, Native, Public) // @ 0x149A6E190
	void OnStreamingCompletedFunc(); // (Final, Native, Public) // @ 0x149A6E250
	void RemoveTickLevel(class UMissionLevel* InArg); // (Final, Native, Public) // @ 0x149A6E3F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameStateMissionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameStateMissionComponent")
	}
	static class UGameStateMissionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameStateMissionComponent>();
	}
};
DUMPER7_ASSERTS_UGameStateMissionComponent;

// Class DFMMission.SubLevelInstanceActor
// 0x0040 (0x03B0 - 0x0370)
class ASubLevelInstanceActor final : public AActor
{
public:
	class AGPPlayerController*                    cpc;                                               // 0x0370(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USublevelComponent*                     SublevelComponent;                                 // 0x0378(0x0008)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LevelName;                                         // 0x0380(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          isServerLoaded;                                    // 0x0388(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_389[0x27];                                     // 0x0389(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSubLevelLoadComplete(); // (Final, Native, Public) // @ 0x149A6E270
	void OnSubLevelTick(); // (Final, Native, Public) // @ 0x149A6E290

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubLevelInstanceActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubLevelInstanceActor")
	}
	static class ASubLevelInstanceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASubLevelInstanceActor>();
	}
};
DUMPER7_ASSERTS_ASubLevelInstanceActor;

// Class DFMMission.Mission
// 0x0438 (0x0460 - 0x0028)
class UMission final : public UObject
{
public:
	class UMissionLevel*                          MissionLevel;                                      // 0x0028(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UMissionComponent>       MissionComponent;                                  // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameRuleType                                 WorldType;                                         // 0x0038(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AGPPlayerState>          PlayerState;                                       // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         missionid;                                         // 0x0044(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPQuest*                               CurrentQuest;                                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MissionName;                                       // 0x0058(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapMarkerStr;                                      // 0x0068(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LongPackageName;                                   // 0x0078(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentStateIndex;                                 // 0x0088(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionState*                          CurrentState;                                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMissionState*>                  CurrentStates;                                     // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UMissionBaseTrigger*                    PauseTrigger;                                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMissionBaseTrigger*                    FailedTrigger;                                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQASimpleQuestProxy*                    SimpleQuest;                                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UQASimpleActionProxy*>           SimpleActions;                                     // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UQASimpleQuestProxy*>            SimpleSideQuestProxys;                             // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UQASimpleQuestProxy*>            SimpleTriggerProxys;                               // 0x00E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, class UQASimpleQuestProxy*> TaskGroupQuestProxys;                            // 0x00F0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ValidQuest;                                        // 0x0140(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x57];                                     // 0x0141(0x0057)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FMissionMapMarkerData> MapIconMarkers;                                  // 0x0198(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E8[0x278];                                    // 0x01E8(0x0278)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGetPlayerState(class AGPQuest* Quest, class UMission** Mission); // (Final, Native, Public, HasOutParams) // @ 0x149A73E70
	void OnRep_CurrentStateIndex(); // (Final, Native, Public) // @ 0x149A74910

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Mission")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Mission")
	}
	static class UMission* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMission>();
	}
};
DUMPER7_ASSERTS_UMission;

// Class DFMMission.MissionActorLayer
// 0x0078 (0x00A0 - 0x0028)
class UMissionActorLayer final : public UObject
{
public:
	uint8                                         Pad_28[0x78];                                      // 0x0028(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToLayer(const class FString& Tag, class AActor* InArg2); // (Final, Native, Public) // @ 0x149A72FC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionActorLayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionActorLayer")
	}
	static class UMissionActorLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionActorLayer>();
	}
};
DUMPER7_ASSERTS_UMissionActorLayer;

// Class DFMMission.MissionAIFightMeTrigger
// 0x0020 (0x01B8 - 0x0198)
class UMissionAIFightMeTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x20];                                     // 0x0198(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAIMesgReceive(class ADFMCharacter* AI, EAIMsgType MsgType); // (Final, Native, Public) // @ 0x149A737D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionAIFightMeTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionAIFightMeTrigger")
	}
	static class UMissionAIFightMeTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionAIFightMeTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionAIFightMeTrigger;

// Class DFMMission.MissionAreaTrigger
// 0x0050 (0x01E8 - 0x0198)
class UMissionAreaTrigger : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x10];                                     // 0x0198(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Trigger;                                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x38];                                     // 0x01B0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DelayCheckContainActors(); // (Final, Native, Public) // @ 0x149A73420
	void OnBeginOverlap(class AActor* InTrigger, class AActor* OtherActor); // (Final, Native, Public) // @ 0x149A73890
	void OnEndOverlap(class AActor* InTrigger, class AActor* OtherActor); // (Final, Native, Public) // @ 0x149A73B70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionAreaTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionAreaTrigger")
	}
	static class UMissionAreaTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionAreaTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionAreaTrigger;

// Class DFMMission.MissionConditionAreaTrigger
// 0x0010 (0x01F8 - 0x01E8)
class UMissionConditionAreaTrigger final : public UMissionAreaTrigger
{
public:
	uint8                                         Pad_1E8[0x10];                                     // 0x01E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionConditionAreaTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionConditionAreaTrigger")
	}
	static class UMissionConditionAreaTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionConditionAreaTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionConditionAreaTrigger;

// Class DFMMission.MissionCombineTrigger
// 0x0030 (0x01C8 - 0x0198)
class UMissionCombineTrigger : public UMissionBaseTrigger
{
public:
	TArray<class UMissionBaseTrigger*>            Triggers;                                          // 0x0198(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0x20];                                     // 0x01A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddTrigger(class UMissionBaseTrigger* InArg); // (Final, Native, Public) // @ 0x149A73120

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionCombineTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionCombineTrigger")
	}
	static class UMissionCombineTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionCombineTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionCombineTrigger;

// Class DFMMission.MissionServerAcceptCombineTrigger
// 0x0000 (0x01C8 - 0x01C8)
class UMissionServerAcceptCombineTrigger final : public UMissionCombineTrigger
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionServerAcceptCombineTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionServerAcceptCombineTrigger")
	}
	static class UMissionServerAcceptCombineTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionServerAcceptCombineTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionServerAcceptCombineTrigger;

// Class DFMMission.MissionCommitItemTrigger
// 0x0038 (0x01D0 - 0x0198)
class UMissionCommitItemTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x38];                                     // 0x0198(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSpaceMarkedDirty(); // (Final, Native, Public) // @ 0x140C994B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionCommitItemTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionCommitItemTrigger")
	}
	static class UMissionCommitItemTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionCommitItemTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionCommitItemTrigger;

// Class DFMMission.MissionDamageTrigger
// 0x0020 (0x01B8 - 0x0198)
class UMissionDamageTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x20];                                     // 0x0198(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDamage(int32 Health); // (Final, Native, Public) // @ 0x149A73AF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionDamageTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionDamageTrigger")
	}
	static class UMissionDamageTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionDamageTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionDamageTrigger;

// Class DFMMission.MissionTurnInItemTrigger
// 0x0028 (0x01C0 - 0x0198)
class UMissionTurnInItemTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x28];                                     // 0x0198(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInteractEnd(uint64 Uin, int64 GroupID); // (Final, Native, Public) // @ 0x144B526E0
	void OnTurnInItem(struct FMissionTurnInItemInfo* Item); // (Final, Native, Public, HasOutParams) // @ 0x149A74B40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionTurnInItemTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionTurnInItemTrigger")
	}
	static class UMissionTurnInItemTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionTurnInItemTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionTurnInItemTrigger;

// Class DFMMission.MissionEnermyDieTrigger
// 0x0028 (0x01C0 - 0x0198)
class UMissionEnermyDieTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x28];                                     // 0x0198(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnKillInfoNtf(class ADFMCharacter* CHARACTER); // (Final, Native, Public) // @ 0x149A74270
	void OnMissionSpawnDelgate(bool useCache); // (Final, Native, Public) // @ 0x149A74530
	void OnMissionSpawnDelgateProxy(); // (Final, Native, Public) // @ 0x149A74650

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionEnermyDieTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionEnermyDieTrigger")
	}
	static class UMissionEnermyDieTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionEnermyDieTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionEnermyDieTrigger;

// Class DFMMission.MissionGameStateTrigger
// 0x0020 (0x01B8 - 0x0198)
class UMissionGameStateTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x20];                                     // 0x0198(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnGameStateChange(int32 Key, int32 Value); // (Final, Native, Public) // @ 0x149A73DB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionGameStateTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionGameStateTrigger")
	}
	static class UMissionGameStateTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionGameStateTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionGameStateTrigger;

// Class DFMMission.MissionGetItemTrigger
// 0x0080 (0x0218 - 0x0198)
class UMissionGetItemTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x80];                                     // 0x0198(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSpaceMarkedDirty(); // (Final, Native, Public) // @ 0x140C994B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionGetItemTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionGetItemTrigger")
	}
	static class UMissionGetItemTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionGetItemTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionGetItemTrigger;

// Class DFMMission.MissionTriggerLeaveArea
// 0x0040 (0x01D8 - 0x0198)
class UMissionTriggerLeaveArea final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x10];                                     // 0x0198(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Trigger;                                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x28];                                     // 0x01B0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DelayCheckContainActors(); // (Final, Native, Public) // @ 0x149A73440
	void OnBeginOverlap(class AActor* InTrigger, class AActor* OtherActor); // (Final, Native, Public) // @ 0x149A73950
	void OnEndOverlap(class AActor* InTrigger, class AActor* OtherActor); // (Final, Native, Public) // @ 0x149A73C30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionTriggerLeaveArea")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionTriggerLeaveArea")
	}
	static class UMissionTriggerLeaveArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionTriggerLeaveArea>();
	}
};
DUMPER7_ASSERTS_UMissionTriggerLeaveArea;

// Class DFMMission.MissionGPQuestTrigger
// 0x0008 (0x01A0 - 0x0198)
class UMissionGPQuestTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQuestEnd(class AGPQuest* Quest); // (Final, Native, Public) // @ 0x149A74810

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionGPQuestTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionGPQuestTrigger")
	}
	static class UMissionGPQuestTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionGPQuestTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionGPQuestTrigger;

// Class DFMMission.MissionInteractItemTrigger
// 0x0028 (0x01C0 - 0x0198)
class UMissionInteractItemTrigger final : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x28];                                     // 0x0198(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInteract(uint64 Uin, class AActor* Actor, EInteractorType InteractorType, const class FString& Params_0); // (Final, Native, Public) // @ 0x149A73F60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionInteractItemTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionInteractItemTrigger")
	}
	static class UMissionInteractItemTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionInteractItemTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionInteractItemTrigger;

// Class DFMMission.MissionInteractNPCTrigger
// 0x0020 (0x01B8 - 0x0198)
class UMissionInteractNPCTrigger : public UMissionBaseTrigger
{
public:
	uint8                                         Pad_198[0x20];                                     // 0x0198(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInteractEnd(uint64 Uin, int64 GroupID); // (Final, Native, Public) // @ 0x149A74130

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionInteractNPCTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionInteractNPCTrigger")
	}
	static class UMissionInteractNPCTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionInteractNPCTrigger>();
	}
};
DUMPER7_ASSERTS_UMissionInteractNPCTrigger;

// Class DFMMission.SQAFunctionLib
// 0x0000 (0x0028 - 0x0028)
class USQAFunctionLib final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SQAFunctionLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SQAFunctionLib")
	}
	static class USQAFunctionLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQAFunctionLib>();
	}
};
DUMPER7_ASSERTS_USQAFunctionLib;

// Class DFMMission.MissionInteractNPCExt
// 0x0010 (0x01C8 - 0x01B8)
class UMissionInteractNPCExt final : public UMissionInteractNPCTrigger
{
public:
	uint8                                         Pad_1B8[0x10];                                     // 0x01B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MissionInteractNPCExt")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MissionInteractNPCExt")
	}
	static class UMissionInteractNPCExt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionInteractNPCExt>();
	}
};
DUMPER7_ASSERTS_UMissionInteractNPCExt;

// Class DFMMission.MissionConditionInteractNPCTrigger
// 0x0008 (0x01C0 - 0x01B8)
class UMissionConditionInteractNPCTrigger final : public UMissionInteractNPCTrigger
{
public:
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInteractStart(uint64 Uin); // (Final, Native, Public) // @ 0x149A741F0
