#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMPlatform

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum DFMPlatform.EDFMPlatformPremiumFeaturesType
// NumValues: 0x0004
enum class EDFMPlatformPremiumFeaturesType : uint8
{
	RealtimeMultiplay                        = 0,
	CrossPlatform                            = 1,
	EngineSpectating                         = 2,
	EDFMPlatformPremiumFeaturesType_MAX      = 3,
};

// Enum DFMPlatform.EDFMPermissionType
// NumValues: 0x0004
enum class EDFMPermissionType : uint8
{
	CommunicateUsingText                     = 0,
	CommunicateUsingVoice                    = 1,
	CommunicateUsingTextAndVoice             = 2,
	EDFMPermissionType_MAX                   = 3,
};

// Enum DFMPlatform.EDFMAnonymousUserType
// NumValues: 0x0003
enum class EDFMAnonymousUserType : uint8
{
	CrossNetworkUser                         = 0,
	CrossNetWorkFriend                       = 1,
	EDFMAnonymousUserType_MAX                = 2,
};

// Enum DFMPlatform.EDFMUserPrivileges
// NumValues: 0x0006
enum class EDFMUserPrivileges : uint8
{
	CanPlay                                  = 0,
	CanPlayOnline                            = 1,
	CanCommunicateOnline                     = 2,
	CanUseUserGeneratedContent               = 3,
	CanUserCrossPlay                         = 4,
	EDFMUserPrivileges_MAX                   = 5,
};

// Enum DFMPlatform.EDFMSessionTaskType
// NumValues: 0x0007
enum class EDFMSessionTaskType : uint8
{
	None                                     = 0,
	CreateSession                            = 1,
	DestroySession                           = 2,
	JoinSession                              = 3,
	UpdateSession                            = 4,
	AcceptInvite                             = 5,
	EDFMSessionTaskType_MAX                  = 6,
};

// Enum DFMPlatform.EDFMSessionUpdateType
// NumValues: 0x0005
enum class EDFMSessionUpdateType : uint8
{
	Default                                  = 0,
	Leader                                   = 1,
	MaxMember                                = 2,
	None                                     = 3,
	EDFMSessionUpdateType_MAX                = 4,
};

// Enum DFMPlatform.EDFMOnlineMangerState
// NumValues: 0x000A
enum class EDFMOnlineMangerState : uint8
{
	Idle                                     = 0,
	Destroy_DestroyingSession                = 1,
	Create_DestroyingOldSession              = 2,
	Create_CreatingNewSession                = 3,
	Create_StartingSession                   = 4,
	Join_DestroyingOldSession                = 5,
	Join_JoiningNewSession                   = 6,
	AcceptInvite_DestroyingOldSession        = 7,
	AcceptInvite_JoiningNewSession           = 8,
	EDFMOnlineMangerState_MAX                = 9,
};

// Enum DFMPlatform.EDFMSessionRestriction
// NumValues: 0x0005
enum class EDFMSessionRestriction : uint8
{
	Public                                   = 0,
	InviteOnly                               = 1,
	FriendsOnly                              = 2,
	Private                                  = 3,
	EDFMSessionRestriction_MAX               = 4,
};

// Enum DFMPlatform.EPS5ActivityMatchState
// NumValues: 0x0004
enum class EPS5ActivityMatchState : uint8
{
	NoMatch                                  = 0,
	InProgcess                               = 1,
	MatchEnd                                 = 2,
	EPS5ActivityMatchState_MAX               = 3,
};

// ScriptStruct DFMPlatform.DFMPlatformAchievementDataRow
// 0x0030 (0x0038 - 0x0008)
struct FDFMPlatformAchievementDataRow final : public FTableRowBase
{
public:
	class FName                                   Name;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ID;                                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsProgressive;                                     // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsHidden;                                          // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x0020(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMPlatformAchievementDataRow;

// ScriptStruct DFMPlatform.CommunicationPermissionResult
// 0x0018 (0x0018 - 0x0000)
struct FCommunicationPermissionResult final
{
public:
	class FString                                 UserIdStr;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCommunicationPermissionsAllowed;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCommunicationPermissionResult;

// ScriptStruct DFMPlatform.UserPrivilegeCacheData
// 0x0002 (0x0002 - 0x0000)
struct FUserPrivilegeCacheData final
{
public:
	bool                                          bIsCached;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPrivilege;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUserPrivilegeCacheData;

// ScriptStruct DFMPlatform.PlatformMemberInfo
// 0x0030 (0x0030 - 0x0000)
struct FPlatformMemberInfo final
{
public:
	uint64                                        PlayerId;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        TeamID;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPS5Player;                                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlatformId;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformMemberInfo;

// ScriptStruct DFMPlatform.PlatformMatchInfo
// 0x0018 (0x0018 - 0x0000)
struct FPlatformMatchInfo final
{
public:
	TArray<struct FPlatformMemberInfo>            members;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        ModeId;                                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlatformMatchInfo;

// ScriptStruct DFMPlatform.DFMPlatformFriend
// 0x0028 (0x0028 - 0x0000)
struct FDFMPlatformFriend final
{
public:
	class FString                                 PlatformId;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlatformName;                                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOnline;                                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFMPlatformFriend;

// ScriptStruct DFMPlatform.DFMPlatformProduct
// 0x0070 (0x0070 - 0x0000)
struct FDFMPlatformProduct final
{
public:
	class FString                                 StoreId;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductId;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrencyCode;                                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayPriceText;                                  // 0x0040(0x0018)(NativeAccessSpecifierPublic)
	class FText                                   DisplayRegularPriceText;                           // 0x0058(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMPlatformProduct;

}

