#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMQuest

#include "Basic.hpp"

#include "GPQuest_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "GameCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DFMQuest.EQAInputActionType
// NumValues: 0x0005
enum class EQAInputActionType : uint8
{
	OpenMap                                  = 188,
	Skill_X                                  = 117,
	Skill_V                                  = 119,
	Skill_G                                  = 121,
	EQAInputActionType_MAX                   = 189,
};

// Enum DFMQuest.EQAKillAIType
// NumValues: 0x0004
enum class EQAKillAIType : uint8
{
	KillWithTag                              = 0,
	KillWithoutTag                           = 1,
	KillAll                                  = 2,
	EQAKillAIType_MAX                        = 3,
};

// Enum DFMQuest.EPlayerPosition
// NumValues: 0x0006
enum class EPlayerPosition : uint8
{
	None                                     = 0,
	InTargetZone                             = 1,
	InSafeZone                               = 2,
	InWarningZone                            = 3,
	InFailZone                               = 4,
	EPlayerPosition_MAX                      = 5,
};

// Enum DFMQuest.EPlayersChaseTargetMode
// NumValues: 0x0004
enum class EPlayersChaseTargetMode : uint8
{
	None                                     = 0,
	ClosestPlayer                            = 1,
	FarthestPlayer                           = 2,
	EPlayersChaseTargetMode_MAX              = 3,
};

// Enum DFMQuest.ERVLeaveBehaviour
// NumValues: 0x0004
enum class ERVLeaveBehaviour : uint8
{
	KeepRestriction                          = 0,
	Revert                                   = 1,
	NewRestriction                           = 2,
	ERVLeaveBehaviour_MAX                    = 3,
};

// Enum DFMQuest.EQA_AITeamSizeListenerOption
// NumValues: 0x0003
enum class EQA_AITeamSizeListenerOption : uint8
{
	CompareSize                              = 0,
	SizeChanged                              = 1,
	EQA_MAX                                  = 2,
};

// Enum DFMQuest.EQA_CountdownAsyncReturnBranch
// NumValues: 0x0003
enum class EQA_CountdownAsyncReturnBranch : uint8
{
	Finished                                 = 0,
	Stoped                                   = 1,
	EQA_MAX                                  = 2,
};

// Enum DFMQuest.EQA_GPSequenceOption
// NumValues: 0x0003
enum class EQA_GPSequenceOption : uint8
{
	Play                                     = 0,
	Listen                                   = 1,
	EQA_MAX                                  = 2,
};

// Enum DFMQuest.EQA_InteractorControllerOption
// NumValues: 0x0006
enum class EQA_InteractorControllerOption : uint8
{
	Listen                                   = 0,
	Activate                                 = 1,
	Deactivate                               = 2,
	MakeSuccessful                           = 3,
	MakeFail                                 = 4,
	EQA_MAX                                  = 5,
};

// Enum DFMQuest.EQA_PlayerSafePathListenerOption
// NumValues: 0x0006
enum class EQA_PlayerSafePathListenerOption : uint8
{
	Play                                     = 0,
	Stop                                     = 1,
	Pause                                    = 2,
	Resume                                   = 3,
	Listen                                   = 4,
	EQA_MAX                                  = 5,
};

// Enum DFMQuest.EQA_SimplePathFollowerOption
// NumValues: 0x0006
enum class EQA_SimplePathFollowerOption : uint8
{
	Play                                     = 0,
	Stop                                     = 1,
	Pause                                    = 2,
	Resume                                   = 3,
	Listen                                   = 4,
	EQA_MAX                                  = 5,
};

// Enum DFMQuest.EGPSimpleActionInnerType
// NumValues: 0x002A
enum class EGPSimpleActionInnerType : uint8
{
	None                                     = 0,
	SetTargets                               = 1,
	SetTargetState                           = 2,
	SetFails                                 = 3,
	SetFailState                             = 4,
	SetLevelPos                              = 5,
	SetLevelTime                             = 6,
	CreateTaskGroup                          = 7,
	SetTargetTask                            = 8,
	SetTaskState                             = 9,
	CreateABTeam                             = 10,
	GetMissionPlayer                         = 11,
	GetMissionPlayers                        = 12,
	PlayMultiCastNetworkdedMontage           = 13,
	GetMainTrigger                           = 14,
	EnableEffect                             = 15,
	DisableEffect                            = 16,
	LoadPersistLevel                         = 17,
	UnLoadPersistLevel                       = 18,
	LoadBindPersistLevel                     = 19,
	UnLoadBindPersistLevel                   = 20,
	ShowTeamScore                            = 21,
	AddBigWordMapMarker                      = 22,
	RemoveBigWordMapMarker                   = 23,
	CarraySomeBody                           = 24,
	SomeOneCarrySomeBody                     = 25,
	IsSomeOneCarrySomeBody                   = 26,
	GetMissionListeners                      = 27,
	GetMissionSideListeners                  = 28,
	GetMissionTeamListeners                  = 29,
	GetMissionListener                       = 30,
	EndAllListener                           = 31,
	GetMissionTeamCharacters                 = 32,
	SetCarryBodyTag                          = 33,
	AddGameStateAction                       = 34,
	SetGameStateAction                       = 35,
	GetGameStateAction                       = 36,
	RemoveItem                               = 37,
	SetMissionTotalTime                      = 38,
	PlayerPlayDialog                         = 39,
	PlayAbility                              = 40,
	EGPSimpleActionInnerType_MAX             = 41,
};

// Enum DFMQuest.EGPSimpleActionType
// NumValues: 0x0013
enum class EGPSimpleActionType : uint8
{
	None                                     = 0,
	Drama                                    = 1,
	StartQuest                               = 2,
	PlayDialog                               = 3,
	NpcTalk                                  = 4,
	PlaySequence                             = 5,
	EnableInteract                           = 6,
	DisableInteract                          = 7,
	SendSelfToPos                            = 8,
	SendTeamToPos                            = 9,
	EnterWorld                               = 10,
	RAID_SendSelfToPos                       = 11,
	RAID_SendTeamToPos                       = 12,
	EndRaid                                  = 13,
	ShowRaidEnd                              = 14,
	WorldCruise                              = 15,
	EnableEffect                             = 16,
	EnableHitEffect                          = 17,
	EGPSimpleActionType_MAX                  = 18,
};

// Enum DFMQuest.ETriggerTitleFlag
// NumValues: 0x0007
enum class ETriggerTitleFlag : uint8
{
	Normal                                   = 0,
	NormalMarkerTarget                       = 1,
	OnlyTitle                                = 2,
	OnlyProgress                             = 3,
	OnlyTarget                               = 4,
	OnlyMarkerTarget                         = 5,
	ETriggerTitleFlag_MAX                    = 6,
};

// Enum DFMQuest.EGPSimpleObjectiveType
// NumValues: 0x0006
enum class EGPSimpleObjectiveType : uint8
{
	Main                                     = 0,
	HidenMain                                = 1,
	Side                                     = 2,
	AutoSide                                 = 3,
	HidenSide                                = 4,
	EGPSimpleObjectiveType_MAX               = 5,
};

// Enum DFMQuest.EGPSimpleQuestTypeEx
// NumValues: 0x0009
enum class EGPSimpleQuestTypeEx : uint8
{
	None                                     = 0,
	Quest                                    = 1,
	InteractNPCEx                            = 2,
	Combine                                  = 3,
	Event                                    = 4,
	ServerCombine                            = 5,
	LoadLevel                                = 6,
	ConditionSearchArea                      = 7,
	EGPSimpleQuestTypeEx_MAX                 = 8,
};

// Enum DFMQuest.EGPSimpleQuestType
// NumValues: 0x001B
enum class EGPSimpleQuestType : uint8
{
	None                                     = 0,
	KillEnermy                               = 1,
	ObtainItem                               = 2,
	SearchArea                               = 3,
	InteractItem                             = 4,
	InteractNPC                              = 5,
	SelfPlayerDie                            = 6,
	SelfPlayerReborn                         = 7,
	LeaveArea                                = 8,
	GameState                                = 9,
	AvoidAIFightMe                           = 10,
	AvoidAIFightUs                           = 11,
	ConditionInteractNPC                     = 12,
	LoseItem                                 = 13,
	EnermyDie                                = 14,
	TurnInItem                               = 15,
	TraceItem                                = 16,
	Damage                                   = 17,
	SearchAreaAndGetOnVehicle                = 18,
	SearchAreaAndGetOffVehicle               = 19,
	CheckGetOnVehicle                        = 20,
	CheckGetOffVehicle                       = 21,
	Raid_ReachArea_ALL                       = 22,
	Raid_ReachArea_Leader                    = 23,
	Raid_ReachArea_num                       = 24,
	Raid_TrainBreaks                         = 25,
	Max                                      = 26,
};

// Enum DFMQuest.EQADamageType
// NumValues: 0x0005
enum class EQADamageType : uint8
{
	None                                     = 0,
	All_Types                                = 1,
	Bullets                                  = 2,
	RPG                                      = 3,
	EQADamageType_MAX                        = 4,
};

// Enum DFMQuest.EQA_TimerMode
// NumValues: 0x0003
enum class EQA_TimerMode : uint8
{
	Timer                                    = 0,
	Countdown                                = 1,
	EQA_MAX                                  = 2,
};

// Enum DFMQuest.EQA_TriggerListenerOption
// NumValues: 0x0007
enum class EQA_TriggerListenerOption : uint8
{
	All                                      = 0,
	PlayerOnly                               = 1,
	NotPlayer                                = 2,
	ExceptAICharacter                        = 3,
	PlayerVehicle                            = 4,
	AIVehicle                                = 5,
	EQA_MAX                                  = 6,
};

// Enum DFMQuest.EQA_VehiclePathFollowerOption
// NumValues: 0x0006
enum class EQA_VehiclePathFollowerOption : uint8
{
	Play                                     = 0,
	Stop                                     = 1,
	Pause                                    = 2,
	Resume                                   = 3,
	Listen                                   = 4,
	EQA_MAX                                  = 5,
};

// ScriptStruct DFMQuest.GamingAreaPlayerInfo
// 0x0010 (0x0010 - 0x0000)
struct FGamingAreaPlayerInfo final
{
public:
	class AGPPlayerController*                    PlayerCtrl;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOutsideGamingArea;                              // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGamingAreaPlayerInfo;

// ScriptStruct DFMQuest.GamingAreaStageSetting
// 0x0018 (0x0018 - 0x0000)
struct FGamingAreaStageSetting final
{
public:
	int32                                         StageId;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidDuringWholeStage;                            // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ValidObjectiveIndexes;                             // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamingAreaStageSetting;

// ScriptStruct DFMQuest.GamingAreaQuestSetting
// 0x0018 (0x0018 - 0x0000)
struct FGamingAreaQuestSetting final
{
public:
	int32                                         QuestID;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidDuringWholeQuest;                            // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGamingAreaStageSetting>        StageSettings;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamingAreaQuestSetting;

// ScriptStruct DFMQuest.SubtitleObjectiveNoticeInfo
// 0x0098 (0x0098 - 0x0000)
struct FSubtitleObjectiveNoticeInfo final
{
public:
	struct FGPQuestObjectiveNoticeInfo            Notice;                                            // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                         EndTimeStamp;                                      // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGPAudioFuturePlayingID                AudioId;                                           // 0x0084(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         NoticeHandle;                                      // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSubtitleObjectiveNoticeInfo;

// ScriptStruct DFMQuest.NoticeInfos
// 0x0010 (0x0010 - 0x0000)
struct FNoticeInfos final
{
public:
	TArray<struct FSubtitleObjectiveNoticeInfo>   Notices;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNoticeInfos;

// ScriptStruct DFMQuest.DFMQuestAudioTableItem
// 0x0020 (0x0028 - 0x0008)
struct FDFMQuestAudioTableItem final : public FTableRowBase
{
public:
	class FName                                   Key;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     AudioEvent;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFMQuestAudioTableItem;

// ScriptStruct DFMQuest.QMarkerSpawnParams
// 0x0028 (0x0028 - 0x0000)
struct FQMarkerSpawnParams final
{
public:
	TSubclassOf<class AGPQuestMarkerBase>         QMarkerClass;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     TargetClass;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OffsetLocation;                                    // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceThreshold;                                 // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPQuestActionMarkerType                      markerType;                                        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPQuestActionScope                           Scope;                                             // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FQMarkerSpawnParams;

// ScriptStruct DFMQuest.SimpleActionArguments
// 0x0020 (0x0020 - 0x0000)
struct FSimpleActionArguments final
{
public:
	class AGPQuest*                               Quest;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x18];                                       // 0x0008(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleActionArguments;

// ScriptStruct DFMQuest.SimpleActionExtArgument
// 0x0090 (0x0090 - 0x0000)
struct FSimpleActionExtArgument final
{
public:
	TArray<class FString>                         ExtParams;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ExtIntParams;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ExtFloatParams;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ExtString;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExtBool;                                           // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExtVector;                                         // 0x0044(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtFloat;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExtInt;                                            // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExtInt64;                                          // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      montageToPlayTPP;                                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      montageToPlayFPP;                                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPQuest*                               Quest;                                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleActionExtArgument;

// ScriptStruct DFMQuest.SimpleActionArgument
// 0x0014 (0x0014 - 0x0000)
struct FSimpleActionArgument final
{
public:
	EGPSimpleActionType                           Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionTag;                                         // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BindQuest;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleActionArgument;

// ScriptStruct DFMQuest.SimpleQuestArgument
// 0x0040 (0x0040 - 0x0000)
struct FSimpleQuestArgument final
{
public:
	class AGPQuest*                               Quest;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x38];                                       // 0x0008(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleQuestArgument;

// ScriptStruct DFMQuest.SimpleTriggerItemInfo
// 0x0038 (0x0038 - 0x0000)
struct FSimpleTriggerItemInfo
{
public:
	EGPSimpleQuestType                            Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Tag;                                               // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Tag1;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConfigId;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnceTrigger;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnceUnTrigger;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UISceneTraceTarget;                                // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPSimpleObjectiveType                        ObjectiveType;                                     // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleTriggerItemInfo;

// ScriptStruct DFMQuest.SimpleObjectiveItemInfo
// 0x0018 (0x0050 - 0x0038)
struct FSimpleObjectiveItemInfo final : public FSimpleTriggerItemInfo
{
public:
	class FString                                 Title;                                             // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPQuestObjectiveHUDType                      HUDMissionType;                                    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShowSingleText;                                    // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleObjectiveItemInfo;

// ScriptStruct DFMQuest.MissionStateAction
// 0x0008 (0x0018 - 0x0010)
struct FMissionStateAction final : public FDescRowBase
{
public:
	int32                                         ActionId;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsServer;                                          // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SecretLoot;                                        // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMissionStateAction;

// ScriptStruct DFMQuest.QuestAudioConfig
// 0x0020 (0x0020 - 0x0000)
struct FQuestAudioConfig final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     BeginAudioEvent;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     EndAudioEvent;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DsPlayTimeStamp;                                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DsStopTimeStamp;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestAudioConfig;

// ScriptStruct DFMQuest.QuestFxConfig
// 0x001C (0x001C - 0x0000)
struct FQuestFxConfig final
{
public:
	class FName                                   FXName;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LifeTimeFxPropertyName;                            // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanFadeOut;                                       // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DsPlayTimeStamp;                                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestFxConfig;

// ScriptStruct DFMQuest.ObjectiveHintInfo
// 0x0020 (0x0020 - 0x0000)
struct FObjectiveHintInfo final
{
public:
	EGPQuestObjectiveHUDType                      ObjectiveHUDType;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ObjectiveHintText;                                 // 0x0008(0x0018)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FObjectiveHintInfo;

// ScriptStruct DFMQuest.ContractBossData
// 0x0010 (0x0010 - 0x0000)
struct FContractBossData final
{
public:
	int32                                         ContractID;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BossHealth;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BossHealthMax;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBossIsDead;                                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FContractBossData;

// ScriptStruct DFMQuest.MapQuestRangeData
// 0x0018 (0x0018 - 0x0000)
struct FMapQuestRangeData final
{
public:
	int32                                         IsContract;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         objectiveId;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObjectiveRange;                                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMapQuestRangeData;

}

