#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMReplaySystem

#include "Basic.hpp"

#include "GPGameFlow_structs.hpp"
#include "Engine_classes.hpp"
#include "DFMGameplay_structs.hpp"
#include "GPGameHud_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class DFMReplaySystem.DFMNetworkPlayerReplayComponent
// 0x00D8 (0x01D0 - 0x00F8)
class UDFMNetworkPlayerReplayComponent final : public UActorComponent
{
public:
	class ADFMPlayerController*                   OwnerPlayer;                                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPCharacterBase*                       PlayerPawn;                                        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMReplayInstance*                     LastKillcamRecordingReplay;                        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMReplayInstance*                     CurrentKillcamRecordingReplay;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        LastRepRequestTimeTicks;                           // 0x0118(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_120[0xB0];                                     // 0x0120(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CharacterDied(class AGPCharacterBase* GPChar); // (Final, Native, Public) // @ 0x149CCD010
	void CharacterImpendingDeath(class AGPCharacterBase* GPChar); // (Final, Native, Public) // @ 0x149CCD090
	void ClientReceiveReplayCheckpointChunk(const TArray<struct FReplayCheckpointChunk>& Chunks); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x149CCD110
	void ClientReceiveReplayDataChunk(const TArray<struct FReplayDataChunk>& Chunks); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x149CCD220
	void ClientReceiveReplayHeaderChunk(const TArray<struct FReplayHeaderChunk>& Chunks); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x149CCD330
	void OnPlayReplayEnd(); // (Final, Native, Protected) // @ 0x149CCEFB0
	void OnRep_bEnablePlayKillCamera(); // (Final, Native, Protected) // @ 0x142A88400
	void OnRep_RequestTimeTicks(); // (Final, Native, Protected) // @ 0x149CCF0D0
	void OnRepDeadDamageInfo(); // (Final, Native, Protected) // @ 0x149CCF0B0
	void OnReplayRealStart(float TimeInMS); // (Final, Native, Protected) // @ 0x149CCF140
	void OnRequestPlayReplay(class UDFReplayBase* ReplayIns); // (Final, Native, Protected) // @ 0x149CCF1C0
	void OnSeamlessTravelToGameWorldEnd(bool bReconnect); // (Final, Native, Protected) // @ 0x149CCF2D0
	void OnServerPlayerGameEnd(EMatchOverReason MatchOverReason, int64 InPlayerUin); // (Final, Native, Protected) // @ 0x149CCF360
	void ServerSaveReplay(uint64 PlayerUin, int64 RequestTimeTicks, float RequestReplayTime, bool bModifyTimeTicks); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149CCFD80
	void ServerStartReplayRecording(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144AD8170

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMNetworkPlayerReplayComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMNetworkPlayerReplayComponent")
	}
	static class UDFMNetworkPlayerReplayComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMNetworkPlayerReplayComponent>();
	}
};
DUMPER7_ASSERTS_UDFMNetworkPlayerReplayComponent;

// Class DFMReplaySystem.DFMNetworkReplaySubsystem
// 0x02E0 (0x0310 - 0x0030)
class UDFMNetworkReplaySubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnLoadAllReplayFilesComplete;                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnParseProtocolFileComplete;                       // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                CachedWorldContextObject;                          // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDFMReplayInstance*>             StoredReplay;                                      // 0x00A8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDFMReplayInstance*                     CurrentRecordingReplay;                            // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x250];                                     // 0x00C0(0x0250)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDFMNetworkReplaySubsystem* GetReplaySubsystem(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCE470

	float GetDownloadKillCamProgress(); // (Final, Native, Public) // @ 0x149CCE3E0
	uint64 GetLastDeathUTCTimeStamp(); // (Final, Native, Public) // @ 0x149CCE410
	float GetParseProtocolProgress(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x149CCE440
	bool IsAllowPlayKillCamReplay(); // (Final, Native, Public) // @ 0x149CCE8D0
	bool IsLastKillCamReplayReady(); // (Final, Native, Public) // @ 0x149CCE980
	void OnGameFlowEnter(EGameFlowStageType GameFlowStage); // (Final, Native, Public) // @ 0x149CCED30
	void OnGameFlowLeave(EGameFlowStageType GameFlowStage); // (Final, Native, Public) // @ 0x141334EA0
	bool PlayLastKillCamReplay(); // (Final, Native, Public) // @ 0x149CCF6C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMNetworkReplaySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMNetworkReplaySubsystem")
	}
	static class UDFMNetworkReplaySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMNetworkReplaySubsystem>();
	}
};
DUMPER7_ASSERTS_UDFMNetworkReplaySubsystem;

// Class DFMReplaySystem.DFMReplayEvent
// 0x0000 (0x0028 - 0x0028)
class UDFMReplayEvent final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMReplayEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMReplayEvent")
	}
	static class UDFMReplayEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMReplayEvent>();
	}
};
DUMPER7_ASSERTS_UDFMReplayEvent;

// Class DFMReplaySystem.DFMReplayInstance
// 0x0018 (0x00E8 - 0x00D0)
class UDFMReplayInstance final : public UDFReplayBase
{
public:
	TMulticastInlineDelegate<void()>              OnReplaySaveComplete;                              // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AGPPlayerController*                    OwnerPlayerController;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Destory(); // (Native, Public) // @ 0x145F61350
	float GetCurrentRecordTime(); // (Native, Public) // @ 0x149CCE320
	float GetTotalRecordTime(); // (Native, Public) // @ 0x149CCE690
	bool GotoReplayAtTime(float TimeInMS); // (Native, Public) // @ 0x149CCE6D0
	void OnReplayEnd(); // (Final, Native, Protected) // @ 0x149CCF0F0
	bool PauseReplay(bool isPause); // (Native, Public) // @ 0x149CCF530
	bool ResetReplay(); // (Native, Public) // @ 0x140EE16A0
	bool SetPlayRate(float PlayRate); // (Native, Public) // @ 0x149CCFEC0
	bool StartReplayRecording(); // (Native, Public) // @ 0x141FB5930
	bool StopReplay(); // (Native, Public) // @ 0x140EE1700
	bool StopReplayRecording(); // (Native, Public) // @ 0x141FB59C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMReplayInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMReplayInstance")
	}
	static class UDFMReplayInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMReplayInstance>();
	}
};
DUMPER7_ASSERTS_UDFMReplayInstance;

// Class DFMReplaySystem.DFMReplayPlayerController
// 0x0058 (0x0B00 - 0x0AA8)
class ADFMReplayPlayerController final : public AGPPlayerController
{
public:
	TMulticastInlineDelegate<void(int32 value1, int32 value2)> OnPlaybackTimeChange;                 // 0x0AA8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 value1, int32 value2)> OnPlaybackEndChange;                  // 0x0AB8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class AHUD>                       ReplayGMHUDClass;                                  // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AHUD>                       ReplayOBHUDClass;                                  // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AHUD>                       ReplayKillcamHUDClass;                             // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMReplayInstance*                     CurrentReplayInstance;                             // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AE8[0x18];                                     // 0x0AE8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginPlayReplay(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BeginRecordReplay(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void GMGotoReplayPercent(float Percent); // (Final, Exec, Native, Public, BlueprintCallable) // @ 0x149CCDA50
	void GMPauseReplay(bool isPause); // (Final, Exec, Native, Public, BlueprintCallable) // @ 0x149CCDAD0
	void GMResetReplay(); // (Final, Exec, Native, Public, BlueprintCallable) // @ 0x149CCDB60
	void GMSetPlayRate(float PlayRate); // (Final, Exec, Native, Public, BlueprintCallable) // @ 0x149CCDB80
	void OnRegisterActor(class AActor* ChangedActor); // (Native, Protected) // @ 0x149CCF020
	void OnSeamlessToReplayEnd(bool bReconnect); // (Native, Protected) // @ 0x149CCF240
	void OnUnregisterActor(class AActor* ChangedActor); // (Native, Protected) // @ 0x149CCF460

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMReplayPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMReplayPlayerController")
	}
	static class ADFMReplayPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFMReplayPlayerController>();
	}
};
DUMPER7_ASSERTS_ADFMReplayPlayerController;

// Class DFMReplaySystem.DFMReplaySystemBlueprintHelper
// 0x0000 (0x0028 - 0x0028)
class UDFMReplaySystemBlueprintHelper final : public UBlueprintFunctionLibrary
{
public:
	static class UDFMReplayInstance* DirectStartReplayRecording(ENetworkReplayStreamerType StreamerType, const class FString& ReplayName, const class FString& FriendlyName, class UObject* WorldContextObject, bool usingCustomPath, const class FString& FilePath, float RecordMaxTime); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCD560
	static bool DirectStopReplayRecording(class UObject* WorldContextObject, class UDFMReplayInstance* ReplayInstance); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCD900
	static bool GenerateReplayNameAndFilePath(class UObject* WorldContextObject, class FString* ReplayName, class FString* FilePath); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x149CCDC00
	static class FString GenerateTimeString(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x149CCDD90
	static TArray<class FString> GetAllProtocolFiles(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCDE10
	static TArray<class UDFMReplayInstance*> GetAllProtocolReplaysFromFile(class UObject* WorldContextObject, const class FString& ProtocolReplayFolderName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCDFC0
	static TArray<class UDFMReplayInstance*> GetAllReplaysFromFile(class UObject* WorldContextObject, bool ForceRefresh, bool onlyGetData); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCE150
	static bool GetAllReplaysFromServer(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCE2A0
	static class UDFMReplayInstance* GetCurrentRuntimeReplay(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x149CCE360
	static class UDFMReplayInstance* GetReplayWithName(const class FString& Name_0, class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x149CCE530
	static bool GotoReplayAtTime(class UDFMReplayInstance* ReplayInstance, class UObject* WorldContextObject, float Time); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCE760
	static bool HasReplayData(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x149CCE850
	static bool IsInReplay(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x149CCE900
	static bool PauseReplay(class UDFMReplayInstance* ReplayInstance, class UObject* WorldContextObject, bool isPause); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCF5D0
	static class UDFMReplayInstance* PlayerStartReplayRecording(ENetworkReplayStreamerType StreamerType, const class FString& ReplayName, const class FString& FriendlyName, class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCF7D0
	static bool PlayerStopReplayRecording(class UObject* WorldContextObject, class UDFMReplayInstance* ReplayInstance); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCFA20
	static bool PlayReplay(class UDFMReplayInstance* ReplayInstance, class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCF6F0
	static bool RepeatKillcam(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCFB40
	static bool RequestMyNearestKillcam(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCFC40
	static bool RestartReplay(class UDFMReplayInstance* ReplayInstance, class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCFCC0
	static bool SetReplayRate(class UDFMReplayInstance* ReplayInstance, class UObject* WorldContextObject, float Rate); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCFF50
	static void StartParseProtocolFile(class UObject* WorldContextObject, const class FString& FilePath); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CD0040

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMReplaySystemBlueprintHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMReplaySystemBlueprintHelper")
	}
	static class UDFMReplaySystemBlueprintHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMReplaySystemBlueprintHelper>();
	}
};
DUMPER7_ASSERTS_UDFMReplaySystemBlueprintHelper;

// Class DFMReplaySystem.KillCamHUDView
// 0x03E8 (0x07D0 - 0x03E8)
class UKillCamHUDView final : public UBaseUIView
{
public:
	TArray<class FName>                           HUDKeepInKillCam;                                  // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDFCanvasPanel*                         Panel_KillerView;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFCanvasPanel*                         Panel_PlayingFinished;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFTextBlock*                           Text_ReplayTime;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFTextBlock*                           Text_KillerName;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFTextBlock*                           Text_WeaponName;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFImage*                               Image_KillerAvatar;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFImage*                               Image_KillerType;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFImage*                               Image_WeaponIcon;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            HDKeyIcons;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULuaUIBaseView*                         WBP_CommonKeyIconBoxText_Replay;                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULuaUIBaseView*                         WBP_CommonKeyIconBoxText_Exit;                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULuaUIBaseView*                         WBP_CommonKeyIconBoxText_Report;                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            MobileButtons;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            WBP_Btn_Playback;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            WBP_Btn_ExitReplay;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            WBP_Btn_ReplayReport;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFCommonButton*                        Btn_Playback;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFCommonButton*                        Btn_ExitReplay;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFCommonButton*                        Btn_Report;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       Anim_DeathReplay_Main_in;                          // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       Anim_DeathReplay_Main_loop;                        // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       Anim_DeathReplay_Main_out;                         // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FSoftObjectPath>   ReplayIconMap;                                     // 0x04A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   DisplayInputActionName_Playback;                   // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DisplayInputActionName_ExitReplay;                 // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DisplayInputActionName_Report;                     // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_510[0x2B0];                                    // 0x0510(0x02B0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bInOpenWorldStage;                                 // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C1[0xF];                                      // 0x07C1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DelayReplayRealStart(float TimeInMS); // (Final, Native, Protected) // @ 0x149CCD4E0
	void DisableProcessPlayerInputInReplay(bool bDisable); // (Final, Native, Protected) // @ 0x149CCD9C0
	void InitGamepadKeyIcon(const class FName& InActionName); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void InitHDKeyIcon(); // (Event, Protected, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void OnClickExitReplay(); // (Final, Native, Protected) // @ 0x149CCEB30
	void OnClickPlackback(); // (Final, Native, Protected) // @ 0x149CCEB70
	void OnClickReportBtn(); // (Final, Native, Protected) // @ 0x149CCEBF0
	void OnPlayReplayEnd(); // (Final, Native, Protected) // @ 0x149CCEFD0
	void OpenWorldEnterStage(); // (Final, Native, Protected) // @ 0x149CCF4F0
	void OpenWorldExitStage(); // (Final, Native, Protected) // @ 0x149CCF510
	void RefreshKillerInfo(); // (Final, Native, Protected) // @ 0x149CCFAE0
	void ReplayRealStart(float TimeInMS); // (Final, Native, Protected) // @ 0x149CCFBC0
	void SetNoKiller(bool bNoKiller, bool bNoKillerType); // (Event, Protected, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateExitHDKeyIconText(const int32& CountDownNum); // (Event, Protected, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void UpdateKillerAvatar(); // (Final, Native, Protected) // @ 0x149CD03C0
	void UpdateKillerDetail(); // (Final, Native, Protected) // @ 0x149CD03E0
	void UpdateKillerWeapon(); // (Final, Native, Protected) // @ 0x149CD0400

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KillCamHUDView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KillCamHUDView")
	}
	static class UKillCamHUDView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillCamHUDView>();
	}
};
DUMPER7_ASSERTS_UKillCamHUDView;

// Class DFMReplaySystem.ProtocolFileDebugItem
// 0x0030 (0x0320 - 0x02F0)
class UProtocolFileDebugItem final : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x8];                                      // 0x02F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             ProtocolFile;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                PlayButton;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_308[0x18];                                     // 0x0308(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnClickPlayButton(); // (Final, Native, Public) // @ 0x149CCEB90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProtocolFileDebugItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProtocolFileDebugItem")
	}
	static class UProtocolFileDebugItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProtocolFileDebugItem>();
	}
};
DUMPER7_ASSERTS_UProtocolFileDebugItem;

// Class DFMReplaySystem.ReplayClienSDK
// 0x0000 (0x0028 - 0x0028)
class UReplayClienSDK final : public UBlueprintFunctionLibrary
{
public:
	static bool LoadReplayClientSDK(const class FString& Folder, class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CCE9B0
	static bool TestPlayVideo(const class FString& Filename, class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CD0190
	static bool Tick(float Delta); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CD02F0
	static bool UnloadReplayClientSDK(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x149CD0390

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplayClienSDK")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplayClienSDK")
	}
	static class UReplayClienSDK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplayClienSDK>();
	}
};
DUMPER7_ASSERTS_UReplayClienSDK;

// Class DFMReplaySystem.ReplayControllerView
// 0x0080 (0x0468 - 0x03E8)
class UReplayControllerView final : public UBaseUIView
{
public:
	class UTextBlock*                             TxtPreviewTime;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TxtReplayDateTime;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TxtReplayTime;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TxtPlaySpeed;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                BtnPlay;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                BtnPause;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                BtnPlaySpeed;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                BtnExit;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                           ReplayProgressBar;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_430[0x38];                                     // 0x0430(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnClickExitButton(); // (Final, Native, Protected) // @ 0x149CCEB10
	void OnClickPauseButton(); // (Final, Native, Protected) // @ 0x149CCEB50
	void OnClickPlayButton(); // (Final, Native, Protected) // @ 0x149CCEBB0
	void OnClickSpeedButton(); // (Final, Native, Protected) // @ 0x149CCEC10
	void OnClientCharacterRebornInReplay(class AGPCharacterBase* CHARACTER); // (Final, Native, Protected) // @ 0x149CCECB0
	void OnGotoTimeSuccess(); // (Final, Native, Protected) // @ 0x149CCEDB0
	void OnRegisterActor(class AActor* ChangedActor); // (Final, Native, Protected) // @ 0x140C98C70
	void TrySkipReplayTime(); // (Final, Native, Protected) // @ 0x149CD0370

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplayControllerView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplayControllerView")
	}
	static class UReplayControllerView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplayControllerView>();
	}
};
DUMPER7_ASSERTS_UReplayControllerView;

// Class DFMReplaySystem.ReplayDebugFileItemView
// 0x0018 (0x0308 - 0x02F0)
class UReplayDebugFileItemView final : public UUserWidget
{
public:
	class UDFMReplayInstance*                     CurrentRecordingReplay;                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                ReplayLoadingView;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x8];                                      // 0x0300(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetData(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PlayReplay(); // (Final, Native, Public, BlueprintCallable) // @ 0x149CCF7B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplayDebugFileItemView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplayDebugFileItemView")
	}
	static class UReplayDebugFileItemView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplayDebugFileItemView>();
	}
};
DUMPER7_ASSERTS_UReplayDebugFileItemView;

// Class DFMReplaySystem.ReplayDebugMainView
// 0x0020 (0x0408 - 0x03E8)
class UReplayDebugMainView final : public UBaseUIView
{
public:
	TSubclassOf<class UUserWidget>                ReplayItemClass;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollBox*                             ReplayScrollList;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UReplayDebugFileItemView*>       AllReplayItems;                                    // 0x03F8(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	void AddToViewPortShow(); // (Final, Native, Public, BlueprintCallable) // @ 0x149CCCFD0
	void OnLoadAllReplayFilesComplete(); // (Final, Native, Public) // @ 0x149CCEDD0
	void OnRecordingStateChange(bool Enable); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnShow(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnStartReplayRecording(); // (Final, Native, Public) // @ 0x149CCF420
	void OnStopReplayRecording(); // (Final, Native, Public) // @ 0x149CCF440
	void RemoveFromViewPortHide(); // (Final, Native, Public, BlueprintCallable) // @ 0x149CCFB00

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplayDebugMainView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplayDebugMainView")
	}
	static class UReplayDebugMainView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplayDebugMainView>();
	}
};
DUMPER7_ASSERTS_UReplayDebugMainView;

// Class DFMReplaySystem.ReplayListDisplayView
// 0x00B8 (0x03A8 - 0x02F0)
class UReplayListDisplayView final : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x1];                                      // 0x02F0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseForProtocolReplay;                             // 0x02F1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UUserWidget>                ReplayItemClass;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                ProtocolFileItemClass;                             // 0x0300(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           ReplayPanel;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           ProtocolFilePanel;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           ProtocolReplayPanel;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCanvasPanel*                           ParseProgressPanel;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFScrollGridBox*                       ProtocolFileCrollList;                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFScrollGridBox*                       DFReplayScrollList;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                PlayButton;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableTextBox*                       TxtPlayerUID;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                           ParseProgress;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TxtProgress;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UDFMReplayInstance*>             AllReplay;                                         // 0x0358(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         AllProtocolFiles;                                  // 0x0368(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_378[0x30];                                     // 0x0378(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToViewPortShow(); // (Final, Native, Public, BlueprintCallable) // @ 0x149CCCFF0
	void OnClickPlayButton(); // (Final, Native, Public) // @ 0x149CCEBD0
	void OnLoadAllReplayFilesComplete(); // (Final, Native, Public) // @ 0x149CCEDF0
	void OnOneProtocolFileItemSetData(int32 Position, class UWidget* ItemWidget); // (Final, Native, Public) // @ 0x149CCEE10
	void OnOneReplayItemSetData(int32 Position, class UWidget* ItemWidget); // (Final, Native, Public) // @ 0x149CCEED0
	void OnParseProtocolFileSuccess(); // (Final, Native, Public) // @ 0x149CCEF90
	int32 OnProtocolFileItemCount(); // (Final, Native, Public) // @ 0x149CCEFF0
	int32 OnReplayItemCount(); // (Final, Native, Public) // @ 0x149CCF110
	void OnShow(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void RemoveFromViewPortHide(); // (Final, Native, Public, BlueprintCallable) // @ 0x149CCFB20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplayListDisplayView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplayListDisplayView")
	}
	static class UReplayListDisplayView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplayListDisplayView>();
	}
};
DUMPER7_ASSERTS_UReplayListDisplayView;

// Class DFMReplaySystem.ReplayLoadingView
// 0x0020 (0x0310 - 0x02F0)
class UReplayLoadingView final : public UUserWidget
{
public:
	class UProgressBar*                           LoadingProgressBar;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TxtProgress;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplayLoadingView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplayLoadingView")
	}
	static class UReplayLoadingView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplayLoadingView>();
	}
};
DUMPER7_ASSERTS_UReplayLoadingView;

// Class DFMReplaySystem.ReplayOBView
// 0x0000 (0x03E8 - 0x03E8)
class UReplayOBView final : public UBaseUIView
{
public:
	void BP_OnCharacterListChanged(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnClientCharacterListChanged(class AGPCharacterBase* CHARACTER); // (Final, Native, Public) // @ 0x149CCEC30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplayOBView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplayOBView")
	}
	static class UReplayOBView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplayOBView>();
	}
};
