#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMultiprocessingSocket

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DFMultiprocessingSocket.DFSocketClient
// 0x0040 (0x0068 - 0x0028)
class UDFSocketClient final : public UObject
{
public:
	TMulticastInlineDelegate<void(const class FString& Data, bool bSuccess)> SendSocketDataDelegate; // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Data)> ReceiveSocketDataDelegate;             // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USocketRSThread*>                RecThreads;                                        // 0x0058(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	bool ConnectServer(const class FString& ServerIP, int32 ServerPort); // (Final, Native, Public, BlueprintCallable) // @ 0x14129E680
	bool CreateClientAndConnect(const class FString& ServerIP, int32 ServerPort, int32 ReceiveBufferSize, int32 SendBufferSize); // (Final, Native, Public, BlueprintCallable) // @ 0x14129E8A0
	void Disconnect(); // (Final, Native, Public, BlueprintCallable) // @ 0x14129EEA0
	void OnServerDisconnect(class USocketRSThread* pThread); // (Final, Native, Public) // @ 0x14129F040
	void ReconnectServer(const class FString& ServerIP, int32 ServerPort); // (Final, Native, Public, BlueprintCallable) // @ 0x14129F140
	void SendToServer(const class FString& Message); // (Final, Native, Public, BlueprintCallable) // @ 0x14129F580

	bool IsConnected() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14129EEE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFSocketClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFSocketClient")
	}
	static class UDFSocketClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFSocketClient>();
	}
};
DUMPER7_ASSERTS_UDFSocketClient;

// Class DFMultiprocessingSocket.DFSocketClientV2
// 0x0048 (0x0070 - 0x0028)
class UDFSocketClientV2 final : public UObject
{
public:
	TMulticastInlineDelegate<void(const class FString& Data, bool bSuccess)> SendSocketDataDelegate; // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Data)> ReceiveSocketDataDelegate;             // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USocketRSThreadV2*>              RecThreads;                                        // 0x0060(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	bool ConnectServer(const class FString& ServerIP, int32 ServerPort); // (Final, Native, Public, BlueprintCallable) // @ 0x14129E790
	bool CreateClientAndConnect(const class FString& ServerIP, int32 ServerPort, int32 ReceiveBufferSize, int32 SendBufferSize); // (Final, Native, Public, BlueprintCallable) // @ 0x14129EA20
	void Disconnect(); // (Final, Native, Public, BlueprintCallable) // @ 0x14129EEC0
	void OnServerDisconnect(class USocketRSThreadV2* pThread); // (Final, Native, Public) // @ 0x14129F0C0
	void ReconnectServer(const class FString& ServerIP, int32 ServerPort); // (Final, Native, Public, BlueprintCallable) // @ 0x14129F240
	void SendToServer(const class FString& Message); // (Final, Native, Public, BlueprintCallable) // @ 0x14129F6A0

	bool IsConnected() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14129EF10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFSocketClientV2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFSocketClientV2")
	}
	static class UDFSocketClientV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFSocketClientV2>();
	}
};
DUMPER7_ASSERTS_UDFSocketClientV2;

// Class DFMultiprocessingSocket.DFSocketServer
// 0x0068 (0x0090 - 0x0028)
class UDFSocketServer final : public UObject
{
public:
	TMulticastInlineDelegate<void(bool bSuccess)> SocketCreateDelegate;                              // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& RemoteIP, int32 RemotePort)> ConnectReceiveDelegate; // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Data)> ReceiveSocketDataDelegate;             // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Data, bool bSuccess)> SendSocketDataDelegate; // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USocketRSThread*>                RecThreads;                                        // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseServer(); // (Final, Native, Public, BlueprintCallable) // @ 0x14129E640
	bool CreateServer(const class FString& ServerIP, int32 ServerPort, int32 ReceiveBufferSize, int32 SendBufferSize); // (Final, Native, Public, BlueprintCallable) // @ 0x14129EBA0
	void OnDisConnected(class USocketRSThread* pThread); // (Final, Native, Public, BlueprintCallable) // @ 0x14129EF40
	void SendToClient(const class FString& Message); // (Final, Native, Public, BlueprintCallable) // @ 0x14129F340

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFSocketServer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFSocketServer")
	}
	static class UDFSocketServer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFSocketServer>();
	}
};
DUMPER7_ASSERTS_UDFSocketServer;

// Class DFMultiprocessingSocket.DFSocketServerV2
// 0x0060 (0x0088 - 0x0028)
class UDFSocketServerV2 final : public UObject
{
public:
	TMulticastInlineDelegate<void(bool bSuccess)> SocketCreateDelegate;                              // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& RemoteIP, int32 RemotePort)> ConnectReceiveDelegate; // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Data)> ReceiveSocketDataDelegate;             // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Data, bool bSuccess)> SendSocketDataDelegate; // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USocketRSThreadV2*>              RecThreads;                                        // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseServer(); // (Final, Native, Public, BlueprintCallable) // @ 0x14129E660
	bool CreateServer(const class FString& ServerIP, int32 ServerPort, int32 ReceiveBufferSize, int32 SendBufferSize); // (Final, Native, Public, BlueprintCallable) // @ 0x14129ED20
	void OnDisConnected(class USocketRSThreadV2* pThread); // (Final, Native, Public, BlueprintCallable) // @ 0x14129EFC0
	void SendToClient(const class FString& Message); // (Final, Native, Public, BlueprintCallable) // @ 0x14129F460

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFSocketServerV2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFSocketServerV2")
	}
	static class UDFSocketServerV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFSocketServerV2>();
	}
};
DUMPER7_ASSERTS_UDFSocketServerV2;

// Class DFMultiprocessingSocket.SocketRSThread
// 0x0078 (0x00A0 - 0x0028)
class USocketRSThread final : public UObject
{
public:
	uint8                                         Pad_28[0x78];                                      // 0x0028(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocketRSThread")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocketRSThread")
	}
	static class USocketRSThread* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocketRSThread>();
	}
};
DUMPER7_ASSERTS_USocketRSThread;

// Class DFMultiprocessingSocket.SocketRSThreadV2
// 0x00B8 (0x00E0 - 0x0028)
class USocketRSThreadV2 final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEncrypt;                                          // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0xAF];                                      // 0x0031(0x00AF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocketRSThreadV2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocketRSThreadV2")
	}
	static class USocketRSThreadV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocketRSThreadV2>();
	}
};
DUMPER7_ASSERTS_USocketRSThreadV2;

}

