#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMVehicle

#include "Basic.hpp"

#include "GPGlobalDefines_structs.hpp"
#include "GPGlobalDefines_classes.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "GPAIBase_classes.hpp"
#include "DFMVehicle_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "PropertyReplication_structs.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "PhysXVehicles_structs.hpp"
#include "PhysXVehicles_classes.hpp"
#include "GPCutScene_classes.hpp"
#include "GPWeaponRuntime_classes.hpp"


namespace SDK
{

// Class DFMVehicle.DFMVehicleResourceManager
// 0x00D0 (0x0100 - 0x0030)
class UDFMVehicleResourceManager final : public UWorldSubsystem
{
public:
	TMap<struct FSoftObjectPath, struct FDFMVehicleLoadedResourceInfo> LoadedResourceMap;            // 0x0030(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSoftObjectPath, struct FDFMVehicleResourceDelegateInfo> ResourceDelegateMap;        // 0x0080(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<uint64>                                LoadHandlerArray;                                  // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x20];                                      // 0x00E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnResourceArrayLoadComplete(const TArray<struct FSoftObjectPath>& ResourcePaths); // (Final, Native, Public) // @ 0x14A2F31B0
	void OnResourceLoadComplete(const struct FSoftObjectPath& ResourcePath); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x14A2F3340

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMVehicleResourceManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMVehicleResourceManager")
	}
	static class UDFMVehicleResourceManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMVehicleResourceManager>();
	}
};
DUMPER7_ASSERTS_UDFMVehicleResourceManager;

// Class DFMVehicle.BTTask_FollowSpline
// 0x0030 (0x00A8 - 0x0078)
class UBTTask_FollowSpline final : public UGPBTTaskBase
{
public:
	struct FBlackboardKeySelector                 SplineBBKey;                                       // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         CustomAcceptableRadius;                            // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EndlessLoopingPath;                                // 0x00A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NoComebackInOpenedSpline;                          // 0x00A5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FoundNearestWaypoint;                              // 0x00A6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoReverse;                                       // 0x00A7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_FollowSpline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_FollowSpline")
	}
	static class UBTTask_FollowSpline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_FollowSpline>();
	}
};
DUMPER7_ASSERTS_UBTTask_FollowSpline;

// Class DFMVehicle.DramaAreaVehicle
// 0x0010 (0x0500 - 0x04F0)
class ADramaAreaVehicle final : public ADramaArea
{
public:
	TArray<struct FRaidVehicleDramaInfo>          VehicleDifficulties;                               // 0x04F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	float GetExpectedOverrideExplodeDamage(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2FDAE0
	float GetExpectedVehicleHealth(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2FDB40
	class AAIPatrolPath* GetExpectedVehiclePath(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2FDBA0
	TMap<class FName, class FName> GetOverridePassengers(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2FDD60
	bool ShouldSpawnVehicleOnCurrentDifficulty(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2FE8D0
	void SpawnVehicleAI(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14A2FE930

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DramaAreaVehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DramaAreaVehicle")
	}
	static class ADramaAreaVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADramaAreaVehicle>();
	}
};
DUMPER7_ASSERTS_ADramaAreaVehicle;

// Class DFMVehicle.DFMJetAnimInstance
// 0x0890 (0x0B00 - 0x0270)
class UDFMJetAnimInstance final : public UAnimInstance
{
public:
	float                                         NozzleConstInterpSpeed;                            // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CockpitOpenTime;                                   // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchFlapLerpSpeed;                                // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawFlapLerpSpeed;                                  // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RollFlapLerpSpeed;                                 // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspLerpSpeed;                                     // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FrontWheelBoneName;                                // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BackLeftWheelBoneName;                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BackRightWheelBoneName;                            // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FlapScalar;                                        // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspOffset;                                        // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LandingGearMinMaxProgress;                         // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              DriveModeMinMaxProgress;                           // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CockpitMinMaxProgress;                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              NozzleMinMaxProgress;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFMJetAnimInstanceProxy               LocalProxy;                                        // 0x02D0(0x0800)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UDFMVehicleAnimInteractorComponent*     JetAnimComp;                                       // 0x0AD0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMJetMovementComponent*               JetMoveComp;                                       // 0x0AD8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADFMJet*                                JetVehicle;                                        // 0x0AE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 JetAnimSkeletalMeshComp;                           // 0x0AE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AF0[0x10];                                     // 0x0AF0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMJetAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMJetAnimInstance")
	}
	static class UDFMJetAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMJetAnimInstance>();
	}
};
DUMPER7_ASSERTS_UDFMJetAnimInstance;

// Class DFMVehicle.DFMVehicleThermalSmoke
// 0x0028 (0x0778 - 0x0750)
class ADFMVehicleThermalSmoke : public ADFMSkillSmokeActor
{
public:
	float                                         ShieldRadius;                                      // 0x0750(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       Trigger;                                           // 0x0758(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentShieldRadius;                               // 0x0760(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_764[0x14];                                     // 0x0764(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_CurrentShieldRadius(); // (Final, Native, Protected) // @ 0x14A2F9E60
	void OnTriggerBeginOverlapped(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult); // (Final, Native, Protected, HasOutParams) // @ 0x14A2F9EA0
	void OnTriggerEndOverlapped(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex); // (Final, Native, Protected) // @ 0x14A2FA0A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMVehicleThermalSmoke")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMVehicleThermalSmoke")
	}
	static class ADFMVehicleThermalSmoke* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFMVehicleThermalSmoke>();
	}
};
DUMPER7_ASSERTS_ADFMVehicleThermalSmoke;

// Class DFMVehicle.DFMVehicleGlobalUtils
// 0x0000 (0x0028 - 0x0028)
class UDFMVehicleGlobalUtils final : public UObject
{
public:
	static TArray<class FName> GetAllSubChildrenWidgetNames(class ADFMVehicleBase* Vehicle, class AActor* CHARACTER); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A2EA4F0
	static TArray<class FName> GetAllSubParentWidgetNames(class ADFMVehicleBase* Vehicle, class AActor* CHARACTER); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A2EA600
	static TArray<class FName> GetAllSubWidgetNames(class ADFMVehicleBase* Vehicle, class AActor* CHARACTER); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A2EA710
	static TArray<class FName> GetPreloadedSubWidgetNames(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A2EA8B0
	static TMap<class FString, class FName> GetSkillWidgetConfig(class ADFMVehicleBase* Vehicle, class AActor* CHARACTER); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A2EA930

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMVehicleGlobalUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMVehicleGlobalUtils")
	}
	static class UDFMVehicleGlobalUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMVehicleGlobalUtils>();
	}
};
DUMPER7_ASSERTS_UDFMVehicleGlobalUtils;

// Class DFMVehicle.AIHelicopterWeaponInterface
// 0x0000 (0x0000 - 0x0000)
class IAIHelicopterWeaponInterface final
{
public:
	void SetAttackTargets(class AActor* DamageMaker, class AActor* DamageTaker); // (Native, Public) // @ 0x14A2CF510
	void SetFire(bool bFire, float Duration); // (Native, Public) // @ 0x14A2CF5D0
	void UpdateDir(const struct FVector& Dir, class AActor* LockTarget); // (Native, Public, HasDefaults) // @ 0x14A2CF7C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIHelicopterWeaponInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIHelicopterWeaponInterface")
	}
	static class IAIHelicopterWeaponInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAIHelicopterWeaponInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAIHelicopterWeaponInterface;

// Class DFMVehicle.AITankAimTargetComponent
// 0x0038 (0x0130 - 0x00F8)
class UAITankAimTargetComponent final : public UActorComponent
{
public:
	class ADFMCharacter*                          CurrentGunAimTarget;                               // 0x00F8(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADFMCharacter*                          CurrentCanonAimTarget;                             // 0x0100(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableFindAimTarget;                               // 0x0108(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CanonMinHitDistance;                               // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChangeAimTargetStep;                               // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADFMAITank*                             DFMAITank;                                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x8];                                      // 0x0120(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ADFMAIController*                       DFMAIController;                                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ResetCannonDesireRotation(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITankAimTargetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITankAimTargetComponent")
	}
	static class UAITankAimTargetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITankAimTargetComponent>();
	}
};
DUMPER7_ASSERTS_UAITankAimTargetComponent;

// Class DFMVehicle.DFMVehiclePathFollowComponent
// 0x00F8 (0x01F0 - 0x00F8)
class UDFMVehiclePathFollowComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(class AActor* Follower)> OnMoveFollow;                             // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Follower)> OnStopFollow;                             // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Follower)> OnPauseFollow;                            // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Follower)> OnResumeFollow;                           // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Follower)> OnBlockedFollow;                          // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bAutoMoveWhenBegin;                                // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DefaultSplineTag;                                  // 0x014C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMoveLoopAlongDefaultSpline;                       // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoResetWhenBlocked;                             // 0x0155(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlockedDetectionDuration;                          // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HeightToPlaceVehicle;                              // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SteeringInputInterpSpeed;                          // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ThrottleInputInterpSpeed;                          // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLimitMaxSpeedWhenMoving;                          // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSpeedWhenMoving;                                // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInterpolateMovingSpeed;                           // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpolatedSpeedOfMovingSpeed;                    // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLimitMaxSpeedWhenTurning;                         // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxSpeedWhenTurning;                               // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinSpeedWhenTurning;                               // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADFMVehicleBase*                        OwnerVehicle;                                      // 0x0188(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDFMVhiclePathFollowMoveRequestParam   CurrentMoveParam;                                  // 0x0190(0x0010)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDFMVehiclePathFollowWayPointData> CollectedWayPointDataArray;                     // 0x01A0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B0[0x40];                                     // 0x01B0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool RequestToMove(const struct FDFMVhiclePathFollowMoveRequestParam& InParam); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14A2EF140
	bool RequestToPause(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2EF1F0
	bool RequestToResume(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2EF220
	bool RequestToStop(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2EF250

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMVehiclePathFollowComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMVehiclePathFollowComponent")
	}
	static class UDFMVehiclePathFollowComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMVehiclePathFollowComponent>();
	}
};
DUMPER7_ASSERTS_UDFMVehiclePathFollowComponent;

// Class DFMVehicle.AITankPhaseComponent
// 0x0060 (0x0158 - 0x00F8)
class UAITankPhaseComponent final : public UActorComponent
{
public:
	EAITankPhase                                  AITankPhase;                                       // 0x00F8(0x0001)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EAITankPhase, float>                     AITankPhaseTotalTakeHitCountMap;                   // 0x0100(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AITankTotalHP;                                     // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HPPercent;                                         // 0x0154(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void DamageTakerModifyDamage(const struct FDamageSourceInfo& SourceInfo, struct FDamageResultInfo* DamageResult); // (Final, Native, Public, HasOutParams) // @ 0x14A2CD1A0
	float GetHPPercent(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2CDE90
	void OnRep_AITankPhase(); // (Final, Native, Public) // @ 0x14A2CE670
	void OnRep_HPPercentChanged(); // (Final, Native, Public) // @ 0x14A2CE690
	void OnTakeDamage(const struct FDamageResultInfo& DamageResult); // (Final, Native, Public, HasOutParams) // @ 0x14A2CE6B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITankPhaseComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITankPhaseComponent")
	}
	static class UAITankPhaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITankPhaseComponent>();
	}
};
DUMPER7_ASSERTS_UAITankPhaseComponent;

// Class DFMVehicle.BreakthroughVehicleSpawnerDataTableManager
// 0x0068 (0x0098 - 0x0030)
class UBreakthroughVehicleSpawnerDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x68];                                      // 0x0030(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetBreakthroughVehicleSpawnerDataRow(int32 InMapID, struct FBreakthroughVehicleSpawnerDataRow* OutBreakthroughVehicleSpawnerDataRow); // (Final, Native, Public, HasOutParams) // @ 0x14A2CDA80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BreakthroughVehicleSpawnerDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BreakthroughVehicleSpawnerDataTableManager")
	}
	static class UBreakthroughVehicleSpawnerDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBreakthroughVehicleSpawnerDataTableManager>();
	}
};
DUMPER7_ASSERTS_UBreakthroughVehicleSpawnerDataTableManager;

// Class DFMVehicle.BTTask_MoveStraight
// 0x0030 (0x00A8 - 0x0078)
class UBTTask_MoveStraight final : public UGPBTTaskBase
{
public:
	struct FBlackboardKeySelector                 GoalKey;                                           // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         CustomAcceptableRadius;                            // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_MoveStraight")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_MoveStraight")
	}
	static class UBTTask_MoveStraight* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_MoveStraight>();
	}
};
DUMPER7_ASSERTS_UBTTask_MoveStraight;

// Class DFMVehicle.VehicleNavmeshBlockerComponent
// 0x0020 (0x05E0 - 0x05C0)
class UVehicleNavmeshBlockerComponent final : public UBoxComponent
{
public:
	uint8                                         Pad_5B8[0x28];                                     // 0x05B8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCanAffectNavigation(bool Value); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2EF3D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VehicleNavmeshBlockerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VehicleNavmeshBlockerComponent")
	}
	static class UVehicleNavmeshBlockerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleNavmeshBlockerComponent>();
	}
};
DUMPER7_ASSERTS_UVehicleNavmeshBlockerComponent;

// Class DFMVehicle.BTTask_VehicleMoveTo
// 0x0070 (0x00E8 - 0x0078)
class UBTTask_VehicleMoveTo final : public UGPBTTaskBase
{
public:
	struct FBlackboardKeySelector                 DramaAreaBBKey;                                    // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 TeamIDBBKey;                                       // 0x00A0(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         AverageSpeed;                                      // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMinScale;                                     // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedMaxScale;                                     // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomAcceptableRadius;                            // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnemyInterruptRadius;                              // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0xC];                                       // 0x00DC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_VehicleMoveTo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_VehicleMoveTo")
	}
	static class UBTTask_VehicleMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_VehicleMoveTo>();
	}
};
DUMPER7_ASSERTS_UBTTask_VehicleMoveTo;

// Class DFMVehicle.ConquestVehicleSpawnerDataTableManager
// 0x0128 (0x0158 - 0x0030)
class UConquestVehicleSpawnerDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x128];                                     // 0x0030(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetConquestVehicleSpawnerDataRow(int32 InMapID, struct FConquestVehicleSpawnerDataRow* OutConquestVehicleSpawnerDataRow); // (Final, Native, Public, HasOutParams) // @ 0x14A2CDD10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConquestVehicleSpawnerDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConquestVehicleSpawnerDataTableManager")
	}
	static class UConquestVehicleSpawnerDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConquestVehicleSpawnerDataTableManager>();
	}
};
DUMPER7_ASSERTS_UConquestVehicleSpawnerDataTableManager;

// Class DFMVehicle.DFMVehicleMultiInteractor
// 0x0050 (0x0850 - 0x0800)
class ADFMVehicleMultiInteractor : public AMultiInteractorBase
{
public:
	uint8                                         Pad_800[0x50];                                     // 0x0800(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnInteractorHUDClicked(int32 InteractorIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x14A2EEF10
	void RefreshInteractPanel(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMVehicleMultiInteractor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMVehicleMultiInteractor")
	}
	static class ADFMVehicleMultiInteractor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADFMVehicleMultiInteractor>();
	}
};
DUMPER7_ASSERTS_ADFMVehicleMultiInteractor;

// Class DFMVehicle.DFVehicleAdvancedPhysicsComponentBase
// 0x0040 (0x0138 - 0x00F8)
class UDFVehicleAdvancedPhysicsComponentBase : public UActorComponent
{
public:
	struct FFallingBalanceConfig                  FallingBalanceConfig;                              // 0x00F8(0x0028)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FContactRestitutionConfig              ContactRestitutionConfig;                          // 0x0120(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x10];                                     // 0x0128(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFVehicleAdvancedPhysicsComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFVehicleAdvancedPhysicsComponentBase")
	}
	static class UDFVehicleAdvancedPhysicsComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFVehicleAdvancedPhysicsComponentBase>();
	}
};
DUMPER7_ASSERTS_UDFVehicleAdvancedPhysicsComponentBase;

// Class DFMVehicle.DFBoatAdvancedPhysicsComponent
// 0x0150 (0x0288 - 0x0138)
class UDFBoatAdvancedPhysicsComponent final : public UDFVehicleAdvancedPhysicsComponentBase
{
public:
	struct FRuntimeFloatCurve                     StaticFrictionCurve;                               // 0x0138(0x00A0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                     DynamicFrictionCurve;                              // 0x01D8(0x00A0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBoatAutoBalanceConfig                 AutoBalanceConfig;                                 // 0x0278(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBoatAdvancedPhysicsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBoatAdvancedPhysicsComponent")
	}
	static class UDFBoatAdvancedPhysicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBoatAdvancedPhysicsComponent>();
	}
};
DUMPER7_ASSERTS_UDFBoatAdvancedPhysicsComponent;

// Class DFMVehicle.TrailsMeshComponent
// 0x0070 (0x02C0 - 0x0250)
class UTrailsMeshComponent final : public USceneComponent
{
public:
	class UMaterialInterface*                     TrailMaterial;                                     // 0x0250(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x68];                                     // 0x0258(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TrailsMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TrailsMeshComponent")
	}
	static class UTrailsMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrailsMeshComponent>();
	}
};
DUMPER7_ASSERTS_UTrailsMeshComponent;

// Class DFMVehicle.DFInteractableComponent_Vehicle
// 0x0000 (0x0690 - 0x0690)
class UDFInteractableComponent_Vehicle final : public UDFInteractableComponentBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFInteractableComponent_Vehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFInteractableComponent_Vehicle")
	}
	static class UDFInteractableComponent_Vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFInteractableComponent_Vehicle>();
	}
};
DUMPER7_ASSERTS_UDFInteractableComponent_Vehicle;

// Class DFMVehicle.DFInteractableCompProxy_Vehicle
// 0x0030 (0x0168 - 0x0138)
class UDFInteractableCompProxy_Vehicle final : public UDFInteractableCompProxy
{
public:
	struct FGameplayTag                           DriveTag;                                          // 0x0138(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SitInTag;                                          // 0x0140(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RepairTag;                                         // 0x0148(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CachedRepairProcessCompName;                       // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractorOperatorProcessComponent*    CachedRepairProcessComp;                           // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                        RepairWeaponID;                                    // 0x0160(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool IsLocalPlayerOnVehicle(class ADFMVehicleBase* InVehicle); // (Final, Native, Protected, BlueprintCallable) // @ 0x14A2CE290

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFInteractableCompProxy_Vehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFInteractableCompProxy_Vehicle")
	}
	static class UDFInteractableCompProxy_Vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFInteractableCompProxy_Vehicle>();
	}
};
DUMPER7_ASSERTS_UDFInteractableCompProxy_Vehicle;

// Class DFMVehicle.DFMVehicleSkillInstance
// 0x0040 (0x0068 - 0x0028)
class UDFMVehicleSkillInstance final : public UObject
{
public:
	int32                                         SkillId;                                           // 0x0028(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPassiveSkill;                                   // 0x002C(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SeatName;                                          // 0x0030(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDFMVehicleSkillStatus                        SKillStatus;                                       // 0x0038(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainSkillDuration;                               // 0x003C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainCoolDownTime;                                // 0x0040(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemainSkillNum;                                    // 0x0044(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDisable;                                        // 0x0048(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADFMVehicleBase*                        OwnVehicle;                                        // 0x0050(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPCharacter*                           LastSkillUser;                                     // 0x0058(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMVehicleSkillExecutor*               SkillExecutor;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnRep_bIsDisable(); // (Final, Native, Protected) // @ 0x14A2F3190
	void OnRep_SkillStatus(EDFMVehicleSkillStatus OldSkillStatus); // (Final, Native, Protected) // @ 0x14A2F3110

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMVehicleSkillInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMVehicleSkillInstance")
	}
	static class UDFMVehicleSkillInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMVehicleSkillInstance>();
	}
};
DUMPER7_ASSERTS_UDFMVehicleSkillInstance;

// Class DFMVehicle.DFJetAdvancedPhysicsComponent
// 0x0148 (0x0280 - 0x0138)
class UDFJetAdvancedPhysicsComponent final : public UDFVehicleAdvancedPhysicsComponentBase
{
public:
	bool                                          bShouldModifyContactFriction;                      // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     StaticFrictionCurveWithJetUpWorldUpAngle;          // 0x0140(0x00A0)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     DynamicFrictionCurveWWithJetUpWorldUpAngle;        // 0x01E0(0x00A0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFJetAdvancedPhysicsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFJetAdvancedPhysicsComponent")
	}
	static class UDFJetAdvancedPhysicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFJetAdvancedPhysicsComponent>();
	}
};
DUMPER7_ASSERTS_UDFJetAdvancedPhysicsComponent;

// Class DFMVehicle.BOSS04AIHelicopterConfig
// 0x0198 (0x01C0 - 0x0028)
class UBOSS04AIHelicopterConfig final : public UObject
{
public:
	float                                         DeterrenceRange;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FAIHelicopterTimeKey, struct FAIHelicopterSpaceData> PatrolTimeConfig;               // 0x0030(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAIHelicopterSpaceData                 DefaultSpaceData;                                  // 0x0080(0x0120)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0[0x10];                                     // 0x01A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAIHelicopterAlertPath>         AlertPathConfig;                                   // 0x01B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BOSS04AIHelicopterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BOSS04AIHelicopterConfig")
	}
	static class UBOSS04AIHelicopterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBOSS04AIHelicopterConfig>();
	}
};
DUMPER7_ASSERTS_UBOSS04AIHelicopterConfig;

// Class DFMVehicle.DFMWeaponHitPosPredictTableManager
// 0x0010 (0x0040 - 0x0030)
class UDFMWeaponHitPosPredictTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMWeaponHitPosPredictTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMWeaponHitPosPredictTableManager")
	}
	static class UDFMWeaponHitPosPredictTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMWeaponHitPosPredictTableManager>();
	}
};
DUMPER7_ASSERTS_UDFMWeaponHitPosPredictTableManager;

// Class DFMVehicle.DFMVehicleBase
// 0x07D0 (0x1710 - 0x0F40)
class ADFMVehicleBase : public AGPVehicleBase
{
public:
	uint8                                         Pad_F40[0xC0];                                     // 0x0F40(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFMVehicleHealthComponent*             HealthComp;                                        // 0x1000(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleCollisionComponent*          CollisionComp;                                     // 0x1008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleAssembledComponent*          AssembledComp;                                     // 0x1010(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleAnimInteractorComponent*     AnimInteractorComp;                                // 0x1018(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleEffectComponent*             EffectComp;                                        // 0x1020(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleActingComponent*             ActingComponent;                                   // 0x1028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGPPathFollowComponent*                 PathFollowComponent;                               // 0x1030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleSequenceBindingComponent*    SequenceBinding;                                   // 0x1038(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVehicleSignificanceComponent*          VehicleSignificance;                               // 0x1040(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleAudioComponent*              AudioComp;                                         // 0x1048(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleStateControllComponent*      StateComp;                                         // 0x1050(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehiclePhysicsReplicationComponent* PhysicsReplicationComp;                            // 0x1058(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleWaterMaskComponent*          WaterMaskComp;                                     // 0x1060(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGPSharedRepairComponent*               SharedRepairComponent;                             // 0x1068(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFMVehicleHitEffectComponent*          VehicleHitEffectComponent;                         // 0x1070(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGPOutLineEffectComponent*              OutLineEffectComponent;                            // 0x1078(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1080[0x18];                                    // 0x1080(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UDFMVehicleSkinImplement*               SkinImpl;                                          // 0x1098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_10A0[0x10];                                    // 0x10A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeaponSeatInfo>                WeaponSeatInfos;                                   // 0x10B0(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVehicleLockedAttribute                LockedAttribute;                                   // 0x10C0(0x0008)(Net, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          AutoKickWhenRollover;                              // 0x10C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C9[0x7];                                     // 0x10C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            WheelStaticMesh;                                   // 0x10D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            BrokenWheelStaticMesh;                             // 0x10D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVehicleAsyncResourceInfo>      BeginVehicleAsyncResourceInfos;                    // 0x10E0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FVehicleAsyncResourceInfo>      GetOnVehicleAsyncResourceInfos;                    // 0x10F0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FVehicleAsyncResourceInfo>      LocalPlayerGetOnVehicleAsyncResourceInfos;         // 0x1100(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FVehicleAsyncResourceInfo>      DamageAsyncResourceInfos;                          // 0x1110(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<class FName>                           DamageAsyncEffectIds;                              // 0x1120(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         DefaultCamp;                                       // 0x1130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowHealthPrecent;                                  // 0x1134(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           CloseSkeletalMeshWithLowCPUNames;                  // 0x1138(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1148[0x48];                                    // 0x1148(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PassengerNoiseMakingInterval;                      // 0x1190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassengerNoiseRadius;                              // 0x1194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoDriveDuration;                                 // 0x1198(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119C[0x1];                                     // 0x119C(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          isLocalFocus;                                      // 0x119D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHornTooting;                                    // 0x119E(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAutoDriving;                                    // 0x119F(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11A0[0x68];                                    // 0x11A0(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FDamageResultInfo& DamageResultInfo)> OnVehicleTakeDamageExternalSignature; // 0x1208(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	class AActor*                                 DriverOnVehicle;                                   // 0x1218(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DetectRelativeLocation;                            // 0x1220(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MarkerRelativeLocation;                            // 0x122C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUnderCloaking;                                    // 0x1238(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1239[0x7];                                     // 0x1239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVehicleLockStateInfo>          LockedStateInfos;                                  // 0x1240(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FVehicleLockInfo>               LaserLockStateInfos;                               // 0x1250(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLockStateChanged;                                // 0x1260(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
