#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMWeaponAssemble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameCore_classes.hpp"
#include "DFMWeaponAssemble_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "GPGlobalDefines_structs.hpp"


namespace SDK
{

// Class DFMWeaponAssemble.GunCameraParamsRowManager
// 0x0010 (0x0040 - 0x0030)
class UGunCameraParamsRowManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GunCameraParamsRowManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GunCameraParamsRowManager")
	}
	static class UGunCameraParamsRowManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGunCameraParamsRowManager>();
	}
};
DUMPER7_ASSERTS_UGunCameraParamsRowManager;

// Class DFMWeaponAssemble.AssemblerCameraParamsRowManager
// 0x0010 (0x0040 - 0x0030)
class UAssemblerCameraParamsRowManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssemblerCameraParamsRowManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssemblerCameraParamsRowManager")
	}
	static class UAssemblerCameraParamsRowManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssemblerCameraParamsRowManager>();
	}
};
DUMPER7_ASSERTS_UAssemblerCameraParamsRowManager;

// Class DFMWeaponAssemble.AssemblerCameraCtrl
// 0x05A8 (0x0918 - 0x0370)
class AAssemblerCameraCtrl : public AActor
{
public:
	struct FSoftObjectPath                        CamParamsTablePath;                                // 0x0370(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CamResetParamsTablePath;                           // 0x0388(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DefaultCamParamsTablePath;                         // 0x03A0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SlideScreenTablePath;                              // 0x03B8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DefaultSlideTablePath;                             // 0x03D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            SpeedCurve;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMobileDOFInfo                         DefaultMobileDOF;                                  // 0x03F0(0x0034)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPinchParams                           PinchParams;                                       // 0x0424(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBeginCamParams                        BeginCamParams;                                    // 0x0440(0x0108)(Edit, NativeAccessSpecifierPublic)
	float                                         CamSpeedOnBegin;                                   // 0x0548(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateRootSpeed;                                   // 0x054C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateArroundSpeed;                                // 0x0550(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoRotateSpeed;                                   // 0x0554(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResetCamLength;                                    // 0x0558(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoomOutSpeed;                                      // 0x055C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinCameraDist;                                     // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CamLengthInterim;                                  // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultLerpTime;                                   // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LerpSpeedUnit;                                     // 0x056C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MobileFixedLerpSpeed;                              // 0x0570(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GunLookScale;                                      // 0x0574(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGunCameraParamsRow                    GunLookCenterCameraParm;                           // 0x0578(0x0080)(Edit, NativeAccessSpecifierPublic)
	float                                         GunLookMaxRoll;                                    // 0x05F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GunLookMaxRollExtra;                               // 0x05FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateCameraSpeed;                                 // 0x0600(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenCorrectionAlpha;                              // 0x0604(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLockRotate : 1;                                   // 0x0605(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EAssemblerCameraType                          CameraType;                                        // 0x0606(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_607[0x1];                                      // 0x0607(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnTouchMoveStart;                                  // 0x0608(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTouchMoveEnd;                                    // 0x0618(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTouchMove;                                       // 0x0628(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FVector2D& TouchLocation)> OnTouched;                 // 0x0638(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRotateStart;                                     // 0x0648(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnRotateEnd;                                       // 0x0658(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EAssemblerCamPoint PointType)> OnCameraPointChanged;               // 0x0668(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCameraChanged;                                   // 0x0678(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bStartPinch, float EndFOV, float BaseFOV)> OnGesturePinch;    // 0x0688(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Angle)>   OnGestureFlick;                                    // 0x0698(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCameraLerpStart;                                 // 0x06A8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCameraLerpEnd;                                   // 0x06B8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCameraLerp;                                      // 0x06C8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMap<EAssemblerCamPoint, struct FGunCameraParamsRow> CameraParams;                               // 0x06D8(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                FocusCenterOffset;                                 // 0x0728(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocusCenterDistanceRatio;                          // 0x0734(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeaponAttachPosToBoundBoxOrigin;                  // 0x0738(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenOffsetWeapon;                                 // 0x0739(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73A[0x6];                                      // 0x073A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABracketActor*                          Bracket;                                           // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 ViewTargetPoint;                                   // 0x0748(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAssemblerCamPoint                            CurCameraPoint;                                    // 0x0750(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CameraManager;                                     // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AAssembleWeaponActor*                   TargetWeapon;                                      // 0x0760(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMobilePlayerInput*                     MobileInput;                                       // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMobileDOFInfo                         CurMobileDOF;                                      // 0x0770(0x0034)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A4[0x174];                                    // 0x07A4(0x0174)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckCameraViewTarget(); // (Final, Native, Public) // @ 0x14A3F4A50
	EAssemblerCamPoint GetFocusCameraPoint(); // (Final, Native, Public) // @ 0x14A3F58F0
	class AGPPlayerCameraManager* GetGPPlayerCameraManager(); // (Final, Native, Public) // @ 0x14A3F5920
	bool IsAutoSizeCameraPoint(const EAssemblerCamPoint CamPoint); // (Final, Native, Public) // @ 0x14A3F63B0
	void PlayBracketDropAnim(); // (Final, Native, Public) // @ 0x14A3F6670
	void PlayBracketShakeAnim(); // (Final, Native, Public) // @ 0x14A3F6690
	void ProcessEnvionmentOnClose(); // (Final, Native, Public) // @ 0x14A3F6AB0
	void ProcessEnvionmentOnOpen(); // (Final, Native, Public) // @ 0x14A3F6AD0
	void ResetCamera(); // (Final, Native, Public) // @ 0x14A3F6C70
	void ResetOffset(); // (Final, Native, Public) // @ 0x14A3F6C90
	void SetCameraParam(EAssemblerCamPoint CamPoint, const struct FGunCameraParamsRow& Row); // (Final, Native, Public) // @ 0x14A3F6D30
	bool SetCameraParamLerp(const struct FGunCameraParamsRow& CameraParamsRow); // (Final, Native, Public) // @ 0x14A3F6EE0
	struct FGunCameraParamsRow SetCameraToWeaponCenter(EAssemblerCamPoint CamPoint); // (Final, Native, Public) // @ 0x14A3F7050
	struct FGunCameraParamsRow SetCameraToWeaponSocketCenter(EAssemblerCamPoint CamPoint); // (Final, Native, Public) // @ 0x14A3F7180
	void SetCameraType(EAssemblerCameraType Type); // (Final, Native, Public) // @ 0x14A3F72B0
	void SetPitchEnable(bool IsEnable); // (Final, Native, Public) // @ 0x14A3F73B0
	bool SetTargetPoint(EAssemblerCamPoint PointType, bool bUseCameraID); // (Final, Native, Public) // @ 0x14A3F7590
	void StartBeginCamera(); // (Final, Native, Public) // @ 0x14A3F7850
	void UpdateDOFParam(EAssemblerCamPoint CameraPoint); // (Final, Native, Public) // @ 0x14A3F7870

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssemblerCameraCtrl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssemblerCameraCtrl")
	}
	static class AAssemblerCameraCtrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAssemblerCameraCtrl>();
	}
};
DUMPER7_ASSERTS_AAssemblerCameraCtrl;

// Class DFMWeaponAssemble.AssemblerStartPoint
// 0x0000 (0x0370 - 0x0370)
class AAssemblerStartPoint final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssemblerStartPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssemblerStartPoint")
	}
	static class AAssemblerStartPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAssemblerStartPoint>();
	}
};
DUMPER7_ASSERTS_AAssemblerStartPoint;

// Class DFMWeaponAssemble.AssembleWeaponActor
// 0x01F8 (0x0568 - 0x0370)
class AAssembleWeaponActor final : public AActor
{
public:
	uint8                                         Pad_370[0x30];                                     // 0x0370(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UModularApperanceBaseProvider*          ModularApperanceBaseProvider;                      // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAssembleWeaponNodeTree*                NodeTree;                                          // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAssembleWeaponNodeTree*                SnapshotNodeTree;                                  // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int16, class USkeletalMeshComponent*>    MeshComMap;                                        // 0x03B8(0x0050)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, class USkeletalMesh*> ItemIdToMeshMap;                              // 0x0408(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 RootPartMesh;                                      // 0x0458(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModularWeaponDesc*                     Desc;                                              // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          PendantAnimSequence;                               // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           PendantAnimMontage;                                // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurrentDescRowName;                                // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIdle : 1;                                         // 0x0480(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStreamInFullTex : 1;                              // 0x0480(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_481[0x17];                                     // 0x0481(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsComplete)>              OnDynamicLoadMeshesComplete;                       // 0x0498(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A8[0x20];                                     // 0x04A8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponDataComponentAdapterSimple*      AdapterComponent;                                  // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UWeaponSkinApperanceModiferBase*> SkinApperanceModifers;                            // 0x04D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4E0[0x28];                                     // 0x04E0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        PreviewPresetId;                                   // 0x0508(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        PreviewSkinApperanceId;                            // 0x0510(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponPartMeshType                           LoadMeshType;                                      // 0x0518(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDisplayAdapter;                                  // 0x0519(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51A[0x2];                                      // 0x051A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CalBoundMax;                                       // 0x051C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CalBoundMin;                                       // 0x0520(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateForPreview;                                 // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UModularWeaponMeshProxy*                MeshProxy;                                         // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnalbePartOffset;                                 // 0x0530(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Use3PTemplateMaterial;                             // 0x0531(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ForceLod;                                          // 0x0534(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModularWeaponSkeletalMeshComponent*    MainWeaponMeshSkeletalComponent;                   // 0x0538(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FixedTransformPosition;                            // 0x0540(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LastFixedTransformPosition;                        // 0x054C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickCounter;                                       // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseInEditorView;                                  // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int16 AddNewPart(uint64 ItemID, const struct FItemInfoContext& ItemInfo, int16 ParentNodeIndex, uint32 SocketId, uint64 Guid); // (Final, Native, Public) // @ 0x14A3F4610
	void CacheSkeletalMeshRef(const struct FSoftObjectPath& SoftObjectPath, class USkeletalMesh* Mesh); // (Final, Native, Protected, HasDefaults) // @ 0x14A3F48F0
	void ClearDebugBounds(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A3F4A70
	void ClearSnapshotNodeTree(); // (Final, Native, Public) // @ 0x14A3F4A90
	void CopyChild(int16 SrcPartIndex, int16 DesPartIndex); // (Final, Native, Public) // @ 0x14A3F4AB0
	class UModularWeaponDynamicSkeletalMeshComponent* CreateDynamicSkeletalMeshComponent(class USkeletalMeshComponent* ParentSkeletalMeshComponent, class FName AttachName, uint64 ItemGid, uint64 ItemID, class USkeletalMesh* SkeletalMesh); // (Final, Native, Public) // @ 0x14A3F4B70
	void CreatePreviewGunOnScene(); // (Final, Native, Public) // @ 0x14A3F4D00
	void CreateRootPart(const struct FPartsDataRow& PartDataRow, uint64 Guid); // (Final, Native, Public, HasOutParams) // @ 0x14A3F4D20
	void CreateWeaponFromDesc(class UModularWeaponDesc* Desc_0, bool isAsync); // (Final, Native, Public) // @ 0x14A3F4E80
	void CreateWeaponFromDescId(uint64 DescId, bool isAsync); // (Final, Native, Public) // @ 0x14A3F4F50
	void CreateWeaponFromNodes(TArray<struct FGPModularWeaponPartNode>* Nodes, const struct FWeaponSkinInfo& SkinInfo, bool isAsync); // (Final, Native, Public, HasOutParams) // @ 0x14A3F5020
	void CreateWeaponFromNodesV2(TArray<struct FGPModularWeaponPartNode>* Nodes, const struct FWeaponSkinInfo& SkinInfo, bool bIsBipodDeploy, bool isAsync); // (Final, Native, Public, HasOutParams) // @ 0x14A3F5370
	void CreateWeaponFromRow(const struct FGunPresetRow& GunRow, bool isAsync); // (Final, Native, Public, HasOutParams) // @ 0x14A3F5710
	void DrawDebugBounds(); // (Final, Native, Public, BlueprintCallable) // @ 0x14A3F5840
	void FullTextureStreamIn(); // (Final, Native, Public) // @ 0x14A3F5860
	struct FVector GetBoundsCenterOffset(); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5880
	bool GetFixWorldTransformLocationDirty(); // (Final, Native, Public) // @ 0x14A3F58C0
	class USkeletalMeshComponent* GetOrNewSkeletalCom(int16 Index_0, uint64 ItemID); // (Final, Native, Public) // @ 0x14A3F5950
	struct FVector GetPartCenterLocation(int16 PartIndex, bool bScreenPos); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5A10
	struct FVector2D GetPartCenterLocationOnViewport(int16 PartIndex); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5AF0
	struct FVector GetPartOffset(int16 PartIndex); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5B80
	struct FVector GetSocketLocation(int16 PartIndex, int16 SocketIndex, bool bScreenPos); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5C30
	struct FVector GetSocketLocationByRelative(int16 PartIndex, int16 SocketIndex, const ERelativeTransformSpace RelativeTransformSpace); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5D50
	struct FVector GetSocketLocationBySocketGUID(const uint64 SocketGUID); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5E70
	struct FVector GetSocketLocationBySocketName(class FName SocketName, bool bScreenPos); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5F10
	struct FVector2D GetSocketLocationOnViewport(int16 PartIndex, int16 SocketIndex); // (Final, Native, Public, HasDefaults) // @ 0x14A3F5FF0
	struct FVector2D GetSocketLocationOnViewportBySocketGUID(const uint64 SocketGUID); // (Final, Native, Public, HasDefaults) // @ 0x14A3F60C0
	struct FVector GetSocketOffset(int16 ParentPartIndex, int16 SocketIndex); // (Final, Native, Public, HasDefaults) // @ 0x14A3F6150
	bool IsFullTextureStreamIn(); // (Final, Native, Public) // @ 0x14A3F6440
	bool IsMerged(); // (Final, Native, Public) // @ 0x14A3F6470
	class USkeletalMeshComponent* NewSkeletalCom(); // (Final, Native, Public) // @ 0x14A3F64A0
	void OnBuildMergeMeshComplete(); // (Final, Native, Public) // @ 0x14A3F64D0
	void OnDescAddPartCallback(const struct FGPModularWeaponPartNode& Node); // (Final, Native, Public, HasOutParams) // @ 0x14A3F64F0
	void OnPlayPendantAnimationEnd(class UAnimMontage* Montage, bool bInterrupted); // (Final, Native, Public) // @ 0x14A3F65A0
	void PlayPartDefaultAnimByIndex(int16 PartIndex); // (Final, Native, Public) // @ 0x14A3F66B0
	void PlayPendantAnimation(const struct FSoftObjectPath& PendantAnimSequencePath); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x14A3F6730
	void PostBuildCompleteTickOneFrame(float dt, const struct FTimerHandle& TimerHandle); // (Final, Native, Public, HasOutParams) // @ 0x14A3F6810
	void PrepareNodeTreeFromDesc(class UModularWeaponDesc* InDesc, const bool bRefreshSocketNodeFlag); // (Final, Native, Public) // @ 0x14A3F68F0
	void PrepareSnapshotNodeTreeFromDesc(class UModularWeaponDesc* InDesc, const bool bRefreshSocketNodeFlag); // (Final, Native, Public) // @ 0x14A3F69C0
	void PreviewBoundOffset(); // (Final, Native, Public) // @ 0x14A3F6A90
	void RemoveNewPart(uint64 ParentGuid, uint32 SocketId); // (Final, Native, Public) // @ 0x14A3F6AF0
	void RemovePart(int16 ParentPartNodeIndex, int16 SlotIndex); // (Final, Native, Public) // @ 0x14A3F6BB0
	void Reset(); // (Final, Native, Public) // @ 0x142A88DE0
	void SetAllSkeletalOutLine(int32 DepthValue); // (Final, Native, Public) // @ 0x14A3F6CB0
	void SetForceLOD(int32 LOD); // (Final, Native, Public) // @ 0x14A3F7330
	void SetPreviewDynamicEffect(bool InPreviewDynamicEffect); // (Final, Native, Public) // @ 0x14A3F7440
	void SetSkeletalOutLine(int16 PartIndex, int32 DepthValue); // (Final, Native, Public) // @ 0x14A3F74D0
	void SetUseInRTCapture(bool InbUseInRTCapture, bool InbWhiteIcon); // (Final, Native, Public) // @ 0x14A3F7660
	void SetVisibility(bool bVisible); // (Final, Native, Public) // @ 0x14A3F7730
	void SetWeaponPartOffsetEnable(bool bEnable); // (Final, Native, Public) // @ 0x14A3F77C0
	void SetWorldTransformLocation(); // (Final, Native, Public) // @ 0x142A88400
	void UpdateFixWorldTransformLocation(); // (Final, Native, Public) // @ 0x14A3F78F0

	bool HasCacheSkeletalMesh(const struct FSoftObjectPath& SoftObjectPath, class USkeletalMesh** OutMesh) const; // (Final, Native, Protected, HasOutParams, HasDefaults, Const) // @ 0x14A3F6230

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssembleWeaponActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssembleWeaponActor")
	}
	static class AAssembleWeaponActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAssembleWeaponActor>();
	}
};
DUMPER7_ASSERTS_AAssembleWeaponActor;

// Class DFMWeaponAssemble.AssembleWeaponNodeTree
// 0x0010 (0x0038 - 0x0028)
class UAssembleWeaponNodeTree final : public UObject
{
public:
	TArray<struct FGPAssemblePartNode>            AllNodes;                                          // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	struct FGPAssemblePartNode GetAttachmentNode(EWeaponExtraModelType PartType); // (Final, Native, Public) // @ 0x14A3FB2A0
	struct FGPAssemblePartNode GetNode(EAdapterItemType PartType); // (Final, Native, Public) // @ 0x14A3FB5D0
	struct FGPAssemblePartNode GetNodeByGUID(uint64 Guid); // (Final, Native, Public) // @ 0x14A3FB680
	struct FGPAssemblePartNode GetNodeByIndex(int32 Index_0); // (Final, Native, Public) // @ 0x14A3FB720
	struct FGPAssemblePartNode GetNodeBySocketGUID(uint64 SocketGUID); // (Final, Native, Public) // @ 0x14A3FB7C0
	uint64 GetRootItemID(); // (Final, Native, Public) // @ 0x14A3FBB70
	struct FGPAssemblePartSocket GetSocketFromSocketGUID(uint64 Guid); // (Final, Native, Public) // @ 0x14A3FBBA0
	void RefreshSocketNodeFlag(); // (Final, Native, Public) // @ 0x14A3FCCB0
	void ReLinkSocketGUIDs(); // (Final, Native, Public) // @ 0x14A3FCC90
	void SetSocketFlag(struct FGPAssemblePartNode* Node, const bool bIsSimulateParentNode); // (Final, Native, Public, HasOutParams) // @ 0x14A3FD000

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssembleWeaponNodeTree")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssembleWeaponNodeTree")
	}
	static class UAssembleWeaponNodeTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssembleWeaponNodeTree>();
	}
};
DUMPER7_ASSERTS_UAssembleWeaponNodeTree;

// Class DFMWeaponAssemble.AssembleWeaponDataLibrary
// 0x0000 (0x0028 - 0x0028)
class UAssembleWeaponDataLibrary final : public UObject
{
public:
	static struct FFastEquipResult AddNodeToDesc(class UModularWeaponDesc* Desc, uint64 ItemID, const struct FItemInfoContext& ItemInfo, uint64 Guid, uint64 ParentGid, uint32 SocketId, bool bOnlyForCheck); // (Final, Native, Static, Public) // @ 0x14A3F95F0
	static struct FFastEquipResult AddNodeToDescFromParentNode(class UModularWeaponDesc* Desc, uint64 ItemID, const struct FItemInfoContext& ItemInfo, uint64 Guid, uint32 SocketId, const struct FGPModularWeaponPartNode& ParentNode, bool bOnlyForCheck, bool bFillVirtualParts); // (Final, Native, Static, Public) // @ 0x14A3F98D0
	static struct FFastEquipResult AddNodeToDescFromSocketGUID(class UModularWeaponDesc* Desc, uint64 ItemID, uint64 ItemGUID, const struct FItemInfoContext& ItemInfo, uint64 SocketGUID, bool bOnlyForCheck); // (Final, Native, Static, Public) // @ 0x14A3F9C10
	static struct FFastEquipResult AutoAddNodeToDesc(class UModularWeaponDesc* Desc, uint64 ItemID, const struct FItemInfoContext& ItemInfo, uint64 Guid, bool bOnlyForCheck); // (Final, Native, Static, Public) // @ 0x14A3F9EA0
	static struct FFastEquipResult AutoRemoveNodeFromDescWithSocketGUID(class UModularWeaponDesc* Desc, uint64 SocketGUID, bool bOnlyForCheck); // (Final, Native, Static, Public) // @ 0x14A3FA0F0
	static struct FFastEquipResult AutoRemoveNodeFromeDesc(class UModularWeaponDesc* Desc, uint64 ItemID, uint64 Guid, bool bOnlyForCheck); // (Final, Native, Static, Public) // @ 0x14A3FA230
	static void BaseRefreshSocketNodeFlagFromWeaponDesc(class UModularWeaponDesc* Desc, const uint64 PartNodeIndex, const bool bIsSimulateParentNode); // (Final, Native, Static, Public) // @ 0x14A3FA3B0
	static float CalculateWeaponPrice(class UModularWeaponDesc* ModularWeaponDesc); // (Final, Native, Static, Public) // @ 0x14A3FA4B0
	static float CalculateWeaponWeight(class UModularWeaponDesc* ModularWeaponDesc); // (Final, Native, Static, Public) // @ 0x14A3FA540
	static float CalculateWeaponWeightByDescInfo(const struct FGPWeaponDescInfo& GunDescInfo); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FA5D0
	static struct FFastEquipResult ChcekOccupySocket(class UModularWeaponDesc* Desc, int32 PartIndex, uint64 ItemID, uint32 SocketId); // (Final, Native, Static, Public) // @ 0x14A3FA690
	static struct FFastEquipResult ChcekOccupySocketFromSocketGUID(class UModularWeaponDesc* Desc, const struct FGPModularWeaponPartNode& ParentNode, uint64 ItemID, uint32 SocketId); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FA810
	static void CheckAndFillExtraModels(class UModularWeaponDesc* Desc); // (Final, Native, Static, Public) // @ 0x14A3FA9C0
	static void CheckAndFillSkinAttachModels(class UModularWeaponDesc* Desc); // (Final, Native, Static, Public) // @ 0x14A3FAA30
	static void CheckAndFillVirtualPart(class UModularWeaponDesc* Desc, struct FFastEquipResult* InOutEquipResult); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FAAA0
	static void CheckAndFillVirtualPartV2(class UModularWeaponDesc* Desc, struct FFastEquipResult* InOutEquipResult); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FABB0
	static struct FFastEquipResult CheckFastEquip(class UModularWeaponDesc* Desc, uint64 ItemID, const struct FItemInfoContext& ItemInfo, uint64 Guid); // (Final, Native, Static, Public) // @ 0x14A3FACC0
	static bool CheckSocketCanAddItem(const struct FGPAssemblePartSocket& Socket, uint64 NodeItemId, uint64 ItemID); // (Final, Native, Static, Public) // @ 0x14A3FAEC0
	static TArray<uint32> FindValidSocketIdList(class UModularWeaponDesc* Desc, uint64 ItemID); // (Final, Native, Static, Public) // @ 0x14A3FB110
	static class UAssembleWeaponNodeTree* GetAssemblePartNodesFromeDesc(class UModularWeaponDesc* Desc); // (Final, Native, Static, Public) // @ 0x14A3FB220
	static bool GetItemIDAndModelID4ShareCode(const class FString& ShareCodeString, uint64* ItemID, int32* ModelID); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FB470
	static TArray<uint64> GetPartInstallReceiverList(uint64 PartItemId); // (Final, Native, Static, Public) // @ 0x14A3FB860
	static void GetPartSocketValidInstallList(uint64 PartItemId, uint32 SocketId, TArray<uint64>* OutValidInstallItemIds); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FB930
	static void GetReceiverIDValidInstallList(const uint64 ReceiverID, TArray<uint64>* OutValidInstallItemIds); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FBA70
	static class UGPModularWeaponDesc* GetWeaponDescAndPartIndexsFromPreset(const struct FGunPresetRow& GunRow, TArray<int32>* PartIndexs); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FBCF0
	static class UGPModularWeaponDesc* GetWeaponDescFromAdapterID(uint64 InAdapaterItemId); // (Final, Native, Static, Public) // @ 0x14A3FBE70
	static class UGPModularWeaponDesc* GetWeaponDescFromModularContext(const struct FModularContext& ModularContext); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FBEF0
	static class UGPModularWeaponDesc* GetWeaponDescFromModularInfo(const struct FModularWeaponInfo& ModularWeaponInfo); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FC200
	static class UGPModularWeaponDesc* GetWeaponDescFromPreset(const struct FGunPresetRow& GunRow); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FC530
	static class UGPModularWeaponDesc* GetWeaponDescFromPresetId(uint64 PresetId); // (Final, Native, Static, Public) // @ 0x14A3FC610
	static class UGPModularWeaponDesc* GetWeaponDescFromWeaponID(uint64 InWeaponId); // (Final, Native, Static, Public) // @ 0x14A3FC690
	static bool HasVirtualPart(uint64 RecId, uint32 ParentSocketId, uint64* OutItemId); // (Final, Native, Static, Public, HasOutParams) // @ 0x14A3FC740
	static bool IsBasicSocket(uint64 RecId, int32 SocketId); // (Final, Native, Static, Public) // @ 0x14A3FC840
	static bool IsCanInstallBySocketGUID(class UModularWeaponDesc* Desc, const uint64 SocketGUID, const uint64 ItemID); // (Final, Native, Static, Public) // @ 0x14A3FC900
	static bool IsCanInstallOnWeapon(class UModularWeaponDesc* Desc, uint64 ItemID); // (Final, Native, Static, Public) // @ 0x14A3FC9F0
	static bool IsHiddenInGunsmith(const uint64 PartItemId); // (Final, Native, Static, Public) // @ 0x14A3FCAB0
	static bool IsValidWeapon(class UModularWeaponDesc* Desc); // (Final, Native, Static, Public) // @ 0x14A3FCB30
	static bool IsVirutalPartItem(uint64 PartItemId); // (Final, Native, Static, Public) // @ 0x14A3FCBB0
	static void RefreshSocketNodeFlagFromWeaponDesc(class UModularWeaponDesc* Desc, const uint64 PartNodeIndex, const bool bIsSimulateParentNode); // (Final, Native, Static, Public) // @ 0x14A3FCCD0
	static void RefreshVirutalSocketNodeFlagFromWeaponDesc(class UModularWeaponDesc* Desc, const uint64 PartNodeIndex); // (Final, Native, Static, Public) // @ 0x14A3FCDD0
	static struct FFastEquipResult RemoveNodeFromeDescByIndex(class UModularWeaponDesc* Desc, int32 PartNodeIndex, bool bOnlyForCheck, bool bFillVirtualParts); // (Final, Native, Static, Public) // @ 0x14A3FCE80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssembleWeaponDataLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssembleWeaponDataLibrary")
	}
	static class UAssembleWeaponDataLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssembleWeaponDataLibrary>();
	}
};
DUMPER7_ASSERTS_UAssembleWeaponDataLibrary;

// Class DFMWeaponAssemble.AssembleWeaponMgr
// 0x0028 (0x0398 - 0x0370)
class AAssembleWeaponMgr final : public AActor
{
public:
	TArray<TWeakObjectPtr<class AAssembleWeaponActor>> WeaponContainer;                              // 0x0370(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AAssembleWeaponActor>> WeaponContainer_RTI;                          // 0x0380(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_390[0x8];                                      // 0x0390(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AAssembleWeaponActor* GetEmptyWeapon(class UWorld* InWorld); // (Final, Native, Public) // @ 0x14A3FB350
	class AAssembleWeaponActor* GetEmptyWeaponForRTI(class UWorld* InWorld); // (Final, Native, Public) // @ 0x14A3FB3E0
	void OnPreGarbageCollect(); // (Final, Native, Public) // @ 0x14A3FCC30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssembleWeaponMgr")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssembleWeaponMgr")
	}
	static class AAssembleWeaponMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAssembleWeaponMgr>();
	}
};
DUMPER7_ASSERTS_AAssembleWeaponMgr;

// Class DFMWeaponAssemble.AssemblyPlayerController
// 0x0000 (0x0AA8 - 0x0AA8)
class AAssemblyPlayerController final : public AGPPlayerController
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssemblyPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssemblyPlayerController")
	}
	static class AAssemblyPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAssemblyPlayerController>();
	}
};
DUMPER7_ASSERTS_AAssemblyPlayerController;

// Class DFMWeaponAssemble.BracketActor
// 0x0070 (0x03E0 - 0x0370)
class ABracketActor : public AActor
{
public:
	TSubclassOf<class AAssemblerCameraCtrl>       BpAssemblerCameraCtrl;                             // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           ShakeMontage;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           DropMontage;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WeaponRootSocket;                                  // 0x0388(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RotateRootSocket;                                  // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DefaultCameraRotation;                             // 0x0398(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               DefaultRelativeRotation;                           // 0x03A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DefaultOffset;                                     // 0x03B0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultBracketYaw;                                 // 0x03BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SelfSkeletalMeshCom;                               // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimInstance*                          SelfAnimInstance;                                  // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x10];                                     // 0x03D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateAssmblerAndCamera(); // (Final, Native, Public) // @ 0x14A3FB0F0
	float GetYaw(); // (Final, Native, Public) // @ 0x14A3FC710
	void PlayDropAnim(); // (Final, Native, Public) // @ 0x14A3FCC50
	void PlayShakeAnim(); // (Final, Native, Public) // @ 0x14A3FCC70
	void SetYaw(float Yaw); // (Final, Native, Public) // @ 0x14A3FD1B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BracketActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BracketActor")
	}
	static class ABracketActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABracketActor>();
	}
};
DUMPER7_ASSERTS_ABracketActor;

// Class DFMWeaponAssemble.CaptureExclude
// 0x0010 (0x0380 - 0x0370)
class ACaptureExclude final : public AActor
{
public:
	TArray<TWeakObjectPtr<class AActor>>          ExcludeList;                                       // 0x0370(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CaptureExclude")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CaptureExclude")
	}
	static class ACaptureExclude* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACaptureExclude>();
	}
};
DUMPER7_ASSERTS_ACaptureExclude;

// Class DFMWeaponAssemble.LightEnvToogle
// 0x0038 (0x03A8 - 0x0370)
class ALightEnvToogle final : public AActor
{
public:
	TWeakObjectPtr<class APostProcessVolume>      WeakPostProcess;                                   // 0x0370(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ANZSkyBoxActor>          WeakNZSkyBoxActor;                                 // 0x0378(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AExponentialHeightFog>   WeakFogActor;                                      // 0x0380(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ADirectionalLight>       WeakDirLightActor;                                 // 0x0388(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ASkyLight>               WeakSkyLightActor;                                 // 0x0390(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  DisplayBoardLights;                                // 0x0398(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  AssemblyTableLights;                               // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void CloseEnv(); // (Final, Native, Public) // @ 0x14A400950
	void OpenEnv(); // (Final, Native, Public) // @ 0x14A401930
	void SyncDisplayBoardLight(bool bIsOpen); // (Final, Native, Public) // @ 0x14A4024A0
	void ToogleEnv(bool bOpen); // (Final, Native, Public) // @ 0x14A402860

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LightEnvToogle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LightEnvToogle")
	}
	static class ALightEnvToogle* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALightEnvToogle>();
	}
};
DUMPER7_ASSERTS_ALightEnvToogle;

// Class DFMWeaponAssemble.DFMModularAppearanceProvider
// 0x0000 (0x0028 - 0x0028)
class UDFMModularAppearanceProvider final : public UModularApperanceBaseProvider
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMModularAppearanceProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMModularAppearanceProvider")
	}
	static class UDFMModularAppearanceProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMModularAppearanceProvider>();
	}
};
DUMPER7_ASSERTS_UDFMModularAppearanceProvider;

// Class DFMWeaponAssemble.DFMWeaponSkinUtil
// 0x0000 (0x0028 - 0x0028)
class UDFMWeaponSkinUtil final : public UObject
{
public:
	static TArray<struct FWeaponSkin_TexasPoker_Card> Generate_TexasPokerCards(int32 TexasPokerRuleId, uint64 RandomSeed); // (Final, Native, Static, Public) // @ 0x14A400D30
	static class FString TexasPokerNumberEnumToDebugString(int32 InNumberEnum); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A402530
	static float TexasPokerNumberEnumToMaterialParameter(int32 InNumberEnum); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A402600
	static class FString TexasPokerPatternEnumToDebugString(int32 InPatternEnum); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A402680
	static float TexasPokerPatternEnumToMaterialParameter(int32 InPatternEnum); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14A402750

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFMWeaponSkinUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFMWeaponSkinUtil")
	}
	static class UDFMWeaponSkinUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFMWeaponSkinUtil>();
	}
};
DUMPER7_ASSERTS_UDFMWeaponSkinUtil;

// Class DFMWeaponAssemble.RTIActorData
// 0x0008 (0x0030 - 0x0028)
class URTIActorData : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTIActorData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTIActorData")
	}
	static class URTIActorData* GetDefaultObj()
	{
		return GetDefaultObjImpl<URTIActorData>();
	}
};
DUMPER7_ASSERTS_URTIActorData;

// Class DFMWeaponAssemble.RTIActorData_HeroItem
// 0x0030 (0x0060 - 0x0030)
class URTIActorData_HeroItem final : public URTIActorData
{
public:
	class ASkeletalMeshActor*                     HeroItem;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        LoadedObject;                                      // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLoadHeroItemComplete(const struct FSoftObjectPath& Path, class FName HeroItemId, class FName HeroItemFahionId); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x14A4016F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTIActorData_HeroItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTIActorData_HeroItem")
	}
	static class URTIActorData_HeroItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URTIActorData_HeroItem>();
	}
};
DUMPER7_ASSERTS_URTIActorData_HeroItem;

// Class DFMWeaponAssemble.RTIActorData_Item
// 0x0010 (0x0040 - 0x0030)
class URTIActorData_Item final : public URTIActorData
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ItemActor;                                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTIActorData_Item")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTIActorData_Item")
	}
	static class URTIActorData_Item* GetDefaultObj()
	{
		return GetDefaultObjImpl<URTIActorData_Item>();
	}
};
DUMPER7_ASSERTS_URTIActorData_Item;

// Class DFMWeaponAssemble.RTIActorData_Vehicle
// 0x0018 (0x0048 - 0x0030)
class URTIActorData_Vehicle final : public URTIActorData
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AVehicleFrontendActor*                  Vehicle;                                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLoadVehicleComplete(uint64 ID, bool bSuccess); // (Final, Native, Private) // @ 0x14A401840

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTIActorData_Vehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTIActorData_Vehicle")
	}
	static class URTIActorData_Vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<URTIActorData_Vehicle>();
	}
};
DUMPER7_ASSERTS_URTIActorData_Vehicle;

// Class DFMWeaponAssemble.RTIActorData_Weapon
// 0x0008 (0x0038 - 0x0030)
class URTIActorData_Weapon final : public URTIActorData
{
public:
	class AAssembleWeaponActor*                   Weapon;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTIActorData_Weapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTIActorData_Weapon")
	}
	static class URTIActorData_Weapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<URTIActorData_Weapon>();
	}
};
DUMPER7_ASSERTS_URTIActorData_Weapon;

// Class DFMWeaponAssemble.CaptureRTResult
// 0x0018 (0x0040 - 0x0028)
class UCaptureRTResult final : public UObject
{
public:
	class UTextureRenderTarget2D*                 ColorRT;                                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SizeUV;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CaptureRTResult")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CaptureRTResult")
	}
	static class UCaptureRTResult* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaptureRTResult>();
	}
};
DUMPER7_ASSERTS_UCaptureRTResult;

// Class DFMWeaponAssemble.RTICapture
// 0x0118 (0x0488 - 0x0370)
class ARTICapture : public AActor
{
public:
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        RTIRootComponent;                                  // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x48];                                     // 0x0388(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FSoftObjectPath, struct FRTILightBPData> AllRTILightBPDataMap;                       // 0x03D0(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class ULightComponentBase*, struct FRTIOriginLightComponentData> OriginLightComponentBaseDataMap; // 0x0420(0x0050)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class ALightShadowVolume*                     LightShadowVolumeActor;                            // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_478[0x10];                                     // 0x0478(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCaptureRTResult* CaptureWeapon(class URTIActorData* RTIActorData, const struct FVector2D& RTSize, struct FRTIParamData* InRTIParamData); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x14A400810
	void HandleCaptureWeapon(class URTIActorData* RTIActorData, const struct FVector2D& RTSize, const struct FRTIConfigRow& RTIConfigRow, class UCaptureRTResult* CaptureRTResult); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x14A401210

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTICapture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTICapture")
	}
	static class ARTICapture* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARTICapture>();
	}
};
DUMPER7_ASSERTS_ARTICapture;

// Class DFMWeaponAssemble.RTICaptureHelper
// 0x0000 (0x0028 - 0x0028)
class URTICaptureHelper final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTICaptureHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RTICaptureHelper")
	}
	static class URTICaptureHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<URTICaptureHelper>();
	}
};
DUMPER7_ASSERTS_URTICaptureHelper;

// Class DFMWeaponAssemble.RTIResourceManager
// 0x0068 (0x0090 - 0x0028)
class URTIResourceManager final : public UObject
{
public:
	TSet<class UObject*>                          RTIResourceList_PreLoad;                           // 0x0028(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FSoftObjectPath GetDefaultCommon_Transition(); // (Final, Native, Public, HasDefaults) // @ 0x14A400EC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RTIResourceManager")
	}
	static const class FName& StaticName()
	{
