#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFMWeaponAssemble

#include "Basic.hpp"

#include "GPGameplay_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum DFMWeaponAssemble.EWeaponLoadStatus
// NumValues: 0x0006
enum class EWeaponLoadStatus : uint8
{
	None                                     = 0,
	LoadingMesh                              = 1,
	LoadingMaterial                          = 2,
	Success                                  = 3,
	Faild                                    = 4,
	EWeaponLoadStatus_MAX                    = 5,
};

// Enum DFMWeaponAssemble.EFastEquipOpreationCode
// NumValues: 0x0007
enum class EFastEquipOpreationCode : uint8
{
	Deault                                   = 0,
	Add                                      = 1,
	Remove                                   = 2,
	Conflict                                 = 4,
	VirtualPrepare                           = 8,
	VirtualPost                              = 16,
	EFastEquipOpreationCode_MAX              = 17,
};

// Enum DFMWeaponAssemble.EAssemblePartSocketType
// NumValues: 0x0004
enum class EAssemblePartSocketType : uint8
{
	None                                     = 0,
	Default                                  = 1,
	RulesSocket                              = 2,
	EAssemblePartSocketType_MAX              = 3,
};

// Enum DFMWeaponAssemble.ERTIActorDataLoadMesh
// NumValues: 0x0004
enum class ERTIActorDataLoadMesh : uint8
{
	Loading                                  = 0,
	Success                                  = 1,
	Fail                                     = 2,
	ERTIActorDataLoadMesh_MAX                = 3,
};

// Enum DFMWeaponAssemble.ERTIActorDataType
// NumValues: 0x0006
enum class ERTIActorDataType : uint8
{
	StaticIcon                               = 0,
	Weapon                                   = 1,
	Vehicle                                  = 2,
	HeroItem                                 = 3,
	Item                                     = 4,
	ERTIActorDataType_MAX                    = 5,
};

// Enum DFMWeaponAssemble.ECaptureRTResult
// NumValues: 0x0008
enum class ECaptureRTResult : uint8
{
	Waiting                                  = 0,
	Success                                  = 1,
	Fail_ConfigIsError                       = 2,
	Fail_RTSizeIsZero                        = 3,
	Fail_RTIsNULL                            = 4,
	Fail_WeaponIsNULL                        = 5,
	Fail_WeaponBoundsIsZero                  = 6,
	ECaptureRTResult_MAX                     = 7,
};

// Enum DFMWeaponAssemble.ERTICaptureType
// NumValues: 0x0003
enum class ERTICaptureType : uint8
{
	Game                                     = 0,
	Editor                                   = 1,
	ERTICaptureType_MAX                      = 2,
};

// Enum DFMWeaponAssemble.ERTICaptureMeshProcess
// NumValues: 0x0004
enum class ERTICaptureMeshProcess : uint8
{
	CaptureNone                              = 0,
	CaptureLowIcon                           = 1,
	CaptureHighIcon                          = 2,
	ERTICaptureMeshProcess_MAX               = 3,
};

// Enum DFMWeaponAssemble.ERTICaptureState
// NumValues: 0x0004
enum class ERTICaptureState : uint8
{
	RTICaptureWaiting                        = 0,
	RTICaptureFail                           = 1,
	RTICaptureSuccess                        = 2,
	ERTICaptureState_MAX                     = 3,
};

// Enum DFMWeaponAssemble.ERTIActionProcess
// NumValues: 0x000A
enum class ERTIActionProcess : uint8
{
	Init                                     = 0,
	Loading                                  = 1,
	LoadFail                                 = 2,
	LoadSuccess                              = 3,
	Capturing                                = 4,
	CaptureFail                              = 5,
	CaptureSuccess                           = 6,
	MergeSuccessOrFallBack                   = 7,
	Discard                                  = 8,
	ERTIActionProcess_MAX                    = 9,
};

// Enum DFMWeaponAssemble.ERTIMerge
// NumValues: 0x0005
enum class ERTIMerge : uint8
{
	Close                                    = 0,
	AllIcon                                  = 1,
	OnlyWeaponIcon                           = 2,
	OnlyStaticIcon                           = 3,
	ERTIMerge_MAX                            = 4,
};

// Enum DFMWeaponAssemble.ERTIEnable
// NumValues: 0x0005
enum class ERTIEnable : uint8
{
	DisableAll                               = 0,
	EnableAll                                = 1,
	EnableWeaponIcon                         = 2,
	EnableStaticIcon                         = 3,
	ERTIEnable_MAX                           = 4,
};

// Enum DFMWeaponAssemble.EWeaponPresetGenerateType
// NumValues: 0x0004
enum class EWeaponPresetGenerateType : uint8
{
	CompletelyRandom                         = 0,
	MainAttribute                            = 1,
	OnlyMainAttribute                        = 2,
	EWeaponPresetGenerateType_MAX            = 3,
};

// ScriptStruct DFMWeaponAssemble.CameraResetParamsRow
// 0x0010 (0x0020 - 0x0010)
struct FCameraResetParamsRow final : public FDescRowBase
{
public:
	EAssemblerCamPoint                            CameraPoint;                                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResetCamLength;                                    // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bResetOffsetYToZero : 1;                           // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraResetParamsRow;

// ScriptStruct DFMWeaponAssemble.FastEquipResultDebugInfo
// 0x0020 (0x0020 - 0x0000)
struct FFastEquipResultDebugInfo final
{
public:
	uint8                                         OpreationCode;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        OpreationID;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        FromID;                                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        SocketGUID;                                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFastEquipResultDebugInfo;

// ScriptStruct DFMWeaponAssemble.FastEquipResult
// 0x0078 (0x0078 - 0x0000)
struct FFastEquipResult final
{
public:
	uint8                                         bSuccess : 1;                                      // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint64>                                RecyclePartGids;                                   // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint64>                                RecyclePartItemIds;                                // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                RecyclePartIndexs;                                 // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                RecyclePartSocketIds;                              // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint64>                                RecycleSocketGUIDs;                                // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FItemInfoContext>               RecycleItemInfos;                                  // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FFastEquipResultDebugInfo>      DebugInfos;                                        // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFastEquipResult;

// ScriptStruct DFMWeaponAssemble.SlideConfig
// 0x0014 (0x0014 - 0x0000)
struct FSlideConfig final
{
public:
	float                                         Min;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDist;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDuration;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssemblerCamPoint                            PointType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSlideConfig;

// ScriptStruct DFMWeaponAssemble.SlideScreenParamsRow
// 0x0030 (0x0040 - 0x0010)
struct FSlideScreenParamsRow final : public FDescRowBase
{
public:
	EAssemblerCamPoint                            PointType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSlideConfig>                   SlideConfigs;                                      // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EAssemblerCamPoint>                    AdditionLerpPointList;                             // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         AdditionPointLength;                               // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSlideScreenParamsRow;

// ScriptStruct DFMWeaponAssemble.GunSlideParamsRow
// 0x0010 (0x0020 - 0x0010)
struct FGunSlideParamsRow final : public FDescRowBase
{
public:
	TArray<struct FSlideScreenParamsRow>          SlideConfigs;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGunSlideParamsRow;

// ScriptStruct DFMWeaponAssemble.MobileDOFInfo
// 0x0034 (0x0034 - 0x0000)
struct FMobileDOFInfo final
{
public:
	uint8                                         bOpen : 1;                                         // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DOFFocalRegion;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DOFNearRegion;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DOFFarRegion;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DOFScale;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DOFNearBlurSize;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DOFFarBlurSize;                                    // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOfFieldSensorWidth;                           // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOfFieldSqueezeFactor;                         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOfFieldFocalDistance;                         // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOfFieldDepthBlurAmount;                       // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOfFieldDepthBlurRadius;                       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOfFieldFstop;                                 // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMobileDOFInfo;

// ScriptStruct DFMWeaponAssemble.GunCameraParamsRow
// 0x0078 (0x0080 - 0x0008)
struct FGunCameraParamsRow final : public FTableRowBase
{
public:
	uint64                                        ID;                                                // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSize;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssemblerCamPoint                            PointType;                                         // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                offset;                                            // 0x0020(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraDistance;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LerpSpeed;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMobileDOFInfo                         MobileDOFInfo;                                     // 0x0038(0x0034)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                FocusCenterOffset;                                 // 0x006C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FocusCenterDistanceRatio;                          // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGunCameraParamsRow;

// ScriptStruct DFMWeaponAssemble.BeginCamParams
// 0x0108 (0x0108 - 0x0000)
struct FBeginCamParams final
{
public:
	struct FGunCameraParamsRow                    CamParamsOnBegin;                                  // 0x0000(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FGunCameraParamsRow                    CamParamsOnDiplay;                                 // 0x0080(0x0080)(Edit, NativeAccessSpecifierPublic)
	float                                         CamSpeed;                                          // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bActiveBeginCam : 1;                               // 0x0104(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBeginCamParams;

// ScriptStruct DFMWeaponAssemble.PinchParams
// 0x0018 (0x0018 - 0x0000)
struct FPinchParams final
{
public:
	float                                         PinchSpeed;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FovFactorWhenPinch;                                // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FovFactorForReturn;                                // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0xC];                                        // 0x000C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPinchParams;

// ScriptStruct DFMWeaponAssemble.AssemblerCameraParamsRow
// 0x0018 (0x0020 - 0x0008)
struct FAssemblerCameraParamsRow final : public FTableRowBase
{
public:
	uint64                                        RecId;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGunCameraParamsRow>            Params;                                            // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssemblerCameraParamsRow;

// ScriptStruct DFMWeaponAssemble.LoadAnimSeqHandle
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FLoadAnimSeqHandle final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadAnimSeqHandle;

// ScriptStruct DFMWeaponAssemble.LoadMeshHandle
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FLoadMeshHandle final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadMeshHandle;

// ScriptStruct DFMWeaponAssemble.StyleRecognitionInfo
// 0x0018 (0x0018 - 0x0000)
struct FStyleRecognitionInfo final
{
public:
	uint64                                        StyleId;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        RecognizeId;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStyleRecognitionInfo;

// ScriptStruct DFMWeaponAssemble.GPAssemblePartSocket
// 0x0058 (0x0058 - 0x0000)
struct FGPAssemblePartSocket final
{
public:
	uint32                                        SocketId;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         SocketIndex;                                       // 0x0004(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint64>                                ValidPartItemList;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int16                                         ParentPartIndex;                                   // 0x0020(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bOccupy : 1;                                       // 0x0022(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         AttachPartIndex;                                   // 0x0024(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        AttachItemId;                                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        AttachItemGUID;                                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         Depth;                                             // 0x0038(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        SocketGUID;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssemblePartSocketType                       SocketType;                                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        Flag;                                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAssemblePartSocket;

// ScriptStruct DFMWeaponAssemble.GPAssemblePartNode
// 0x0058 (0x0058 - 0x0000)
struct FGPAssemblePartNode final
{
public:
	int32                                         IndexInDesc;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         IndexInArray;                                      // 0x0004(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        ItemID;                                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAssemblerCamPoint                            CamPoint;                                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        Guid;                                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        SocketGUID;                                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         ParentIndex;                                       // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         ParentSocketIndex;                                 // 0x002A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGPAssemblePartSocket>          AllSocketList;                                     // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint64                                        AppearanceId;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Durability;                                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModularPartNodeType                          NodeType;                                          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAssemblePartNode;

// ScriptStruct DFMWeaponAssemble.RTIOriginLightComponentData
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FRTIOriginLightComponentData final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRTIOriginLightComponentData;

// ScriptStruct DFMWeaponAssemble.RTILightBPData
// 0x0010 (0x0010 - 0x0000)
struct FRTILightBPData final
{
public:
	class AActor*                                 LightBPActor;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRTILightBPData;

// ScriptStruct DFMWeaponAssemble.RTIPreLoadRuntimeIconData
// 0x0018 (0x0018 - 0x0000)
struct FRTIPreLoadRuntimeIconData final
{
public:
	class URTIActorData*                          Weapon_PreLoad;                                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRTIPreLoadRuntimeIconData;

// ScriptStruct DFMWeaponAssemble.WeaponAllPresetGenerateContext
// 0x0098 (0x0098 - 0x0000)
struct FWeaponAllPresetGenerateContext final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint32, int32>                           GunMap;                                            // 0x0020(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x18];                                      // 0x0070(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPModularWeaponDesc*                   Desc;                                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAssembleWeaponNodeTree*                AssembleWeaponNodeTree;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponAllPresetGenerateContext;

// ScriptStruct DFMWeaponAssemble.WeaponGeneratePresetRow
// 0x0120 (0x0128 - 0x0008)
struct FWeaponGeneratePresetRow final : public FTableRowBase
{
public:
	uint64                                        Key;                                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DescHash;                                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Price;                                             // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        RecId;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part1;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part2;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part3;                                             // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part4;                                             // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part5;                                             // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part6;                                             // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part7;                                             // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part8;                                             // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part9;                                             // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part10;                                            // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part11;                                            // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part12;                                            // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part13;                                            // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part14;                                            // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part15;                                            // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part16;                                            // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part17;                                            // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part18;                                            // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part19;                                            // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part20;                                            // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part21;                                            // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part22;                                            // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part23;                                            // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part24;                                            // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part25;                                            // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part26;                                            // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part27;                                            // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part28;                                            // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part29;                                            // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part30;                                            // 0x0118(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Part31;                                            // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponGeneratePresetRow;

// ScriptStruct DFMWeaponAssemble.WeaponPresetGeneratePartSocket
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FWeaponPresetGeneratePartSocket final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponPresetGeneratePartSocket;

// ScriptStruct DFMWeaponAssemble.WeaponPresetGenerateParam
// 0x0010 (0x0010 - 0x0000)
struct FWeaponPresetGenerateParam final
{
public:
	EWeaponPresetGenerateType                     GenerateType;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MainAttributeId;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPrice;                                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPartsNum;                                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponPresetGenerateParam;

// ScriptStruct DFMWeaponAssemble.WeaponTestWeaponPresetConfig
// 0x0008 (0x0018 - 0x0010)
struct FWeaponTestWeaponPresetConfig final : public FDescRowBase
{
public:
	uint64                                        PresetId;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponTestWeaponPresetConfig;

// ScriptStruct DFMWeaponAssemble.WeaponTestCharacterConfig
// 0x0020 (0x0030 - 0x0010)
struct FWeaponTestCharacterConfig final : public FDescRowBase
{
public:
	uint64                                        AvatarID;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        BagId;                                             // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        ChestId;                                           // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        BreastPlateID;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponTestCharacterConfig;

// ScriptStruct DFMWeaponAssemble.TestWeaponParam
// 0x0018 (0x0018 - 0x0000)
struct FTestWeaponParam final
{
public:
	uint64                                        WeaponPresetId;                                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        SkinId;                                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        SkinAppId;                                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTestWeaponParam;

// ScriptStruct DFMWeaponAssemble.TestCharacterParam
// 0x0040 (0x0040 - 0x0000)
struct FTestCharacterParam final
{
public:
	uint64                                        AvatarID;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        BagId;                                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        ChestId;                                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        BreastPlateID;                                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestCharacterParam;

}

