#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DFScreenShotTool

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "RuntimeFilesDownloader_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DFScreenShotTool.DFScreenShotRequest
// 0x0040 (0x0068 - 0x0028)
class UDFScreenShotRequest final : public UObject
{
public:
	TMulticastInlineDelegate<void(const class FString& ScreenshotName, bool WithWaterMark)> DFMScreenshotFinishDelegate; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	class UTexture2D*                             NoWatermarkScreenShot;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             WithWatermarkScreenShot;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyGetCDNWatermarkResource(const class FString& ImgKey); // (Final, Native, Public, BlueprintCallable) // @ 0x141293A10
	void GenerateScreenShot(class UGameInstance* GameInstance, bool bInShowUI, const class FString& ScreenshotName, bool WithWaterMark); // (Final, Native, Public, BlueprintCallable) // @ 0x141293D60
	void GenerateScreenShotCropByWidget(class UGameInstance* GameInstance, bool bInShowUI, const class FString& ScreenshotName, class UWidget* WidgetIns, bool WithWaterMark); // (Final, Native, Public, BlueprintCallable) // @ 0x1412940E0
	void GenerateScreenShotSpliceWatermark(class UGameInstance* GameInstance, bool bInShowUI, const class FString& ScreenshotName, const class FString& ImgKey); // (Final, Native, Public, BlueprintCallable) // @ 0x1412944E0
	void LoadStaticWatermarkImageSource(int32 HashCode, ECdnDownResult Result); // (Final, Native, Public) // @ 0x141294C10
	void OnScreenShotCapturedSpliceWatermark(int32 InSizeX, int32 InSizeY, const TArray<struct FColor>& InImageData, const class FString& ScreenshotName, class UGameInstance* GameInstance); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141294E40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFScreenShotRequest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFScreenShotRequest")
	}
	static class UDFScreenShotRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFScreenShotRequest>();
	}
};
DUMPER7_ASSERTS_UDFScreenShotRequest;

// Class DFScreenShotTool.DFScreenShotToolManager
// 0x0018 (0x0048 - 0x0030)
class UDFScreenShotToolManager final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(const class FString& ScreenshotName, bool WithWaterMark)> BusinessScreenshotFinishDelegate; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	class UDFScreenShotRequest*                   TheDFScreenshotReq;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UDFScreenShotToolManager* Get(const class UObject* GameInst); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141294950

	void DeleteScreenshotDir(); // (Final, Native, Public, BlueprintCallable) // @ 0x141293C50
	void DeleteTheScreenshotObject(); // (Final, Native, Public, BlueprintCallable) // @ 0x141293C70
	void DFMReqLoadCDNWatermarkImg(const class FString& ImgKey); // (Final, Native, Public, BlueprintCallable) // @ 0x141293B30
	void DisplayScreenShot(class UDFImage* Image, bool WithWaterMark); // (Final, Native, Public, BlueprintCallable) // @ 0x141293C90
	void GenerateScreenShot(bool bInShowUI, const class FString& ScreenshotName, bool WithWaterMark); // (Final, Native, Public, BlueprintCallable) // @ 0x141293F40
	void GenerateScreenShotCropByWidget(bool bInShowUI, const class FString& ScreenshotName, class UWidget* WidgetIns, bool WithWaterMark); // (Final, Native, Public, BlueprintCallable) // @ 0x141294300
	void GenerateScreenShotSpliceWatermark(bool bInShowUI, const class FString& ScreenshotName, const class FString& ImgKey); // (Final, Native, Public, BlueprintCallable) // @ 0x141294730
	class FString GetScreenshotFilePath(const class FString& ScreenshotName); // (Final, Native, Public, BlueprintCallable) // @ 0x141294A90
	void OnDFMScreenshotFinishDelegate(const class FString& ScreenshotName, bool WithWaterMark); // (Final, Native, Public) // @ 0x141294CD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFScreenShotToolManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFScreenShotToolManager")
	}
	static class UDFScreenShotToolManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFScreenShotToolManager>();
	}
};
DUMPER7_ASSERTS_UDFScreenShotToolManager;

}

