#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DSNetwork

#include "Basic.hpp"

#include "PropertyReplication_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DSNetwork.DualChannelIpNetConnection
// 0x0240 (0x2028 - 0x1DE8)
class UDualChannelIpNetConnection : public UPropertyReplicationConnection
{
public:
	uint8                                         Pad_1DE8[0x40];                                    // 0x1DE8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UDualChannelChildConnection*            ChildConnection;                                   // 0x1E28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SocketErrorRecoverDelay;                           // 0x1E30(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ServerSocketSendThreshold;                         // 0x1E34(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          ForceSendViaDualSocket;                            // 0x1E38(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          EnablePacketAnalyse;                               // 0x1E39(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E3A[0x5A];                                    // 0x1E3A(0x005A)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SwitchIpAddressThreshold;                          // 0x1E94(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SwitchIpAddressThresholdStable;                    // 0x1E98(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SwitchIpAddressThresholdScaler;                    // 0x1E9C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SwitchIpAddressTickCountThreshold;                 // 0x1EA0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RecvNothingTickCountThreshold;                     // 0x1EA4(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SwitchIpActorCheckMask;                            // 0x1EA8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SwitchIpLostPackageCountThreshold;                 // 0x1EAC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SwitchIpLostPackageRateThreshold;                  // 0x1EB0(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1EB4[0x174];                                   // 0x1EB4(0x0174)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHandleNetworkFailure(class UWorld* World, class UNetDriver* NetDriver, ENetworkFailure FailureType, const class FString& ErrorString); // (Final, Native, Private) // @ 0x142A1B920

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DualChannelIpNetConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DualChannelIpNetConnection")
	}
	static class UDualChannelIpNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDualChannelIpNetConnection>();
	}
};
DUMPER7_ASSERTS_UDualChannelIpNetConnection;

// Class DSNetwork.DualChannelPackageMapClient
// 0x0000 (0x0470 - 0x0470)
class UDualChannelPackageMapClient : public UPropertyReplicationPackageMapClient
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DualChannelPackageMapClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DualChannelPackageMapClient")
	}
	static class UDualChannelPackageMapClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDualChannelPackageMapClient>();
	}
};
DUMPER7_ASSERTS_UDualChannelPackageMapClient;

// Class DSNetwork.DSLogicBase
// 0x0468 (0x0490 - 0x0028)
class UDSLogicBase : public UObject
{
public:
	uint8                                         Pad_28[0x468];                                     // 0x0028(0x0468)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DSLogicBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DSLogicBase")
	}
	static class UDSLogicBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDSLogicBase>();
	}
};
DUMPER7_ASSERTS_UDSLogicBase;

// Class DSNetwork.DualChannelChildConnection
// 0x0008 (0x1DF0 - 0x1DE8)
class UDualChannelChildConnection final : public UIpConnection
{
public:
	class UDualChannelIpNetConnection*            ParentConnection;                                  // 0x1DE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DualChannelChildConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DualChannelChildConnection")
	}
	static class UDualChannelChildConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDualChannelChildConnection>();
	}
};
DUMPER7_ASSERTS_UDualChannelChildConnection;

// Class DSNetwork.DualChannelIpNetDriver
// 0x00A8 (0x08A8 - 0x0800)
class UDualChannelIpNetDriver : public UIpNetDriver
{
public:
	uint8                                         Pad_800[0x18];                                     // 0x0800(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxRetryBindPortTimes;                             // 0x0818(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RetrySleepTimeSecondsWhenBindFailed;               // 0x081C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExitProcessIfBindFailed;                           // 0x0820(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_821[0x87];                                     // 0x0821(0x0087)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DualChannelIpNetDriver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DualChannelIpNetDriver")
	}
	static class UDualChannelIpNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDualChannelIpNetDriver>();
	}
};
DUMPER7_ASSERTS_UDualChannelIpNetDriver;

// Class DSNetwork.MultiIpNetConnection
// 0x0000 (0x1DE8 - 0x1DE8)
class UMultiIpNetConnection final : public UIpConnection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiIpNetConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiIpNetConnection")
	}
	static class UMultiIpNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiIpNetConnection>();
	}
};
DUMPER7_ASSERTS_UMultiIpNetConnection;

// Class DSNetwork.MultiIpNetDriver
// 0x0080 (0x0880 - 0x0800)
class UMultiIpNetDriver final : public UIpNetDriver
{
public:
	uint8                                         Pad_800[0x80];                                     // 0x0800(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiIpNetDriver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiIpNetDriver")
	}
	static class UMultiIpNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiIpNetDriver>();
	}
};
DUMPER7_ASSERTS_UMultiIpNetDriver;

// Class DSNetwork.ProtocolJsonExporter
// 0x0038 (0x0060 - 0x0028)
class UProtocolJsonExporter final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProtocolJsonExporter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProtocolJsonExporter")
	}
	static class UProtocolJsonExporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProtocolJsonExporter>();
	}
};
DUMPER7_ASSERTS_UProtocolJsonExporter;

// Class DSNetwork.ParseNetProtocolCommandlet
// 0x0000 (0x0088 - 0x0088)
class UParseNetProtocolCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParseNetProtocolCommandlet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParseNetProtocolCommandlet")
	}
	static class UParseNetProtocolCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParseNetProtocolCommandlet>();
	}
};
DUMPER7_ASSERTS_UParseNetProtocolCommandlet;

// Class DSNetwork.ProtocolJsonExporter_ForNState
// 0x0038 (0x0060 - 0x0028)
class UProtocolJsonExporter_ForNState final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProtocolJsonExporter_ForNState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProtocolJsonExporter_ForNState")
	}
	static class UProtocolJsonExporter_ForNState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProtocolJsonExporter_ForNState>();
	}
};
DUMPER7_ASSERTS_UProtocolJsonExporter_ForNState;

// Class DSNetwork.ParseNetProtocolForNStateCommandlet
// 0x0000 (0x0088 - 0x0088)
class UParseNetProtocolForNStateCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParseNetProtocolForNStateCommandlet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParseNetProtocolForNStateCommandlet")
	}
	static class UParseNetProtocolForNStateCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParseNetProtocolForNStateCommandlet>();
	}
};
DUMPER7_ASSERTS_UParseNetProtocolForNStateCommandlet;

// Class DSNetwork.ParseProtocolForReplayClientSDK
// 0x0000 (0x0028 - 0x0028)
class UParseProtocolForReplayClientSDK final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParseProtocolForReplayClientSDK")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParseProtocolForReplayClientSDK")
	}
	static class UParseProtocolForReplayClientSDK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParseProtocolForReplayClientSDK>();
	}
};
DUMPER7_ASSERTS_UParseProtocolForReplayClientSDK;

}

