#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExCommonUI

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ExCommonUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ExCommonUI.ExCommonWidgetGroupBase
// 0x0000 (0x0028 - 0x0028)
class UExCommonWidgetGroupBase : public UObject
{
public:
	void AddWidget(class UWidget* InWidget); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F38F0
	void RemoveAll(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F3970
	void RemoveWidget(class UWidget* InWidget); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F3990

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonWidgetGroupBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonWidgetGroupBase")
	}
	static class UExCommonWidgetGroupBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonWidgetGroupBase>();
	}
};
DUMPER7_ASSERTS_UExCommonWidgetGroupBase;

// Class ExCommonUI.ExCommonCarouselNavButtonGroup
// 0x0048 (0x0070 - 0x0028)
class UExCommonCarouselNavButtonGroup final : public UExCommonWidgetGroupBase
{
public:
	TMulticastInlineDelegate<void(class UExCommonCarouselNavButton* AssociatedButton, int32 ButtonIndex, bool bIsSelected)> OnSelectedButtonChanged; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x38];                                      // 0x0038(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DeselectAll(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EE8C0
	void OnSelectionStateChanged(class UExCommonCarouselNavButton* ButtonParam, bool bIsSelected); // (Native, Protected) // @ 0x1413EF1E0
	void SelectButtonAtIndex(int32 ButtonIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EF2B0
	void SelectNextButton(bool bAllowWrap); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EF330
	void SelectPreviousButton(bool bAllowWrap); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EF3C0

	int32 FindButtonIndex(const class UExCommonCarouselNavButton* ButtonToFind) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EE8E0
	class UExCommonCarouselNavButton* GetButtonAtIndex(int32 Index_0) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEAF0
	int32 GetButtonCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEB80
	bool GetIsHover() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEBF0
	class UExCommonCarouselNavButton* GetSelectedButton() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEC20
	int32 GetSelectedButtonIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEC50
	bool HasAnyButtons() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEEF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonCarouselNavButtonGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonCarouselNavButtonGroup")
	}
	static class UExCommonCarouselNavButtonGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonCarouselNavButtonGroup>();
	}
};
DUMPER7_ASSERTS_UExCommonCarouselNavButtonGroup;

// Class ExCommonUI.ExCommonAnimatedSwitcher
// 0x0058 (0x01D8 - 0x0180)
class UExCommonAnimatedSwitcher final : public UWidgetSwitcher
{
public:
	uint8                                         Pad_180[0x18];                                     // 0x0180(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	EExCommonSwitcherTransition                   TransitionType;                                    // 0x0198(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETransitionCurve                              TransitionCurveType;                               // 0x0199(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionDuration;                                // 0x019C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A0[0x38];                                     // 0x01A0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateNextWidget(bool bCanWrap); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EE640
	void ActivatePreviousWidget(bool bCanWrap); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EE6D0
	void SetDisableTransitionAnimation(bool bDisableAnimation); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFA20

	bool HasWidgets() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEF20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonAnimatedSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonAnimatedSwitcher")
	}
	static class UExCommonAnimatedSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonAnimatedSwitcher>();
	}
};
DUMPER7_ASSERTS_UExCommonAnimatedSwitcher;

// Class ExCommonUI.ExCommonCustomNavigation
// 0x0010 (0x02D0 - 0x02C0)
class UExCommonCustomNavigation final : public UBorder
{
public:
	TDelegate<void(EUINavigation NavigationType)> OnNavigationEvent;                                 // 0x02C0(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonCustomNavigation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonCustomNavigation")
	}
	static class UExCommonCustomNavigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonCustomNavigation>();
	}
};
DUMPER7_ASSERTS_UExCommonCustomNavigation;

// Class ExCommonUI.ExCommonBorderStyle
// 0x0090 (0x00B8 - 0x0028)
class UExCommonBorderStyle final : public UObject
{
public:
	struct FSlateBrush                            Background;                                        // 0x0028(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void GetBackgroundBrush(struct FSlateBrush* Brush) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EE970

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonBorderStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonBorderStyle")
	}
	static class UExCommonBorderStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonBorderStyle>();
	}
};
DUMPER7_ASSERTS_UExCommonBorderStyle;

// Class ExCommonUI.ExCommonBorder
// 0x0020 (0x02E0 - 0x02C0)
class UExCommonBorder final : public UBorder
{
public:
	TSubclassOf<class UExCommonBorderStyle>       Style;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReducePaddingBySafezone;                          // 0x02C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                MinimumPadding;                                    // 0x02CC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetStyle(TSubclassOf<class UExCommonBorderStyle> InStyle); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F0030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonBorder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonBorder")
	}
	static class UExCommonBorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonBorder>();
	}
};
DUMPER7_ASSERTS_UExCommonBorder;

// Class ExCommonUI.ExCommonCarouselNavBarPro
// 0x0048 (0x0198 - 0x0150)
class UExCommonCarouselNavBarPro final : public UWidget
{
public:
	TSubclassOf<class UExCommonCarouselNavButton> ButtonWidgetType;                                  // 0x0150(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                ButtonPadding;                                     // 0x0158(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UExCommonCarouselNavBarPro* CarouselNavBar, int32 CurrentPageIndex, class UExCommonCarouselNavButton* CarouselNavBtn)> OnNavBtnInitPro; // 0x0168(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x10];                                     // 0x0178(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UExCommonWidgetCarouselProBase*         LinkedCarousel;                                    // 0x0188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UExCommonCarouselNavButtonGroup*        ButtonGroup;                                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleButtonSelected(class UExCommonCarouselNavButton* AssociatedButton, int32 ButtonIndex, bool bIsSelect); // (Final, Native, Protected) // @ 0x1413EECB0
	void HandleDragging(class UExCommonWidgetCarouselProBase* CommonCarousel, int32 OldPageIndex, int32 PageIndex, class UWidget* Widget); // (Final, Native, Protected) // @ 0x1413EEDB0
	void HandlePageChanged(class UExCommonWidgetCarouselProBase* CommonCarousel, int32 OldPageIndex, int32 PageIndex, class UWidget* Widget); // (Final, Native, Protected) // @ 0x1413EEDB0
	void SetLinkedCarousel(class UExCommonWidgetCarouselProBase* CommonCarousel); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFD50

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonCarouselNavBarPro")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonCarouselNavBarPro")
	}
	static class UExCommonCarouselNavBarPro* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonCarouselNavBarPro>();
	}
};
DUMPER7_ASSERTS_UExCommonCarouselNavBarPro;

// Class ExCommonUI.ExCommonCarouselNavButton
// 0x0028 (0x0318 - 0x02F0)
class UExCommonCarouselNavButton final : public UUserWidget
{
public:
	TMulticastInlineDelegate<void(class UExCommonCarouselNavButton* Button, bool Selected)> OnSelectedChanged; // 0x02F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UButton*                                NavButton;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HoverOpacity;                                      // 0x0308(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UnHoverOpacity;                                    // 0x030C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBindHover;                                      // 0x0310(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBindClick;                                      // 0x0311(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCancelHandle(); // (Final, Native, Protected) // @ 0x1413EF180
	void OnSelectHandle(); // (Final, Native, Protected) // @ 0x1413EF1C0
	void OnSetSelected(bool bInSelected); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonCarouselNavButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonCarouselNavButton")
	}
	static class UExCommonCarouselNavButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonCarouselNavButton>();
	}
};
DUMPER7_ASSERTS_UExCommonCarouselNavButton;

// Class ExCommonUI.ExCommonTextBlock
// 0x0028 (0x03B8 - 0x0390)
class UExCommonTextBlock : public UTextBlock
{
public:
	TSubclassOf<class UExCommonTextStyle>         Style;                                             // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UExCommonTextScrollStyle>   ScrollStyle;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayAllCaps;                                   // 0x03A0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoCollapseWithEmptyText;                        // 0x03A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MobileFontSizeMultiplier;                          // 0x03A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A8[0x10];                                     // 0x03A8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ResetScrollState(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2EA0
	void SetStyle(TSubclassOf<class UExCommonTextStyle> InStyle); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F3220
	void SetTextCase(bool bUseAllCaps); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F32A0
	void SetWrapTextWidth(int32 InWrapTextAt); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F33B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonTextBlock")
	}
	static class UExCommonTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonTextBlock>();
	}
};
DUMPER7_ASSERTS_UExCommonTextBlock;

// Class ExCommonUI.ExCommonDateTimeTextBlock
// 0x0040 (0x03F8 - 0x03B8)
class UExCommonDateTimeTextBlock final : public UExCommonTextBlock
{
public:
	uint8                                         Pad_3B8[0x40];                                     // 0x03B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCountDownCompletionText(const class FText& InCompletionText); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EF7C0
	void SetDateTimeValue(const struct FDateTime& InDateTime, bool bShowAsCountdown, float InRefreshDelay); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1413EF920
	void SetTimespanValue(const struct FTimespan& InTimespan); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1413F00B0

	struct FDateTime GetDateTime() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEBB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonDateTimeTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonDateTimeTextBlock")
	}
	static class UExCommonDateTimeTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonDateTimeTextBlock>();
	}
};
DUMPER7_ASSERTS_UExCommonDateTimeTextBlock;

// Class ExCommonUI.ExCommonHierarchicalScrollBox
// 0x0000 (0x0998 - 0x0998)
class UExCommonHierarchicalScrollBox final : public UScrollBox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonHierarchicalScrollBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonHierarchicalScrollBox")
	}
	static class UExCommonHierarchicalScrollBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonHierarchicalScrollBox>();
	}
};
DUMPER7_ASSERTS_UExCommonHierarchicalScrollBox;

// Class ExCommonUI.ExCommonWidgetCarouselProBase
// 0x01C0 (0x0328 - 0x0168)
class UExCommonWidgetCarouselProBase : public UPanelWidget
{
public:
	TSubclassOf<class UUserWidget>                WidgetType;                                        // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              ItemVisibility;                                    // 0x0170(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoScroll;                                     // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollInterval;                                    // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x1];                                      // 0x0178(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsVertical;                                       // 0x0179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetCarouselCurve                          CarouselCurve;                                     // 0x017A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartPageIndex;                                    // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeed;                                         // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinMoveSpeed;                                      // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPageOnce;                                       // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WheelMaxPageOnce;                                  // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDragCount;                                      // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PageSize;                                          // 0x0194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RenderSize;                                        // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidgetInterval;                                    // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidgetFadeOpacity;                                 // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidgetMinOpacity;                                  // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidgetFadeScale;                                   // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidgetMinScale;                                    // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragDistanceThreshold;                             // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragSpeedThreshold;                                // 0x01B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragSensitivity;                                   // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSupportClick;                                   // 0x01BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSupportDrag;                                    // 0x01BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CacheSize;                                         // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CacheUpdateStep;                                   // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RenderUpdateStep;                                  // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InterceptTimes;                                    // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CanClickedPageCount;                               // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UExCommonWidgetCarouselProBase* CarouselWidget, int32 CurUpdateIndex, class UWidget* TargetItem, int32 PageIndex, int32 CacheIndex)> OnLoadOuterData; // 0x01D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UExCommonWidgetCarouselProBase* CarouselWidget, int32 OldPageIndex, int32 CurrentPageIndex, class UWidget* CurrentItem)> OnPageChanged; // 0x01E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UExCommonWidgetCarouselProBase* CarouselWidget, int32 TargetPageIndex, class UWidget* TargetItem)> OnPageClicked; // 0x01F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UExCommonWidgetCarouselProBase* CarouselWidget, int32 OldPageIndex, int32 CurrentPageIndex, class UWidget* CurrentItem)> OnDragging; // 0x0208(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnGetItemCount;                                    // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnGetCacheItemCount;                               // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnGetRenderItemCount;                              // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0xC0];                                     // 0x0268(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginAutoScrolling(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F22B0
	void EndAutoScrolling(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2310
	void GenerateCurrentWidgets(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2330
	int32 GetLeftPageIndex(int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2510
	int32 GetRightPageIndex(int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F26D0
	void NextPage(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2DC0
	void PreviousPage(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2E60
	void RefreshAllItems(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2E80
	void SetActivePage(int32 TargetPage); // (Native, Public, BlueprintCallable) // @ 0x1413F2F60
	void SimpleInit(int32 OverridePageSize, int32 OverrideCacheSize); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F3430
	void SimulateClickPageWithGamepad(int32 ClickedPage); // (Final, Native, Public) // @ 0x1413F34F0

	int32 GetActivePageIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2350
	int32 GetTotalLoadOuterCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2A00
	int32 GetTotalTurnPageCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2A20
	class UWidget* GetWidgetByPageIndex(int32 PageIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2B10
	int32 GetWindowCenterPage() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2BA0
	int32 GetWindowCenterSlotIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2BF0
	int32 GetWindowLeftPage() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2C10
	int32 GetWindowLeftSlotIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2C60
	int32 GetWindowRightPage() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2C80
	int32 GetWindowRightSlotIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2CD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonWidgetCarouselProBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonWidgetCarouselProBase")
	}
	static class UExCommonWidgetCarouselProBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonWidgetCarouselProBase>();
	}
};
DUMPER7_ASSERTS_UExCommonWidgetCarouselProBase;

// Class ExCommonUI.ExCommonInfiniteScrollBoxPro
// 0x0000 (0x0328 - 0x0328)
class UExCommonInfiniteScrollBoxPro final : public UExCommonWidgetCarouselProBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonInfiniteScrollBoxPro")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonInfiniteScrollBoxPro")
	}
	static class UExCommonInfiniteScrollBoxPro* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonInfiniteScrollBoxPro>();
	}
};
DUMPER7_ASSERTS_UExCommonInfiniteScrollBoxPro;

// Class ExCommonUI.ExCommonLazyImage
// 0x00D0 (0x0398 - 0x02C8)
class UExCommonLazyImage final : public UImage
{
public:
	struct FSlateBrush                            LoadingBackgroundBrush;                            // 0x02C8(0x0090)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   MaterialTextureParamName;                          // 0x0358(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(bool bIsLoading)> BP_OnLoadingStateChanged;                        // 0x0360(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_370[0x28];                                     // 0x0370(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBrushFromLazyDisplayAsset(const TSoftObjectPtr<class UObject>& LazyObject, bool bMatchTextureSize); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1413EF450
	void SetBrushFromLazyMaterial(const TSoftObjectPtr<class UMaterialInterface>& LazyMaterial); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1413EF590
	void SetBrushFromLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture, bool bMatchSize); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1413EF680
	void SetMaterialTextureParamName(class FName TextureParamName); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFEA0

	bool IsLoading() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EF0D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonLazyImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonLazyImage")
	}
	static class UExCommonLazyImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonLazyImage>();
	}
};
DUMPER7_ASSERTS_UExCommonLazyImage;

// Class ExCommonUI.ExCommonLazyWidget
// 0x0110 (0x0260 - 0x0150)
class UExCommonLazyWidget final : public UWidget
{
public:
	struct FSlateBrush                            LoadingBackgroundBrush;                            // 0x0150(0x0090)(Edit, NativeAccessSpecifierPrivate)
	class UUserWidget*                            Content;                                           // 0x01E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E8[0x28];                                     // 0x01E8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bIsLoading)> BP_OnLoadingStateChanged;                        // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x40];                                     // 0x0220(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLazyContent(const TSoftClassPtr<class UClass> SoftWidget); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFBC0

	class UUserWidget* GetContent() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141118D70
	bool IsLoading() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EF100

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonLazyWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonLazyWidget")
	}
	static class UExCommonLazyWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonLazyWidget>();
	}
};
DUMPER7_ASSERTS_UExCommonLazyWidget;

// Class ExCommonUI.LoadGuardSlot
// 0x0028 (0x0060 - 0x0038)
class ULoadGuardSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A[0x16];                                      // 0x004A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFAB0
	void SetPadding(const struct FMargin& InPadding); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFFA0
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F0130

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LoadGuardSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoadGuardSlot")
	}
	static class ULoadGuardSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadGuardSlot>();
	}
};
DUMPER7_ASSERTS_ULoadGuardSlot;

// Class ExCommonUI.ExCommonLoadGuard
// 0x0118 (0x0280 - 0x0168)
class UExCommonLoadGuard final : public UContentWidget
{
public:
	struct FSlateBrush                            LoadingBackgroundBrush;                            // 0x0168(0x0090)(Edit, NativeAccessSpecifierPrivate)
	EHorizontalAlignment                          ThrobberAlignment;                                 // 0x01F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ThrobberPadding;                                   // 0x01FC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LoadingText;                                       // 0x0210(0x0018)(Edit, NativeAccessSpecifierPrivate)
	TSubclassOf<class UExCommonTextStyle>         TextStyle;                                         // 0x0228(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(bool bIsLoading)> BP_OnLoadingStateChanged;                        // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                        SpinnerMaterialPath;                               // 0x0240(0x0018)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x28];                                     // 0x0258(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_GuardAndLoadAsset(const TSoftObjectPtr<class UObject>& InLazyAsset, const TDelegate<void(class UObject* Object)>& OnAssetLoaded); // (Final, Native, Private, HasOutParams, BlueprintCallable) // @ 0x1413EE760
	void SetIsLoading(bool bInIsLoading); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFB30
	void SetLoadingText(const class FText& InLoadingText); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1413EFDD0

	bool IsLoading() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EF130

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonLoadGuard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonLoadGuard")
	}
	static class UExCommonLoadGuard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonLoadGuard>();
	}
};
DUMPER7_ASSERTS_UExCommonLoadGuard;

// Class ExCommonUI.ExCommonNumericTextBlock
// 0x00A0 (0x0458 - 0x03B8)
class UExCommonNumericTextBlock final : public UExCommonTextBlock
{
public:
	TMulticastInlineDelegate<void(class UExCommonNumericTextBlock* NumericTextBlock)> OnInterpolationStartedEvent; // 0x03B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UExCommonNumericTextBlock* NumericTextBlock, float LastValue, float NewValue)> OnInterpolationUpdatedEvent; // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UExCommonNumericTextBlock* NumericTextBlock)> OnOutroEvent;  // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UExCommonNumericTextBlock* NumericTextBlock, const bool HadCompleted)> OnInterpolationEndedEvent; // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         CurrentNumericValue;                               // 0x03F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExCommonNumericType                          NumericType;                                       // 0x03FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FExCommonNumberFormattingOptions       FormattingSpecification;                           // 0x0400(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                         EaseOutInterpolationExponent;                      // 0x0414(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolationUpdateInterval;                       // 0x0418(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostInterpolationShrinkDuration;                   // 0x041C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PerformSizeInterpolation;                          // 0x0420(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPercentage;                                      // 0x0421(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_422[0x36];                                     // 0x0422(0x0036)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InterpolateToValue(const float TargetValue, float MaximumInterpolationDuration, float MinimumChangeRate, float OutroOffset); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EEF50
	void SetCurrentValue(const float NewValue); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EF8A0
	void SetNumericType(EExCommonNumericType InNumericType); // (Final, Native, Public, BlueprintCallable) // @ 0x1413EFF20

	float GetTargetValue() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEC80
	bool IsInterpolatingNumericValue() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EF0A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonNumericTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonNumericTextBlock")
	}
	static class UExCommonNumericTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonNumericTextBlock>();
	}
};
DUMPER7_ASSERTS_UExCommonNumericTextBlock;

// Class ExCommonUI.ExCommonPoolableWidgetInterface
// 0x0000 (0x0000 - 0x0000)
class IExCommonPoolableWidgetInterface final
{
public:
	void OnAcquireFromPool(); // (Native, Event, Protected, BlueprintEvent) // @ 0x1413EF160
	void OnReleaseToPool(); // (Native, Event, Protected, BlueprintEvent) // @ 0x1413EF1A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonPoolableWidgetInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonPoolableWidgetInterface")
	}
	static class IExCommonPoolableWidgetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IExCommonPoolableWidgetInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IExCommonPoolableWidgetInterface;

// Class ExCommonUI.ExCommonRichTextBlock
// 0x0038 (0x07B8 - 0x0780)
class UExCommonRichTextBlock final : public URichTextBlock
{
public:
	ERichTextInlineIconDisplayMode                InlineIconDisplayMode;                             // 0x0780(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTintInlineIcon;                                   // 0x0781(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_782[0x6];                                      // 0x0782(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UExCommonTextStyle>         DefaultTextStyleOverrideClass;                     // 0x0788(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MobileTextBlockScale;                              // 0x0790(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UExCommonTextScrollStyle>   ScrollStyle;                                       // 0x0798(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisplayAllCaps;                                   // 0x07A0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7A1[0x17];                                     // 0x07A1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonRichTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonRichTextBlock")
	}
	static class UExCommonRichTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonRichTextBlock>();
	}
};
DUMPER7_ASSERTS_UExCommonRichTextBlock;

// Class ExCommonUI.ExCommonTextStyle
// 0x0130 (0x0158 - 0x0028)
class UExCommonTextStyle final : public UObject
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0028(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsesDropShadow;                                   // 0x0090(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ShadowOffset;                                      // 0x0094(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColor;                                       // 0x009C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Margin;                                            // 0x00AC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            StrikeBrush;                                       // 0x00C0(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         LineHeightPercentage;                              // 0x0150(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetColor(struct FLinearColor* OutColor) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F23B0
	void GetFont(struct FSlateFontInfo* OutFont) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2440
	float GetLineHeightPercentage() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F25A0
	void GetMargin(struct FMargin* OutMargin) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F25D0
	void GetShadowColor(struct FLinearColor* OutColor) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2760
	void GetShadowOffset(struct FVector2D* OutShadowOffset) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F27F0
	void GetStrikeBrush(struct FSlateBrush* OutStrikeBrush) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2880

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonTextStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonTextStyle")
	}
	static class UExCommonTextStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonTextStyle>();
	}
};
DUMPER7_ASSERTS_UExCommonTextStyle;

// Class ExCommonUI.ExCommonTextScrollStyle
// 0x0018 (0x0040 - 0x0028)
class UExCommonTextScrollStyle final : public UObject
{
public:
	float                                         Speed;                                             // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDelay;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDelay;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeInDelay;                                       // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutDelay;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonTextScrollStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonTextScrollStyle")
	}
	static class UExCommonTextScrollStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonTextScrollStyle>();
	}
};
DUMPER7_ASSERTS_UExCommonTextScrollStyle;

// Class ExCommonUI.ExCommonUIEditorSettings
// 0x0058 (0x0080 - 0x0028)
class UExCommonUIEditorSettings final : public UObject
{
public:
	TSoftClassPtr<class UClass>                   TemplateTextStyle;                                 // 0x0028(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   TemplateBorderStyle;                               // 0x0050(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonUIEditorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonUIEditorSettings")
	}
	static class UExCommonUIEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonUIEditorSettings>();
	}
};
DUMPER7_ASSERTS_UExCommonUIEditorSettings;

// Class ExCommonUI.ExCommonUIRichTextData
// 0x0008 (0x0030 - 0x0028)
class UExCommonUIRichTextData final : public UObject
{
public:
	class UDataTable*                             InlineIconSet;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonUIRichTextData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonUIRichTextData")
	}
	static class UExCommonUIRichTextData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonUIRichTextData>();
	}
};
DUMPER7_ASSERTS_UExCommonUIRichTextData;

// Class ExCommonUI.ExCommonUISettings
// 0x0130 (0x0158 - 0x0028)
class UExCommonUISettings final : public UObject
{
public:
	bool                                          bAutoLoadData;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 DefaultImageResourceObject;                        // 0x0030(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialInterface>      DefaultThrobberMaterial;                           // 0x0058(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DefaultRichTextDataClass;                          // 0x0080(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DefaultImageResourceObjectInstance;                // 0x00B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     DefaultThrobberMaterialInstance;                   // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            DefaultThrobberBrush;                              // 0x00C0(0x0090)(Transient, NativeAccessSpecifierPrivate)
	class UExCommonUIRichTextData*                RichTextDataInstance;                              // 0x0150(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExCommonUISettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExCommonUISettings")
	}
	static class UExCommonUISettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExCommonUISettings>();
	}
};
DUMPER7_ASSERTS_UExCommonUISettings;

// Class ExCommonUI.ExCommonVideoPlayer
// 0x0118 (0x0268 - 0x0150)
class UExCommonVideoPlayer final : public UWidget
{
public:
	class UMediaSource*                           Video;                                             // 0x0150(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0158(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaTexture*                          MediaTexture;                                      // 0x0160(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterial*                              VideoMaterial;                                     // 0x0168(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSoundComponent*                   SoundComponent;                                    // 0x0170(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            VideoBrush;                                        // 0x0178(0x0090)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_208[0x60];                                     // 0x0208(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Close(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F22D0
	void Pause(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2DE0
	void Play(); // (Final, Native, Public, BlueprintCallable) // @ 0x1413F2E00
