#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayAbilities

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayTasks_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameplayAbilities.AbilityTask
// 0x0018 (0x0080 - 0x0068)
class UAbilityTask : public UGameplayTask
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask")
	}
	static class UAbilityTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask>();
	}
};
DUMPER7_ASSERTS_UAbilityTask;

// Class GameplayAbilities.AbilityTask_WaitGameplayEvent
// 0x0030 (0x00B0 - 0x0080)
class UAbilityTask_WaitGameplayEvent final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayEventData& Payload)> EventReceived;          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                OptionalExternalTarget;                            // 0x0098(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitGameplayEvent* WaitGameplayEvent(class UGameplayAbility* OwningAbility, const struct FGameplayTag& EventTag, class AActor* OptionalExternalTarget_0, bool OnlyTriggerOnce, bool OnlyMatchExact); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141927AC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_WaitGameplayEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_WaitGameplayEvent")
	}
	static class UAbilityTask_WaitGameplayEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitGameplayEvent>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_WaitGameplayEvent;

// Class GameplayAbilities.GameplayAbility
// 0x03D8 (0x0400 - 0x0028)
class UGameplayAbility : public UObject
{
public:
	uint8                                         Pad_28[0x80];                                      // 0x0028(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AbilityTags;                                       // 0x00A8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bReplicateInputDirectly;                           // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RemoteInstanceEnded;                               // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x4];                                       // 0x00CA(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	EGameplayAbilityReplicationPolicy             ReplicationPolicy;                                 // 0x00CE(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayAbilityInstancingPolicy              InstancingPolicy;                                  // 0x00CF(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bServerRespectsRemoteAbilityCancellation;          // 0x00D0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRetriggerInstancedAbility;                        // 0x00D1(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActivationInfo         CurrentActivationInfo;                             // 0x00D8(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayEventData                     CurrentEventData;                                  // 0x00F8(0x00B0)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	EGameplayAbilityNetExecutionPolicy            NetExecutionPolicy;                                // 0x01A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            CostGameplayEffectClass;                           // 0x01B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAbilityTriggerData>            AbilityTriggers;                                   // 0x01B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            CooldownGameplayEffectClass;                       // 0x01C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagQuery                      CancelAbilitiesMatchingTagQuery;                   // 0x01D0(0x0048)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  CancelAbilitiesWithTag;                            // 0x0218(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  BlockAbilitiesWithTag;                             // 0x0238(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationOwnedTags;                               // 0x0258(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationRequiredTags;                            // 0x0278(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ActivationBlockedTags;                             // 0x0298(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceRequiredTags;                                // 0x02B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  SourceBlockedTags;                                 // 0x02D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetRequiredTags;                                // 0x02F8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TargetBlockedTags;                                 // 0x0318(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x20];                                     // 0x0338(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameplayTask*>                  ActiveTasks;                                       // 0x0358(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x10];                                     // 0x0368(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CurrentMontage;                                    // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x60];                                     // 0x0380(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsActive;                                         // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCancelable;                                     // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsBlockingOtherAbilities;                         // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E3[0x15];                                     // 0x03E3(0x0015)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMarkPendingKillOnAbilityEnd;                      // 0x03F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToOwner(TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks); // (Final, Native, Protected, BlueprintCallable) // @ 0x141924B80
	TArray<struct FActiveGameplayEffectHandle> BP_ApplyGameplayEffectToTarget(const struct FGameplayAbilityTargetDataHandle& TargetData, TSubclassOf<class UGameplayEffect> GameplayEffectClass, int32 GameplayEffectLevel, int32 Stacks); // (Final, Native, Protected, BlueprintCallable) // @ 0x141924C90
	void BP_RemoveGameplayEffectFromOwnerWithAssetTags(const struct FGameplayTagContainer& WithAssetTags, int32 StacksToRemove); // (Final, Native, Protected, BlueprintCallable) // @ 0x141924EC0
	void BP_RemoveGameplayEffectFromOwnerWithGrantedTags(const struct FGameplayTagContainer& WithGrantedTags, int32 StacksToRemove); // (Final, Native, Protected, BlueprintCallable) // @ 0x141925020
	void BP_RemoveGameplayEffectFromOwnerWithHandle(const struct FActiveGameplayEffectHandle& Handle, int32 StacksToRemove); // (Final, Native, Protected, BlueprintCallable) // @ 0x141925180
	void CancelTaskByInstanceName(class FName InstanceName); // (Final, Native, Protected, BlueprintCallable) // @ 0x141925360
	void ConfirmTaskByInstanceName(class FName InstanceName, bool bEndTask); // (Final, Native, Protected, BlueprintCallable) // @ 0x1419253E0
	void EndAbilityState(class FName OptionalStateNameToEnd); // (Final, Native, Protected, BlueprintCallable) // @ 0x141925680
	void EndTaskByInstanceName(class FName InstanceName); // (Final, Native, Protected, BlueprintCallable) // @ 0x141925700
	void K2_ActivateAbility(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData); // (Event, Protected, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void K2_AddGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context, bool bRemoveOnAbilityEnd); // (Native, Protected, BlueprintCallable) // @ 0x141925D40
	void K2_AddGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameter, bool bRemoveOnAbilityEnd); // (Native, Protected, HasOutParams, BlueprintCallable) // @ 0x141925EB0
	struct FActiveGameplayEffectHandle K2_ApplyGameplayEffectSpecToOwner(const struct FGameplayEffectSpecHandle& EffectSpecHandle); // (Final, Native, Protected, BlueprintCallable) // @ 0x141926090
	TArray<struct FActiveGameplayEffectHandle> K2_ApplyGameplayEffectSpecToTarget(const struct FGameplayEffectSpecHandle& EffectSpecHandle, const struct FGameplayAbilityTargetDataHandle& TargetData); // (Final, Native, Protected, BlueprintCallable) // @ 0x141926170
	void K2_CancelAbility(); // (Final, Native, Public, BlueprintCallable) // @ 0x141926370
	bool K2_CheckAbilityCooldown(); // (Native, Public, BlueprintCallable) // @ 0x141926390
	bool K2_CheckAbilityCost(); // (Native, Public, BlueprintCallable) // @ 0x1419263C0
	bool K2_CommitAbility(); // (Native, Public, BlueprintCallable) // @ 0x1419263F0
	bool K2_CommitAbilityCooldown(bool BroadcastCommitEvent, bool ForceCooldown); // (Native, Public, BlueprintCallable) // @ 0x141926420
	bool K2_CommitAbilityCost(bool BroadcastCommitEvent); // (Native, Public, BlueprintCallable) // @ 0x141926500
	void K2_CommitExecute(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void K2_EndAbility(); // (Native, Protected, BlueprintCallable) // @ 0x1419265A0
	void K2_ExecuteGameplayCue(const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context); // (Native, Protected, BlueprintCallable) // @ 0x1419265C0
	void K2_ExecuteGameplayCueWithParams(const struct FGameplayTag& GameplayCueTag, const struct FGameplayCueParameters& GameplayCueParameters); // (Native, Protected, HasOutParams, BlueprintCallable) // @ 0x1419266F0
	void K2_OnEndAbility(bool bWasCancelled); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void K2_RemoveGameplayCue(const struct FGameplayTag& GameplayCueTag); // (Native, Protected, BlueprintCallable) // @ 0x14100D730
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerActor(); // (Final, Native, Protected, BlueprintCallable, BlueprintPure) // @ 0x1419269C0
	struct FGameplayAbilityTargetingLocationInfo MakeTargetLocationInfoFromOwnerSkeletalMeshComponent(class FName SocketName); // (Final, Native, Protected, BlueprintCallable, BlueprintPure) // @ 0x141926A60
	void MontageJumpToSection(class FName SectionName); // (Final, Native, Protected, BlueprintCallable) // @ 0x141926B50
	void MontageSetNextSectionName(class FName FromSectionName, class FName ToSectionName); // (Final, Native, Protected, BlueprintCallable) // @ 0x141926BD0
	void MontageStop(float OverrideBlendOutTime); // (Final, Native, Protected, BlueprintCallable) // @ 0x141926C90
	void RemoveGrantedByEffect(); // (Native, Public, BlueprintCallable) // @ 0x141927570
	void SendGameplayEvent(const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload); // (Native, Protected, BlueprintCallable) // @ 0x141927590
	void SetCanBeCanceled(bool bCanBeCanceled); // (Native, Public, BlueprintCallable) // @ 0x141927850
	void SetShouldBlockOtherAbilities(bool bShouldBlockAbilities); // (Native, Public, BlueprintCallable) // @ 0x1419278E0

	int32 GetAbilityLevel() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925910
	class UAbilitySystemComponent* GetAbilitySystemComponentFromActorInfo() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925940
	struct FGameplayAbilityActorInfo GetActorInfo() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925970
	class AActor* GetAvatarActorFromActorInfo() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1419259E0
	struct FGameplayEffectContextHandle GetContextFromOwner(const struct FGameplayAbilityTargetDataHandle& OptionalTargetData) const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925A10
	float GetCooldownTimeRemaining() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925BB0
	class UAnimMontage* GetCurrentMontage() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925BE0
	class UObject* GetCurrentSourceObject() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925C10
	struct FGameplayEffectContextHandle GetGrantedByEffectContext() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925C40
	class AActor* GetOwningActorFromActorInfo() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925CC0
	class USkeletalMeshComponent* GetOwningComponentFromActorInfo() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141925CF0
	void InvalidateClientPredictionKey() const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x141925D20
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const; // (Event, Protected, HasOutParams, BlueprintEvent, Const) // @ 0x14B5B5E20
	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const; // (Event, Protected, BlueprintEvent, Const) // @ 0x14B5B5E20
	struct FGameplayEffectSpecHandle MakeOutgoingGameplayEffectSpec(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141926880

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayAbility")
	}
	static class UGameplayAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayAbility>();
	}
};
DUMPER7_ASSERTS_UGameplayAbility;

// Class GameplayAbilities.AbilitySystemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbilitySystemBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FGameplayAbilityTargetDataHandle AbilityTargetDataFromActor(class AActor* Actor); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x141907EE0
	static struct FGameplayAbilityTargetDataHandle AbilityTargetDataFromActorArray(const TArray<class AActor*>& ActorArray, bool OneTargetPerHandle); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141907FA0
	static struct FGameplayAbilityTargetDataHandle AbilityTargetDataFromHitResult(const struct FHitResult& HitResult); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x1419080F0
	static struct FGameplayAbilityTargetDataHandle AbilityTargetDataFromLocations(const struct FGameplayAbilityTargetingLocationInfo& SourceLocation, const struct FGameplayAbilityTargetingLocationInfo& TargetLocation); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141908200
	static struct FGameplayEffectSpecHandle AddAssetTag(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTag& NewGameplayTag); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1419083B0
	static struct FGameplayEffectSpecHandle AddAssetTags(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTagContainer& NewGameplayTags); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141908500
	static struct FGameplayEffectSpecHandle AddGrantedTag(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTag& NewGameplayTag); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1419086F0
	static struct FGameplayEffectSpecHandle AddGrantedTags(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTagContainer& NewGameplayTags); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141908840
	static struct FGameplayEffectSpecHandle AddLinkedGameplayEffect(const struct FGameplayEffectSpecHandle& SpecHandle, TSubclassOf<class UGameplayEffect> LinkedGameplayEffect); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141908A30
	static struct FGameplayEffectSpecHandle AddLinkedGameplayEffectSpec(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayEffectSpecHandle& LinkedGameplayEffectSpec); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141908B80
	static struct FGameplayAbilityTargetDataHandle AppendTargetDataHandle(const struct FGameplayAbilityTargetDataHandle& TargetHandle, const struct FGameplayAbilityTargetDataHandle& HandleToAdd); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x141908D10
	static struct FGameplayEffectSpecHandle AssignSetByCallerMagnitude(const struct FGameplayEffectSpecHandle& SpecHandle, class FName DataName, float Magnitude); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141908F40
	static struct FGameplayEffectSpecHandle AssignTagSetByCallerMagnitude(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayTag& DataTag, float Magnitude); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1419090D0
	static void BreakGameplayCueParameters(const struct FGameplayCueParameters& Parameters, float* NormalizedMagnitude, float* RawMagnitude, struct FGameplayEffectContextHandle* EffectContext, struct FGameplayTag* MatchedTagName, struct FGameplayTag* OriginalTag, struct FGameplayTagContainer* AggregatedSourceTags, struct FGameplayTagContainer* AggregatedTargetTags, struct FVector* Location, struct FVector* Normal, class AActor** Instigator, class AActor** EffectCauser, class UObject** SourceObject, class UPhysicalMaterial** PhysicalMaterial, int32* GameplayEffectLevel, int32* AbilityLevel, class USceneComponent** TargetAttachComponent); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x141909260
	static struct FGameplayEffectSpecHandle CloneSpecHandle(class AActor* InNewInstigator, class AActor* InEffectCauser, const struct FGameplayEffectSpecHandle& GameplayEffectSpecHandle_Clone); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x141909A90
	static bool DoesGameplayCueMeetTagRequirements(const struct FGameplayCueParameters& Parameters, const struct FGameplayTagRequirements& SourceTagReqs, const struct FGameplayTagRequirements& TargetTagReqs); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141909C30
	static bool DoesTargetDataContainActor(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0, class AActor* Actor); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141909EA0
	static void EffectContextAddHitResult(const struct FGameplayEffectContextHandle& EffectContext, const struct FHitResult& HitResult, bool bReset); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190A060
	static class AActor* EffectContextGetEffectCauser(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190A250
	static struct FHitResult EffectContextGetHitResult(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190A340
	static class AActor* EffectContextGetInstigatorActor(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190A480
	static struct FVector EffectContextGetOrigin(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190A570
	static class AActor* EffectContextGetOriginalInstigatorActor(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190A670
	static class UObject* EffectContextGetSourceObject(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190A760
	static bool EffectContextHasHitResult(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190A850
	static bool EffectContextIsInstigatorLocallyControlled(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190A940
	static bool EffectContextIsValid(const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190AA30
	static void EffectContextSetOrigin(const struct FGameplayEffectContextHandle& EffectContext, const struct FVector& Origin); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14190AB20
	static bool EqualEqual_GameplayAttributeGameplayAttribute(const struct FGameplayAttribute& AttributeA, const struct FGameplayAttribute& AttributeB); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190AC50
	static float EvaluateAttributeValueWithTags(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAttribute& Attribute, const struct FGameplayTagContainer& SourceTags, const struct FGameplayTagContainer& TargetTags, bool* bSuccess); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190B0A0
	static float EvaluateAttributeValueWithTagsAndBase(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAttribute& Attribute, const struct FGameplayTagContainer& SourceTags, const struct FGameplayTagContainer& TargetTags, float BaseValue, bool* bSuccess); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190B4F0
	static struct FGameplayAbilityTargetDataHandle FilterTargetData(const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTargetDataFilterHandle& ActorFilterClass); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190B980
	static void ForwardGameplayCueToTarget(TScriptInterface<class IGameplayCueInterface> TargetCueInterface, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190BB70
	static class UAbilitySystemComponent* GetAbilitySystemComponent(class AActor* Actor); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190BD70
	static class FString GetActiveGameplayEffectDebugString(const struct FActiveGameplayEffectHandle& ActiveHandle); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190BDF0
	static float GetActiveGameplayEffectExpectedEndTime(const struct FActiveGameplayEffectHandle& ActiveHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190BEC0
	static float GetActiveGameplayEffectRemainingDuration(class UObject* WorldContextObject, const struct FActiveGameplayEffectHandle& ActiveHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190BF40
	static int32 GetActiveGameplayEffectStackCount(const struct FActiveGameplayEffectHandle& ActiveHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190C010
	static int32 GetActiveGameplayEffectStackLimitCount(const struct FActiveGameplayEffectHandle& ActiveHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190C090
	static float GetActiveGameplayEffectStartTime(const struct FActiveGameplayEffectHandle& ActiveHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190C110
	static float GetActiveGameplayEffectTotalDuration(const struct FActiveGameplayEffectHandle& ActiveHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190C190
	static class AActor* GetActorByIndex(const struct FGameplayCueParameters& Parameters, int32 Index_0); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190C210
	static int32 GetActorCount(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190C3C0
	static TArray<class AActor*> GetActorsFromTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190C530
	static TArray<class AActor*> GetAllActorsFromTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190C6F0
	static TArray<struct FGameplayEffectSpecHandle> GetAllLinkedGameplayEffectSpecHandles(const struct FGameplayEffectSpecHandle& SpecHandle); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190C880
	static int32 GetDataCountFromTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190CAA0
	static struct FGameplayEffectContextHandle GetEffectContext(const struct FGameplayEffectSpecHandle& SpecHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190CBF0
	static float GetFloatAttribute(const class AActor* Actor, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190CD00
	static float GetFloatAttributeBase(const class AActor* Actor, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190CFC0
	static float GetFloatAttributeBaseFromAbilitySystemComponent(const class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190D280
	static float GetFloatAttributeFromAbilitySystemComponent(const class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190D540
	static bool GetGameplayCueDirection(class AActor* TargetActor, const struct FGameplayCueParameters& Parameters, struct FVector* Direction); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190D800
	static bool GetGameplayCueEndLocationAndNormal(class AActor* TargetActor, const struct FGameplayCueParameters& Parameters, struct FVector* Location, struct FVector* Normal); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190D9F0
	static struct FHitResult GetHitResult(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190DC40
	static struct FHitResult GetHitResultFromTargetData(const struct FGameplayAbilityTargetDataHandle& HitResult, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14190DE00
	static class AActor* GetInstigatorActor(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190DFF0
	static struct FTransform GetInstigatorTransform(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190E160
	static float GetModifiedAttributeMagnitude(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayAttribute& Attribute); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14190E300
	static struct FVector GetOrigin(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190E5E0
	static struct FVector GetTargetDataEndPoint(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190E760
	static struct FTransform GetTargetDataEndPointTransform(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190E8F0
	static struct FTransform GetTargetDataOrigin(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190EA90
	static bool HasHitResult(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190EC30
	static bool IsInstigatorLocallyControlled(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190EDA0
	static bool IsInstigatorLocallyControlledPlayer(const struct FGameplayCueParameters& Parameters); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190EF10
	static bool IsValid(const struct FGameplayAttribute& Attribute); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190F080
	static struct FGameplayTargetDataFilterHandle MakeFilterHandle(const struct FGameplayTargetDataFilter& Filter, class AActor* FilterActor); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190F2D0
	static struct FGameplayCueParameters MakeGameplayCueParameters(float NormalizedMagnitude, float RawMagnitude, const struct FGameplayEffectContextHandle& EffectContext, const struct FGameplayTag& MatchedTagName, const struct FGameplayTag& OriginalTag, const struct FGameplayTagContainer& AggregatedSourceTags, const struct FGameplayTagContainer& AggregatedTargetTags, const struct FVector& Location, const struct FVector& Normal, class AActor* Instigator, class AActor* EffectCauser, class UObject* SourceObject, class UPhysicalMaterial* PhysicalMaterial, int32 GameplayEffectLevel, int32 AbilityLevel, class USceneComponent* TargetAttachComponent); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14190F450
	static struct FGameplayEffectSpecHandle MakeSpecHandle(class UGameplayEffect* InGameplayEffect, class AActor* InInstigator, class AActor* InEffectCauser, float InLevel); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190FB90
	static bool NotEqual_GameplayAttributeGameplayAttribute(const struct FGameplayAttribute& AttributeA, const struct FGameplayAttribute& AttributeB); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14190FD10
	static void SendGameplayEventToActor(class AActor* Actor, const struct FGameplayTag& EventTag, const struct FGameplayEventData& Payload); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141910160
	static struct FGameplayEffectSpecHandle SetDuration(const struct FGameplayEffectSpecHandle& SpecHandle, float Duration); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141910450
	static struct FGameplayEffectSpecHandle SetStackCount(const struct FGameplayEffectSpecHandle& SpecHandle, int32 StackCount); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1419105A0
	static struct FGameplayEffectSpecHandle SetStackCountToMax(const struct FGameplayEffectSpecHandle& SpecHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1419106F0
	static bool TargetDataHasActor(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x1419107F0
	static bool TargetDataHasEndPoint(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141910970
	static bool TargetDataHasHitResult(const struct FGameplayAbilityTargetDataHandle& HitResult, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141910AF0
	static bool TargetDataHasOrigin(const struct FGameplayAbilityTargetDataHandle& TargetData, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141910C70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilitySystemBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilitySystemBlueprintLibrary")
	}
	static class UAbilitySystemBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitySystemBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UAbilitySystemBlueprintLibrary;

// Class GameplayAbilities.GameplayCueManager
// 0x02E0 (0x0310 - 0x0030)
class UGameplayCueManager : public UDataAsset
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueObjectLibrary              RuntimeGameplayCueObjectLibrary;                   // 0x0048(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FGameplayCueObjectLibrary              EditorGameplayCueObjectLibrary;                    // 0x0098(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x1C8];                                     // 0x00E8(0x01C8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         LoadedGameplayCueNotifyClasses;                    // 0x02B0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AGameplayCueNotify_Actor>> GameplayCueClassesForPreallocation;          // 0x02C0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FGameplayCuePendingExecute>     PendingExecuteCues;                                // 0x02D0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	int32                                         GameplayCueSendContextCount;                       // 0x02E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPreallocationInfo>             PreallocationInfoList_Internal;                    // 0x02E8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F8[0x18];                                     // 0x02F8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayCueManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayCueManager")
	}
	static class UGameplayCueManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayCueManager>();
	}
};
DUMPER7_ASSERTS_UGameplayCueManager;

// Class GameplayAbilities.AbilityTask_WaitInputPress
// 0x0020 (0x00A0 - 0x0080)
class UAbilityTask_WaitInputPress final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float TimeWaited)> OnPress;                                        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x10];                                      // 0x0090(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitInputPress* WaitInputPress(class UGameplayAbility* OwningAbility, bool bTestAlreadyPressed); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141927EB0

	void OnPressCallback(); // (Final, Native, Public) // @ 0x1419270F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_WaitInputPress")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_WaitInputPress")
	}
	static class UAbilityTask_WaitInputPress* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitInputPress>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_WaitInputPress;

// Class GameplayAbilities.AbilitySystemGlobals
// 0x0238 (0x0260 - 0x0028)
class UAbilitySystemGlobals : public UObject
{
public:
	struct FSoftClassPath                         AbilitySystemGlobalsClassName;                     // 0x0028(0x0018)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ActivateFailIsDeadTag;                             // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateFailIsDeadName;                            // 0x0070(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailCooldownTag;                           // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateFailCooldownName;                          // 0x0080(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailCostTag;                               // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateFailCostName;                              // 0x0090(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailTagsBlockedTag;                        // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateFailTagsBlockedName;                       // 0x00A0(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailTagsMissingTag;                        // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateFailTagsMissingName;                       // 0x00B0(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActivateFailNetworkingTag;                         // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ActivateFailNetworkingName;                        // 0x00C0(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinimalReplicationTagCountBits;                    // 0x00C8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNetSerializeScriptStructCache         TargetDataStructCache;                             // 0x00D0(0x0010)(NativeAccessSpecifierPublic)
	bool                                          bAllowGameplayModEvaluationChannels;               // 0x00E0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGameplayModEvaluationChannel                 DefaultGameplayModEvaluationChannel;               // 0x00E1(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GameplayModEvaluationChannelAliases[0xA];          // 0x00E4(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        GlobalCurveTableName;                              // 0x0138(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveTable*                            GlobalCurveTable;                                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        GlobalAttributeMetaDataTableName;                  // 0x0158(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             GlobalAttributeMetaDataTable;                      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        GlobalAttributeSetDefaultsTableName;               // 0x0178(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FSoftObjectPath>                GlobalAttributeSetDefaultsTableNames;              // 0x0190(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TArray<class UCurveTable*>                    GlobalAttributeDefaultsTables;                     // 0x01A0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        GlobalGameplayCueManagerClass;                     // 0x01B0(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        GlobalGameplayCueManagerName;                      // 0x01C8(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         GameplayCueNotifyPaths;                            // 0x01E0(0x0010)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	struct FSoftObjectPath                        GameplayTagResponseTableName;                      // 0x01F0(0x0018)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayTagReponseTable*               GameplayTagResponseTable;                          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          PredictTargetGameplayEffects;                      // 0x0210(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayCueManager*                    GlobalGameplayCueManager;                          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_220[0x40];                                     // 0x0220(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ToggleIgnoreAbilitySystemCooldowns(); // (Exec, Native, Public) // @ 0x140C99510
	void ToggleIgnoreAbilitySystemCosts(); // (Exec, Native, Public) // @ 0x140EDBAC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilitySystemGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilitySystemGlobals")
	}
	static class UAbilitySystemGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilitySystemGlobals>();
	}
};
DUMPER7_ASSERTS_UAbilitySystemGlobals;

// Class GameplayAbilities.AbilitySystemComponent
// 0x11D0 (0x1338 - 0x0168)
class UAbilitySystemComponent : public UGameplayTasksComponent
{
public:
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAttributeDefaults>             DefaultStartingData;                               // 0x0178(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAttributeSet*>                  SpawnedAttributes;                                 // 0x0188(0x0010)(ExportObject, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   AffectedAnimInstanceTag;                           // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0[0x1A0];                                    // 0x01A0(0x01A0)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutgoingDuration;                                  // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IncomingDuration;                                  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x20];                                     // 0x0348(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ClientDebugStrings;                                // 0x0368(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<class FString>                         ServerDebugStrings;                                // 0x0378(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x60];                                     // 0x0388(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          UserAbilityActivationInhibited;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReplicationProxyEnabled;                           // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuppressGrantAbility;                             // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuppressGameplayCues;                             // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameplayAbilityTargetActor*>    SpawnedTargetActors;                               // 0x03F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_400[0x28];                                     // 0x0400(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x0428(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 AvatarActor;                                       // 0x0430(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0x10];                                     // 0x0438(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilitySpecContainer          ActivatableAbilities;                              // 0x0448(0x0120)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_568[0x30];                                     // 0x0568(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameplayAbility*>               AllReplicatedInstancedAbilities;                   // 0x0598(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A8[0x1D0];                                    // 0x05A8(0x01D0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityRepAnimMontage         RepAnimMontageInfo;                                // 0x0778(0x0030)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bCachedIsNetSimulated;                             // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingMontageRep;                                // 0x07A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7AA[0x6];                                      // 0x07AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityLocalAnimMontage       LocalAnimMontageInfo;                              // 0x07B0(0x0030)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_7E0[0xA0];                                     // 0x07E0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectsContainer        ActiveGameplayEffects;                             // 0x0880(0x0480)(Net, Protected, NativeAccessSpecifierProtected)
	struct FActiveGameplayCueContainer            ActiveGameplayCues;                                // 0x0D00(0x0128)(Net, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FActiveGameplayCueContainer            MinimalReplicationGameplayCues;                    // 0x0E28(0x0128)(Net, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F50[0x128];                                    // 0x0F50(0x0128)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 BlockedAbilityBindings;                            // 0x1078(0x0010)(Net, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1088[0x128];                                   // 0x1088(0x0128)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalReplicationTagCountMap         MinimalReplicationTags;                            // 0x11B0(0x0060)(Net, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1210[0x10];                                    // 0x1210(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedPredictionKeyMap            ReplicatedPredictionKeyMap;                        // 0x1220(0x0118)(Net, NativeAccessSpecifierPublic)

public:
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectSpecToSelf(const struct FGameplayEffectSpecHandle& SpecHandle); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141913970
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectSpecToTarget(const struct FGameplayEffectSpecHandle& SpecHandle, class UAbilitySystemComponent* Target); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141913A50
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToSelf(TSubclassOf<class UGameplayEffect> GameplayEffectClass, float Level, const struct FGameplayEffectContextHandle& EffectContext); // (Final, Native, Public, BlueprintCallable) // @ 0x141913B70
	struct FActiveGameplayEffectHandle BP_ApplyGameplayEffectToTarget(TSubclassOf<class UGameplayEffect> GameplayEffectClass, class UAbilitySystemComponent* Target, float Level, const struct FGameplayEffectContextHandle& Context); // (Final, Native, Public, BlueprintCallable) // @ 0x141913CF0
	void ClientActivateAbilityFailed(const struct FGameplayAbilitySpecHandle& AbilityToActivate, int16 PredictionKey); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x141913EA0
	void ClientActivateAbilitySucceed(const struct FGameplayAbilitySpecHandle& AbilityToActivate, const struct FPredictionKey& PredictionKey); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x141913F70
	void ClientActivateAbilitySucceedWithEventData(const struct FGameplayAbilitySpecHandle& AbilityToActivate, const struct FPredictionKey& PredictionKey, const struct FGameplayEventData& TriggerEventData); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x141914060
	void ClientCancelAbility(const struct FGameplayAbilitySpecHandle& AbilityToCancel, const struct FGameplayAbilityActivationInfo& ActivationInfo); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x141914390
	void ClientEndAbility(const struct FGameplayAbilitySpecHandle& AbilityToEnd, const struct FGameplayAbilityActivationInfo& ActivationInfo); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x141914480
	void ClientPrintDebug_Response(const TArray<class FString>& Strings, int32 GameFlags); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x141914570
