#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AssetPackerRuntime_structs.hpp"


namespace SDK
{

// Enum GameCore.EAppUpdateType
// NumValues: 0x0003
enum class EAppUpdateType : uint8
{
	Dolphin                                  = 0,
	Puffer                                   = 1,
	EAppUpdateType_MAX                       = 2,
};

// Enum GameCore.EPreloadType
// NumValues: 0x0003
enum class EPreloadType : uint8
{
	NoBlock                                  = 0,
	Block                                    = 1,
	EPreloadType_MAX                         = 2,
};

// Enum GameCore.EDataTableLoadingStep
// NumValues: 0x0005
enum class EDataTableLoadingStep : uint8
{
	None                                     = 0,
	Loading                                  = 1,
	Success                                  = 2,
	Fail                                     = 3,
	EDataTableLoadingStep_MAX                = 4,
};

// Enum GameCore.EDataTableUseClientType
// NumValues: 0x0009
enum class EDataTableUseClientType : uint8
{
	All                                      = 0,
	DS                                       = 1,
	Editor                                   = 2,
	Android                                  = 3,
	IOS                                      = 4,
	PC                                       = 5,
	Console                                  = 6,
	OpenHarmony                              = 7,
	EDataTableUseClientType_MAX              = 8,
};

// Enum GameCore.EDataTableUseScene
// NumValues: 0x0008
enum class EDataTableUseScene : uint8
{
	None                                     = 0,
	Common                                   = 1,
	FrontEnd                                 = 2,
	InGameSOL                                = 3,
	InGameBattleField                        = 4,
	Login                                    = 6,
	Disable                                  = 5,
	EDataTableUseScene_MAX                   = 7,
};

// Enum GameCore.EDatatableAssetinfoOPCode
// NumValues: 0x0005
enum class EDatatableAssetinfoOPCode : uint8
{
	Default                                  = 0,
	Add                                      = 1,
	Remove                                   = 2,
	AddLoaded                                = 3,
	EDatatableAssetinfoOPCode_MAX            = 4,
};

// Enum GameCore.EDeviceLevel
// NumValues: 0x0008
enum class EDeviceLevel : uint8
{
	VeryLow                                  = 0,
	Low                                      = 1,
	Middle                                   = 2,
	Standard                                 = 3,
	High                                     = 4,
	VeryHigh                                 = 5,
	Unknown                                  = 6,
	EDeviceLevel_MAX                         = 7,
};

// Enum GameCore.EBackgroundType
// NumValues: 0x0007
enum class EBackgroundType : uint8
{
	None                                     = 0,
	Image                                    = 1,
	Media                                    = 2,
	CustomBP                                 = 3,
	CDNImage                                 = 4,
	DirectOnStackBP                          = 5,
	EBackgroundType_MAX                      = 6,
};

// Enum GameCore.EBackgroundScaleType
// NumValues: 0x0003
enum class EBackgroundScaleType : uint8
{
	Scale                                    = 0,
	UnScale                                  = 1,
	EBackgroundScaleType_MAX                 = 2,
};

// Enum GameCore.EGameVersionCompareResult
// NumValues: 0x0005
enum class EGameVersionCompareResult : uint8
{
	VERSION_COMPARE_EQUAL                    = 0,
	VERSION_COMPARE_LOWER                    = 1,
	VERSION_COMPARE_HIGHER                   = 2,
	VERSION_COMPARE_ERROR                    = 3,
	VERSION_COMPARE_MAX                      = 4,
};

// Enum GameCore.EResourceMSVersion
// NumValues: 0x0025
enum class EResourceMSVersion : uint8
{
	Unknown                                  = 0,
	She1                                     = 11,
	She2                                     = 12,
	She3                                     = 13,
	She4                                     = 14,
	She5                                     = 15,
	Ma1                                      = 21,
	Ma2                                      = 22,
	Ma3                                      = 23,
	Ma4                                      = 24,
	Ma5                                      = 25,
	Yang1                                    = 31,
	Yang2                                    = 32,
	Yang3                                    = 33,
	Yang4                                    = 34,
	Yang5                                    = 35,
	Hou1                                     = 41,
	Hou2                                     = 42,
	Hou3                                     = 43,
	Hou4                                     = 45,
	Hou5                                     = 46,
	Ji1                                      = 51,
	Ji2                                      = 52,
	Ji3                                      = 53,
	Ji4                                      = 54,
	Ji5                                      = 55,
	Gou1                                     = 61,
	Gou2                                     = 62,
	Gou3                                     = 63,
	Gou4                                     = 64,
	Gou5                                     = 65,
	Zhu1                                     = 71,
	Zhu2                                     = 72,
	Zhu3                                     = 73,
	Zhu4                                     = 74,
	Zhu5                                     = 75,
	EResourceMSVersion_MAX                   = 76,
};

// Enum GameCore.EGameChannel
// NumValues: 0x0007
enum class EGameChannel : uint8
{
	Unknown                                  = 0,
	Official                                 = 1,
	WeGame                                   = 2,
	Steam                                    = 3,
	Epic                                     = 4,
	Google                                   = 5,
	EGameChannel_MAX                         = 6,
};

// Enum GameCore.EGameBuildRegion
// NumValues: 0x000A
enum class EGameBuildRegion : uint8
{
	Default                                  = 0,
	CN                                       = 1,
	CN_Exper                                 = 2,
	CN_Match                                 = 3,
	Global                                   = 4,
	Global_Exper                             = 5,
	Global_Match                             = 6,
	GA                                       = 7,
	GA_Exper                                 = 8,
	EGameBuildRegion_MAX                     = 9,
};

// Enum GameCore.EGameBuildConfiguration
// NumValues: 0x0008
enum class EGameBuildConfiguration : uint8
{
	Default                                  = 0,
	Daily                                    = 1,
	Test                                     = 2,
	Match                                    = 3,
	Shipping                                 = 4,
	ShippingTest                             = 5,
	Release                                  = 6,
	EGameBuildConfiguration_MAX              = 7,
};

// Enum GameCore.ETODType
// NumValues: 0x0005
enum class ETODType : uint8
{
	Day                                      = 0,
	Dusk                                     = 1,
	Random                                   = 2,
	DONOTUSE                                 = 3,
	ETODType_MAX                             = 4,
};

// ScriptStruct GameCore.DataTableUseSceneValue
// 0x0008 (0x0008 - 0x0000)
struct FDataTableUseSceneValue final
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataTableUseSceneValue;

// ScriptStruct GameCore.AppSettingForUpdateChannel
// 0x0080 (0x0080 - 0x0000)
struct FAppSettingForUpdateChannel final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EGameBuildConfiguration                       BuildType;                                         // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AndroidProductId;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyProductId;                              // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IOSProductId;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PCProductId;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WinSEProductId;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 XSXProductId;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PS5ProductId;                                      // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppSettingForUpdateChannel;

// ScriptStruct GameCore.AppSettingForUpdate
// 0x0068 (0x0068 - 0x0000)
struct FAppSettingForUpdate final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DolphinPreDomain;                                  // 0x0008(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DolphinDomain;                                     // 0x0018(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAppSettingForUpdateChannel>    DolphinProductIdList;                              // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 PufferPreDomain;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PufferDomain;                                      // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAppSettingForUpdateChannel>    PufferProductIdList;                               // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppSettingForUpdate;

// ScriptStruct GameCore.DescRowBase
// 0x0008 (0x0010 - 0x0008)
struct FDescRowBase : public FTableRowBase
{
public:
	class FName                                   RowDescription;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDescRowBase;

// ScriptStruct GameCore.AppSettingForMapleChannel
// 0x0020 (0x0020 - 0x0000)
struct FAppSettingForMapleChannel final
{
public:
	EGameBuildConfiguration                       BuildType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AndroidTreeID;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OpenHarmonyTreeID;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IOSTreeID;                                         // 0x000C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PCTreeID;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WinSETreeID;                                       // 0x0014(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         XSXTreeID;                                         // 0x0018(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PS5TreeID;                                         // 0x001C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppSettingForMapleChannel;

// ScriptStruct GameCore.MapleSettingRow
// 0x0070 (0x0070 - 0x0000)
struct FMapleSettingRow final
{
public:
	class FString                                 MaplePreDomain;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MapleDomain;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultCDNUrl;                                     // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CDNUrl_PC;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CDNFallbackDomains;                                // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CDNFallbackDomains_PC;                             // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAppSettingForMapleChannel>     MapleChannels;                                     // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMapleSettingRow;

// ScriptStruct GameCore.LoginSettingRow
// 0x0070 (0x0070 - 0x0000)
struct FLoginSettingRow final
{
public:
	class FString                                 EditorLoginList;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WindowsLoginList;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AndroidLoginList;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyLoginList;                              // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IOSLoginList;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 XSXLoginList;                                      // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PS5LoginList;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLoginSettingRow;

// ScriptStruct GameCore.AppSettingRow
// 0x0748 (0x0748 - 0x0000)
struct FAppSettingRow final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BundleDisplayName;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ProjectDisplayedTitle;                             // 0x0018(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	class FString                                 BundleName;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BundleId;                                          // 0x0040(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AppLinks;                                          // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RegionCode;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SdkBlackListStr;                                   // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IosMinimumiOSVersion;                              // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 IosMobileProvision;                                // 0x0088(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IosSiningCertificate;                              // 0x0098(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IosSupportItunesFileSharing;                       // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AndroidMinSDKVersion;                              // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AndroidTargetSDKVersion;                           // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AndroidKeyStore;                                   // 0x00B8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AndroidKeyStorePassword;                           // 0x00C8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AndroidKeyAlias;                                   // 0x00D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AndroidKeyAliasPassword;                           // 0x00E8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyBundleDisplayName;                      // 0x00F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyBundleName;                             // 0x0108(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyAppId;                                  // 0x0118(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyClientId;                               // 0x0128(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyKeyStorePassword;                       // 0x0138(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyKeyAlias;                               // 0x0148(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyKeyAliasPassword;                       // 0x0158(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultCulture;                                    // 0x0168(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultAudioCulture;                               // 0x0170(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SupportCultures;                                   // 0x0178(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 GCloudId;                                          // 0x0188(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GCloudKey;                                         // 0x0198(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GVoiceId;                                          // 0x01A8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GVoiceKey;                                         // 0x01B8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApolloId;                                          // 0x01C8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApolloKey;                                         // 0x01D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApolloDH;                                          // 0x01E8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApolloKeyRelease;                                  // 0x01F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApolloDHRelease;                                   // 0x0208(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SdkGameId;                                         // 0x0218(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeGameId;                                          // 0x0228(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SteamAppId;                                        // 0x0238(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeGameTestDlcId;                                   // 0x0248(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeGamePreDlcId;                                    // 0x0258(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeGameShippingDlcId;                               // 0x0268(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeGameReleaseDlcId;                                // 0x0278(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SteamTestDlcId;                                    // 0x0288(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SteamPreDlcId;                                     // 0x0298(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SteamShippingDlcId;                                // 0x02A8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SteamReleaseDlcId;                                 // 0x02B8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AuthType;                                          // 0x02C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GVoiceServerUrl;                                   // 0x02D0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TSSGameId;                                         // 0x02E0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 QQAppId;                                           // 0x02F0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeixinAppId;                                       // 0x0300(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightAndroidAppId;                            // 0x0310(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightAndroidAppId_Shipping;                   // 0x0320(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightOpenHarmonyAppId;                        // 0x0330(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightOpenHarmonyAppId_Shipping;               // 0x0340(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightAndroidUrl;                              // 0x0350(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightOpenHarmonyUrl;                          // 0x0360(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightIosAppId;                                // 0x0370(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightIosAppId_Shipping;                       // 0x0380(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightXSXAppId;                                // 0x0390(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightXSXAppId_Shipping;                       // 0x03A0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightPS5AppId;                                // 0x03B0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightPS5AppId_Shipping;                       // 0x03C0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightWinAppKey;                               // 0x03D0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightWinAppKey_Shipping;                      // 0x03E0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CrashSightIosUrl;                                  // 0x03F0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TDMSrcId;                                          // 0x0400(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TDMServerChineseRouteAddress;                      // 0x0410(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TDMServerAbroadRouteAddress;                       // 0x0420(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TDMServerRouteAddressTest;                         // 0x0430(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ApmIOSConfigPath;                                  // 0x0440(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MidasBusinessId;                                   // 0x0450(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MidasOfferId;                                      // 0x0460(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CentauriBusinessId;                                // 0x0470(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CentauriOfferId;                                   // 0x0480(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DolphinBuildAccessName;                            // 0x0490(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DolphinBuildArea;                                  // 0x04A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DolphinConnectType;                                // 0x04B0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppSettingForUpdate                   UpdateInfo;                                        // 0x04B8(0x0068)(Edit, Config, NativeAccessSpecifierPublic)
	struct FMapleSettingRow                       MapleInfo;                                         // 0x0520(0x0070)(Edit, Config, NativeAccessSpecifierPublic)
	class FString                                 CDNRoot;                                           // 0x0590(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLoginSettingRow                       LoginSetting;                                      // 0x05A0(0x0070)(Edit, Config, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   LoadingBackground;                                 // 0x0610(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   WindowsLoadingBackground;                          // 0x0638(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   HealthTipView;                                     // 0x0660(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   LoadingView;                                       // 0x0688(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HealthTipShowTime;                                 // 0x06B0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B4[0x4];                                      // 0x06B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnnounceDefaultRegion;                             // 0x06B8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideDefaultConfig;                            // 0x06C8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StartupMovies;                                     // 0x06D0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 ConfigFutureMovieStartTimes;                       // 0x06E0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConfigFutureMovieEndTimes;                         // 0x06F0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ConfigFutureMovieNames;                            // 0x0700(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bOverrideDefaultConfig_HD;                         // 0x0710(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StartupMovies_HD;                                  // 0x0718(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         ConsoleVariables;                                  // 0x0728(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         ConsoleVariables_HD;                               // 0x0738(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppSettingRow;

// ScriptStruct GameCore.AsyncReqGroup
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FAsyncReqGroup final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAsyncReqGroup;

// ScriptStruct GameCore.AsyncReqStruct
// 0x0038 (0x0038 - 0x0000)
struct FAsyncReqStruct final
{
public:
	uint64                                        AsyncID;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                InPaths;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x20];                                      // 0x0018(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAsyncReqStruct;

// ScriptStruct GameCore.AssetRetargetInfoRow
// 0x0008 (0x0010 - 0x0008)
struct FAssetRetargetInfoRow final : public FTableRowBase
{
public:
	class FName                                   RetargetPackageName;                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAssetRetargetInfoRow;

// ScriptStruct GameCore.PackageDescRow
// 0x0018 (0x0028 - 0x0010)
struct FPackageDescRow : public FDescRowBase
{
public:
	class FName                                   Catagory;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPrimaryAssetPakRule                          PakLevel;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FallbackRowName;                                   // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPackageDescRow;

// ScriptStruct GameCore.AssetDescRowBase
// 0x0020 (0x0030 - 0x0010)
struct FAssetDescRowBase : public FDescRowBase
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPreloadType                                  PreloadType;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAssetDescRowBase;

// ScriptStruct GameCore.PreloadAssetDescRowBase
// 0x0010 (0x0040 - 0x0030)
struct FPreloadAssetDescRowBase final : public FAssetDescRowBase
{
public:
	TSubclassOf<class AActor>                     Archetype;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreloadNum;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPreloadAssetDescRowBase;

// ScriptStruct GameCore.AssetStoreItemRow
// 0x0078 (0x0080 - 0x0008)
struct FAssetStoreItemRow final : public FTableRowBase
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0008(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SrcTablePath;                                      // 0x0020(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Category;                                          // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MidAssetPath;                                      // 0x0048(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        LowAssetPath;                                      // 0x0060(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BuildToMobile;                                     // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAssetStoreItemRow;

// ScriptStruct GameCore.GameTypeConfig
// 0x0018 (0x0018 - 0x0000)
struct FGameTypeConfig final
{
public:
	int32                                         GameMapId;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MainGameModeType;                                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubGameModeType;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RoomType;                                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamType;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInited;                                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameTypeConfig;

// ScriptStruct GameCore.CSV2Datatable
// 0x0038 (0x0048 - 0x0010)
struct FCSV2Datatable final : public FDescRowBase
{
public:
	struct FSoftObjectPath                        DataTablePath;                                     // 0x0010(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CSVName;                                           // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           AssetInfoKeys;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCSV2Datatable;

// ScriptStruct GameCore.DataTableAssetInfo
// 0x0048 (0x00C0 - 0x0078)
struct FDataTableAssetInfo final : public FAssetPakerPakPolicyRow
{
public:
	uint8                                         SyncLoad : 1;                                      // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UseScene;                                          // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UseClientType;                                     // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         HasSubTableInDir : 1;                              // 0x0084(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCombineWithOtherTables : 1;                       // 0x0084(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                CombineWithThoseTables;                            // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bCanMMapWithSubTable : 1;                          // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMaskToUseMMap : 1;                                // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CSVName;                                           // 0x009C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCleanWhenForceBatchLoad : 1;                      // 0x00A4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A5[0x1B];                                      // 0x00A5(0x001B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataTableAssetInfo;

// ScriptStruct GameCore.DataTableLiteContent
// 0x0218 (0x0218 - 0x0000)
struct FDataTableLiteContent final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataTable*>                     DataTables;                                        // 0x0028(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x1C0];                                     // 0x0038(0x01C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CombineTable;                                      // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_200[0x18];                                     // 0x0200(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataTableLiteContent;

// ScriptStruct GameCore.DirIconRow
// 0x0060 (0x0090 - 0x0030)
struct FDirIconRow final : public FAssetDescRowBase
{
public:
	class FName                                   DirName;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        RegionTexturePath;                                 // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        VersionTexturePath;                                // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RegionScale;                                       // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VersionScale;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 RegionTexturePos;                                  // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 VersionTexturePos;                                 // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDirIconRow;

// ScriptStruct GameCore.DirTextRow
// 0x0040 (0x0070 - 0x0030)
struct FDirTextRow final : public FAssetDescRowBase
{
public:
	class FName                                   DirName;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Text;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 TextOffset;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   TextFont;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 TColorAndOpacity;                                  // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDirTextRow;

// ScriptStruct GameCore.FrameStackBgAssetRow
// 0x00B0 (0x00C0 - 0x0010)
struct FFrameStackBgAssetRow final : public FDescRowBase
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBackgroundScaleType                          BackgroundScaleType;                               // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBackgroundType                               BackgroundType;                                    // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        DisplayAssetPath;                                  // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MediaName;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CDNUrl;                                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchSize;                                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Tag;                                               // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMaskVisible;                                     // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBlurVisible;                                     // 0x0079(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlurStrength;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsCustomPadding;                                   // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CustomPadding;                                     // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutoAudio;                                       // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AudioEventName;                                    // 0x00A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsForceRenderingWorld;                             // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomUIName;                                      // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFrameStackBgAssetRow;

// ScriptStruct GameCore.FrameStackTransitionRow
// 0x0028 (0x0038 - 0x0010)
struct FFrameStackTransitionRow final : public FDescRowBase
{
public:
	struct FSoftObjectPath                        AssetPath;                                         // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsForceTransition;                                 // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
