#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameCore_structs.hpp"
#include "Engine_classes.hpp"
#include "PerfGear_structs.hpp"


namespace SDK
{

// Class GameCore.DataTableAssetInfoManager
// 0x0008 (0x0030 - 0x0028)
class UDataTableAssetInfoManager final : public UObject
{
public:
	class UDataTable*                             DataTableCache;                                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableAssetInfoManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableAssetInfoManager")
	}
	static class UDataTableAssetInfoManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataTableAssetInfoManager>();
	}
};
DUMPER7_ASSERTS_UDataTableAssetInfoManager;

// Class GameCore.AnimNotify_PlayParticleEffectGroup
// 0x0058 (0x0090 - 0x0038)
class alignas(0x10) UAnimNotify_PlayParticleEffectGroup final : public UAnimNotify
{
public:
	class UParticleSystemGroup*                   PSGTemplate;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0040(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x004C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0058(0x000C)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x1C];                                      // 0x0064(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Attached : 1;                                      // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0084(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_PlayParticleEffectGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_PlayParticleEffectGroup")
	}
	static class UAnimNotify_PlayParticleEffectGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayParticleEffectGroup>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_PlayParticleEffectGroup;

// Class GameCore.AppSetting
// 0x0758 (0x0780 - 0x0028)
class UAppSetting final : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAppSettingRow                         Setting;                                           // 0x0038(0x0748)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static const struct FAppSettingRow Get(); // (Final, Native, Static, Public) // @ 0x140C95790
	static const TArray<class FString> GetBuildRegionFileFolders(); // (Final, Native, Static, Public) // @ 0x140C957D0
	static const TArray<class FString> GetBuildRegionFolders(); // (Final, Native, Static, Public) // @ 0x140C95810
	static class FString GetCDNUrl(); // (Final, Native, Static, Public) // @ 0x140C95850
	static class FString GetGameBuildPlatformName(); // (Final, Native, Static, Public) // @ 0x140C958D0
	static const EGameBuildRegion GetGameBuildRegion(); // (Final, Native, Static, Public) // @ 0x140C95950
	static class FString GetGameBuildRegionFolderName(); // (Final, Native, Static, Public) // @ 0x140C95980
	static class FString GetGameBuildRegionName(); // (Final, Native, Static, Public) // @ 0x140C959C0
	static const bool IsInUseR13NFile(const struct FSoftObjectPath& Path); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x140C95A00
	static void ResetGameBuildPlatformName(); // (Final, Native, Static, Public) // @ 0x140C95AE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppSetting")
	}
	static class UAppSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppSetting>();
	}
};
DUMPER7_ASSERTS_UAppSetting;

// Class GameCore.AppSettingsExtend
// 0x0050 (0x0078 - 0x0028)
class UAppSettingsExtend final : public UObject
{
public:
	TMap<class FString, struct FAppSettingRow>    Settings;                                          // 0x0028(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppSettingsExtend")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppSettingsExtend")
	}
	static class UAppSettingsExtend* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppSettingsExtend>();
	}
};
DUMPER7_ASSERTS_UAppSettingsExtend;

// Class GameCore.AssetBaseManager
// 0x01E0 (0x0208 - 0x0028)
class UAssetBaseManager final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAssetBaseManagerSetting*               CachedSettings;                                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x1C0];                                     // 0x0048(0x01C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssetBaseManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssetBaseManager")
	}
	static class UAssetBaseManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetBaseManager>();
	}
};
DUMPER7_ASSERTS_UAssetBaseManager;

// Class GameCore.AssetBaseManagerSetting
// 0x0028 (0x0050 - 0x0028)
class UAssetBaseManagerSetting final : public UObject
{
public:
	TSoftObjectPtr<class UDataTable>              AssetRetargetTablePath;                            // 0x0028(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssetBaseManagerSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssetBaseManagerSetting")
	}
	static class UAssetBaseManagerSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetBaseManagerSetting>();
	}
};
DUMPER7_ASSERTS_UAssetBaseManagerSetting;

// Class GameCore.AssetStore
// 0x0000 (0x0028 - 0x0028)
class UAssetStore final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssetStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssetStore")
	}
	static class UAssetStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetStore>();
	}
};
DUMPER7_ASSERTS_UAssetStore;

// Class GameCore.BaseGameInstance
// 0x0030 (0x01D0 - 0x01A0)
class UBaseGameInstance : public UGameInstance
{
public:
	uint8                                         Pad_1A0[0x30];                                     // 0x01A0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseGameInstance")
	}
	static class UBaseGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseGameInstance>();
	}
};
DUMPER7_ASSERTS_UBaseGameInstance;

// Class GameCore.DataTableSystemManagerBase
// 0x0008 (0x0030 - 0x0028)
class UDataTableSystemManagerBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UDataTable* GetDataTable(); // (Final, Native, Public) // @ 0x140C98670
	class UDataTable* GetDataTableFirst(); // (Native, Public) // @ 0x140C98750
	const TArray<class FName> GetRowNames(); // (Final, Native, Public) // @ 0x140C98AD0
	class UScriptStruct* GetRowStruct(); // (Native, Public) // @ 0x140C98B10
	void HotAddRows(class UDataTable* TargetDataTable); // (Final, Native, Private) // @ 0x140C98C70
	void HotRemoveRows(class UDataTable* TargetDataTable); // (Final, Native, Private) // @ 0x140C98C70
	void HotUpdateRows(class UDataTable* TargetDataTable); // (Final, Native, Private) // @ 0x140C98C70
	void Init(); // (Native, Public) // @ 0x140C98CF0
	bool IsLoaded(); // (Native, Public) // @ 0x140C98D10
	void OnInit(); // (Native, Protected) // @ 0x140C991D0
	void OnReset(); // (Native, Protected) // @ 0x140C994F0
	void OnShutdown(); // (Native, Protected) // @ 0x140C99510
	void Reset(); // (Native, Public) // @ 0x140C99650
	void Shutdown(); // (Native, Public) // @ 0x140C99940

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableSystemManagerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableSystemManagerBase")
	}
	static class UDataTableSystemManagerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataTableSystemManagerBase>();
	}
};
DUMPER7_ASSERTS_UDataTableSystemManagerBase;

// Class GameCore.CSV2DatatableManager
// 0x0010 (0x0040 - 0x0030)
class UCSV2DatatableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CSV2DatatableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CSV2DatatableManager")
	}
	static class UCSV2DatatableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCSV2DatatableManager>();
	}
};
DUMPER7_ASSERTS_UCSV2DatatableManager;

// Class GameCore.GPSubsystemBase
// 0x0000 (0x0030 - 0x0030)
class UGPSubsystemBase : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPSubsystemBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPSubsystemBase")
	}
	static class UGPSubsystemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPSubsystemBase>();
	}
};
DUMPER7_ASSERTS_UGPSubsystemBase;

// Class GameCore.DataTableSystemImpl
// 0x0070 (0x00A0 - 0x0030)
class UDataTableSystemImpl final : public UGPSubsystemBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataTableSystemManagerBase*>    DataManagerList;                                   // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<class UClass*, class UDataTableSystemManagerBase*> DataManagerMap;                          // 0x0048(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDataTableSystemImpl* Get(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C98480
	static bool IsUseLiteTableManager(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C98DF0

	void AsyncPreloadTableManager(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C98360
	TScriptInterface<class IDataTableSystemManagerLiteInterface> GetManagerLiteInterfaceBP(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C98A30
	void OnAllLiteDataTableReset(const class FName& TableName); // (Final, Native, Protected, HasOutParams) // @ 0x140C98E20
	void OnLiteDataTablePreLoadFinishPreHandle(const struct FDataTableUseSceneValue& UseSceneValue, int32 LoadedNum); // (Final, Native, Protected, HasOutParams) // @ 0x140C991F0
	void OnLiteDataTableReady(const class FName& TableName, float Progress); // (Final, Native, Protected, HasOutParams) // @ 0x140C992C0
	void OnLiteDataTableReload(const class FName& TableName); // (Final, Native, Protected, HasOutParams) // @ 0x140C99390
	void OnLiteDataTableReset(const class FName& TableName); // (Final, Native, Protected, HasOutParams) // @ 0x140C99420
	void OnPostRegisterDataTableManager(); // (Final, Native, Protected) // @ 0x140C994B0
	void OnRegisterDataTableManager(); // (Final, Native, Protected) // @ 0x140C994D0
	void RegisterDataTableManager(); // (Final, Native, Protected) // @ 0x140C99630

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableSystemImpl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableSystemImpl")
	}
	static class UDataTableSystemImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataTableSystemImpl>();
	}
};
DUMPER7_ASSERTS_UDataTableSystemImpl;

// Class GameCore.DataTableSystemImplDS
// 0x0000 (0x0030 - 0x0030)
class UDataTableSystemImplDS final : public UEngineSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableSystemImplDS")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableSystemImplDS")
	}
	static class UDataTableSystemImplDS* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataTableSystemImplDS>();
	}
};
DUMPER7_ASSERTS_UDataTableSystemImplDS;

// Class GameCore.DataTableSystemInterface
// 0x0000 (0x0000 - 0x0000)
class IDataTableSystemInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableSystemInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableSystemInterface")
	}
	static class IDataTableSystemInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDataTableSystemInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDataTableSystemInterface;

// Class GameCore.DataTableSystemManagerLite
// 0x0220 (0x0250 - 0x0030)
class UDataTableSystemManagerLite final : public UGPSubsystemBase
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTableAssetInfoManager*             DataTableAssetInfo;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const struct FDataTableUseSceneValue& UseSceneValue, int32 LoadedNum)> OnPreloadFinishPreHandleDelegate; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FDataTableUseSceneValue& UseSceneValue, int32 LoadedNum)> OnPreloadFinishDelegate; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FName& TableName, float Progress)> OnTableReadyDelegate; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FName& TableName)> OnTableResetDelegate;               // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FName& TableName)> OnTableReloadDelegate;              // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnInitResourcesCallBack;                           // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBeginLoadDataTableCallBack;                      // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UDataTable*>        DataTableReferenceMap;                             // 0x00F0(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x110];                                    // 0x0140(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UDataTableSystemManagerLite* Get(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C98540
	static class FString GetTableAssetGuid(class UDataTable* Table); // (Final, Native, Static, Public) // @ 0x140C98B40

	void AsyncPreloadAll(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C98340
	void ForceReloadDataTable(const class FName& TableName); // (Final, Native, Public, HasOutParams) // @ 0x140C983F0
	class UDataTable* GetDataTable(const class FName& TableName); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x140C986A0
	class FString GetHotfixMD5(const class FName& TableName); // (Final, Native, Public, HasOutParams) // @ 0x140C98860
	class FName GetKeyNameFromCSVName(const class FName& CSVName); // (Final, Native, Public, HasOutParams) // @ 0x140C98950
	TScriptInterface<class IDataTableSystemManagerLiteInterface> GetLiteInterface(); // (Final, Native, Public) // @ 0x140C989F0
	bool IsPreloadFinish(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C98D40
	void OnAsyncDataTableLoad(const struct FSoftObjectPath& DataTablePath, class FName TableName, bool bAsync, uint64 InBatachID); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x140C98EB0
	void OnDataTableLoad(const struct FSoftObjectPath& DataTablePath, class FName TableName, bool bAsync, uint64 InBatachID); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x140C99040
	bool PreloadTable(const class FName& TableName, TDelegate<void(const class UDataTable* DataTable)> Delegate); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x140C99530
	void ResetTable(const class FName& TableName); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x140C99700
	void SetHotfixMD5(const class FName& TableName, const class FString& MD5); // (Final, Native, Public, HasOutParams) // @ 0x140C99820
	void SyncPreloadAll(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C99960
	void UnloadTable(const class FName& TableName); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x140C99A10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableSystemManagerLite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableSystemManagerLite")
	}
	static class UDataTableSystemManagerLite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataTableSystemManagerLite>();
	}
};
DUMPER7_ASSERTS_UDataTableSystemManagerLite;

// Class GameCore.DataTableSystemManagerLiteInterface
// 0x0000 (0x0000 - 0x0000)
class IDataTableSystemManagerLiteInterface final
{
public:
	class UDataTable* GetDataTable(const class FName& TableName); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x140C985C0
	void ResetTable(const class FName& TableName); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x140C99670
	void UnloadTable(const class FName& TableName); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x140C99980

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableSystemManagerLiteInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableSystemManagerLiteInterface")
	}
	static class IDataTableSystemManagerLiteInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDataTableSystemManagerLiteInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDataTableSystemManagerLiteInterface;

// Class GameCore.DataTableSystemPlayerImpl
// 0x00A8 (0x00D8 - 0x0030)
class UDataTableSystemPlayerImpl final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UDataTable*>        TableNameAndHash2DataTable;                        // 0x0088(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataTableSystemPlayerImpl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataTableSystemPlayerImpl")
	}
	static class UDataTableSystemPlayerImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataTableSystemPlayerImpl>();
	}
};
DUMPER7_ASSERTS_UDataTableSystemPlayerImpl;

// Class GameCore.DeviceSetting
// 0x0000 (0x0028 - 0x0028)
class UDeviceSetting final : public UObject
{
public:
	static void ChangeBGMSoundEffectVolume(int32 Volume); // (Final, Native, Static, Public) // @ 0x140C98380
	static EDeviceLevel GetDeviceLevel(); // (Final, Native, Static, Public) // @ 0x140C98780
	static class FString GetDeviceModel(); // (Final, Native, Static, Public) // @ 0x140C987B0
	static bool GetDisturbingMode(); // (Final, Native, Static, Public) // @ 0x140C98830
	static uint64 GetMemoryUsedFast(); // (Final, Native, Static, Public) // @ 0x140C98A70
	static float GetMemoryUsedFastMB(); // (Final, Native, Static, Public) // @ 0x140C98AA0
	static uint64 GetTotalPhysicalMemory(); // (Final, Native, Static, Public) // @ 0x140C98C10
	static uint64 GetUsedPhysicalMemory(); // (Final, Native, Static, Public) // @ 0x140C98C40
	static bool IsRunningInSimulator(bool bNewCheck); // (Final, Native, Static, Public) // @ 0x140C98D70
	static bool SetDisturbingMode(bool bNoDisturbing); // (Final, Native, Static, Public) // @ 0x140C997A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeviceSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeviceSetting")
	}
	static class UDeviceSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeviceSetting>();
	}
};
DUMPER7_ASSERTS_UDeviceSetting;

// Class GameCore.EditorVersionUtils
// 0x0000 (0x0028 - 0x0028)
class UEditorVersionUtils final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditorVersionUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditorVersionUtils")
	}
	static class UEditorVersionUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorVersionUtils>();
	}
};
DUMPER7_ASSERTS_UEditorVersionUtils;

// Class GameCore.GameResVersion
// 0x0038 (0x0060 - 0x0028)
class UGameResVersion final : public UObject
{
public:
	class FString                                 GameResVersionStr;                                 // 0x0028(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 GameResNewVersionStr;                              // 0x0038(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GameResVersionUpdateStartCount;                    // 0x0048(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         GameResVersionUpdateSucCount;                      // 0x004C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 PSOVersionStr;                                     // 0x0050(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static int32 GetGameResVersionUpdateStartCount(); // (Final, Native, Static, Public) // @ 0x140C9CED0
	static int32 GetGameResVersionUpdateSucCount(); // (Final, Native, Static, Public) // @ 0x140C9CF30
	static class FString GetResNewVersion(); // (Final, Native, Static, Public) // @ 0x140C9D5B0
	static class FString GetResVersion(bool bNeedReloadConfig); // (Final, Native, Static, Public) // @ 0x140C9D6B0
	static bool PSOVersionNeedUpdate(); // (Final, Native, Static, Public) // @ 0x140C9E000
	static void SetGameResVersionUpdateStartCount(int32 Count); // (Final, Native, Static, Public) // @ 0x140C9E8A0
	static void SetGameResVersionUpdateSucCount(int32 Count); // (Final, Native, Static, Public) // @ 0x140C9E980
	static void SetResNewVersion(const class FString& Version); // (Final, Native, Static, Public) // @ 0x140C9EBF0
	static void SetResVersion(const class FString& Version); // (Final, Native, Static, Public) // @ 0x140C9EE10
	static void UpdatePSOVersion(); // (Final, Native, Static, Public) // @ 0x140C9F3F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameResVersion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameResVersion")
	}
	static class UGameResVersion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameResVersion>();
	}
};
DUMPER7_ASSERTS_UGameResVersion;

// Class GameCore.GameVersionUtils
// 0x00F0 (0x0118 - 0x0028)
class UGameVersionUtils final : public UObject
{
public:
	class FString                                 GameVersionStr;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WeGameVersionStr;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameAppVersionStr;                                 // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameResVersionStr;                                 // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EResourceMSVersion                            GameResourceMSVersionStr;                          // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SVNRevision;                                       // 0x006C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CIPipeline;                                        // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CIBuildNum;                                        // 0x0080(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CIBuildTime;                                       // 0x0090(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SyncFullTime;                                      // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameBuildConfiguration                       GameBuildConfiguration;                            // 0x00B0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameBuildRegion                              GameBuildRegion;                                   // 0x00B1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTemporaryRegionFirst;                          // 0x00B2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         LatestGameCommits;                                 // 0x00B8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         LatestEngineCommits;                               // 0x00C8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         OpenWorldBuildVersions;                            // 0x00D8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bOpenMicrocosm;                                    // 0x00E8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableShaderCompile;                             // 0x00E9(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableLog;                                       // 0x00EA(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDownloadBaseDlcOnly;                              // 0x00EB(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportLitePackage;                               // 0x00EC(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LanguageInAPK;                                     // 0x00F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ClearFilePaths;                                    // 0x0100(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool CheckAppVersionChange(); // (Final, Native, Static, Public) // @ 0x140C9C630
	static class FString GetAppProductVersion(); // (Final, Native, Static, Public) // @ 0x140C9C8A0
	static class FString GetAppVersion(); // (Final, Native, Static, Public) // @ 0x140C9C920
	static class FString GetCIBuildNum(); // (Final, Native, Static, Public) // @ 0x140C9C9A0
	static class FString GetCIBuildTime(); // (Final, Native, Static, Public) // @ 0x140C9CA20
	static class FString GetCIPipeline(); // (Final, Native, Static, Public) // @ 0x140C9CAA0
	static TArray<class FString> GetClearFilePaths(); // (Final, Native, Static, Public) // @ 0x140C9CB20
	static class FString GetConfigVersion(const class FString& ConfigKey); // (Final, Native, Static, Public) // @ 0x140C9CBF0
	static class FString GetEditorBranchID(); // (Final, Native, Static, Public) // @ 0x140C9CD40
	static class FString GetEditorVersion(); // (Final, Native, Static, Public) // @ 0x140C9CDC0
	static EGameBuildConfiguration GetGameBuildConfiguration(); // (Final, Native, Static, Public) // @ 0x140C9CE40
	static EGameBuildRegion GetGameBuildRegion(); // (Final, Native, Static, Public) // @ 0x140C9CE70
	static EGameChannel GetGameChannel(); // (Final, Native, Static, Public) // @ 0x140C9CEA0
	static int32 GetGameResVersionUpdateStartCount(); // (Final, Native, Static, Public) // @ 0x140C9CF00
	static int32 GetGameResVersionUpdateSucCount(); // (Final, Native, Static, Public) // @ 0x140C9CF60
	static class FString GetLanguageInAPK(); // (Final, Native, Static, Public) // @ 0x140C9D010
	static TArray<class FString> GetLatestEngineCommits(); // (Final, Native, Static, Public) // @ 0x140C9D090
	static TArray<class FString> GetLatestGameCommits(); // (Final, Native, Static, Public) // @ 0x140C9D160
	static int32 GetLauncherChannel(); // (Final, Native, Static, Public) // @ 0x140C9D230
	static class FString GetLauncherParamsByKey(const class FString& Key); // (Final, Native, Static, Public) // @ 0x140C9D260
	static TArray<class FString> GetOpenWorldBuildVersions(); // (Final, Native, Static, Public) // @ 0x140C9D3D0
	static class FString GetResNewVersion(); // (Final, Native, Static, Public) // @ 0x140C9D630
	static EResourceMSVersion GetResourceMSVersion(); // (Final, Native, Static, Public) // @ 0x140C9D800
	static class FString GetResVersion(); // (Final, Native, Static, Public) // @ 0x140C9D780
	static int32 GetSVNRevision(); // (Final, Native, Static, Public) // @ 0x140C9D830
	static class FString GetSyncFullTime(); // (Final, Native, Static, Public) // @ 0x140C9D860
	static class FString GetUEBuildConfiguration(); // (Final, Native, Static, Public) // @ 0x140C9D8E0
	static class FString GetUEBuildTargetType(); // (Final, Native, Static, Public) // @ 0x140C9D960
	static class FString GetVersion(); // (Final, Native, Static, Public) // @ 0x140C9D9E0
	static TArray<int32> GetVersionNums(); // (Final, Native, Static, Public) // @ 0x140C9DA60
	static class FString GetWeGameVersion(); // (Final, Native, Static, Public) // @ 0x140C9DB60
	static bool IsAndroidAppBundle(); // (Final, Native, Static, Public) // @ 0x140C9DBE0
	static bool IsDisableLog(); // (Final, Native, Static, Public) // @ 0x140C9DC10
	static bool IsDisableShaderCompile(); // (Final, Native, Static, Public) // @ 0x140C9DC40
	static bool IsDownloadBaseDlcOnly(); // (Final, Native, Static, Public) // @ 0x140C9DC70
	static bool IsInReview(); // (Final, Native, Static, Public) // @ 0x140C9DCA0
	static bool IsOpenMicrocosm(); // (Final, Native, Static, Public) // @ 0x140C9DCD0
	static bool IsPreRelease(); // (Final, Native, Static, Public) // @ 0x140C9DD00
	static bool IsResVersionLegal(const class FString& AppVersion, const class FString& ResVersion); // (Final, Native, Static, Public) // @ 0x140C9DD30
	static bool IsShipping(); // (Final, Native, Static, Public) // @ 0x140C9DF40
	static bool IsSupportLitePackage(); // (Final, Native, Static, Public) // @ 0x140C9DF70
	static bool IsUseTemporaryRegionFirst(); // (Final, Native, Static, Public) // @ 0x140C9DFA0
	static bool IsVersionUsable(); // (Final, Native, Static, Public) // @ 0x140C9DFD0
	static void RemoveLauncherParamsByKey(const class FString& Key); // (Final, Native, Static, Public) // @ 0x140C9E600
	static void ResetResVersion(); // (Final, Native, Static, Public) // @ 0x140C9E780
	static void SetDisableLog(bool IsDisable); // (Final, Native, Static, Public) // @ 0x140C9E7A0
	static void SetDisableShaderCompile(bool IsDisable); // (Final, Native, Static, Public) // @ 0x140C9E820
	static void SetGameResVersionUpdateStartCount(int32 Count); // (Final, Native, Static, Public) // @ 0x140C9E910
	static void SetGameResVersionUpdateSucCount(int32 Count); // (Final, Native, Static, Public) // @ 0x140C9E9F0
	static void SetLauncherQueryInfo(const class FString& QueryInfo); // (Final, Native, Static, Public) // @ 0x140C9EA60
	static void SetOpenMicrocosm(bool IsOpen); // (Final, Native, Static, Public) // @ 0x140C9EB70
	static void SetResNewVersion(const class FString& Version); // (Final, Native, Static, Public) // @ 0x140C9ED00
	static void SetResVersion(const class FString& Version); // (Final, Native, Static, Public) // @ 0x140C9EF20
	static void UpdateStringTableVersion(); // (Final, Native, Static, Public) // @ 0x140C9F410
	static EGameVersionCompareResult VersionCompare(const class FString& OriginVersion, const class FString& TargetVersion); // (Final, Native, Static, Public) // @ 0x140C9F430

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameVersionUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameVersionUtils")
	}
	static class UGameVersionUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameVersionUtils>();
	}
};
DUMPER7_ASSERTS_UGameVersionUtils;

// Class GameCore.GameVersionBlueprintTools
// 0x0000 (0x0028 - 0x0028)
class UGameVersionBlueprintTools final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetOpenWorldRuntimeBuildVersion(const class FString& InWorldName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C9D4A0
	static class FString GetWeGameVersion(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C9DAE0
	static bool IsShipping(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C9DF10

	class FString GetGameVersion(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C9CF90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameVersionBlueprintTools")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameVersionBlueprintTools")
	}
	static class UGameVersionBlueprintTools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameVersionBlueprintTools>();
	}
};
DUMPER7_ASSERTS_UGameVersionBlueprintTools;

// Class GameCore.WorldSingletonCollection
// 0x0050 (0x0080 - 0x0030)
class UWorldSingletonCollection final : public UWorldSubsystem
{
public:
	TMap<TSubclassOf<class UObject>, class UObject*> InstMap;                                        // 0x0030(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WorldSingletonCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorldSingletonCollection")
	}
	static class UWorldSingletonCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldSingletonCollection>();
	}
};
DUMPER7_ASSERTS_UWorldSingletonCollection;

// Class GameCore.GameInstanceSingletonCollection
// 0x0050 (0x0080 - 0x0030)
class UGameInstanceSingletonCollection final : public UGameInstanceSubsystem
{
public:
	TMap<TSubclassOf<class UObject>, class UObject*> InstMap;                                        // 0x0030(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameInstanceSingletonCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameInstanceSingletonCollection")
	}
	static class UGameInstanceSingletonCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameInstanceSingletonCollection>();
	}
};
DUMPER7_ASSERTS_UGameInstanceSingletonCollection;

// Class GameCore.EngineSingletonCollection
// 0x0050 (0x0080 - 0x0030)
class UEngineSingletonCollection final : public UEngineSubsystem
{
public:
	TMap<TSubclassOf<class UObject>, class UObject*> InstMap;                                        // 0x0030(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EngineSingletonCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EngineSingletonCollection")
	}
	static class UEngineSingletonCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEngineSingletonCollection>();
	}
};
DUMPER7_ASSERTS_UEngineSingletonCollection;

// Class GameCore.WorldSingletonHelper
// 0x0008 (0x0030 - 0x0028)
class UWorldSingletonHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WorldSingletonHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorldSingletonHelper")
	}
	static class UWorldSingletonHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldSingletonHelper>();
	}
};
DUMPER7_ASSERTS_UWorldSingletonHelper;

// Class GameCore.GameInstanceSingletonHelper
// 0x0008 (0x0030 - 0x0028)
class UGameInstanceSingletonHelper : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameInstanceSingletonHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameInstanceSingletonHelper")
	}
	static class UGameInstanceSingletonHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameInstanceSingletonHelper>();
	}
};
DUMPER7_ASSERTS_UGameInstanceSingletonHelper;

// Class GameCore.EngineSingletonHelper
// 0x0008 (0x0030 - 0x0028)
class UEngineSingletonHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EngineSingletonHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EngineSingletonHelper")
	}
	static class UEngineSingletonHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEngineSingletonHelper>();
	}
};
DUMPER7_ASSERTS_UEngineSingletonHelper;

// Class GameCore.GPAIUtils
// 0x0000 (0x0028 - 0x0028)
class UGPAIUtils final : public UBlueprintFunctionLibrary
{
public:
	static void SetTickPrerequisite(class UActorComponent* A, class UActorComponent* B); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C9F030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAIUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAIUtils")
	}
	static class UGPAIUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAIUtils>();
	}
};
DUMPER7_ASSERTS_UGPAIUtils;

// Class GameCore.GPBlueprintUtils
// 0x0000 (0x0028 - 0x0028)
class UGPBlueprintUtils final : public UBlueprintFunctionLibrary
{
public:
	static bool CalcBoundingFromViewInfo(class USceneCaptureComponent2D* RenderComponent, const struct FVector& Origin, const struct FVector& Extend, struct FBox2D* BoxOut, TArray<struct FVector>* Points, TArray<struct FVector2D>* Points2D); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x140C9C110
	static bool CalcBoundingFromViewport(const class UObject* WorldContextObject, const struct FVector& Origin, const struct FVector& Extend, struct FBox2D* BoxOut, TArray<struct FVector>* Points, TArray<struct FVector2D>* Points2D); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x140C9C3A0
	static bool ConvertTermText(const class FText& InText, class FText* OutText); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140C9C660
	static bool CovertSpecialString(class FString* str); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140C9C7D0
	static class UGameInstance* GetCurrentGameInstance(const class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140C9CCC0
	static class FText ReadPropertyText(class FName* TableName, class FName* PropertyName, class FName* KeyName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140C9E030
	static bool ReadTermText(const class FString& InTermName, const class FString& InKey, class FText* OutText); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140C9E1D0
	static float RebaseOntoLocalOrigin_Z(float Z, const class UObject* WorldContextObject); // (Final, Native, Static, Public) // @ 0x140C9E390
	static float RebaseOntoZeroOrigin_Z(float Z, const class UObject* WorldContextObject); // (Final, Native, Static, Public) // @ 0x140C9E460
	static bool RegularConvertSpecialString(class FString* str); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140C9E530
	static void RerunConstructionScripts(class AActor* Actor); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C9E710
	static bool ShowMessageDialog(const class FText& Message, const class FText& Title); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140C9F0E0
	static void TrySetActorLabelInEditor(class AActor* Actor, const class FString& Label); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C9F250
	static void TrySetFolderPathInEditor(class AActor* Actor, class FName FolderName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140C9F340

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBlueprintUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBlueprintUtils")
	}
	static class UGPBlueprintUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBlueprintUtils>();
	}
};
DUMPER7_ASSERTS_UGPBlueprintUtils;

// Class GameCore.GPGConfigUtils
// 0x0000 (0x0028 - 0x0028)
class UGPGConfigUtils final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetArray(const class FString& Section, const class FString& Key, TArray<class FString>* out_Arr, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA32A0
	static bool GetBool(const class FString& Section, const class FString& Key, bool* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA3530
	static bool GetColor(const class FString& Section, const class FString& Key, struct FColor* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140CA3730
	static bool GetFloat(const class FString& Section, const class FString& Key, float* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA3B50
	static bool GetInt(const class FString& Section, const class FString& Key, int32* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA3ED0
	static bool GetRotator(const class FString& Section, const class FString& Key, struct FRotator* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140CA4310
	static int32 GetSingleLineArray(const class FString& Section, const class FString& Key, TArray<class FString>* out_Arr, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA4590
	static bool GetString(const class FString& Section, const class FString& Key, class FString* OutResult, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA4820
	static bool GetVector(const class FString& Section, const class FString& Key, struct FVector* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140CA4EF0
	static bool GetVector2D(const class FString& Section, const class FString& Key, struct FVector2D* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140CA4AE0
	static bool GetVector4(const class FString& Section, const class FString& Key, struct FVector4* Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140CA4CE0
	static void SetArray(const class FString& Section, const class FString& Key, const TArray<class FString>& Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA56B0
	static void SetBool(const class FString& Section, const class FString& Key, bool Value, const class FString& IniName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA5930
	static void SetColor(const class FString& Section, const class FString& Key, const struct FColor& Value, const class FString& IniName); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140CA5B20
	static void SetFloat(const class FString& Section, const class FString& Key, float Value, const class FString& IniName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA5D00
	static void SetInt(const class FString& Section, const class FString& Key, int32 Value, const class FString& IniName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA5EE0
	static void SetRotator(const class FString& Section, const class FString& Key, const struct FRotator& Value, const class FString& IniName); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140CA60C0
	static void SetSingleLineArray(const class FString& Section, const class FString& Key, const TArray<class FString>& In_Arr, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CA62B0
	static void SetString(const class FString& Section, const class FString& Key, const class FString& InValue, const class FString& IniName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA6530
	static void SetVector(const class FString& Section, const class FString& Key, const struct FVector& Value, const class FString& IniName); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140CA6EE0
	static void SetVector2D(const class FString& Section, const class FString& Key, const struct FVector2D& Value, const class FString& IniName); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140CA6B00
	static void SetVector4(const class FString& Section, const class FString& Key, const struct FVector4& Value, const class FString& IniName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140CA6CE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPGConfigUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPGConfigUtils")
	}
	static class UGPGConfigUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPGConfigUtils>();
	}
};
DUMPER7_ASSERTS_UGPGConfigUtils;

// Class GameCore.GPNetModeUtils
// 0x0000 (0x0028 - 0x0028)
class UGPNetModeUtils final : public UBlueprintFunctionLibrary
{
public:
	static class APlayerController* GetLocalPlayerController(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA4250
	static bool HasLocalPlayer(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA5270
	static bool IsClient(const class UObject* WorldContextObject, bool bIncludeStandalone); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CA5380
	static bool IsServer(const class UObject* WorldContextObject, bool bIncludeStandalone); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CA5440
	static bool IsStandalone(const class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CA5500

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPNetModeUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPNetModeUtils")
	}
	static class UGPNetModeUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPNetModeUtils>();
	}
};
DUMPER7_ASSERTS_UGPNetModeUtils;

// Class GameCore.WorldSubsystemExample
// 0x0000 (0x0030 - 0x0030)
class UWorldSubsystemExample final : public UWorldSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WorldSubsystemExample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorldSubsystemExample")
	}
	static class UWorldSubsystemExample* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldSubsystemExample>();
	}
};
DUMPER7_ASSERTS_UWorldSubsystemExample;

// Class GameCore.GameInstanceSubsystemExample
// 0x0000 (0x0030 - 0x0030)
class UGameInstanceSubsystemExample final : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameInstanceSubsystemExample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameInstanceSubsystemExample")
	}
	static class UGameInstanceSubsystemExample* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameInstanceSubsystemExample>();
	}
};
DUMPER7_ASSERTS_UGameInstanceSubsystemExample;

// Class GameCore.LevelSubsystem
// 0x0000 (0x0370 - 0x0370)
class ALevelSubsystem : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelSubsystem")
	}
	static class ALevelSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelSubsystem>();
	}
};
DUMPER7_ASSERTS_ALevelSubsystem;

// Class GameCore.LevelSubsystemExample
// 0x0000 (0x0370 - 0x0370)
class ALevelSubsystemExample final : public ALevelSubsystem
{
public:
	static class ALevelSubsystemExample* GetLevelSubsystemExample(const class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CA4190

	void TestLevelSubsystem(); // (Final, Native, Public, BlueprintCallable) // @ 0x140CA7190

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelSubsystemExample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelSubsystemExample")
	}
	static class ALevelSubsystemExample* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelSubsystemExample>();
	}
};
DUMPER7_ASSERTS_ALevelSubsystemExample;

// Class GameCore.NormalActorSingletonExample
// 0x0010 (0x0380 - 0x0370)
class ANormalActorSingletonExample final : public AActor
{
public:
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NormalActorSingletonExample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NormalActorSingletonExample")
	}
	static class ANormalActorSingletonExample* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANormalActorSingletonExample>();
	}
};
DUMPER7_ASSERTS_ANormalActorSingletonExample;

// Class GameCore.NormalWorldObjectSingletonExample
// 0x0010 (0x0038 - 0x0028)
class UNormalWorldObjectSingletonExample final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NormalWorldObjectSingletonExample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NormalWorldObjectSingletonExample")
	}
	static class UNormalWorldObjectSingletonExample* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNormalWorldObjectSingletonExample>();
	}
};
DUMPER7_ASSERTS_UNormalWorldObjectSingletonExample;

// Class GameCore.NormalGameInstanceObjectSingletonExample
// 0x0000 (0x0028 - 0x0028)
class UNormalGameInstanceObjectSingletonExample final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NormalGameInstanceObjectSingletonExample")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NormalGameInstanceObjectSingletonExample")
	}
	static class UNormalGameInstanceObjectSingletonExample* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNormalGameInstanceObjectSingletonExample>();
	}
};
DUMPER7_ASSERTS_UNormalGameInstanceObjectSingletonExample;

// Class GameCore.GPSingletonUtils
// 0x0000 (0x0028 - 0x0028)
class UGPSingletonUtils final : public UBlueprintFunctionLibrary
{
public:
	static class UObject* GetDefaultSingleton(const class UObject* WorldContextObject, class UClass* Class_0, bool bForceCreate); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA3950
	static class UObject* GetEngineSingleton(class UClass* Class_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA3A50
	static class UEngineSubsystem* GetEngineSubsystem(class UClass* Class_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA3AD0
	static class UObject* GetGameInstanceSingleton(const class UObject* WorldContextObject, class UClass* Class_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA3D50
	static class UGameInstanceSubsystem* GetGameInstanceSubsystem(const class UObject* GameContextObject, class UClass* Class_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA3E10
	static class ALevelSubsystem* GetLevelSubsystem(const class UObject* WorldContextObject, class UClass* Class_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA40D0
	static class UObject* GetWorldSingleton(const class UObject* WorldContextObject, class UClass* Class_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA50F0
	static class UWorldSubsystem* GetWorldSubsystem(const class UObject* WorldContextObject, class UClass* Class_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140CA51B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPSingletonUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPSingletonUtils")
	}
	static class UGPSingletonUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPSingletonUtils>();
	}
};
DUMPER7_ASSERTS_UGPSingletonUtils;

// Class GameCore.GPSubsystemManagerImpl
// 0x0020 (0x0050 - 0x0030)
class UGPSubsystemManagerImpl : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPSubsystemManagerImpl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPSubsystemManagerImpl")
	}
	static class UGPSubsystemManagerImpl* GetDefaultObj()
	{
