#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameletJsEnv

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class GameletJsEnv.GameletDynamicDelegateProxy
// 0x0048 (0x0070 - 0x0028)
class UGameletDynamicDelegateProxy final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Fire(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletDynamicDelegateProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletDynamicDelegateProxy")
	}
	static class UGameletDynamicDelegateProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletDynamicDelegateProxy>();
	}
};
DUMPER7_ASSERTS_UGameletDynamicDelegateProxy;

// Class GameletJsEnv.GameletJSGeneratedClass
// 0x0060 (0x03C8 - 0x0368)
class UGameletJSGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	uint8                                         Pad_368[0x60];                                     // 0x0368(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletJSGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletJSGeneratedClass")
	}
	static class UGameletJSGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletJSGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UGameletJSGeneratedClass;

// Class GameletJsEnv.GameletExtensionMethods
// 0x0000 (0x0028 - 0x0028)
class UGameletExtensionMethods final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletExtensionMethods")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletExtensionMethods")
	}
	static class UGameletExtensionMethods* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletExtensionMethods>();
	}
};
DUMPER7_ASSERTS_UGameletExtensionMethods;

// Class GameletJsEnv.GameletJSAnimGeneratedClass
// 0x0060 (0x05D8 - 0x0578)
class UGameletJSAnimGeneratedClass final : public UAnimBlueprintGeneratedClass
{
public:
	uint8                                         Pad_578[0x60];                                     // 0x0578(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletJSAnimGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletJSAnimGeneratedClass")
	}
	static class UGameletJSAnimGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletJSAnimGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UGameletJSAnimGeneratedClass;

// Class GameletJsEnv.GameletJSGeneratedFunction
// 0x0060 (0x0148 - 0x00E8)
class UGameletJSGeneratedFunction final : public UFunction
{
public:
	uint8                                         Pad_E8[0x48];                                      // 0x00E8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UFunction*                              Original;                                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0x10];                                     // 0x0138(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletJSGeneratedFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletJSGeneratedFunction")
	}
	static class UGameletJSGeneratedFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletJSGeneratedFunction>();
	}
};
DUMPER7_ASSERTS_UGameletJSGeneratedFunction;

// Class GameletJsEnv.GameletJSWidgetGeneratedClass
// 0x0060 (0x0420 - 0x03C0)
class UGameletJSWidgetGeneratedClass final : public UWidgetBlueprintGeneratedClass
{
public:
	uint8                                         Pad_3C0[0x60];                                     // 0x03C0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletJSWidgetGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletJSWidgetGeneratedClass")
	}
	static class UGameletJSWidgetGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletJSWidgetGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UGameletJSWidgetGeneratedClass;

// Class GameletJsEnv.GameletTypeScriptBlueprint
// 0x0000 (0x00A0 - 0x00A0)
class UGameletTypeScriptBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletTypeScriptBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletTypeScriptBlueprint")
	}
	static class UGameletTypeScriptBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletTypeScriptBlueprint>();
	}
};
DUMPER7_ASSERTS_UGameletTypeScriptBlueprint;

// Class GameletJsEnv.GameletTypeScriptGeneratedClass
// 0x00A0 (0x0408 - 0x0368)
class UGameletTypeScriptGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	uint8                                         Pad_368[0x99];                                     // 0x0368(0x0099)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          HasConstructor;                                    // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletTypeScriptGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletTypeScriptGeneratedClass")
	}
	static class UGameletTypeScriptGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameletTypeScriptGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UGameletTypeScriptGeneratedClass;

// Class GameletJsEnv.GameletTypeScriptObject
// 0x0000 (0x0000 - 0x0000)
class IGameletTypeScriptObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameletTypeScriptObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameletTypeScriptObject")
	}
	static class IGameletTypeScriptObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameletTypeScriptObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGameletTypeScriptObject;

}

