#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeneKit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GeneKit.EPositionSnapArrangeType
// NumValues: 0x000A
enum class EPositionSnapArrangeType : uint8
{
	TopLeft                                  = 0,
	TopCenter                                = 1,
	TopRight                                 = 2,
	MiddleLeft                               = 3,
	MiddleCenter                             = 4,
	MiddleRight                              = 5,
	BottomLeft                               = 6,
	BottomCenter                             = 7,
	BottomRight                              = 8,
	EPositionSnapArrangeType_MAX             = 9,
};

// Enum GeneKit.EGeneKitMaterialType
// NumValues: 0x0002
enum class EGeneKitMaterialType : uint8
{
	Wood                                     = 0,
	EGeneKitMaterialType_MAX                 = 1,
};

// Enum GeneKit.EGeneKitConnectType
// NumValues: 0x0004
enum class EGeneKitConnectType : uint8
{
	Constant                                 = 0,
	Sigle                                    = 1,
	Combined                                 = 2,
	EGeneKitConnectType_MAX                  = 3,
};

// Enum GeneKit.EGeneKitRotateType
// NumValues: 0x0005
enum class EGeneKitRotateType : uint8
{
	CannotRotate                             = 0,
	HorizontalRotate                         = 1,
	VerticalRotate                           = 2,
	FreeRotate                               = 3,
	EGeneKitRotateType_MAX                   = 4,
};

// Enum GeneKit.EGeneKitSnapType
// NumValues: 0x0005
enum class EGeneKitSnapType : uint8
{
	Unknow                                   = 0,
	GripSnap                                 = 1,
	AnchorSnap                               = 2,
	SocketPluginSnap                         = 3,
	EGeneKitSnapType_MAX                     = 4,
};

// Enum GeneKit.EGeneKitPrefabType
// NumValues: 0x0004
enum class EGeneKitPrefabType : uint8
{
	Unknown                                  = 0,
	Atomic                                   = 1,
	Combined                                 = 2,
	EGeneKitPrefabType_MAX                   = 3,
};

// Enum GeneKit.EGeneKitAnchorType
// NumValues: 0x0004
enum class EGeneKitAnchorType : uint8
{
	Unknown                                  = 0,
	Socket                                   = 1,
	Plugin                                   = 2,
	EGeneKitAnchorType_MAX                   = 3,
};

// ScriptStruct GeneKit.GeneKitAnchorData
// 0x0050 (0x0050 - 0x0000)
struct FGeneKitAnchorData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        AnchorDataConnectId;                               // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SocketOrPluginTag;                                 // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                PivotOffset;                                       // 0x0018(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRotator>                       Rotations;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneKitAnchorData;

// ScriptStruct GeneKit.GeneKitPrefabInfo
// 0x0030 (0x0030 - 0x0000)
struct FGeneKitPrefabInfo final
{
public:
	class FName                                   GeneKitName;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 GeneKitActorPrefabs;                               // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneKitPrefabInfo;

// ScriptStruct GeneKit.GeneKitSocketPluginBind
// 0x0020 (0x0020 - 0x0000)
struct FGeneKitSocketPluginBind final
{
public:
	class FName                                   SocketTag;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           CanBindPluginTags;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneKitSocketPluginBind;

// ScriptStruct GeneKit.GeneKitPluginTag
// 0x0014 (0x0014 - 0x0000)
struct FGeneKitPluginTag final
{
public:
	class FName                                   PluginTag;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PluginTagDes;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneKitPluginTag;

// ScriptStruct GeneKit.GeneKitSocketTag
// 0x0014 (0x0014 - 0x0000)
struct FGeneKitSocketTag final
{
public:
	class FName                                   SocketTag;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketTagDes;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneKitSocketTag;

}

