#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeneBatch

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GeneBatch.EGeneAtlasObjectiveType
// NumValues: 0x0006
enum class EGeneAtlasObjectiveType : uint64
{
	TotalAtlasNum                            = 0,
	TotalAtlasNetResolution                  = 1,
	AllObjectiveNum                          = 2,
	TotalAtlasResolution                     = 18446744073709551615,
	TotalDrawSectionNum                      = 18446744073709551615,
	EGeneAtlasObjectiveType_MAX              = 3,
};

// Enum GeneBatch.EGeneBatchObjectiveType
// NumValues: 0x0007
enum class EGeneBatchObjectiveType : uint64
{
	TotalMeshVertexCount                     = 0,
	TotalDrawCallNum                         = 1,
	TotalDrawInstancingNum                   = 2,
	TotalBoundingBoxVolume                   = 3,
	AllObjectiveNum                          = 4,
	TotalAtlasResolution                     = 18446744073709551615,
	EGeneBatchObjectiveType_MAX              = 5,
};

// Enum GeneBatch.EGeneBatchWhyNotBatchDetailType
// NumValues: 0x0010
enum class EGeneBatchWhyNotBatchDetailType : uint8
{
	Batchable                                = 0,
	NumericDataCount                         = 1,
	AtlasResolution                          = 2,
	RegionGroupCount                         = 3,
	SourceMaterialCount                      = 4,
	AtlasMaterial                            = 5,
	MergeMaterialKey                         = 6,
	ISMCluster                               = 7,
	ComponentMergeKey                        = 8,
	MeshMergeKey                             = 9,
	ComponentKey                             = 10,
	VertexOrBounds                           = 11,
	Root                                     = 12,
	POI                                      = 13,
	NotBatchable                             = 14,
	EGeneBatchWhyNotBatchDetailType_MAX      = 15,
};

// Enum GeneBatch.EGeneBatchWhyNotBatchReason
// NumValues: 0x0015
enum class EGeneBatchWhyNotBatchReason : uint8
{
	Unknown                                  = 0,
	Config                                   = 1,
	LevelKey                                 = 2,
	ActorResource                            = 3,
	MeshBuildData                            = 4,
	StaticMeshTag                            = 5,
	CastShadow                               = 6,
	Grid                                     = 7,
	AtlasMap                                 = 8,
	AtlasChannelUsage                        = 9,
	PreferNot                                = 10,
	BaseMaterial                             = 11,
	MaterialParameter                        = 12,
	ChannelUsage                             = 13,
	MaterialInstanceCount                    = 14,
	NumericParameterCount                    = 15,
	Bound                                    = 16,
	VertexCount                              = 17,
	CanMerge                                 = 18,
	NUM_REASONS                              = 19,
	EGeneBatchWhyNotBatchReason_MAX          = 20,
};

// Enum GeneBatch.EMaterialParameterClusterSaveMode
// NumValues: 0x0003
enum class EMaterialParameterClusterSaveMode : uint8
{
	Median                                   = 0,
	ResetToDefault                           = 1,
	EMaterialParameterClusterSaveMode_MAX    = 2,
};

// Enum GeneBatch.EMaterialParameterClusterMode
// NumValues: 0x0004
enum class EMaterialParameterClusterMode : uint8
{
	None                                     = 0,
	Cluster                                  = 1,
	ResetToDefault                           = 2,
	EMaterialParameterClusterMode_MAX        = 3,
};

// Enum GeneBatch.EMaterialParameterDataType
// NumValues: 0x000A
enum class EMaterialParameterDataType : uint8
{
	Unknown                                  = 0,
	Scalar                                   = 1,
	Vector                                   = 2,
	Texture                                  = 3,
	StaticSwitch                             = 4,
	BasePropertyOverrides                    = 5,
	Font                                     = 6,
	StaticComponentMask                      = 7,
	MaterialLayers                           = 8,
	EMaterialParameterDataType_MAX           = 9,
};

// Enum GeneBatch.EGeneBatchBakeMethod
// NumValues: 0x0004
enum class EGeneBatchBakeMethod : uint8
{
	Unknown                                  = 0,
	RuntimeBake                              = 1,
	EditorBake                               = 2,
	EGeneBatchBakeMethod_MAX                 = 3,
};

// Enum GeneBatch.EGeneJointBatchObjectiveType
// NumValues: 0x0007
enum class EGeneJointBatchObjectiveType : uint8
{
	TotalMeshVertexCount                     = 0,
	TotalDrawCallCount                       = 1,
	TotalDrawInstancingCount                 = 2,
	TotalBoundingBoxVolume                   = 3,
	TotalAtlasMapCount                       = 4,
	AllObjectiveNum                          = 5,
	EGeneJointBatchObjectiveType_MAX         = 6,
};

// Enum GeneBatch.EGeneUnionBatchObjectiveType
// NumValues: 0x0007
enum class EGeneUnionBatchObjectiveType : uint8
{
	TotalMeshVertexCount                     = 0,
	TotalDrawCallCount                       = 1,
	TotalDrawInstancingCount                 = 2,
	TotalBoundingBoxVolume                   = 3,
	TotalAtlasMapCount                       = 4,
	AllObjectiveNum                          = 5,
	EGeneUnionBatchObjectiveType_MAX         = 6,
};

// ScriptStruct GeneBatch.GeneBatchTableRowResultMeshReuseKeySourceDrawSection
// 0x0020 (0x0020 - 0x0000)
struct FGeneBatchTableRowResultMeshReuseKeySourceDrawSection final
{
public:
	class FName                                   MeshName;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DrawSectionIndex;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           UVScaleOffset;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultMeshReuseKeySourceDrawSection;

// ScriptStruct GeneBatch.GeneBatchTableRowResultMeshReuseKeyMergeDrawSection
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchTableRowResultMeshReuseKeyMergeDrawSection final
{
public:
	TArray<struct FGeneBatchTableRowResultMeshReuseKeySourceDrawSection> SourceDrawSections;         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultMeshReuseKeyMergeDrawSection;

// ScriptStruct GeneBatch.GeneBatchParameterOptimizationConfigIntArray
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchParameterOptimizationConfigIntArray final
{
public:
	TArray<int32>                                 Arr;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchParameterOptimizationConfigIntArray;

// ScriptStruct GeneBatch.GeneBatchAtlasMapIndex
// 0x0014 (0x0014 - 0x0000)
struct FGeneBatchAtlasMapIndex final
{
public:
	struct FGuid                                  AtlasGroupGuid;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AtlasMapIndex;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchAtlasMapIndex;

// ScriptStruct GeneBatch.GeneBatchRuntimeMergingMeshInputElement
// 0x0060 (0x0060 - 0x0000)
struct FGeneBatchRuntimeMergingMeshInputElement final
{
public:
	int32                                         IndexInStaticMeshTable;                            // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DrawSectionIndex;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StaticMeshTransform;                               // 0x0010(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         LocalMaterialIndex;                                // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasLightMap;                                      // 0x0044(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CoordinateBias;                                    // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CoordinateScale;                                   // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchRuntimeMergingMeshInputElement;

// ScriptStruct GeneBatch.GeneBatchRuntimeMergingMeshInputMergeDrawSection
// 0x0018 (0x0018 - 0x0000)
struct FGeneBatchRuntimeMergingMeshInputMergeDrawSection final
{
public:
	TArray<struct FGeneBatchRuntimeMergingMeshInputElement> Elements;                                // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchRuntimeMergingMeshInputMergeDrawSection;

// ScriptStruct GeneBatch.GeneBatchRuntimeMergingMeshInputLOD
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchRuntimeMergingMeshInputLOD final
{
public:
	TArray<struct FGeneBatchRuntimeMergingMeshInputMergeDrawSection> MergeDrawSections;              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchRuntimeMergingMeshInputLOD;

// ScriptStruct GeneBatch.GeneBatchMaterialTextureParam
// 0x0018 (0x0018 - 0x0000)
struct FGeneBatchMaterialTextureParam final
{
public:
	class FName                                   TextureParamName;                                  // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  TextureGuid;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMaterialTextureParam;

// ScriptStruct GeneBatch.GeneBatchMaterial
// 0x0038 (0x0038 - 0x0000)
struct FGeneBatchMaterial final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      MaterialInstance;                                  // 0x0000(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchMaterialTextureParam> TextureParamAndTextureGuid;                        // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMaterial;

// ScriptStruct GeneBatch.GeneBatchMeshComponentDataRow
// 0x0038 (0x0040 - 0x0008)
struct FGeneBatchMeshComponentDataRow final : public FTableRowBase
{
public:
	bool                                          bStandalone;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeneBatchRuntimeMergingMeshInputLOD> LODs;                                        // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FGuid                                  MeshGuid;                                          // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchMaterial>             GeneBatchMaterials;                                // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMeshComponentDataRow;

// ScriptStruct GeneBatch.GeneBatchSMCInputData
// 0x0028 (0x0028 - 0x0000)
struct FGeneBatchSMCInputData final
{
public:
	class UStaticMeshComponent*                   SMC;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverrideLevelKey;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdditionalLevelKey;                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchSMCInputData;

// ScriptStruct GeneBatch.GeneBatchTextureBaseChannelUsage
// 0x000C (0x000C - 0x0000)
struct FGeneBatchTextureBaseChannelUsage
{
public:
	class FName                                   ChannelUsageName;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialAtlasUsage                           MaterialAtlasUsage;                                // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAlpha;                                         // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceLinearColor;                                 // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnisotropic;                                      // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTextureBaseChannelUsage;

// ScriptStruct GeneBatch.GeneBatchTextureChannelUsage
// 0x0054 (0x0060 - 0x000C)
struct FGeneBatchTextureChannelUsage final : public FGeneBatchTextureBaseChannelUsage
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, EPixelFormat>               PlatformPixelFormats;                              // 0x0010(0x0050)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTextureChannelUsage;

// ScriptStruct GeneBatch.GeneBatchMaterialTextureParameter
// 0x0078 (0x0078 - 0x0000)
struct FGeneBatchMaterialTextureParameter final
{
public:
	struct FGeneBatchTextureChannelUsage          ChannelUsage;                                      // 0x0000(0x0060)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceMaterialTextureParamRegex;                   // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AtlasMaterialTextureParam;                         // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMaterialTextureParameter;

// ScriptStruct GeneBatch.GeneBatchTableRowResultAtlasMapIndex
// 0x0014 (0x0014 - 0x0000)
struct FGeneBatchTableRowResultAtlasMapIndex final
{
public:
	struct FGuid                                  AtlasGuid;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AtlasMapIndex;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultAtlasMapIndex;

// ScriptStruct GeneBatch.GeneBatchResultUsageHashedAtlasMaps
// 0x0050 (0x0050 - 0x0000)
struct FGeneBatchResultUsageHashedAtlasMaps final
{
public:
	TMap<struct FGeneBatchMaterialTextureParameter, struct FGeneBatchTableRowResultAtlasMapIndex> AtlasMaps; // 0x0000(0x0050)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchResultUsageHashedAtlasMaps;

// ScriptStruct GeneBatch.GeneBatchMaterialInputData
// 0x0028 (0x0028 - 0x0000)
struct FGeneBatchMaterialInputData final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      Material;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMaterialInputData;

// ScriptStruct GeneBatch.GeneBatchTheme
// 0x0040 (0x0040 - 0x0000)
struct FGeneBatchTheme final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Collections;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           BlacklistCollections;                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReferencedThemes;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAcceptTextureCollection;                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAcceptDecorationOnlyTextures;                     // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRootInPARENT;                                     // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchTheme;

// ScriptStruct GeneBatch.GeneBatchTableRowResultMeshReuseKeyLOD
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchTableRowResultMeshReuseKeyLOD final
{
public:
	TArray<struct FGeneBatchTableRowResultMeshReuseKeyMergeDrawSection> MergeDrawSections;           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultMeshReuseKeyLOD;

// ScriptStruct GeneBatch.GeneBatchTableRowResultDrawSection
// 0x00A0 (0x00A8 - 0x0008)
struct FGeneBatchTableRowResultDrawSection final : public FTableRowBase
{
public:
	class FName                                   ActorResource;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Primitive;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0018(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               BaseMaterial;                                      // 0x0040(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Material;                                          // 0x0068(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  InstancingGuid;                                    // 0x0090(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstancingNum;                                     // 0x00A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultDrawSection;

// ScriptStruct GeneBatch.GeneBatchParameterOptimizationConfig
// 0x0040 (0x0040 - 0x0000)
struct FGeneBatchParameterOptimizationConfig final
{
public:
	TArray<int32>                                 BaseSizes;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchParameterOptimizationConfigIntArray> Sizes;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchParameterOptimizationConfigIntArray> LoadPatterns;                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchParameterOptimizationConfigIntArray> ISMNums;                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchParameterOptimizationConfig;

// ScriptStruct GeneBatch.GeneBatchPrimitiveInstanceLODData
// 0x0030 (0x0030 - 0x0000)
struct FGeneBatchPrimitiveInstanceLODData final
{
public:
	struct FGuid                                  MapBuildDataGuid;                                  // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LightMapCoordinateScale;                           // 0x0010(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LightMapCoordinateBias;                            // 0x0018(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  UnitScaleBiasDummyGuid;                            // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchPrimitiveInstanceLODData;

// ScriptStruct GeneBatch.GeneBatchPrimitiveInstanceData
// 0x0080 (0x0080 - 0x0000)
struct FGeneBatchPrimitiveInstanceData final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0030(0x001C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   StaticMesh;                                        // 0x004C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LocalLightGroupBake;                               // 0x0054(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CastShadow : 1;                                    // 0x005C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeneBatchPrimitiveInstanceLODData> LODData;                                       // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FGuid                                  PrimitiveInstancingGuid;                           // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchPrimitiveInstanceData;

// ScriptStruct GeneBatch.GeneBatchDrawableLODInfo
// 0x0028 (0x0028 - 0x0000)
struct FGeneBatchDrawableLODInfo final
{
public:
	int32                                         TargetLODIndex;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SectionIndices;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInterface>> Materials;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchDrawableLODInfo;

// ScriptStruct GeneBatch.GeneBatchResultDrawSectionIndex
// 0x0040 (0x0040 - 0x0000)
struct FGeneBatchResultDrawSectionIndex final
{
public:
	class FName                                   Primitive;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Mesh;                                              // 0x0008(0x0028)(Edit, BlueprintVisible, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DrawSectionIndex;                                  // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideMaterial;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchResultDrawSectionIndex;

// ScriptStruct GeneBatch.GeneBatchTableRowResultHLODDataMergeDrawSection
// 0x0020 (0x0020 - 0x0000)
struct FGeneBatchTableRowResultHLODDataMergeDrawSection final
{
public:
	TArray<struct FGeneBatchResultDrawSectionIndex> SourceDrawSections;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FGuid                                  MergeDrawSectionGuid;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultHLODDataMergeDrawSection;

// ScriptStruct GeneBatch.GeneBatchTableRowResultHLODDataLODData
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchTableRowResultHLODDataLODData final
{
public:
	TArray<struct FGeneBatchTableRowResultHLODDataMergeDrawSection> MergeDrawSections;               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultHLODDataLODData;

// ScriptStruct GeneBatch.GeneBatchTableRowResultHLODData
// 0x0258 (0x0260 - 0x0008)
struct FGeneBatchTableRowResultHLODData final : public FTableRowBase
{
public:
	struct FGuid                                  Guid;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HLODLevel;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ParentGuid;                                        // 0x001C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LevelKey;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStandalone;                                       // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseStaticMeshProxy;                               // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOriginalSMC;                                   // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeneBatchBakeMethod                          BakeMethod;                                        // 0x0043(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseISM;                                           // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMergeMeshTypeComponent;                        // 0x0045(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTransform;                                  // 0x0046(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOriginalStaticMeshTags;                        // 0x0047(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             OverrideOccluderMesh;                              // 0x0048(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchDrawableLODInfo>      DrawableLODInfo;                                   // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FGuid                                  MergedMeshGuid;                                    // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  MergeDrawSectionGroupGuid;                         // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ISMName;                                           // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchTableRowResultHLODDataLODData> LODs;                                     // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FVector                                PivotLocation;                                     // 0x00B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DrawDistance;                                      // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       StaticMeshBounds;                                  // 0x00C8(0x001C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CullScreenSize;                                    // 0x00E4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullDistance;                                      // 0x00E8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableLightmap;                                  // 0x00EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumVertices;                                       // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 UsedUVs;                                           // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         LightMapUVIndex;                                   // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 LODScreenSizes;                                    // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             MergedMeshPtr;                                     // 0x0120(0x0028)(Edit, BlueprintVisible, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGeneBatchTableRowResultMeshReuseProperties> ReuseProperties;               // 0x0148(0x0028)(Edit, BlueprintVisible, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeneBatchPrimitiveInstanceData        PrimitiveInstanceData;                             // 0x0170(0x0080)(Edit, EditConst, NativeAccessSpecifierPublic)
	float                                         UVDensityScale;                                    // 0x01F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastShadow;                                       // 0x01F4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreIBL;                                        // 0x01F5(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F6[0x2];                                      // 0x01F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             SourceComponentTags;                               // 0x01F8(0x0050)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class FName                                   StreamingLayer;                                    // 0x0248(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              GridKey;                                           // 0x0250(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ZIdx;                                              // 0x0258(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchTableRowResultHLODData;

// ScriptStruct GeneBatch.GeneBatchPOI
// 0x0040 (0x0040 - 0x0000)
struct FGeneBatchPOI final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     Areas;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         LevelNamePatterns;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   GameplayAreaName;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReferencedThemes;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchPOI;

// ScriptStruct GeneBatch.GeneBatchAnalyzeAtlasGroupSetting
// 0x0030 (0x0030 - 0x0000)
struct FGeneBatchAnalyzeAtlasGroupSetting final
{
public:
	int32                                         DesiredAtlasResolution;                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ExtraAtlasResolutions;                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAllowDuplicatedTextures;                          // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAtlasCrossMergeMaterial;                          // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreAnisotropic;                                // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelFormat                                  ForcePixelFormat;                                  // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchAnalyzeAtlasGroupSetting;

// ScriptStruct GeneBatch.GeneBatchMergeResultSourceSectionInfo
// 0x0030 (0x0030 - 0x0000)
struct FGeneBatchMergeResultSourceSectionInfo final
{
public:
	TSoftObjectPtr<class UStaticMesh>             SourceMesh;                                        // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LodIndex;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMergeResultSourceSectionInfo;

// ScriptStruct GeneBatch.GeneBatchMergeResultSectionInfo
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchMergeResultSectionInfo final
{
public:
	TArray<struct FGeneBatchMergeResultSourceSectionInfo> SourceSections;                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMergeResultSectionInfo;

// ScriptStruct GeneBatch.GeneBatchMergeResultLODInfo
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchMergeResultLODInfo final
{
public:
	TArray<struct FGeneBatchMergeResultSectionInfo> MergedSections;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMergeResultLODInfo;

// ScriptStruct GeneBatch.GeneBatchMergeResultInfo
// 0x0038 (0x0038 - 0x0000)
struct FGeneBatchMergeResultInfo final
{
public:
	TSoftObjectPtr<class UStaticMesh>             ResultMesh;                                        // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchMergeResultLODInfo>   LODs;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchMergeResultInfo;

// ScriptStruct GeneBatch.GeneBatchAnalyzeSettings
// 0x0078 (0x0078 - 0x0000)
struct FGeneBatchAnalyzeSettings final
{
public:
	int32                                         ExpectedVertexCount;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpectedBoundSize;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      StreamingLayerExpectedBoundSizes;                  // 0x0008(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         HeightGroupUnit;                                   // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAggressive;                                       // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MinISMNum;                                         // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinISMTotalVertexCount;                            // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinForceISMGridDensity;                            // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxVertexCount;                                    // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CanMergeMeshLODVertexMaxNum;                       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchAnalyzeSettings;

// ScriptStruct GeneBatch.GeneBatchLightMapUVSettings
// 0x0018 (0x0018 - 0x0000)
struct FGeneBatchLightMapUVSettings final
{
public:
	float                                         LightMapUVRangeLimit;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ISMLightMapUVRangeLimit;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ISMLightMapUVErrorLimit;                           // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceFullPrecisionUV;                             // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FullPrecisionUVErrorPercentageThreshold;           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceNormalizedLightMapUV;                        // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchLightMapUVSettings;

// ScriptStruct GeneBatch.GeneBatchAnalyzePrimitiveFilter
// 0x0068 (0x0068 - 0x0000)
struct FGeneBatchAnalyzePrimitiveFilter final
{
public:
	TArray<class FString>                         TagBlacklist;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         MinScreenSize;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         StaticMeshAssetPathWhitelist;                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         StreamingLayerWhitelist;                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           MeshGroupBlacklist;                                // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           MeshGroupWhitelist;                                // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         LevelPathBlacklistWildcards;                       // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchAnalyzePrimitiveFilter;

// ScriptStruct GeneBatch.GeneBatchCustomMaterialParameterClusterLevelIndex
// 0x0030 (0x0030 - 0x0000)
struct FGeneBatchCustomMaterialParameterClusterLevelIndex final
{
public:
	TSoftObjectPtr<class UMaterial>               Material;                                          // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialParameterClusterLevelIndex;                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGeneBatchCustomMaterialParameterClusterLevelIndex;

// ScriptStruct GeneBatch.GeneBatchIntArray
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchIntArray final
{
public:
	TArray<int32>                                 array;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchIntArray;

// ScriptStruct GeneBatch.GeneBatchFloatArray
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchFloatArray final
{
public:
	TArray<float>                                 array;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchFloatArray;

// ScriptStruct GeneBatch.GeneBatchReductionCondition
// 0x0030 (0x0030 - 0x0000)
struct FGeneBatchReductionCondition final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AllowLODOffsetFromFirst;                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AllowLODOffsetFromLast;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           TagBlacklist;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         VertexNum;                                         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VertexSurfaceDensity;                              // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoundHeight;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReductionPercentage;                               // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchReductionCondition;

// ScriptStruct GeneBatch.GeneBatchReductionSettings
// 0x0010 (0x0010 - 0x0000)
struct FGeneBatchReductionSettings final
{
public:
	TArray<struct FGeneBatchReductionCondition>   Conditions;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchReductionSettings;

// ScriptStruct GeneBatch.GeneBatchManualGroupSetting
// 0x0003 (0x0003 - 0x0000)
struct FGeneBatchManualGroupSetting final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrossGrid;                                        // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrossLayer;                                       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeneBatchManualGroupSetting;

// ScriptStruct GeneBatch.GeneBatchAnalyzeHLODSetting
// 0x03D0 (0x03D0 - 0x0000)
struct FGeneBatchAnalyzeHLODSetting final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HLODIndex;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentHLODIndex;                                   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeneBatchAnalyzeSettings              AnalyzeSettings;                                   // 0x0028(0x0078)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<float>                                 DrawDistances;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 MinLODIndex;                                       // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 MinLODIndex_MeshOverridePrefix;                    // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
