#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeneBatchRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GeneBatchRuntime_structs.hpp"


namespace SDK
{

// Class GeneBatchRuntime.BatchStaticMesh
// 0x0010 (0x0038 - 0x0028)
class UBatchStaticMesh final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UStaticMesh* StaticMesh)> BatchCompleted;                    // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UBatchStaticMesh* RequestBatch(class UGeneBatchRuntimeSubsystem* GBRuntime, int32 BatchType, int32 MeshID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140F7D3A0

	void Execute(class UStaticMesh* StaticMesh); // (Final, Native, Public, BlueprintCallable) // @ 0x140F7D140

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BatchStaticMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BatchStaticMesh")
	}
	static class UBatchStaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchStaticMesh>();
	}
};
DUMPER7_ASSERTS_UBatchStaticMesh;

// Class GeneBatchRuntime.AsyncStaticMeshComponentProxy
// 0x0000 (0x0870 - 0x0870)
class UAsyncStaticMeshComponentProxy final : public UAsyncStaticMeshComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncStaticMeshComponentProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncStaticMeshComponentProxy")
	}
	static class UAsyncStaticMeshComponentProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncStaticMeshComponentProxy>();
	}
};
DUMPER7_ASSERTS_UAsyncStaticMeshComponentProxy;

// Class GeneBatchRuntime.GeneBatchHLODInstancedStaticMeshComponent
// 0x0000 (0x0A20 - 0x0A20)
class UGeneBatchHLODInstancedStaticMeshComponent final : public UInstancedStaticMeshComponent
{
public:
	bool                                          bBatched;                                          // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneBatchHLODInstancedStaticMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneBatchHLODInstancedStaticMeshComponent")
	}
	static class UGeneBatchHLODInstancedStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneBatchHLODInstancedStaticMeshComponent>();
	}
};
DUMPER7_ASSERTS_UGeneBatchHLODInstancedStaticMeshComponent;

// Class GeneBatchRuntime.GeneBatchHLODStaticMeshComponent
// 0x00D0 (0x0910 - 0x0840)
class UGeneBatchHLODStaticMeshComponent : public UStaticMeshComponent
{
public:
	bool                                          bBatched;                                          // 0x0840(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_841[0x7];                                      // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoxSphereBounds>               SubBounds;                                         // 0x0848(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 CullingScreenSizes;                                // 0x0858(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchSubBoundsVisibilitiesItem> Visibilities;                                 // 0x0868(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGeneBatchSubVisibilityIdRelevanceItem> SubVisibilityIdRelevance;                  // 0x0878(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMeshUVChannelInfo>             OverrideUVChannelData;                             // 0x0888(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseOriginOC;                                      // 0x0898(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_899[0x17];                                     // 0x0899(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseOriginOCWithOriginComponentIndex;              // 0x08B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B1[0x17];                                     // 0x08B1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeneBatchSubVisibilityId>      SubVisibilityIds;                                  // 0x08C8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D8[0x38];                                     // 0x08D8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneBatchHLODStaticMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneBatchHLODStaticMeshComponent")
	}
	static class UGeneBatchHLODStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneBatchHLODStaticMeshComponent>();
	}
};
DUMPER7_ASSERTS_UGeneBatchHLODStaticMeshComponent;

// Class GeneBatchRuntime.GeneBatchMergeMeshTypeComponent
// 0x0050 (0x0960 - 0x0910)
class UGeneBatchMergeMeshTypeComponent final : public UGeneBatchHLODStaticMeshComponent
{
public:
	TArray<struct FGeneBatchMergeMeshTypeLOD>     LODs;                                              // 0x0910(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 LODScreenSizes;                                    // 0x0920(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       StaticMeshBounds;                                  // 0x0930(0x001C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94C[0x14];                                     // 0x094C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneBatchMergeMeshTypeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneBatchMergeMeshTypeComponent")
	}
	static class UGeneBatchMergeMeshTypeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneBatchMergeMeshTypeComponent>();
	}
};
DUMPER7_ASSERTS_UGeneBatchMergeMeshTypeComponent;

// Class GeneBatchRuntime.GeneBatchMeshComponent
// 0x0070 (0x08B0 - 0x0840)
class UGeneBatchMeshComponent final : public UStaticMeshComponent
{
public:
	int32                                         GeneBatchMeshComponentDataIndex;                   // 0x0840(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_844[0x4];                                      // 0x0844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoxSphereBounds>               SubBounds;                                         // 0x0848(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 CullingScreenSizes;                                // 0x0858(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_868[0x38];                                     // 0x0868(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SphereRadius;                                      // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A4[0xC];                                      // 0x08A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneBatchMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneBatchMeshComponent")
	}
	static class UGeneBatchMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneBatchMeshComponent>();
	}
};
DUMPER7_ASSERTS_UGeneBatchMeshComponent;

// Class GeneBatchRuntime.GeneBatchMeshProxyComponent
// 0x0040 (0x0880 - 0x0840)
class UGeneBatchMeshProxyComponent final : public UStaticMeshComponent
{
public:
	int32                                         GeneBatchMeshComponentDataIndex;                   // 0x0840(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_844[0x4];                                      // 0x0844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeneBatchMeshProxyLOD>         LODs;                                              // 0x0848(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       RenderDataBounds;                                  // 0x0858(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_874[0xC];                                      // 0x0874(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneBatchMeshProxyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneBatchMeshProxyComponent")
	}
	static class UGeneBatchMeshProxyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneBatchMeshProxyComponent>();
	}
};
DUMPER7_ASSERTS_UGeneBatchMeshProxyComponent;

// Class GeneBatchRuntime.GeneBatchRuntimeComponent
// 0x0018 (0x0110 - 0x00F8)
class UGeneBatchRuntimeComponent final : public UActorComponent
{
public:
	class UGeneBatchSettingsObject*               SettingsObjectHigh;                                // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeneBatchSettingsObject*               SettingsObjectLow;                                 // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetQuality(int32 InQuality); // (Final, Native, Public, BlueprintCallable) // @ 0x140F7D490

	int32 GetPOIIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140F7D320
	int32 GetQuality() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140F7D380

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneBatchRuntimeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneBatchRuntimeComponent")
	}
	static class UGeneBatchRuntimeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneBatchRuntimeComponent>();
	}
};
DUMPER7_ASSERTS_UGeneBatchRuntimeComponent;

// Class GeneBatchRuntime.GeneBatchRuntimeSubsystem
// 0x0320 (0x0350 - 0x0030)
class alignas(0x10) UGeneBatchRuntimeSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeneBatchRuntimePOIConfiguration> POIs;                                           // 0x0058(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x2E8];                                     // 0x0068(0x02E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FindAndLoadAllRuntimeComponent(); // (Final, Native, Public, BlueprintCallable) // @ 0x140F7D1D0

	TArray<class UPrimitiveComponent*> FindLeafHLODChildrenCurrent(class UPrimitiveComponent* PrimitiveComponent) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140F7D1F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneBatchRuntimeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneBatchRuntimeSubsystem")
	}
	static class UGeneBatchRuntimeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneBatchRuntimeSubsystem>();
	}
};
DUMPER7_ASSERTS_UGeneBatchRuntimeSubsystem;

}

