#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalTextureDataStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct GlobalTextureDataStruct.GlobalTextureDataStruct
// 0x0100 (0x0100 - 0x0000)
struct FGlobalTextureDataStruct final
{
public:
	class FString                                 关卡名_25_F41E244E438A952E497BD0B2926704C9;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                ClipMap_43_320D6942433DEEC99B95BB817FA533FA;       // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                ClipMap_HD_0_44_A3B78185470CACB06DA52E8C168E5101;  // 0x0038(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                ClipMap_HD_1_45_9441FD9F4056AA8E91AC8CBEEB664240;  // 0x0060(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class URuntimeVirtualTexture>  RVT_50_3DBEE6D84449128E4B6D5092809AEF40;           // 0x0088(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class URuntimeVirtualTexture>  RVT_HD_52_53958DEA4A28CC7CE0739B82CE5359C5;        // 0x00B0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                WaterHeightMap_HD_49_1DE81812449872EE90E4D3AB525DB27A; // 0x00D8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FGlobalTextureDataStruct;

}

