#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GlobalMessageRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MessageTags_structs.hpp"


namespace SDK
{

// Enum GlobalMessageRuntime.EMessageAuthorityType
// NumValues: 0x0004
enum class EMessageAuthorityType : uint8
{
	EMessageTypeBoth                         = 0,
	EMessageTypeServer                       = 1,
	EMessageTypeClient                       = 2,
	EMessageAuthorityType_MAX                = 3,
};

// Enum GlobalMessageRuntime.EFireMessagesAtPosition
// NumValues: 0x0004
enum class EFireMessagesAtPosition : uint8
{
	AtStartOfEvaluation                      = 0,
	AtEndOfEvaluation                        = 1,
	AfterSpawn                               = 2,
	EFireMessagesAtPosition_MAX              = 3,
};

// ScriptStruct GlobalMessageRuntime.MovieSceneMessageParameters
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FMovieSceneMessageParameters final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneMessageParameters;

// ScriptStruct GlobalMessageRuntime.MessagePayload
// 0x0030 (0x0030 - 0x0000)
struct FMessagePayload final
{
public:
	struct FMessageTag                            MessageKey;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneMessageParameters           Parameters;                                        // 0x0008(0x0028)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMessagePayload;

// ScriptStruct GlobalMessageRuntime.MovieSceneMessageSectionData
// 0x0080 (0x0090 - 0x0010)
struct FMovieSceneMessageSectionData final : public FMovieSceneChannel
{
public:
	TArray<struct FFrameNumber>                   Times;                                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMessagePayload>                KeyValues;                                         // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneMessageSectionData;

// ScriptStruct GlobalMessageRuntime.MessageAny
// 0x0010 (0x0010 - 0x0000)
struct FMessageAny final
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMessageAny;

// ScriptStruct GlobalMessageRuntime.MovieSceneMessageSectionTemplate
// 0x00A8 (0x00C8 - 0x0020)
struct FMovieSceneMessageSectionTemplate final : public FMovieSceneEvalTemplate
{
public:
	struct FMovieSceneMessageSectionData          MessageData;                                       // 0x0020(0x0090)(NativeAccessSpecifierPublic)
	TArray<struct FMovieSceneObjectBindingID>     MessageReceivers;                                  // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bFireMessagesWhenForwards : 1;                     // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFireMessagesWhenBackwards : 1;                    // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMovieSceneMessageSectionTemplate;

}

