#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GM.EClimbVaultResult
// NumValues: 0x000B
enum class EClimbVaultResult : uint8
{
	EChoice_None                             = 0,
	Succeed                                  = 1,
	NoObstacle                               = 2,
	TouchAngle                               = 3,
	ObstacleHeight                           = 4,
	ApexPoint                                = 5,
	ObstacleAbruptSlope                      = 6,
	ObstacleWidth                            = 7,
	CollideOverHead                          = 8,
	CollideOverHead_TopNearTarget            = 9,
	EClimbVaultResult_MAX                    = 10,
};

// ScriptStruct GM.ClimbVaultAngleResult
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FClimbVaultAngleResult final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FClimbVaultAngleResult;

// ScriptStruct GM.MapSelectNavPoint
// 0x0110 (0x0110 - 0x0000)
struct FMapSelectNavPoint final
{
public:
	class UWorld*                                 WorldContent;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        AllSelectPoints;                                   // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FClimbVaultAngleResult>         ClimbVaultFaildResult;                             // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          DrawPointDebug;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x9B];                                      // 0x0031(0x009B)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstacleHeightCheckInterval;                       // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxObstacleHeightCheckCount;                       // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x3C];                                      // 0x00D4(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMapSelectNavPoint;

}

