#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPAbility

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GPAbility.EGPAbilityGivenPolicy
// NumValues: 0x0008
enum class EGPAbilityGivenPolicy : uint8
{
	GiveNew                                  = 0,
	GiveOnce                                 = 1,
	FindOrGiveNew                            = 2,
	FindOrGiveOnce                           = 3,
	FindExisted                              = 4,
	OnceFlag                                 = 1,
	FindFlag                                 = 2,
	EGPAbilityGivenPolicy_MAX                = 5,
};

// Enum GPAbility.EAttributeSetTickType
// NumValues: 0x0005
enum class EAttributeSetTickType : uint8
{
	None                                     = 0,
	ServerSide                               = 1,
	ClientSide                               = 2,
	BothSide                                 = 3,
	Max                                      = 4,
};

// Enum GPAbility.EGPValidFlag
// NumValues: 0x0003
enum class EGPValidFlag : uint8
{
	Valid                                    = 0,
	Invalid                                  = 1,
	EGPValidFlag_MAX                         = 2,
};

// Enum GPAbility.EEditorExec
// NumValues: 0x0003
enum class EEditorExec : uint8
{
	InEditorExec                             = 0,
	NoEditorExec                             = 1,
	EEditorExec_MAX                          = 2,
};

// ScriptStruct GPAbility.GPAbilitySpecHandleKey
// 0x0008 (0x0008 - 0x0000)
struct FGPAbilitySpecHandleKey final
{
public:
	struct FGameplayAbilitySpecHandle             AbilityHandle;                                     // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Key;                                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAbilitySpecHandleKey;

// ScriptStruct GPAbility.AbilityActivationItem
// 0x00D4 (0x00E0 - 0x000C)
struct FAbilityActivationItem final : public FFastArraySerializerItem
{
public:
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x000C(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                         PredictionKey;                                     // 0x0010(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEventData                     TriggerEventData;                                  // 0x0028(0x00B0)(NativeAccessSpecifierPublic)
	bool                                          bReplicateEventData;                               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemovedByRPC;                                     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAbilityActivationItem;

// ScriptStruct GPAbility.AbilityActivationInfos
// 0x0028 (0x0130 - 0x0108)
struct FAbilityActivationInfos final : public FFastArraySerializer
{
public:
	TArray<struct FAbilityActivationItem>         Handles;                                           // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UGPASC*                                 Owner;                                             // 0x0118(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAbilityActivationItem>         Predictions;                                       // 0x0120(0x0010)(ZeroConstructor, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAbilityActivationInfos;

// ScriptStruct GPAbility.GPAbilityPair
// 0x0010 (0x0010 - 0x0000)
struct FGPAbilityPair final
{
public:
	TSubclassOf<class UGameplayAbility>           AbilityClass;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             SpecHandle;                                        // 0x0008(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAbilityPair;

// ScriptStruct GPAbility.GPAbilityPairArray
// 0x0010 (0x0010 - 0x0000)
struct FGPAbilityPairArray final
{
public:
	TArray<struct FGPAbilityPair>                 Info;                                              // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAbilityPairArray;

// ScriptStruct GPAbility.GPAbilityRepHandles
// 0x00A0 (0x00A0 - 0x0000)
struct FGPAbilityRepHandles final
{
public:
	TMap<struct FGameplayAbilitySpecHandle, struct FGPAbilityPairArray> AbilityAttachedData;         // 0x0000(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FGameplayAbilitySpecHandle, struct FGameplayAbilitySpecHandle> OuterLookup;          // 0x0050(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAbilityRepHandles;

// ScriptStruct GPAbility.SavedAttribute
// 0x0040 (0x0040 - 0x0000)
struct FSavedAttribute final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SavedValue;                                        // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSavedAttribute;

// ScriptStruct GPAbility.AttributeChangeCustomData
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FAttributeChangeCustomData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  Instigator;                                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  EffectCauser;                                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x20];                                      // 0x0018(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAttributeChangeCustomData;

// ScriptStruct GPAbility.GPAbilitySystemAttributeReg
// 0x0010 (0x0010 - 0x0000)
struct FGPAbilitySystemAttributeReg final
{
public:
	TArray<TSubclassOf<class UAttributeSet>>      Infos;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAbilitySystemAttributeReg;

// ScriptStruct GPAbility.GPAbilitySystemAbilityReg
// 0x0010 (0x0010 - 0x0000)
struct FGPAbilitySystemAbilityReg final
{
public:
	TArray<TSubclassOf<class UGameplayAbility>>   Infos;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAbilitySystemAbilityReg;

// ScriptStruct GPAbility.GPEffectContext
// 0x0060 (0x00D0 - 0x0070)
struct FGPEffectContext final : public FGameplayEffectContext
{
public:
	TWeakObjectPtr<class UAbilitySystemComponent> OriginalInstigatorASC;                             // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  OriginalInstigator;                                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, float>                      ContextFloats;                                     // 0x0080(0x0050)(BlueprintVisible, ZeroConstructor, Transient, RepSkip, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPEffectContext;

// ScriptStruct GPAbility.GPTypeToTable
// 0x0010 (0x0010 - 0x0000)
struct FGPTypeToTable final
{
public:
	class UClass*                                 Type;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             Table;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPTypeToTable;

}

