#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPAIBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPAIBase_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GPAIBase.CoverOccupierInterface
// 0x0000 (0x0000 - 0x0000)
class ICoverOccupierInterface final
{
public:
	bool CanApproachToCover(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140D3C230
	void OnCoverOccupy(class UNZCoverPoint* cover); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140CA52F0
	void OnCoverOccupyLost(class UNZCoverPoint* cover); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140CA5620
	void PlayCoverPointMontage(class UAnimMontage* MontageToPlay); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140CA70D0
	void StopCoverPointMontage(class UAnimMontage* montageToStop); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140D3C4B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CoverOccupierInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CoverOccupierInterface")
	}
	static class ICoverOccupierInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICoverOccupierInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICoverOccupierInterface;

// Class GPAIBase.AIAdvancedPerceptionComponent
// 0x00C8 (0x0290 - 0x01C8)
class UAIAdvancedPerceptionComponent final : public UAIPerceptionComponent
{
public:
	bool                                          bUseTagPreference;                                 // 0x01C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttractionPerceptionFactor            AttractedFactor;                                   // 0x01CC(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D4[0x2C];                                     // 0x01D4(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      TagPriorities;                                     // 0x0200(0x0050)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVisionConeConfig                      NoUse_ForKismetInspectorBug;                       // 0x0250(0x0038)(Edit, DisableEditOnInstance, EditConst, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdjustHearingSenseSize(float factor); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2ECD0
	void AdjustSightSenseSize(int32 Index_0, float RadiusFactor, float AngleFactor, float VisibleRate); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2ED50
	void MultiplySenseSize(TSubclassOf<class UAISenseConfig> senseType, float factor); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2FF10
	void RemoveSenseConfig(TSubclassOf<class UAISenseConfig> senseType); // (Final, Native, Public, BlueprintCallable) // @ 0x140D30040
	bool SetAttracted(bool bActtracted); // (Final, Native, Public, BlueprintCallable) // @ 0x140D309B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIAdvancedPerceptionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIAdvancedPerceptionComponent")
	}
	static class UAIAdvancedPerceptionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIAdvancedPerceptionComponent>();
	}
};
DUMPER7_ASSERTS_UAIAdvancedPerceptionComponent;

// Class GPAIBase.NZCoverPoint
// 0x0078 (0x00A0 - 0x0028)
class UNZCoverPoint final : public UObject
{
public:
	struct FVector                                Location;                                          // 0x0028(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                _DirectionToWall;                                  // 0x0034(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotatorXToWall;                                    // 0x0040(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bLeftCoverStanding;                                // 0x004C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightCoverStanding;                               // 0x004D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftCoverCrouched;                                // 0x004E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightCoverCrouched;                               // 0x004F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFrontCoverCrouched;                               // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECoverType                                    CoverType;                                         // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  CoverActor;                                        // 0x0058(0x0028)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            OccupiedBy;                                        // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECoverOccupyState                             OccupyState;                                       // 0x0090(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HoldOwner;                                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FVector BestCoverShootLocation(); // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x140D3C1F0
	class ANZCoverGenerator* GetCoverGen(); // (Final, Native, Public, BlueprintCallable) // @ 0x140D3C300
	bool IsOccupiedBy(class AActor* InActor); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x140D3C330
	void PlayerHoldCover(class AActor* OwnerChar, float InHoldTime); // (Native, Public) // @ 0x140D3C3C0
	void ReleaseCover(); // (Final, Native, Public) // @ 0x140D3C490
	bool TryOccupyCover(class AController* Controller); // (Final, Native, Public, BlueprintCallable) // @ 0x140D3C540

	bool CanSeenFromPoint(const struct FVector& InFromPoint) const; // (Final, Native, Public, HasDefaults, Const) // @ 0x140D3C260

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NZCoverPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NZCoverPoint")
	}
	static class UNZCoverPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNZCoverPoint>();
	}
};
DUMPER7_ASSERTS_UNZCoverPoint;

// Class GPAIBase.AIBPLib
// 0x0000 (0x0028 - 0x0028)
class UAIBPLib final : public UBlueprintFunctionLibrary
{
public:
	static void OpenBPAssetByBPClass(TSubclassOf<class UObject> objectClass); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D2FFD0
	static void SetBDVector(class UBlackboardComponent* BlackboardComp, const class FName Key, const struct FVector& Value); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140D30A50

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIBPLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIBPLib")
	}
	static class UAIBPLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIBPLib>();
	}
};
DUMPER7_ASSERTS_UAIBPLib;

// Class GPAIBase.GPAIFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGPAIFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CheckVisibility(class AActor* FromActor, class UObject* FromCover, const struct FVector& FromLocation, class AActor* ToActor, class UObject* ToCover, const struct FVector& ToLocation, class UObject* WorldContext, bool bDrawDebug); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140D2EFA0
	static bool TestCoverToActorVisibility(class UNZCoverPoint* FromCover, class AActor* ToActor, bool bDrawDebug); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D314B0
	static bool TestCoverToLocationVisibility(class UNZCoverPoint* FromCover, const struct FVector& ToLocation, bool bDrawDebug); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140D315A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAIFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAIFunctionLibrary")
	}
	static class UGPAIFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAIFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UGPAIFunctionLibrary;

// Class GPAIBase.AIJob
// 0x0028 (0x0050 - 0x0028)
class UAIJob : public UObject
{
public:
	float                                         JobOverTime;                                       // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JobWaitOverTime;                                   // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAINum;                                          // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAIController*>                  ExecutorControllers;                               // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EAIJobType                                    JobType;                                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAIJobState                                   State;                                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanJoin(class AAIController* Controller); // (Native, Protected, BlueprintCallable) // @ 0x140D2EEC0
	void Exit(class AAIController* AIController); // (Native, Protected, BlueprintCallable) // @ 0x140D2F2B0
	void Finish(); // (Native, Protected, BlueprintCallable) // @ 0x140D2F400
	bool IsFinish(class AAIController* AIController); // (Native, Protected, BlueprintCallable) // @ 0x140D2F980
	bool Join(class AAIController* AIController); // (Native, Protected, BlueprintCallable) // @ 0x140D2FA60
	void SetState(const EAIJobState Val); // (Final, Native, Public) // @ 0x140D30B50
	void Start(); // (Native, Protected, BlueprintCallable) // @ 0x140C99940
	void Update(); // (Native, Protected, BlueprintCallable) // @ 0x140D31FF0

	int32 GetAINum() const; // (Final, Native, Public, Const) // @ 0x140D2F750
	EAIJobType GetJobType() const; // (Final, Native, Public, Const) // @ 0x140D2F8A0
	bool IsFinishExtra() const; // (Final, Native, Public, Const) // @ 0x140D2FA20
	bool IsIdle() const; // (Final, Native, Public, Const) // @ 0x140D2FA40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIJob")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIJob")
	}
	static class UAIJob* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIJob>();
	}
};
DUMPER7_ASSERTS_UAIJob;

// Class GPAIBase.NZCoverRangeVolume
// 0x0028 (0x03D0 - 0x03A8)
class ANZCoverRangeVolume final : public AVolume
{
public:
	bool                                          bInclude;                                          // 0x03A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisable;                                          // 0x03A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x03AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AB[0x25];                                     // 0x03AB(0x0025)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NZCoverRangeVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NZCoverRangeVolume")
	}
	static class ANZCoverRangeVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANZCoverRangeVolume>();
	}
};
DUMPER7_ASSERTS_ANZCoverRangeVolume;

// Class GPAIBase.JobFilterBase
// 0x0000 (0x0028 - 0x0028)
class UJobFilterBase : public UObject
{
public:
	class UAIJob* GetJob(class AAIController* AIController, const TArray<class UAIJob*>& Jobs); // (Native, Event, Public, HasOutParams, BlueprintEvent) // @ 0x140D2F770
	class UAIJob* GetJob_Implementation(class AAIController* AIController, const TArray<class UAIJob*>& Jobs); // (Native, Public, HasOutParams) // @ 0x140D2F770

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JobFilterBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JobFilterBase")
	}
	static class UJobFilterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJobFilterBase>();
	}
};
DUMPER7_ASSERTS_UJobFilterBase;

// Class GPAIBase.AIJobManager
// 0x0080 (0x03F0 - 0x0370)
class AAIJobManager final : public ALevelSubsystem
{
public:
	TArray<struct FAIJobList>                     ActivatedJobs;                                     // 0x0370(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_380[0x50];                                     // 0x0380(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAIJobList>                     ProducedJobs;                                      // 0x03D0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FAIJobSetting>                  AIJobSettings;                                     // 0x03E0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)

public:
	static class UAIJob* GetAIJob(class UObject* WorldContext, EAIJobType AIJobType, const class FString& JobName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D2F540
	static class AAIJobManager* GetAIJobManager(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140D2F6D0
	static bool StaticAcquireAIJob(class AAIController* Controller, EAIJobType JobType, class UJobFilterBase* JobFilter, class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D30D50
	static void StaticDistributeAIJob(EAIJobType JobType, class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D30EB0
	static void StaticDistributeAIJobContent(EAIJobType JobType, class UAIJob* Job, class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D30F80
	static void StaticExitAIJob(class AAIController* Controller, class UAIJob* Job); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D31090
	static EAIJobType StaticGetAIActivatedJob(class AAIController* Controller, class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D31160
	static int32 StaticGetSuitableProducedJobNum(class UObject* WorldContext, class AAIController* Controller, EAIJobType JobType); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D31250
	static void StaticSetAIJobSetting(const struct FAIJobSetting& Setting, class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D31370

	bool AcquireAIJob(class AAIController* Controller, EAIJobType JobType); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2EC10
	void BeginPlay(); // (Native, Protected) // @ 0x140D2EEA0
	void CheckAIJobOver(); // (Final, Native, Protected) // @ 0x140D2EF60
	void CheckProduceAIJob(); // (Final, Native, Protected) // @ 0x140D2EF80
	void DistributeAIJob(EAIJobType JobType, class UAIJob* Job); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2F1F0
	void ExitAIJob(class AAIController* Controller, class UAIJob* Job); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2F340
	EAIJobType GetAIActivatedJob(class AAIController* Controller); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2F420
	class UAIJob* GetAIActivatedJobStatus(class AAIController* Controller); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2F4B0
	int32 GetSuitableProducedJobNum(class AAIController* Controller, EAIJobType JobType); // (Final, Native, Public, BlueprintCallable) // @ 0x140D2F8C0
	void SetAIJobSetting(const struct FAIJobSetting& Setting); // (Final, Native, Public, BlueprintCallable) // @ 0x140D308D0
	void Tick(float DeltaSeconds); // (Native, Protected) // @ 0x140D31F70
	void UpdateJobs(); // (Final, Native, Protected) // @ 0x140D32010

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIJobManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIJobManager")
	}
	static class AAIJobManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIJobManager>();
	}
};
DUMPER7_ASSERTS_AAIJobManager;

// Class GPAIBase.AILayoutConfigActor
// 0x0060 (0x03D0 - 0x0370)
class AAILayoutConfigActor final : public AActor
{
public:
	class FString                                 JsonConfig;                                        // 0x0370(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FExclusionTag>                  ExcluList;                                         // 0x0380(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0x40];                                     // 0x0390(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void LoadAILayout(class UObject* WorldContextObject, const class FString& ConfigCategory, const class FString& MapName, const int32 TagId); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D2FB00
	static void LoadAILayoutCustom(class UObject* WorldContextObject, const TArray<class FString>& LevelList, const class FString& MapName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140D2FCF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AILayoutConfigActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AILayoutConfigActor")
	}
	static class AAILayoutConfigActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAILayoutConfigActor>();
	}
};
DUMPER7_ASSERTS_AAILayoutConfigActor;

// Class GPAIBase.AIThreatWeightsComponent
// 0x0808 (0x0900 - 0x00F8)
class UAIThreatWeightsComponent final : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x800];                                     // 0x00F8(0x0800)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultTypeWeight;                                 // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultCampWeight;                                 // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetThreatCampWeight(const uint8 ThreatCamp, float Weight); // (Final, Native, Public, BlueprintCallable) // @ 0x140D30BD0
	void SetThreatTypeWeight(const uint8 ThreatType, float Weight); // (Final, Native, Public, BlueprintCallable) // @ 0x140D30C90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIThreatWeightsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIThreatWeightsComponent")
	}
	static class UAIThreatWeightsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIThreatWeightsComponent>();
	}
};
DUMPER7_ASSERTS_UAIThreatWeightsComponent;

// Class GPAIBase.PointGrid
// 0x0008 (0x0378 - 0x0370)
class APointGrid final : public AActor
{
public:
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<struct FAIPathFindingResult> RunPathFindingArrayAll(const class UAIThreatWeightsComponent* ThreatWeights, const struct FVector& StartPoint, const TArray<struct FVector>& GoalPoints, const float radius, const bool DebugDraw, class UObject* WorldContext); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140D300C0
	static struct FAIPathFindingResult RunPathFindingArrayBest(const class UAIThreatWeightsComponent* ThreatWeights, const struct FVector& StartPoint, const TArray<struct FVector>& GoalPoints, const float radius, const bool DebugDraw, class UObject* WorldContext); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140D30410
	static struct FAIPathFindingResult RunPathFindingSingle(const class UAIThreatWeightsComponent* ThreatWeights, const struct FVector& StartPoint, const struct FVector& GoalPoints, const float radius, const bool DebugDraw, class UObject* WorldContext); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140D30690
	static void ThreatAreaCircle(int64& AreaToken, const uint8 ThreatType, const uint8 CampType, const class AActor* Actor, const float radius, const float ThreatValue, const EAIThreatAreaWeightPainter Painter, const bool DebugDraw, class UObject* WorldContext); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140D316B0
	static void ThreatAreaCircleConnect(int64& AreaToken, const uint8 ThreatType, const uint8 CampType, const class AActor* Actor, const float radius, const float ThreatValue, const EAIThreatAreaWeightPainter Painter, const bool DebugDraw, class UObject* WorldContext); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140D31940
	static void ThreatAreaCircleVisible(int64& AreaToken, const uint8 ThreatType, const uint8 CampType, const class AActor* Actor, const class AActor* Enemy, const float radius, const float ThreatValue, const EAIThreatAreaWeightPainter Painter, const bool DebugDraw, class UObject* WorldContext); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140D31BD0
	static void ThreatAreaClear(int64& AreaToken, class UObject* WorldContext); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140D31EA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PointGrid")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PointGrid")
	}
	static class APointGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<APointGrid>();
	}
};
DUMPER7_ASSERTS_APointGrid;

// Class GPAIBase.AISense_SightEx
// 0x00E8 (0x0168 - 0x0080)
class UAISense_SightEx : public UAISense
{
public:
	uint8                                         Pad_80[0xC0];                                      // 0x0080(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxTracesPerTick;                                  // 0x0140(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MinQueriesPerTimeSliceCheck;                       // 0x0144(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        MaxTimeSlicePerTick;                               // 0x0148(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HighImportanceQueryDistanceThreshold;              // 0x0150(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxQueryImportance;                                // 0x0158(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SightLimitQueryImportance;                         // 0x015C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_160[0x8];                                      // 0x0160(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AISense_SightEx")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AISense_SightEx")
	}
	static class UAISense_SightEx* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISense_SightEx>();
	}
};
DUMPER7_ASSERTS_UAISense_SightEx;

// Class GPAIBase.AISenseConfig_SightEx
// 0x0020 (0x0068 - 0x0048)
class UAISenseConfig_SightEx final : public UAISenseConfig
{
public:
	TSubclassOf<class UAISense_SightEx>           Implementation;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVisionConeConfig>              VisionConeConfigs;                                 // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAISenseAffiliationFilter              DetectionByAffiliation;                            // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUsePawnRot;                                       // 0x0064(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AISenseConfig_SightEx")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AISenseConfig_SightEx")
	}
	static class UAISenseConfig_SightEx* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseConfig_SightEx>();
	}
};
DUMPER7_ASSERTS_UAISenseConfig_SightEx;

// Class GPAIBase.ThreatAreaInterface
// 0x0000 (0x0000 - 0x0000)
class IThreatAreaInterface final
{
public:
	float GetThreatAreaDuration(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	float GetThreatAreaHeight(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	float GetThreatAreaRadius(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	float GetThreatAreaScore(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	EAIThreatAreaType GetThreatAreaType(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ThreatAreaInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ThreatAreaInterface")
	}
	static class IThreatAreaInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IThreatAreaInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IThreatAreaInterface;

// Class GPAIBase.AIThreatAreaSystem
// 0x0018 (0x0388 - 0x0370)
class AAIThreatAreaSystem final : public ALevelSubsystem
{
public:
	TArray<struct FAIThreatArea>                  ThreatAreaList;                                    // 0x0370(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         UpdateInterval;                                    // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class AAIThreatAreaSystem* GetAIThreatAreaSystem(class UWorld* WorldContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140D359F0
	static float GetPositionThreatScoreStatic(class AActor* worldRelatedActor, const struct FVector& inCheckLoc); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x140D35E20
	static void RegisterAsDynamicThreatAreaInWorld(class AActor* RelatedActor); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D363B0
	static void RegisterAsStaticThreatAreaInWorld(const struct FVector& Center, float radius, float Height, float Duration, float Score, class AActor* RelatedActor); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x140D36600

	void BeginPlay(); // (Native, Protected) // @ 0x140D2EEA0
	float GetPositionThreatScore(const struct FVector& inCheckLoc); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x140D35D80
	void RegisterAsDynamicThreatArea(class AActor* RelatedActor); // (Final, Native, Public, BlueprintCallable) // @ 0x140D36330
	void RegisterAsStaticThreatArea(const struct FVector& Center, float radius, float Height, float Duration, float Score, class AActor* RelatedActor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x140D36420
	void Tick(float DeltaSeconds); // (Native, Protected) // @ 0x140D31F70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIThreatAreaSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIThreatAreaSystem")
	}
	static class AAIThreatAreaSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIThreatAreaSystem>();
	}
};
DUMPER7_ASSERTS_AAIThreatAreaSystem;

// Class GPAIBase.ThreatSourceInterface
// 0x0000 (0x0000 - 0x0000)
class IThreatSourceInterface final
{
public:
	float GetThreat_AirHit(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	float GetThreat_Default(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	float GetThreat_Heard(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	float GetThreat_Hurt(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	float GetThreat_Sight(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ThreatSourceInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ThreatSourceInterface")
	}
	static class IThreatSourceInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IThreatSourceInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IThreatSourceInterface;

// Class GPAIBase.AIThreatRecordComponent
// 0x0108 (0x0200 - 0x00F8)
class UAIThreatRecordComponent : public UActorComponent
{
public:
	TMap<TWeakObjectPtr<class ACHARACTER>, struct FCharacterThreatRecord> ThreadRecordMap;           // 0x00F8(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACHARACTER>              HighestThreatKey;                                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACHARACTER>              HighestSightThreatKey;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACHARACTER>              HighestHearingThreatKey;                           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACHARACTER>              HighestHurtThreatKey;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIThreatConfig                        ThreatConfig;                                      // 0x0178(0x0040)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	struct FAIThreatConfig                        ThreatConfigDefaultSetting;                        // 0x01B8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class AAIController*                          OwnerController;                                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ClearAllThreats(); // (Final, Native, Public, BlueprintCallable) // @ 0x140D359D0
	class ACHARACTER* GetHighestThreatCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x140D35BC0
	class ACHARACTER* GetHighestThreatCharacterInSpecType(EAIThreatType ThreatType); // (Final, Native, Public, BlueprintCallable) // @ 0x140D35BF0
	float GetHighestThreatCharacterValue(); // (Final, Native, Public, BlueprintCallable) // @ 0x140D35C80
	float GetHighestThreatCharacterValueInSpecType(EAIThreatType ThreatType); // (Final, Native, Public, BlueprintCallable) // @ 0x140D35CB0
	struct FVector GetLastHeardLocationFromHighestHeardTarget(); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x140D35D40
	struct FCharacterThreatRecord RecordNewThreadEvent(EAIThreatType ThreatType, float ThreatValue, class ACHARACTER* RelatedCharacter); // (Final, Native, Public, BlueprintCallable) // @ 0x140D36070
	void RecordPerceptionThreat(class AAIController* perceptionOwner, class ACHARACTER* threatRelatedCharacter, const struct FAIStimulus& Stimulus); // (Native, Public, BlueprintCallable) // @ 0x140D36180

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIThreatRecordComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIThreatRecordComponent")
	}
	static class UAIThreatRecordComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAIThreatRecordComponent>();
	}
};
DUMPER7_ASSERTS_UAIThreatRecordComponent;

// Class GPAIBase.BTComposite_RandomSelect
// 0x0010 (0x00A0 - 0x0090)
class UBTComposite_RandomSelect final : public UBTCompositeNode
{
public:
	TArray<int32>                                 PercentageOfBranch;                                // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTComposite_RandomSelect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTComposite_RandomSelect")
	}
	static class UBTComposite_RandomSelect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTComposite_RandomSelect>();
	}
};
DUMPER7_ASSERTS_UBTComposite_RandomSelect;

// Class GPAIBase.BTComposite_SelectByBBKeyValue
// 0x0038 (0x00C8 - 0x0090)
class UBTComposite_SelectByBBKeyValue final : public UBTCompositeNode
{
public:
	struct FBlackboardKeySelector                 SpecKey;                                           // 0x0090(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<float>                                 SpecKeySection;                                    // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTComposite_SelectByBBKeyValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTComposite_SelectByBBKeyValue")
	}
	static class UBTComposite_SelectByBBKeyValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTComposite_SelectByBBKeyValue>();
	}
};
DUMPER7_ASSERTS_UBTComposite_SelectByBBKeyValue;

// Class GPAIBase.DynamicBlackboardComponent
// 0x0010 (0x0200 - 0x01F0)
class UDynamicBlackboardComponent final : public UBlackboardComponent
{
public:
	TArray<struct FBlackboardDataFrame>           Frames;                                            // 0x01F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicBlackboardComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicBlackboardComponent")
	}
	static class UDynamicBlackboardComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicBlackboardComponent>();
	}
};
DUMPER7_ASSERTS_UDynamicBlackboardComponent;

// Class GPAIBase.AISpecificBehaviorFlagsInterface
// 0x0000 (0x0000 - 0x0000)
class IAISpecificBehaviorFlagsInterface final
{
public:
	void ApplyOrRegisterSpecificBehaviorFactor(EGPSpecificBehaviorType factorType, int32 NewValue); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140D35850
	void OnBTRechecked(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140D36010
	void RecheckedBTType(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140D36050
	bool ShouldRecheckBTbySpecificBehaviorType(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140D36930

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AISpecificBehaviorFlagsInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AISpecificBehaviorFlagsInterface")
	}
	static class IAISpecificBehaviorFlagsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAISpecificBehaviorFlagsInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAISpecificBehaviorFlagsInterface;

// Class GPAIBase.GPAIBehaviorTreeSubsystem
// 0x0000 (0x0030 - 0x0030)
class UGPAIBehaviorTreeSubsystem final : public UWorldSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAIBehaviorTreeSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAIBehaviorTreeSubsystem")
	}
	static class UGPAIBehaviorTreeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAIBehaviorTreeSubsystem>();
	}
};
DUMPER7_ASSERTS_UGPAIBehaviorTreeSubsystem;

// Class GPAIBase.GPAIBehaviorTreeComponent
// 0x0088 (0x0330 - 0x02A8)
class UGPAIBehaviorTreeComponent : public UBehaviorTreeComponent
{
public:
	EGPSpecificBehaviorType                       SpecificBehaviorType;                              // 0x02A8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EGPSpecificBehaviorType, struct FGPBehaviorFactor> BehaviorFactorMap;                       // 0x02B0(0x0050)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0x28];                                     // 0x0300(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAIBehaviorTreeSubsystem*             Subsystem;                                         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ApplyOrRegisterBehaviorFactor(EGPSpecificBehaviorType Index_0, int32 NewValue); // (Final, Native, Public, BlueprintCallable) // @ 0x140D35790
	void ApplyValueToBehaviorFactor(EGPSpecificBehaviorType Index_0, int32 NewValue); // (Final, Native, Public, BlueprintCallable) // @ 0x140D35910
	struct FGPBehaviorFactor GetBehaviorFactor(EGPSpecificBehaviorType Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x140D35A70
	void ReMakeSpecificBehaviorType(); // (Final, Native, Public, BlueprintCallable) // @ 0x140D36030
	void SetPathfindCommand(const struct FAIPathFindingResult& Command); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140D36850

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAIBehaviorTreeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAIBehaviorTreeComponent")
	}
	static class UGPAIBehaviorTreeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAIBehaviorTreeComponent>();
	}
};
DUMPER7_ASSERTS_UGPAIBehaviorTreeComponent;

// Class GPAIBase.GPAI_CoverPointAnimSetting
// 0x0078 (0x0170 - 0x00F8)
class UGPAI_CoverPointAnimSetting final : public UActorComponent
{
public:
	ECoverPointCondition                          CoverPointCodition;                                // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastEnterCoverCompleteTime;                        // 0x00FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             EnterCoverAnimTable;                               // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCoverPointAnimInfo                    NoUse_ForKismetInspectorBug;                       // 0x0108(0x0010)(Edit, DisableEditOnInstance, EditConst, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UAnimMontage*                           RunningIdleMontage;                                // 0x0118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLerpingToCoverPoint;                             // 0x0120(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentLerpToCoverPointTime;                       // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalLerpToCoverPointTime;                         // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LerpingToCoverLocation;                            // 0x012C(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LerpingToCoverDirection;                           // 0x0138(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LerpingToCoverStartLocation;                       // 0x0144(0x000C)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  LerpingToCoverStartRotation;                       // 0x0150(0x0010)(BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class ACHARACTER*                             OwnerCharacter;                                    // 0x0160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAnimMontage* GetBestMontageToEnterCover(class AAIController* Controller, class UNZCoverPoint* coverPoint); // (Final, Native, Public) // @ 0x140D35B00
	void LerpToCoverPointTransform(const struct FVector& CoverLocation, const struct FVector& coverToWallDir, float Duration); // (Net, NetReliable, Native, Event, NetMulticast, Public, HasDefaults, BlueprintCallable) // @ 0x140D35EF0
	void SetCharacterCoverPointCondition(ECoverPointCondition Condition); // (Final, Native, Public, BlueprintCallable) // @ 0x140D367D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAI_CoverPointAnimSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAI_CoverPointAnimSetting")
	}
	static class UGPAI_CoverPointAnimSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAI_CoverPointAnimSetting>();
	}
};
DUMPER7_ASSERTS_UGPAI_CoverPointAnimSetting;

// Class GPAIBase.GPAIMontageMappingTemplate
// 0x0010 (0x0038 - 0x0028)
class UGPAIMontageMappingTemplate final : public UObject
{
public:
	TArray<struct FGPAIMontageMapping>            MontageMapping;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAIMontageMappingTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAIMontageMappingTemplate")
	}
	static class UGPAIMontageMappingTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAIMontageMappingTemplate>();
	}
};
DUMPER7_ASSERTS_UGPAIMontageMappingTemplate;

// Class GPAIBase.GPAI_PlayMontageCallbackProxy
// 0x0088 (0x00B0 - 0x0028)
class UGPAI_PlayMontageCallbackProxy final : public UObject
{
public:
	class UGPAI_CoverPointAnimSetting*            coverAnimSetting;                                  // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName NotifyName, class UGPAI_CoverPointAnimSetting* coverAnimSetting)> OnCompleted; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName NotifyName)> OnBlendOut;                               // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName NotifyName, class UGPAI_CoverPointAnimSetting* coverAnimSetting)> OnInterrupted; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName NotifyName)> OnNotifyBegin;                            // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName NotifyName)> OnNotifyEnd;                              // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x30];                                      // 0x0080(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGPAI_PlayMontageCallbackProxy* CreateProxyObjectForPlayMontage(class USkeletalMeshComponent* InSkeletalMeshComponent, class UAnimMontage* MontageToPlay, float PlayRate, float StartingPosition, class FName StartingSection); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140D3A460

	void Clear(); // (Final, Native, Public) // @ 0x140D3A3A0
	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted); // (Final, Native, Protected) // @ 0x140D3ABA0
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted); // (Final, Native, Protected) // @ 0x140D3AC70
	void OnNotifyBeginReceived(class FName NotifyName, const struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload); // (Final, Native, Protected, HasOutParams) // @ 0x140D3AD40
	void OnNotifyEndReceived(class FName NotifyName, const struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload); // (Final, Native, Protected, HasOutParams) // @ 0x140D3AE20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAI_PlayMontageCallbackProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAI_PlayMontageCallbackProxy")
	}
	static class UGPAI_PlayMontageCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAI_PlayMontageCallbackProxy>();
	}
};
DUMPER7_ASSERTS_UGPAI_PlayMontageCallbackProxy;

// Class GPAIBase.GPBTTask_MoveByPath
// 0x0038 (0x00A8 - 0x0070)
class UGPBTTask_MoveByPath final : public UBTTaskNode
{
public:
	float                                         CustomAcceptableRadius;                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TargetEnemyKey;                                    // 0x0078(0x0028)(Edit, NativeAccessSpecifierPrivate)
	bool                                          FaceOnTarget;                                      // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBTTask_MoveByPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBTTask_MoveByPath")
	}
	static class UGPBTTask_MoveByPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBTTask_MoveByPath>();
	}
};
DUMPER7_ASSERTS_UGPBTTask_MoveByPath;

// Class GPAIBase.GPBTDecorator_SpecificBehaviorCheck
// 0x0000 (0x0068 - 0x0068)
class UGPBTDecorator_SpecificBehaviorCheck final : public UBTDecorator
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBTDecorator_SpecificBehaviorCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBTDecorator_SpecificBehaviorCheck")
	}
	static class UGPBTDecorator_SpecificBehaviorCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBTDecorator_SpecificBehaviorCheck>();
	}
};
DUMPER7_ASSERTS_UGPBTDecorator_SpecificBehaviorCheck;

// Class GPAIBase.GPBTTaskBase
// 0x0008 (0x0078 - 0x0070)
class UGPBTTaskBase : public UBTTaskNode
{
public:
	float                                         MaxWaitTime;                                       // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugLog;                                     // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetCurrentGameTime() const; // (Final, Native, Protected, Const) // @ 0x140D3A7D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBTTaskBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBTTaskBase")
	}
	static class UGPBTTaskBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBTTaskBase>();
	}
};
DUMPER7_ASSERTS_UGPBTTaskBase;

// Class GPAIBase.GPBTTask_Blueprint
// 0x0030 (0x00A8 - 0x0078)
class UGPBTTask_Blueprint : public UGPBTTaskBase
{
public:
	class AAIController*                          AIOwner;                                           // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 ActorOwner;                                        // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0x18];                                      // 0x0088(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShowPropertyDetails : 1;                          // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishAbort(); // (Final, Native, Protected, BlueprintCallable) // @ 0x140D3A5E0
	void FinishExecute(bool bSuccess); // (Final, Native, Protected, BlueprintCallable) // @ 0x140D3A600
	void ReceiveAbort(class AActor* OwnerActor); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveExecute(class AActor* OwnerActor); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void SetFinishOnMessage(class FName MessageName); // (Final, Native, Protected, BlueprintCallable) // @ 0x140D3AF80
	void SetFinishOnMessageWithId(class FName MessageName, int32 requestId); // (Final, Native, Protected, BlueprintCallable) // @ 0x140D3B000

	class FString GetSpecDescription() const; // (Native, Event, Protected, BlueprintEvent, Const) // @ 0x140D3A970
	bool IsTaskAborting() const; // (Final, Native, Protected, BlueprintCallable, BlueprintPure, Const) // @ 0x140D3AA80
	bool IsTaskExecuting() const; // (Final, Native, Protected, BlueprintCallable, BlueprintPure, Const) // @ 0x140D3AAB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBTTask_Blueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBTTask_Blueprint")
	}
	static class UGPBTTask_Blueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBTTask_Blueprint>();
	}
};
DUMPER7_ASSERTS_UGPBTTask_Blueprint;

// Class GPAIBase.GPBTTask_EnterCoverPoint
// 0x0048 (0x00C0 - 0x0078)
class UGPBTTask_EnterCoverPoint final : public UGPBTTaskBase
{
public:
	struct FBlackboardKeySelector                 TargetCoverPointKey;                               // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	int32                                         SquaredDistToPlayEnterMontage;                     // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseControllerRotation;                             // 0x00A4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotationCompositeVelocity;                        // 0x00A5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClearFocusTarget;                                 // 0x00A6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A7[0x1];                                       // 0x00A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
