#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPAudioRuntime

#include "Basic.hpp"

#include "PerfGear_structs.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"


namespace SDK
{

// Class GPAudioRuntime.EmissiveCubeComponent
// 0x0010 (0x05A0 - 0x0590)
class UEmissiveCubeComponent final : public UPrimitiveComponent
{
public:
	class UModel*                                 Brush;                                             // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BoundaryColor;                                     // 0x0590(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLighting;                                         // 0x0594(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLightingWhenContainsCamera;                       // 0x0595(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_596[0xA];                                      // 0x0596(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EmissiveCubeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EmissiveCubeComponent")
	}
	static class UEmissiveCubeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmissiveCubeComponent>();
	}
};
DUMPER7_ASSERTS_UEmissiveCubeComponent;

// Class GPAudioRuntime.GPAudioReverbSceneDataAsset
// 0x0010 (0x0040 - 0x0030)
class UGPAudioReverbSceneDataAsset final : public UDataAsset
{
public:
	TArray<struct FGPAudioReverbSceneConfig>      ReverbSceneConfigs;                                // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAudioReverbSceneDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAudioReverbSceneDataAsset")
	}
	static class UGPAudioReverbSceneDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAudioReverbSceneDataAsset>();
	}
};
DUMPER7_ASSERTS_UGPAudioReverbSceneDataAsset;

// Class GPAudioRuntime.AnimNotify_GPAudioBase
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_GPAudioBase : public UAnimNotify
{
public:
	EGPAnimNotifyType                             AnimNotifyType;                                    // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyAsMark;                                       // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LogicAudio1P;                                      // 0x003A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPAudioBlueprintType                         AudioTypeOverride;                                 // 0x003B(0x0001)(BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckNeedPlay(class AActor* Owner) const; // (Native, Public, BlueprintCallable, Const) // @ 0x141BAC3E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_GPAudioBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_GPAudioBase")
	}
	static class UAnimNotify_GPAudioBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_GPAudioBase>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_GPAudioBase;

// Class GPAudioRuntime.GPAudioRoomBakeDataAsset
// 0x0200 (0x0230 - 0x0030)
class UGPAudioRoomBakeDataAsset final : public UDataAsset
{
public:
	EGPAudioRoomBakeDataType                      DataType;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RoomBPName;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CellSize;                                          // 0x0048(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtend;                                         // 0x0054(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxPosOffset;                                      // 0x0060(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  BoxQuat;                                           // 0x0070(0x0010)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CelllIndexMax;                                     // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int8>                                  BakeDataArray;                                     // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint32>                                CellIndex2BakeDataArray;                           // 0x0098(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<int32>                                   CellIndex2BakeDataSet;                             // 0x00A8(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int32, int8>                             CellIndex2BakeDataMap;                             // 0x00F8(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<uint16>                                AllCellIndexArr;                                   // 0x0148(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGPADoorWinZone>                DoorWinZones;                                      // 0x0158(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bBakeByBP;                                         // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_169[0xC7];                                     // 0x0169(0x00C7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAudioRoomBakeDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAudioRoomBakeDataAsset")
	}
	static class UGPAudioRoomBakeDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAudioRoomBakeDataAsset>();
	}
};
DUMPER7_ASSERTS_UGPAudioRoomBakeDataAsset;

// Class GPAudioRuntime.AnimNotifyState_AudioEventBase
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_AudioEventBase : public UAnimNotifyState
{
public:
	bool                                          bOnlyAsMark;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LogicAudio1P;                                      // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckNeedPlay(class AActor* Owner) const; // (Native, Public, BlueprintCallable, Const) // @ 0x141BAC340

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_AudioEventBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_AudioEventBase")
	}
	static class UAnimNotifyState_AudioEventBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_AudioEventBase>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_AudioEventBase;

// Class GPAudioRuntime.GPAudioServerNotifier
// 0x0038 (0x0060 - 0x0028)
class UGPAudioServerNotifier : public UObject
{
public:
	struct FGPAudioServerNotifierSpeedInfo        Notifiers[0x3];                                    // 0x0028(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAudioServerNotifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAudioServerNotifier")
	}
	static class UGPAudioServerNotifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAudioServerNotifier>();
	}
};
DUMPER7_ASSERTS_UGPAudioServerNotifier;

// Class GPAudioRuntime.AnimNotifyState_GPAudioEvent
// 0x0028 (0x0060 - 0x0038)
class UAnimNotifyState_GPAudioEvent : public UAnimNotifyState_AudioEventBase
{
public:
	class UGPAudioEventAsset*                     BeginAudioEvent;                                   // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPAudioBlueprintType                         BeginAudioType;                                    // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bStopAudioOnSeqExit;                               // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     EndAudioEvent;                                     // 0x0050(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPAudioBlueprintType                         EndAudioType;                                      // 0x0058(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyFPP;                                          // 0x0059(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyTPP;                                          // 0x005A(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceivedNotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, bool bIsFPP) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x141BACB10
	void ReceivedNotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, bool bIsFPP) const; // (Final, Native, Public, BlueprintCallable, Const) // @ 0x141BACC60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_GPAudioEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_GPAudioEvent")
	}
	static class UAnimNotifyState_GPAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GPAudioEvent>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_GPAudioEvent;

// Class GPAudioRuntime.GPAudioSpatialAudioSettings
// 0x01C0 (0x01E8 - 0x0028)
class UGPAudioSpatialAudioSettings final : public UObject
{
public:
	struct FSoftObjectPath                        DiffractionAngleFactorCurvePath;                   // 0x0028(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DiffractionDistanceFactorCurvePath;                // 0x0040(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DiffractionPortalAttenFactorCurvePath;             // 0x0058(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        TransmissionDistanceSubtractionCurvePath;          // 0x0070(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClosePortalTransmissionBlock;                      // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OpenPortalTransmissionBlock;                       // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OpenedPortalBlockMaxValue;                         // 0x0090(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiffractionPercent;                                // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransmissionMinValue;                              // 0x0098(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDiffractionSteps;                               // 0x009C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDiffractionPaths;                               // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDiffractionCalcNum;                             // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 DistanceArray_M;                                   // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<float>                                 CheckIntervalArray;                                // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         MaxDiffractionSteps_Mobile;                        // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDiffractionPaths_Mobile;                        // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDiffractionCalcNum_Mobile;                      // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 DistanceArray_M_Mobile;                            // 0x00D8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<float>                                 CheckIntervalArray_Mobile;                         // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        AudioPresetTablePath;                              // 0x00F8(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ConvolutionReverbPresetTablePath;                  // 0x0110(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpatialAudioManagerTickInterval;                   // 0x0128(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ObstructionRTPCName;                               // 0x012C(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistScalarStartDist;                               // 0x0134(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistScalarEndDist;                                 // 0x0138(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ObsDistanceArray_M;                                // 0x0140(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<float>                                 ObsCheckIntervalArrayFrontInView;                  // 0x0150(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<float>                                 ObsCheckIntervalArrayFrontOutOfView;               // 0x0160(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<float>                                 ObsCheckIntervalArrayBack;                         // 0x0170(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TMap<EGPAudioBlueprintType, float>            ObsCheckLastTime;                                  // 0x0180(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        OccFloorResultMappingCurvePath;                    // 0x01D0(0x0018)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAudioSpatialAudioSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAudioSpatialAudioSettings")
	}
	static class UGPAudioSpatialAudioSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAudioSpatialAudioSettings>();
	}
};
DUMPER7_ASSERTS_UGPAudioSpatialAudioSettings;

// Class GPAudioRuntime.AudioCylinderBuilder
// 0x0000 (0x0080 - 0x0080)
class UAudioCylinderBuilder : public UBrushBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioCylinderBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioCylinderBuilder")
	}
	static class UAudioCylinderBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioCylinderBuilder>();
	}
};
DUMPER7_ASSERTS_UAudioCylinderBuilder;

// Class GPAudioRuntime.AudioCylinderDebugActor
// 0x0098 (0x0440 - 0x03A8)
class alignas(0x10) AAudioCylinderDebugActor final : public AVolume
{
public:
	struct FDebugCylinderHolder                   CylinderData;                                      // 0x03A8(0x001C)(NoDestructor, NativeAccessSpecifierPrivate)
	int32                                         CylinderIndex;                                     // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Height;                                            // 0x03C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YRadius;                                           // 0x03CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XRadius;                                           // 0x03D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CylinderLocation;                                  // 0x03D4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Sides;                                             // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZRotation;                                         // 0x03E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Segments;                                          // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EC[0x44];                                     // 0x03EC(0x0044)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioCylinderDebugBuilder*             CylinderBuilder;                                   // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProceduralMeshComponent*               ProcMesh;                                          // 0x0438(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioCylinderDebugActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioCylinderDebugActor")
	}
	static class AAudioCylinderDebugActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAudioCylinderDebugActor>();
	}
};
DUMPER7_ASSERTS_AAudioCylinderDebugActor;

// Class GPAudioRuntime.AudioCylinderDebugBuilder
// 0x0020 (0x00A0 - 0x0080)
class UAudioCylinderDebugBuilder final : public UAudioCylinderBuilder
{
public:
	float                                         CylinderHeight;                                    // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YRadius;                                           // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XRadius;                                           // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Sides;                                             // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AlignToSide : 1;                                   // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioCylinderDebugBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioCylinderDebugBuilder")
	}
	static class UAudioCylinderDebugBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioCylinderDebugBuilder>();
	}
};
DUMPER7_ASSERTS_UAudioCylinderDebugBuilder;

// Class GPAudioRuntime.GameAudioVolume
// 0x03A8 (0x0750 - 0x03A8)
class AGameAudioVolume : public AVolume
{
public:
	bool                                          bOrientedBoxCheckPoint;                            // 0x03A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RadiusBorderSquared;                               // 0x03AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStictVolumeHigh;                                  // 0x03B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VomueMeshObjectLocation;                           // 0x03B4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 WorldPivotActor;                                   // 0x03C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioRoomBakeDataAsset> RoomBakeDataSoftObj;                             // 0x03C8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeOcclusion;                                   // 0x03F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EAudioCharacterGroup, class UGPAudioEventAsset*> CharaterEnterEvents;                       // 0x03F8(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<EAudioCharacterGroup, class UGPAudioEventAsset*> CharaterExitEvents;                        // 0x0448(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EGPARoomBakeInterpolationType                 RoomBakeInterpolationType;                         // 0x0498(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayEventAtLocation;                              // 0x0499(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49A[0x6];                                      // 0x049A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGameAudioVolume*>               ConnectedVolumes;                                  // 0x04A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EAudioVolumeType                              AudioVolumeType;                                   // 0x04B0(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpaceType;                                         // 0x04B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioVolumeIDString;                               // 0x04B8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameAudioVolume*                       OwnedDiffractionAreaVolume;                        // 0x04C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePriority;                                   // 0x04D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Priority;                                          // 0x04D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReverbPresetName_1P;                               // 0x04D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReverbPresetName_3P;                               // 0x04E8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GunTailPresetName;                                 // 0x04F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     EnterEvent;                                        // 0x0508(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     ExitEvent;                                         // 0x0510(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     EnterEventDueToPriority;                           // 0x0518(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     ExitEventDueToPriority;                            // 0x0520(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EAudioWeatherType, class UGPAudioEventAsset*> EnterEventsForWeather;                        // 0x0528(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<EAudioWeatherType, class UGPAudioEventAsset*> ExitEventsForWeather;                         // 0x0578(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 EnterMusicEventName;                               // 0x05C8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExitMusicEventName;                                // 0x05D8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGPAudioConditionRTPC>          CharacterRTPCs;                                    // 0x05E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameAudioVolumeBounding>       DetailGeos;                                        // 0x05F8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FGameAudioVolumeBounding>       ExcludeGeos;                                       // 0x0608(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	float                                         FullBrokenPercent;                                 // 0x0618(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61C[0x1C];                                     // 0x061C(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioRoomBakeDataAsset*              m_RoomBakeData;                                    // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_640[0x110];                                    // 0x0640(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAudioWeatherTypeChanged(EAudioWeatherType WeatherType); // (Final, Native, Public) // @ 0x141BAF290

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAudioVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAudioVolume")
	}
	static class AGameAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameAudioVolume>();
	}
};
DUMPER7_ASSERTS_AGameAudioVolume;

// Class GPAudioRuntime.GameAcousticPortal
// 0x0090 (0x07E0 - 0x0750)
class alignas(0x10) AGameAcousticPortal final : public AGameAudioVolume
{
public:
	EAkAcousticPortalState                        InitialState;                                      // 0x0750(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAudioPortalType                              PortalSizeType;                                    // 0x0751(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_752[0x6];                                      // 0x0752(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAudioVolume*                       FrontRoomVolume;                                   // 0x0758(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGameAudioVolume*                       BackRoomVolume;                                    // 0x0760(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDebugDisplay;                               // 0x0768(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_769[0x3];                                      // 0x0769(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomOpenTransmissionBlock;                       // 0x076C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomClosedTransmissionBlock;                     // 0x0770(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomDiffractionScalar;                           // 0x0774(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArrowComponent*                        ArrowComponent;                                    // 0x0778(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_780[0x60];                                     // 0x0780(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisablePortal(const class FString& InReason); // (Final, Native, Public, BlueprintCallable) // @ 0x141BAC4B0
	void EnablePortal(const class FString& InReason); // (Final, Native, Public, BlueprintCallable) // @ 0x141BAC570

	EAkAcousticPortalState GetCurrentState() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141BAC630

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAcousticPortal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAcousticPortal")
	}
	static class AGameAcousticPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameAcousticPortal>();
	}
};
DUMPER7_ASSERTS_AGameAcousticPortal;

// Class GPAudioRuntime.GameAkComponent
// 0x0D70 (0x1430 - 0x06C0)
class UGameAkComponent : public UAkComponent
{
public:
	uint8                                         Pad_6C0[0x14C];                                    // 0x06C0(0x014C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNeedInitCharacterAtBeginPlay;                     // 0x080C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedUpdateSpatialPosition;                        // 0x080D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRoomBakeData;                                  // 0x080E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSpatialVolumeRoomReverb;                       // 0x080F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAudioCharacterGroup                          CharterGroup;                                      // 0x0810(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAudioCharacterViewState                      ViewState;                                         // 0x0811(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_812[0x2];                                      // 0x0812(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AGameAudioVolume>        ParentVolume;                                      // 0x0814(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGameAudioVolume>        ReverbVolume;                                      // 0x081C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGameAudioVolume>        GunTailVolume;                                     // 0x0824(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGameAudioVolume>        SpatialVolumePtr;                                  // 0x082C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGameAudioVolume>        PortalVolume;                                      // 0x0834(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioReverbSceneDataAsset*           ReverbSceneDataAsset;                              // 0x0840(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameAudioOpenEarlyReflection*          OpenEarlyReflection;                               // 0x0848(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedManagerTickInfo;                              // 0x0850(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedDiffraction;                                  // 0x0851(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedCheckIndoorArea;                              // 0x0852(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedUseParentGameAk;                              // 0x0853(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedOutdoorObstruction;                           // 0x0854(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedUpdateLimitSpatialInfo;                       // 0x0855(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_856[0x2];                                      // 0x0856(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LimitSpatialInfoUpdateRadius;                      // 0x0858(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LimitSpatialInfoUpdateInterval;                    // 0x085C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_860[0x10];                                     // 0x0860(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameAudioDiffractionVolume*            CurrentDiffractionVolume;                          // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_878[0x20];                                     // 0x0878(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AGameAudioVolume>> ContainedVolumes;                                 // 0x0898(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A8[0x170];                                    // 0x08A8(0x0170)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ACHARACTER*>                     AllowObserveredCharacters;                         // 0x0A18(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A28[0x959];                                    // 0x0A28(0x0959)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bInBlastShield;                                    // 0x1381(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1382[0xAE];                                    // 0x1382(0x00AE)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CheckGameAkWaterState(); // (Final, Native, Public) // @ 0x141BAC320
	bool CheckWaterFrameLimit(); // (Final, Native, Public) // @ 0x141BAC480
	bool NeedCheckWaterBeforePlay(); // (Final, Native, Public) // @ 0x141BAC730
	void OnAttenuationScaleUpdated(); // (Final, Native, Public) // @ 0x141BAC760
	void OnAudioFinishCallback(EGPEventCallbackType CallbackType, int32 PlayingId); // (Final, Native, Public) // @ 0x141BAC780
	void OnAudioFinishCallbackDelay(EGPEventCallbackType CallbackType, int32 PlayingId); // (Final, Native, Public) // @ 0x141BAC840
	void PlayFoliageOverlapAudio(class UGPAudioEventAsset* AudioEvent); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141BAC900
	void PlayFoliageOverlapStirAudio(); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141BAC980
	struct FGPAudioFuturePlayingID PostGPAudio(class UGPAudioEventAsset* AudioAsset, bool bMakeNoise, EGPAudioBlueprintType AudioType, bool bPreCutted); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141BAC9A0
	void SetWaterPreset(EGPAudioWaterPreset InState); // (Final, Native, Public) // @ 0x141BACDB0
	void SetWaterStateCheckService(bool bEnable); // (Final, Native, Public) // @ 0x141BACE30
	void SetWaterStateRTPC(float TargetWaterStateRTPCValue); // (Final, Native, Public) // @ 0x141BACEC0
	void StartDoppler(float ScalingFactor, float TimeStep); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141BACF40
	void StopDoppler(); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141BAD000
	void StopGameAk(); // (BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x141BAD020
	void TickWaterState(class UGameAkComponent* InListener); // (Final, Native, Public) // @ 0x141BAD040

	bool GetFootLocation(struct FVector* FootLocation) const; // (Final, Native, Public, HasOutParams, HasDefaults, Const) // @ 0x141BAC660
	bool IsGameAkUnderWater() const; // (Final, Native, Public, Const) // @ 0x141BAC700

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAkComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAkComponent")
	}
	static class UGameAkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameAkComponent>();
	}
};
DUMPER7_ASSERTS_UGameAkComponent;

// Class GPAudioRuntime.GameAreaAudioVolume
// 0x0000 (0x0750 - 0x0750)
class AGameAreaAudioVolume final : public AGameAudioVolume
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAreaAudioVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAreaAudioVolume")
	}
	static class AGameAreaAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameAreaAudioVolume>();
	}
};
DUMPER7_ASSERTS_AGameAreaAudioVolume;

// Class GPAudioRuntime.GameAudioColliderVolume
// 0x0038 (0x03E0 - 0x03A8)
class AGameAudioColliderVolume final : public AVolume
{
public:
	TSoftObjectPtr<class UGPAudioColliderDataAsset> ColliderDataSoftObj;                             // 0x03A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x10];                                     // 0x03D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAudioColliderVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAudioColliderVolume")
	}
	static class AGameAudioColliderVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameAudioColliderVolume>();
	}
};
DUMPER7_ASSERTS_AGameAudioColliderVolume;

// Class GPAudioRuntime.AudioGraphFunctions
// 0x0000 (0x0028 - 0x0028)
class UAudioGraphFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioGraphFunctions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioGraphFunctions")
	}
	static class UAudioGraphFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioGraphFunctions>();
	}
};
DUMPER7_ASSERTS_UAudioGraphFunctions;

// Class GPAudioRuntime.GameAudioDiffractionVolume
// 0x00A8 (0x07F8 - 0x0750)
class AGameAudioDiffractionVolume final : public AGameAudioVolume
{
public:
	TArray<struct FPresetIdAndArea>               ReverbPresetNameAndArea;                           // 0x0750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPresetIdAndArea>               GunTailPresetIdAndArea;                            // 0x0760(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AGameAudioVolume*>               SpatialVolumes;                                    // 0x0770(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AGameAcousticPortal*>            Portals;                                           // 0x0780(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AGameAcousticPortal*>            ConnectedPortals;                                  // 0x0790(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FSpatialAudioOctree                    VolumeOctree;                                      // 0x07A0(0x0058)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAudioDiffractionVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAudioDiffractionVolume")
	}
	static class AGameAudioDiffractionVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameAudioDiffractionVolume>();
	}
};
DUMPER7_ASSERTS_AGameAudioDiffractionVolume;

// Class GPAudioRuntime.GameAudioDetailVolumeForEditor
// 0x00E8 (0x0490 - 0x03A8)
class AGameAudioDetailVolumeForEditor final : public AVolume
{
public:
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameAudioVolumeBounding               VolumeBounding;                                    // 0x03B0(0x0090)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AGameAudioVolume>        ParentVolume;                                      // 0x0440(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_448[0x48];                                     // 0x0448(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAudioDetailVolumeForEditor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAudioDetailVolumeForEditor")
	}
	static class AGameAudioDetailVolumeForEditor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameAudioDetailVolumeForEditor>();
	}
};
DUMPER7_ASSERTS_AGameAudioDetailVolumeForEditor;

// Class GPAudioRuntime.GameAudioOpenEarlyReflection
// 0x0AB0 (0x0D00 - 0x0250)
class UGameAudioOpenEarlyReflection : public USceneComponent
{
public:
	struct FGPAOpenEarlyReflectionConfig          Config;                                            // 0x0250(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableReflection;                                 // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPAOpenReflectionGeometryType                GeometryType;                                      // 0x0279(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWeedOutLog;                                 // 0x027A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAudioCollider;                              // 0x027B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableUpdateGeometry;                             // 0x027C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkAcousticTexture*>             AkAcousticTextures;                                // 0x0280(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UGPAudioColliderDataAsset*              ColliderData;                                      // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AGameAudioColliderVolume> CurrentVolume;                                    // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0xA60];                                    // 0x02A0(0x0A60)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAudioOpenEarlyReflection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAudioOpenEarlyReflection")
	}
	static class UGameAudioOpenEarlyReflection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameAudioOpenEarlyReflection>();
	}
};
DUMPER7_ASSERTS_UGameAudioOpenEarlyReflection;

// Class GPAudioRuntime.GameAudioOpenEarlyReflection3p
// 0x0000 (0x0D00 - 0x0D00)
class UGameAudioOpenEarlyReflection3p final : public UGameAudioOpenEarlyReflection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAudioOpenEarlyReflection3p")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAudioOpenEarlyReflection3p")
	}
	static class UGameAudioOpenEarlyReflection3p* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameAudioOpenEarlyReflection3p>();
	}
};
DUMPER7_ASSERTS_UGameAudioOpenEarlyReflection3p;

// Class GPAudioRuntime.GameAudioPointEmitter
// 0x0040 (0x0138 - 0x00F8)
class UGameAudioPointEmitter final : public UActorComponent
{
public:
	bool                                          bNeedObstructionOcclusion;                         // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     LoopEvent;                                         // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameAkComponent*                       AkEmitter;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceUseMaxDistance;                              // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDistance;                                       // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceToListener;                                // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopTransitionMS;                                  // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_120[0x18];                                     // 0x0120(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameAudioPointEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameAudioPointEmitter")
	}
	static class UGameAudioPointEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameAudioPointEmitter>();
	}
};
DUMPER7_ASSERTS_UGameAudioPointEmitter;

// Class GPAudioRuntime.GameAudioPolygonEmitter
// 0x0068 (0x0160 - 0x00F8)
class UGameAudioPolygonEmitter final : public UActorComponent
{
public:
	bool                                          bNeedObstructionOcclusion;                         // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPAudioEventAsset*                     LoopEvent;                                         // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameAkComponent*                       AkEmitter;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance3D;                                        // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
