#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPAudioRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"
#include "GameCore_structs.hpp"


namespace SDK
{

// Enum GPAudioRuntime.EGPEventCallbackType
// NumValues: 0x0006
enum class EGPEventCallbackType : uint8
{
	BeginPlay                                = 0,
	EndPlay                                  = 1,
	StopWhenLoading                          = 2,
	PlayFailed                               = 3,
	AsyncPlayFailed                          = 4,
	EGPEventCallbackType_MAX                 = 5,
};

// Enum GPAudioRuntime.EGPAnimNotifyType
// NumValues: 0x0004
enum class EGPAnimNotifyType : uint8
{
	None                                     = 0,
	GAudio                                   = 1,
	Foot                                     = 2,
	EGPAnimNotifyType_MAX                    = 3,
};

// Enum GPAudioRuntime.EGPGameAudioGeometryType
// NumValues: 0x0003
enum class EGPGameAudioGeometryType : uint8
{
	OBB                                      = 0,
	Cylinder                                 = 1,
	EGPGameAudioGeometryType_MAX             = 2,
};

// Enum GPAudioRuntime.EGameAudioVolumeOutOfPlanType
// NumValues: 0x0005
enum class EGameAudioVolumeOutOfPlanType : uint8
{
	PROJECT_ANY                              = 0,
	PROJECT_NORMAL_PLAN_SEG                  = 1,
	PROJECT_NORMAL_PLAN_Z                    = 2,
	SECTOR_XY                                = 3,
	EGameAudioVolumeOutOfPlanType_MAX        = 4,
};

// Enum GPAudioRuntime.ESpatialVolumeDisableCondition
// NumValues: 0x0002
enum class ESpatialVolumeDisableCondition : uint8
{
	CONDITION_CRACKED_BIG_EVENT              = 0,
	CONDITION_CRACKED_BIG_MAX                = 1,
};

// Enum GPAudioRuntime.EAudioFootStepCompanionPlayCondition
// NumValues: 0x0005
enum class EAudioFootStepCompanionPlayCondition : uint8
{
	CONDITION_DEFAULT                        = 0,
	CONDITION_ABILITY_OVERLOAD               = 1,
	CONDITION_ABILITY_BlastShield            = 2,
	CONDITION_ABILITY_HeavyRain              = 3,
	CONDITION_MAX                            = 4,
};

// Enum GPAudioRuntime.EFaceOperateMode
// NumValues: 0x0005
enum class EFaceOperateMode : uint8
{
	Expand                                   = 0,
	Shrink                                   = 1,
	Expand_CollisionCheck                    = 2,
	Shrink_CollisionCheck                    = 3,
	EFaceOperateMode_MAX                     = 4,
};

// Enum GPAudioRuntime.EGPAkCompPoolMethod
// NumValues: 0x0006
enum class EGPAkCompPoolMethod : uint8
{
	None                                     = 0,
	AutoRelease                              = 1,
	ManualRelease                            = 2,
	ManualRelease_OnComplete                 = 3,
	FreeInPool                               = 4,
	EGPAkCompPoolMethod_MAX                  = 5,
};

// Enum GPAudioRuntime.EGPAudioDebugPlayFlag
// NumValues: 0x0005
enum class EGPAudioDebugPlayFlag : uint8
{
	PLAY_ALL                                 = 0,
	PLAY_ONLY_1P                             = 1,
	PLAY_ONLY_3P                             = 2,
	PLAY_ONLY_Live                           = 3,
	PLAY_MAX                                 = 4,
};

// Enum GPAudioRuntime.EGPAudioEventLimitFireType
// NumValues: 0x0005
enum class EGPAudioEventLimitFireType : uint8
{
	WP_NORMAL_FIRE                           = 0,
	WP_SUP_FIRE                              = 1,
	WP_BULLET_FLY                            = 2,
	WP_BULLET_CRACK                          = 3,
	WP_MAX                                   = 4,
};

// Enum GPAudioRuntime.EGPAudioEventLimitFootStepType
// NumValues: 0x0007
enum class EGPAudioEventLimitFootStepType : uint8
{
	E_FOOT_STEP                              = 0,
	E_FOOT_STEP_SPRINT                       = 1,
	E_FOOT_STEP_RUN                          = 2,
	E_FOOT_STEP_PRONE                        = 3,
	E_FOOT_STEP_MED                          = 4,
	E_FOOT_STEP_SLIDETACKLE                  = 5,
	E_FOOT_MAX                               = 6,
};

// Enum GPAudioRuntime.EGPAudioEventLimitCharGroup
// NumValues: 0x0005
enum class EGPAudioEventLimitCharGroup : uint8
{
	Never                                    = 0,
	Player                                   = 1,
	Ally                                     = 2,
	Enemy                                    = 3,
	EGPAudioEventLimitCharGroup_MAX          = 4,
};

// Enum GPAudioRuntime.EGPAudioEventLimitType
// NumValues: 0x0004
enum class EGPAudioEventLimitType : uint8
{
	Never                                    = 0,
	GameObject                               = 1,
	Event                                    = 2,
	EGPAudioEventLimitType_MAX               = 3,
};

// Enum GPAudioRuntime.EQuadrantDirection
// NumValues: 0x0005
enum class EQuadrantDirection : uint8
{
	EQD_F                                    = 0,
	EQD_L                                    = 1,
	EQD_R                                    = 2,
	EQD_B                                    = 3,
	EQD_MAX                                  = 4,
};

// Enum GPAudioRuntime.EBusStateEnum
// NumValues: 0x0006
enum class EBusStateEnum : uint8
{
	Inactive                                 = 0,
	WaitingActiveConfirm                     = 1,
	Active                                   = 2,
	WaitingInactiveConfirm                   = 3,
	Release                                  = 4,
	EBusStateEnum_MAX                        = 5,
};

// Enum GPAudioRuntime.EMusicLoopType
// NumValues: 0x0003
enum class EMusicLoopType : uint8
{
	ELOOP_ONE                                = 0,
	ELOOP_RANDOM                             = 1,
	ELOOP_MAX                                = 2,
};

// Enum GPAudioRuntime.EGPAudioAniNotifyType
// NumValues: 0x0037
enum class EGPAudioAniNotifyType : uint8
{
	EANI_CHANGLE_CLIP                        = 0,
	EANI_CHANGLE_1                           = 1,
	EANI_CHANGLE_2                           = 2,
	EANI_CHANGLE_3                           = 3,
	EANI_CHANGLE_4                           = 4,
	EANI_CHANGLE_5                           = 5,
	EANI_CHANGLE_6                           = 6,
	EANI_CHANGLE_7                           = 7,
	EANI_CHANGLE_8                           = 8,
	EANI_CHANGLE_9                           = 9,
	EANI_CHANGLE_10                          = 10,
	EANI_CHANGLE_11                          = 11,
	EANI_CHANGLE_12                          = 12,
	EANI_CHANGLE_13                          = 13,
	EANI_CHANGLE_14                          = 14,
	EANI_CHANGLE_15                          = 15,
	EANI_CHANGLE_16                          = 16,
	EANI_CHANGLE_17                          = 17,
	EANI_CHANGLE_18                          = 18,
	EANI_CHANGLE_19                          = 19,
	EANI_CHANGLE_20                          = 20,
	EANI_CHANGLE_21                          = 21,
	EANI_CHANGLE_22                          = 22,
	EANI_CHANGLE_23                          = 23,
	EANI_CHANGLE_24                          = 24,
	EANI_CHANGLE_25                          = 25,
	EANI_CHANGLE_26                          = 26,
	EANI_CHANGLE_27                          = 27,
	EANI_CHANGLE_28                          = 28,
	EANI_CHANGLE_29                          = 29,
	EANI_CHANGLE_30                          = 30,
	EANI_CHANGLE_31                          = 31,
	EANI_CHANGLE_40                          = 32,
	EANI_CHANGLE_41                          = 33,
	EANI_CHANGLE_42                          = 34,
	EANI_CHANGLE_43                          = 35,
	EANI_CHANGLE_44                          = 36,
	EANI_CHANGLE_45                          = 37,
	EANI_CHANGLE_46                          = 38,
	EANI_CHANGLE_47                          = 39,
	EANI_CHANGLE_48                          = 40,
	EANI_CHANGLE_49                          = 41,
	EANI_CHANGLE_50                          = 42,
	EANI_CHANGLE_51                          = 43,
	EANI_CHANGLE_52                          = 44,
	EANI_CHANGLE_53                          = 45,
	EANI_CHANGLE_54                          = 46,
	EANI_CHANGLE_55                          = 47,
	EANI_CHANGLE_56                          = 48,
	EANI_CHANGLE_57                          = 49,
	EANI_CHANGLE_58                          = 50,
	EANI_CHANGLE_59                          = 51,
	EANI_CHANGLE_60                          = 52,
	EANI_CHANGLE_61                          = 53,
	EANI_CHANGLE_MAX                         = 54,
};

// Enum GPAudioRuntime.EGPAudioBlueprintType
// NumValues: 0x0019
enum class EGPAudioBlueprintType : uint8
{
	None                                     = 0,
	Default                                  = 1,
	Music_OutGame                            = 2,
	Music_Ingame                             = 3,
	Character_Voice                          = 11,
	Character_Breath                         = 12,
	Character_Action                         = 13,
	Character_Footstep                       = 14,
	Character_Skill                          = 15,
	Character_Prop                           = 16,
	Character_Rescue                         = 17,
	Voice_NPC                                = 31,
	Voice_System                             = 32,
	Ambience                                 = 41,
	Object_Static                            = 42,
	Object_Scale                             = 43,
	Weapon_Action                            = 61,
	Weapon_Reload                            = 62,
	Weapon_Fire                              = 63,
	Weapon_Fire_Sup                          = 64,
	Weapon_Bullet                            = 65,
	Explosion                                = 81,
	Vehicle                                  = 82,
	Drone                                    = 83,
	EGPAudioBlueprintType_MAX                = 84,
};

// Enum GPAudioRuntime.EGPAudioFootSoundType
// NumValues: 0x0022
enum class EGPAudioFootSoundType : uint8
{
	EACTION_DEFAULT                          = 0,
	EACTION_FOOTSTEP_RUN                     = 1,
	EACTION_FOOTSTEP_WALK                    = 2,
	EACTION_FOOTSTEP_AI_WALK                 = 3,
	EACTION_FOOTSTEP_SPRINT                  = 4,
	EACTION_FOOTSTEP_PRONE                   = 5,
	EACTION_FOOTSTEP_Crouch_Run              = 6,
	EACTION_FOOTSTEP_Crouch_Walk             = 7,
	EACTION_FOOTSTEP_AI_Crouch_Walk          = 8,
	EACTION_FOOTSTEP_JUMP                    = 9,
	EACTION_FOOTSTEP_BodyFall                = 10,
	EACTION_FOOTSTEP_LandHigh                = 11,
	EACTION_FOOTSTEP_LandMedium              = 12,
	EACTION_FOOTSTEP_LandLow                 = 13,
	EACTION_FOOTSTEP_LandDie                 = 14,
	EACTION_FOOTSTEP_Shuffle                 = 15,
	EACTION_FOOTSTEP_SPRINT_STOP             = 16,
	EACTION_FOOTSTEP_FRACTURE_WALK           = 17,
	EACTION_FOOTSTEP_FRACTURE_RUN            = 18,
	EACTION_FOOTSTEP_HandTouch_High          = 19,
	EACTION_FOOTSTEP_HandTouch_Low           = 20,
	EACTION_FOOTSTEP_SLIDETACKLE             = 21,
	EACTION_FOOTSTEP_SLIDETACKLE_END         = 22,
	EACTION_FOOTSTEP_DiveStart               = 23,
	EACTION_FOOTSTEP_DiveEnd                 = 24,
	EACTION_FOOTSTEP_SwimmingStart           = 25,
	EACTION_FOOTSTEP_Swimming                = 26,
	EACTION_FOOTSTEP_SwimmingFast            = 27,
	EACTION_FOOTSTEP_SwimmingBack            = 28,
	EACTION_FOOTSTEP_SwimmingTreading        = 29,
	EACTION_FOOTSTEP_SwimmingEnd             = 30,
	EACTION_FOOTSTEP_SwimmingTreadingInsweep = 31,
	EACTION_FOOTSTEP_SwimmingTurn            = 32,
	EACTION_MAX                              = 33,
};

// Enum GPAudioRuntime.EGPAudioFootSoundBodyType
// NumValues: 0x0006
enum class EGPAudioFootSoundBodyType : uint8
{
	Default                                  = 0,
	Male                                     = 1,
	Female                                   = 2,
	FatGuy                                   = 3,
	Crocodile                                = 4,
	EGPAudioFootSoundBodyType_MAX            = 5,
};

// Enum GPAudioRuntime.ERadioCuttingType
// NumValues: 0x0003
enum class ERadioCuttingType : uint8
{
	ERANGE_PLAY                              = 0,
	EALWAYS_PLAY                             = 1,
	ERadioCuttingType_MAX                    = 2,
};

// Enum GPAudioRuntime.ERadioChannelLoopType
// NumValues: 0x0006
enum class ERadioChannelLoopType : uint8
{
	ELOOP_RANDOM                             = 0,
	ELOOP_SEQUENCE                           = 1,
	ELOOP_ONE                                = 2,
	EONE_SEQUENCE                            = 3,
	ELOOP_PRESET                             = 4,
	ERadioChannelLoopType_MAX                = 5,
};

// Enum GPAudioRuntime.EGPAudioReverbType
// NumValues: 0x0007
enum class EGPAudioReverbType : uint8
{
	Default                                  = 0,
	Room                                     = 1,
	Pipe                                     = 2,
	HalfOpen                                 = 3,
	Alley                                    = 4,
	OpenField                                = 5,
	EGPAudioReverbType_MAX                   = 6,
};

// Enum GPAudioRuntime.EGPABakeSubZoneType
// NumValues: 0x0004
enum class EGPABakeSubZoneType : uint8
{
	AABB                                     = 0,
	OBB                                      = 1,
	CYLINDER                                 = 2,
	EGPABakeSubZoneType_MAX                  = 3,
};

// Enum GPAudioRuntime.EGPAudioRoomBakeDataType
// NumValues: 0x0006
enum class EGPAudioRoomBakeDataType : uint8
{
	S_ARRAY_DS_MAP                           = 0,
	RUN_LENGTH_COMPRESS                      = 1,
	CELL_INDEX_INONE                         = 2,
	CELL_INDEX_INONE_SET                     = 3,
	CELL_INDEX_MAP                           = 4,
	EGPAudioRoomBakeDataType_MAX             = 5,
};

// Enum GPAudioRuntime.EGPARoomBakeInterpolationType
// NumValues: 0x0004
enum class EGPARoomBakeInterpolationType : uint8
{
	NONE                                     = 0,
	RANGE_DIS_WEIGHT                         = 1,
	AVG_RANGE                                = 2,
	EGPARoomBakeInterpolationType_MAX        = 3,
};

// Enum GPAudioRuntime.EAttenuationScaleType
// NumValues: 0x0005
enum class EAttenuationScaleType : uint8
{
	ESCALE_GLOBAL                            = 0,
	ESCALE_NON_SCALE                         = 1,
	ESCALE_TYPE_CONFIG                       = 2,
	ESCALE_SPECIFIC                          = 3,
	ESCALE_MAX                               = 4,
};

// Enum GPAudioRuntime.EGPAudioEnvEmitterState
// NumValues: 0x0004
enum class EGPAudioEnvEmitterState : uint8
{
	EEmitterPlay3D                           = 0,
	EEmitterPlay2D                           = 1,
	EEmitterStopPlay                         = 2,
	EGPAudioEnvEmitterState_MAX              = 3,
};

// Enum GPAudioRuntime.EGPAudioTag
// NumValues: 0x0008
enum class EGPAudioTag : uint8
{
	ETAG_FEMALE                              = 0,
	ETAG_1P                                  = 1,
	ETAG_3P                                  = 2,
	ETAG_SUP                                 = 3,
	ETAG_RAID                                = 4,
	ETAG_WT                                  = 5,
	ETAG_SUB                                 = 6,
	ETAG_MAX                                 = 7,
};

// Enum GPAudioRuntime.EAudioCharacterGroup
// NumValues: 0x0009
enum class EAudioCharacterGroup : uint8
{
	EGROUP_ALL                               = 0,
	EGROUP_LOCALLY                           = 1,
	EGROUP_NON_LOCALLY                       = 2,
	EGROUP_TEAM_ALL                          = 3,
	EGROUP_TEAMATE                           = 4,
	EGROUP_SAMECAMP_ALL                      = 5,
	EGROUP_SAMECAMP                          = 6,
	EGROUP_ENEMY                             = 7,
	EGROUP_MAX                               = 8,
};

// Enum GPAudioRuntime.EAudioCharacterViewState
// NumValues: 0x0006
enum class EAudioCharacterViewState : uint8
{
	ESTATE_NONE                              = 0,
	ESTATE_IP                                = 1,
	ESTATE_LOCALLY_3P                        = 2,
	ESTATE_REMOTE_3P                         = 3,
	ESTATE_AI_3P                             = 4,
	ESTATE_MAX                               = 5,
};

// Enum GPAudioRuntime.EGPAOpenReflectionGeometryType
// NumValues: 0x0003
enum class EGPAOpenReflectionGeometryType : uint8
{
	BOX                                      = 0,
	OPENTANGENT                              = 1,
	EGPAOpenReflectionGeometryType_MAX       = 2,
};

// Enum GPAudioRuntime.EGPATickFrameGroupType
// NumValues: 0x0006
enum class EGPATickFrameGroupType : uint8
{
	G_Default                                = 0,
	G_OcclusionObstruction                   = 1,
	G_3PGameAKUpdateSpatial                  = 2,
	G_3PUpdateReverb                         = 3,
	G_UpdateFoliage                          = 4,
	G_MAX                                    = 5,
};

// Enum GPAudioRuntime.EGPAudioActorEndPlayStopType
// NumValues: 0x0004
enum class EGPAudioActorEndPlayStopType : uint8
{
	STOP_LOOP                                = 0,
	STOP_ALL                                 = 1,
	DO_NOTHING                               = 2,
	EGPAudioActorEndPlayStopType_MAX         = 3,
};

// Enum GPAudioRuntime.EStopAllSoundType
// NumValues: 0x0002
enum class EStopAllSoundType : uint8
{
	ESCALE_ALL                               = 0,
	ESCALE_MAX                               = 1,
};

// Enum GPAudioRuntime.EGPAudioActionOnEventType
// NumValues: 0x0006
enum class EGPAudioActionOnEventType : uint8
{
	Stop                                     = 0,
	Pause                                    = 1,
	Resume                                   = 2,
	Break                                    = 3,
	ReleaseEnvelope                          = 4,
	EGPAudioActionOnEventType_MAX            = 5,
};

// Enum GPAudioRuntime.EGPAudioWaterPreset
// NumValues: 0x0004
enum class EGPAudioWaterPreset : uint8
{
	NotSet                                   = 0,
	OutsideWater                             = 1,
	InsideWater                              = 2,
	EGPAudioWaterPreset_MAX                  = 3,
};

// Enum GPAudioRuntime.EWeapon3PFirePoolLevel
// NumValues: 0x0004
enum class EWeapon3PFirePoolLevel : uint8
{
	Normal                                   = 0,
	Warning                                  = 1,
	Danger                                   = 2,
	EWeapon3PFirePoolLevel_MAX               = 3,
};

// Enum GPAudioRuntime.EGPFootSoundAttenuationScaleType
// NumValues: 0x0003
enum class EGPFootSoundAttenuationScaleType : uint8
{
	EGPFSAST_None                            = 0,
	EGPFSAST_CatGirl                         = 1,
	EGPFSAST_MAX                             = 2,
};

// Enum GPAudioRuntime.EGPAttenuationScaleReason
// NumValues: 0x0006
enum class EGPAttenuationScaleReason : uint8
{
	None                                     = 0,
	Headset                                  = 1,
	CatGirl_CrouchMove                       = 2,
	Buff                                     = 3,
	Shadow_Skill                             = 4,
	EGPAttenuationScaleReason_MAX            = 5,
};

// Enum GPAudioRuntime.EGameAkHighFreqUpdatePosReason
// NumValues: 0x0005
enum class EGameAkHighFreqUpdatePosReason : uint8
{
	DrivenVehicle                            = 0,
	ControlCruiseMissile                     = 1,
	Elevator                                 = 2,
	StepOnVehicle                            = 3,
	EGameAkHighFreqUpdatePosReason_MAX       = 4,
};

// Enum GPAudioRuntime.EObserveredAudioState
// NumValues: 0x0004
enum class EObserveredAudioState : uint8
{
	NotSet                                   = 0,
	Observered                               = 1,
	NotObservered                            = 2,
	EObserveredAudioState_MAX                = 3,
};

// Enum GPAudioRuntime.EAudioPortalType
// NumValues: 0x0005
enum class EAudioPortalType : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Roomy                                    = 2,
	Transparent                              = 3,
	EAudioPortalType_MAX                     = 4,
};

// Enum GPAudioRuntime.EAudioVolumeType
// NumValues: 0x0006
enum class EAudioVolumeType : uint8
{
	Default                                  = 0,
	GameArea                                 = 1,
	SpatialRoom                              = 2,
	Portal                                   = 3,
	POIArea                                  = 4,
	EAudioVolumeType_MAX                     = 5,
};

// Enum GPAudioRuntime.EGPAudioComponent
// NumValues: 0x0005
enum class EGPAudioComponent : uint8
{
	ECP_NONE                                 = 0,
	ECP_BARREL                               = 1,
	ECP_STOCK                                = 2,
	ECP_MAGAZINE                             = 3,
	ECP_MAX                                  = 4,
};

// Enum GPAudioRuntime.EAudioWeatherType
// NumValues: 0x0007
enum class EAudioWeatherType : uint64
{
	None                                     = 0,
	Sunnyday                                 = 8008,
	Cloudy                                   = 9002,
	HeavyRain                                = 9003,
	Foggy                                    = 9004,
	Sunnyday_20001                           = 20001,
	EAudioWeatherType_MAX                    = 20002,
};

// Enum GPAudioRuntime.EGameAkType
// NumValues: 0x0004
enum class EGameAkType : uint8
{
	EGAMEAK_DEFAULT                          = 0,
	EGAMEAK_STATIC                           = 1,
	EGAMEAK_TRAVELER                         = 2,
	EGAMEAK_MAX                              = 3,
};

// Enum GPAudioRuntime.EGPAudioFloorType
// NumValues: 0x0006
enum class EGPAudioFloorType : uint8
{
	GP_AUDIO_FLOOR_TYPE_DEFAULT              = 0,
	GP_AUDIO_FLOOR_TYPE_UPSTAIRS_2           = 1,
	GP_AUDIO_FLOOR_TYPE_UPSTAIRS_1           = 2,
	GP_AUDIO_FLOOR_TYPE_Downstairs_1         = 3,
	GP_AUDIO_FLOOR_TYPE_Downstairs_2         = 4,
	GP_AUDIO_FLOOR_TYPE_MAX                  = 5,
};

// ScriptStruct GPAudioRuntime.GPComponentSignificanceConfig
// 0x0024 (0x0024 - 0x0000)
struct FGPComponentSignificanceConfig final
{
public:
	int32                                         QualityLevel;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            DistanceRange;                                     // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateAkPostionInterval;                           // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateOccObsInterval;                              // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FoliageCheckInterval;                              // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabledOccObs;                                    // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabledEarlyReflection;                           // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabledSpatialRoomInfo;                           // 0x0022(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabledFootstep;                                  // 0x0023(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPComponentSignificanceConfig;

// ScriptStruct GPAudioRuntime.AudioPriorityWeaponDebugSingleInfo
// 0x0048 (0x0048 - 0x0000)
struct FAudioPriorityWeaponDebugSingleInfo final
{
public:
	float                                         Priority;                                          // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationPriority;                                  // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FireDirPriority;                                   // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistancePriority;                                  // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldPlay;                                       // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReasonForNotPlay;                                  // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioName;                                         // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         LimitArea;                                         // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SourceActor;                                       // 0x003C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateTime;                                        // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAudioPriorityWeaponDebugSingleInfo;

// ScriptStruct GPAudioRuntime.GPAudioFirePriorityItem
// 0x0048 (0x0048 - 0x0000)
struct FGPAudioFirePriorityItem final
{
public:
	class UGameAkComponent*                       GameAkComponent;                                   // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x40];                                       // 0x0008(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAudioFirePriorityItem;

// ScriptStruct GPAudioRuntime.DebugCylinderHolder
// 0x001C (0x001C - 0x0000)
struct FDebugCylinderHolder final
{
public:
	float                                         ZHeight;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OuterRadius;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZRotation;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CenterPosition;                                    // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDebugCylinderHolder;

// ScriptStruct GPAudioRuntime.FootStepAudioSequenceDataRow
// 0x0030 (0x0040 - 0x0010)
struct FFootStepAudioSequenceDataRow final : public FDescRowBase
{
public:
	int32                                         AudioStyleId;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPhysicalMaterialAudioSequenceDataAsset> PhysicalConfig;                    // 0x0018(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFootStepAudioSequenceDataRow;

// ScriptStruct GPAudioRuntime.GPAudioFuturePlayingID
// 0x0008 (0x0008 - 0x0000)
struct FGPAudioFuturePlayingID final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ErrorCode;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAudioFuturePlayingID;

// ScriptStruct GPAudioRuntime.GameAkPlayingItem
// 0x0040 (0x0040 - 0x0000)
struct FGameAkPlayingItem final
{
public:
	class FName                                   AudioTypeName;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventID;                                           // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGPAudioFuturePlayingID                PlayingId;                                         // 0x000C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Range;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MakeNoiseRange;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocalListenRange;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartGameTime;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFree;                                            // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AudioEventName;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameAkPlayingItem;

// ScriptStruct GPAudioRuntime.GameAkDebugInfo
// 0x0030 (0x0030 - 0x0000)
struct FGameAkDebugInfo final
{
public:
	int32                                         PlayFlag;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisFromListener;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OccSetValue;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObsSetValue;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdatePositionInterval;                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NextUpdatePositionTimeLeft;                        // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurRoomBakeReflectEnergy;                          // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurRoomBakeTransmissionValue;                      // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameAkPlayingItem>             PlayingItems;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameAkDebugInfo;

// ScriptStruct GPAudioRuntime.AudioAkCompManagerTickFunction
// 0x0008 (0x0068 - 0x0060)
struct FAudioAkCompManagerTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAudioAkCompManagerTickFunction;

// ScriptStruct GPAudioRuntime.GPAudioReverbPreset
// 0x0030 (0x0030 - 0x0000)
struct FGPAudioReverbPreset final
{
public:
	class FString                                 ReverbPresetName;                                  // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioAuxBus*                         GPAuxBus;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuxBusName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SendLevel;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAudioReverbPreset;

// ScriptStruct GPAudioRuntime.GPGameplayAudioHDRConfig
// 0x0038 (0x0038 - 0x0000)
struct FGPGameplayAudioHDRConfig final
{
public:
	bool                                          bEnableHDR;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        HDRDataTablePath;                                  // 0x0008(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HDRDataTablePath_NonWarTape;                       // 0x0020(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPGameplayAudioHDRConfig;

// ScriptStruct GPAudioRuntime.PlaylistConfig
// 0x0028 (0x0028 - 0x0000)
struct FPlaylistConfig final
{
public:
	uint64                                        PlaylistId;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlaylistName;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UGPAudioEventAsset>> MusicEventArr;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	EMusicLoopType                                LoopType;                                          // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenMusicOver;                                // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlaylistConfig;

// ScriptStruct GPAudioRuntime.MusicPlayerDataRow
// 0x0020 (0x0030 - 0x0010)
struct FMusicPlayerDataRow final : public FDescRowBase
{
public:
	uint64                                        MusicPlayerId;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MusicPlayerName;                                   // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPlaylistConfig>                PlaylistArr;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMusicPlayerDataRow;

// ScriptStruct GPAudioRuntime.GameAkInfo
// 0x0008 (0x0008 - 0x0000)
struct FGameAkInfo final
{
public:
	EAudioCharacterGroup                          CharterGroup;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAudioCharacterViewState                      ViewState;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayFlag;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameAkInfo;

// ScriptStruct GPAudioRuntime.PresetIdAndArea
// 0x0018 (0x0018 - 0x0000)
struct FPresetIdAndArea final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SurfaceArea;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPresetIdAndArea;

// ScriptStruct GPAudioRuntime.OrientedBoxInfo
// 0x0044 (0x0044 - 0x0000)
struct FOrientedBoxInfo final
{
public:
	struct FOrientedBox                           OrientedBox;                                       // 0x0000(0x003C)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MaterialIndex;                                     // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSplit;                                         // 0x0040(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIndoor;                                           // 0x0041(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHollow;                                           // 0x0042(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPipe;                                             // 0x0043(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOrientedBoxInfo;

// ScriptStruct GPAudioRuntime.GPClippedWeaponFakeEventRecord
// 0x0004 (0x0004 - 0x0000)
struct FGPClippedWeaponFakeEventRecord final
{
public:
	uint32                                        LastEventServerCount;                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPClippedWeaponFakeEventRecord;

// ScriptStruct GPAudioRuntime.SpatialAudioOctree
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FSpatialAudioOctree final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpatialAudioOctree;

// ScriptStruct GPAudioRuntime.OverlapAudioEventSet
// 0x0018 (0x0018 - 0x0000)
struct FOverlapAudioEventSet final
{
public:
	class UGPAudioEventAsset*                     EnterEvent;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     StirEvent;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPAudioEventAsset*                     ExitEvent;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOverlapAudioEventSet;

// ScriptStruct GPAudioRuntime.AudioOctreeNode
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FAudioOctreeNode final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAudioOctreeNode;

// ScriptStruct GPAudioRuntime.GameAudioVolumeBounding
// 0x0090 (0x0090 - 0x0000)
struct FGameAudioVolumeBounding final
{
public:
	EGPGameAudioGeometryType                      GeometryType;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AxisX;                                             // 0x0004(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AxisY;                                             // 0x0010(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AxisZ;                                             // 0x001C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Center;                                            // 0x0028(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0xC];                                       // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x0040(0x0010)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             RelativeTransform;                                 // 0x0050(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtent;                                         // 0x0080(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XYCircleRadius;                                    // 0x008C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameAudioVolumeBounding;

// ScriptStruct GPAudioRuntime.GPAkCompPoolElement
// 0x0010 (0x0010 - 0x0000)
struct FGPAkCompPoolElement final
{
public:
	class UGameAkComponent*                       Component;                                         // 0x0000(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAkCompPoolElement;

// ScriptStruct GPAudioRuntime.GPAkCompPool
// 0x0038 (0x0038 - 0x0000)
struct FGPAkCompPool final
{
public:
	TArray<struct FGPAkCompPoolElement>           FreeElements;                                      // 0x0000(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UGameAkComponent*>               InUseComponents_Auto;                              // 0x0010(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UGameAkComponent*>               InUseComponents_Manual;                            // 0x0020(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAkCompPool;

// ScriptStruct GPAudioRuntime.GameAudioGeometry_Cylinder
// 0x0060 (0x0060 - 0x0000)
struct FGameAudioGeometry_Cylinder final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Origin;                                            // 0x0030(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x003C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         XYRadius;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentZ;                                           // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SideNum;                                           // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameAudioGeometry_Cylinder;

// ScriptStruct GPAudioRuntime.GameAudioGeometry_OBB
// 0x0060 (0x0060 - 0x0000)
struct FGameAudioGeometry_OBB final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Origin;                                            // 0x0030(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x003C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0048(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameAudioGeometry_OBB;

// ScriptStruct GPAudioRuntime.GameAudioGeometry
// 0x00D0 (0x00D0 - 0x0000)
struct FGameAudioGeometry final
{
public:
	EGPGameAudioGeometryType                      GeometryType;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameAudioGeometry_OBB                 Box;                                               // 0x0010(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameAudioGeometry_Cylinder            Cylinder;                                          // 0x0070(0x0060)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameAudioGeometry;

// ScriptStruct GPAudioRuntime.GPAudioMIDIEvent
// 0x00B0 (0x00B0 - 0x0000)
struct FGPAudioMIDIEvent final
{
public:
	TSoftObjectPtr<class UGPAudioEventAsset>      FireAudioEvent;                                    // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreloadFireAudio;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGPAudioEventAsset>      StartEvent;                                        // 0x0030(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      EndEvent;                                          // 0x0058(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAudioEventLeadTime;                           // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MIDIDelayTime;                                     // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGPAudioEventAsset>      EFAtomEvent;                                       // 0x0088(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAudioMIDIEvent;

// ScriptStruct GPAudioRuntime.GPAudioPOIArea
// 0x00D0 (0x00D0 - 0x0000)
struct alignas(0x08) FGPAudioPOIArea final
{
public:
	uint8                                         Pad_0[0xD0];                                       // 0x0000(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPAudioPOIArea;

// ScriptStruct GPAudioRuntime.AudioMiscConfigRow
// 0x0048 (0x0058 - 0x0010)
struct FAudioMiscConfigRow final : public FDescRowBase
{
public:
	bool                                          IsValid;                                           // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThreePWeaponFireCloseDistance_WT;                  // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireMedDistance_WT;                    // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireFarDistance_WT;                    // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireCloseDistance_Silencer_WT;         // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireMedDistance_Silencer_WT;           // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThreePWeaponFireFarDistance_Silencer_WT;           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AmbientSoundParam_A;                               // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AmbientSoundParam_B;                               // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalPortalSize;                                  // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoomyPortalSize;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransparentPortalSize;                             // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AmbientSoundCheckDistMax;                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Report2DSoundBlackList;                            // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAudioMiscConfigRow;

// ScriptStruct GPAudioRuntime.HearingAttenuationBuffRow
// 0x0010 (0x0020 - 0x0010)
struct FHearingAttenuationBuffRow final : public FDescRowBase
{
public:
	float                                         MinScale;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxScale;                                          // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        BuffId;                                            // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHearingAttenuationBuffRow;

// ScriptStruct GPAudioRuntime.EchoEllipseDataRow
// 0x0020 (0x0030 - 0x0010)
struct FEchoEllipseDataRow final : public FDescRowBase
{
public:
