#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPCutScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GPCutScene.EGPSequenceCustomEvent
// NumValues: 0x0003
enum class EGPSequenceCustomEvent : uint8
{
	GeneralEvent                             = 0,
	KillVehicle                              = 1,
	EGPSequenceCustomEvent_MAX               = 2,
};

// Enum GPCutScene.FGPSequenceBindingActorPolicy
// NumValues: 0x000C
enum class EFGPSequenceBindingActorPolicy : uint8
{
	Unkown                                   = 0,
	TriggerActor                             = 1,
	TriggerActorAttached                     = 2,
	SpecialActor                             = 3,
	SpecialActorAttached                     = 4,
	TaggedActor                              = 5,
	TaggedActorAttached                      = 6,
	PlayerActorAttached                      = 7,
	PlayerActorClientTeamMate                = 253,
	PlayerActorClient                        = 254,
	PlayerActor                              = 255,
	FGPSequenceBindingActorPolicy_MAX        = 256,
};

// Enum GPCutScene.ESequenceCameraType
// NumValues: 0x0004
enum class ESequenceCameraType : uint8
{
	Cinematic                                = 0,
	CopyFromFPP                              = 1,
	CopyFromTPP                              = 2,
	ESequenceCameraType_MAX                  = 3,
};

// Enum GPCutScene.EGPSequenceStatus
// NumValues: 0x0005
enum class EGPSequenceStatus : uint8
{
	Stopped                                  = 0,
	Loading                                  = 1,
	Playing                                  = 2,
	Paused                                   = 3,
	EGPSequenceStatus_MAX                    = 4,
};

// Enum GPCutScene.EGPSequenceEvent
// NumValues: 0x0002
enum class EGPSequenceEvent : uint8
{
	Unkown                                   = 0,
	EGPSequenceEvent_MAX                     = 1,
};

// Enum GPCutScene.EGPSequenceTriggerAuth
// NumValues: 0x0004
enum class EGPSequenceTriggerAuth : uint8
{
	Unkown                                   = 0,
	ClientOnly                               = 1,
	Authority                                = 2,
	EGPSequenceTriggerAuth_MAX               = 3,
};

// Enum GPCutScene.EGPSequencePhysicsMode
// NumValues: 0x0004
enum class EGPSequencePhysicsMode : uint8
{
	Unkown                                   = 0,
	Disable                                  = 1,
	Enable                                   = 2,
	EGPSequencePhysicsMode_MAX               = 3,
};

// Enum GPCutScene.EGPSequencePreloadActorType
// NumValues: 0x000C
enum class EGPSequencePreloadActorType : uint8
{
	AnyAny                                   = 0,
	Player1                                  = 1,
	Player2                                  = 2,
	Player3                                  = 3,
	Player4                                  = 4,
	PlayerAny                                = 5,
	VehiclePlayer                            = 6,
	VehicleAny                               = 7,
	AIAny                                    = 8,
	SpecialActor                             = 9,
	None                                     = 255,
	EGPSequencePreloadActorType_MAX          = 256,
};

// Enum GPCutScene.EGPSequenceTriggerMode
// NumValues: 0x000C
enum class EGPSequenceTriggerMode : uint8
{
	AnyAny                                   = 0,
	Player1                                  = 1,
	Player2                                  = 2,
	Player3                                  = 3,
	Player4                                  = 4,
	PlayerAny                                = 5,
	VehiclePlayer                            = 6,
	VehicleAny                               = 7,
	AIAny                                    = 8,
	SpecialActor                             = 9,
	Custom                                   = 255,
	EGPSequenceTriggerMode_MAX               = 256,
};

// Enum GPCutScene.EGPSequenceBindingActorType
// NumValues: 0x0005
enum class EGPSequenceBindingActorType : uint8
{
	Unkown                                   = 0,
	Player                                   = 1,
	Vehicle                                  = 2,
	AI                                       = 3,
	EGPSequenceBindingActorType_MAX          = 4,
};

// Enum GPCutScene.EGPSequencePerspectiveMode
// NumValues: 0x0005
enum class EGPSequencePerspectiveMode : uint8
{
	Unknown                                  = 0,
	FPP                                      = 1,
	TPP                                      = 2,
	TPPWithFacialAnimation                   = 3,
	EGPSequencePerspectiveMode_MAX           = 4,
};

// Enum GPCutScene.EGPSequencePrepareStatus
// NumValues: 0x0007
enum class EGPSequencePrepareStatus : uint8
{
	Initial                                  = 0,
	Preloading                               = 1,
	Preloaded                                = 2,
	PrepareAllReady                          = 3,
	Unloading                                = 4,
	Unloaded                                 = 5,
	EGPSequencePrepareStatus_MAX             = 6,
};

// Enum GPCutScene.EGPSubLevelPreloaderStatus
// NumValues: 0x0005
enum class EGPSubLevelPreloaderStatus : uint8
{
	Initial                                  = 0,
	Preloading                               = 1,
	Preloaded                                = 2,
	AllReady                                 = 5,
	EGPSubLevelPreloaderStatus_MAX           = 6,
};

// ScriptStruct GPCutScene.SeqStreamSection
// 0x0020 (0x0020 - 0x0000)
struct FSeqStreamSection final
{
public:
	class FName                                   Key;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPSequenceActor*                       SequenceActor;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreloadNetSection;                                // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreloadStep;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreloaded;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSeqStreamSection;

// ScriptStruct GPCutScene.GPSequenceBoundActorInfo
// 0x0018 (0x0018 - 0x0000)
struct FGPSequenceBoundActorInfo final
{
public:
	class FName                                   BindingTag;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 BoundActor;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBindOriginActor;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPSequenceBoundActorInfo;

// ScriptStruct GPCutScene.GPSequenceBindingActorInfo
// 0x0050 (0x0050 - 0x0000)
struct FGPSequenceBindingActorInfo final
{
public:
	EFGPSequenceBindingActorPolicy                ActorPolicy;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  SpecialActor;                                      // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpecialActorTag;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ClassOfActorTag;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerIndex;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPSequenceBindingActorInfo;

// ScriptStruct GPCutScene.GPSequenceBindingInitParam
// 0x0002 (0x0002 - 0x0000)
struct FGPSequenceBindingInitParam final
{
public:
	EGPSequencePhysicsMode                        PhysicsMode;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPSequencePerspectiveMode                    PerspectiveMode;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPSequenceBindingInitParam;

// ScriptStruct GPCutScene.GPSequenceBindingInfo
// 0x0060 (0x0060 - 0x0000)
struct FGPSequenceBindingInfo final
{
public:
	class FName                                   BindingTag;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGPSequenceBindingActorInfo            ActorInfo;                                         // 0x0008(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGPSequenceBindingInitParam            InitParam;                                         // 0x0058(0x0002)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBindOriginalActor;                                // 0x005A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPSequenceBindingInfo;

// ScriptStruct GPCutScene.GPSequencePrepareCondition
// 0x0040 (0x0040 - 0x0000)
struct FGPSequencePrepareCondition final
{
public:
	struct FTransform                             StartTransform;                                    // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                StartSpeed;                                        // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPSequencePrepareCondition;

// ScriptStruct GPCutScene.LevelSequenceAssetAnalyzeRow
// 0x0060 (0x0068 - 0x0008)
struct FLevelSequenceAssetAnalyzeRow final : public FTableRowBase
{
public:
	class FString                                 ShotName;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ObjectCount;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnableCount;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PossessableCount;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransformTrack;                                    // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnedTrack;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AttachTrack;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AnimationTrack;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SkeletalMeshTrack;                                 // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleTrack;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EventTrack;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FocalLengthTrack;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CameraShakeTrack;                                  // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ManualFocusTrack;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ApertureTrack;                                     // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VisibilityTrack;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VelocityScaleTrack;                                // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConstrainAspectRatioTrack;                         // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VignetteSettingTrack;                              // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MobilityTrack;                                     // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherTrack;                                        // 0x0064(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLevelSequenceAssetAnalyzeRow;

}

