#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPDeformable

#include "Basic.hpp"

#include "GPDeformable_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GPDeformable.GPDeformableActor
// 0x03A8 (0x0718 - 0x0370)
class AGPDeformableActor : public AActor
{
public:
	TArray<bool>                                  VisibleList;                                       // 0x0370(0x0010)(Edit, Net, ZeroConstructor, EditConst, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        SyncMoveList;                                      // 0x0380(0x0010)(Edit, Net, ZeroConstructor, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector>                        SyncMoveForwardList;                               // 0x0390(0x0010)(Edit, Net, ZeroConstructor, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	bool                                          bInDisappearing;                                   // 0x03A0(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        OwnerPlayerUin;                                    // 0x03A8(0x0008)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        PseudoRandomSeed;                                  // 0x03B0(0x0004)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerCharacter;                                    // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGPDeformableNetRuntimeData            AuthorityRuntimeData;                              // 0x03C0(0x0020)(Edit, Net, EditConst, RepNotify, Protected, NativeAccessSpecifierProtected)
	class UGPDeformableActorRuntimeData*          RuntimeData;                                       // 0x03E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsLocalControlled;                                // 0x03E8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAIControlled;                                   // 0x03E9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsUseVolumetric;                                  // 0x03EA(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3EB[0x1];                                      // 0x03EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccumulateLifeTime;                                // 0x03EC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccumulateIdleLifeTime;                            // 0x03F0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AccumulateDisappearTime;                           // 0x03F4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGPDeformableStage                            DeformableStage;                                   // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPDeformableShapeComponentBase*        DeformableSmokeComponent;                          // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint64                                        LoadHandler;                                       // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentVolumeSmokeLevelIndex;                      // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBoxComponent*>                  VisibilityBoxArray;                                // 0x0418(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_428[0x4];                                      // 0x0428(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MovePointCount;                                    // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ToFloorDistance;                                   // 0x0430(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         radius;                                            // 0x0434(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfHeight;                                        // 0x0438(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProceduralMeshComponent*               GenerateMesh;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IteratorCount;                                     // 0x0448(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCheckVerticalLine;                          // 0x044C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoxCollisionYCoeff;                                // 0x0450(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLifeTime;                                       // 0x0454(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DeformableShableClass;                             // 0x0458(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   HD_DeformableShapeClass;                           // 0x0480(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   VolumeSmokeClass;                                  // 0x04A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   RayMarchingSmokeClass;                             // 0x04D0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   ParticleSmokeClass;                                // 0x04F8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   EmitParticleSmokeClass;                            // 0x0520(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   EmitParticleSmokeClass_MobileLow;                  // 0x0548(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   EmitParticleSmokeClass_MobileVeryLow;              // 0x0570(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   EmitParticleSmokeClass_HD;                         // 0x0598(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   EmitParticleSmokeClass_HDLow;                      // 0x05C0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDeformableEmitParticleConfig>  EmitParticleClassArray_HD;                         // 0x05E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDeformableEmitParticleConfig>  EmitParticleClassArray_Mobile;                     // 0x05F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         DisappearTime;                                     // 0x0608(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             GridTestChannel;                                   // 0x060C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60D[0x3];                                      // 0x060D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGPDeformableActorConfig               SmokeParamConfig;                                  // 0x0610(0x0080)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCollisionResponseContainer            CollisionResponse;                                 // 0x0690(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B0[0x4];                                      // 0x06B0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MinPoint;                                          // 0x06B4(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                MaxPoint;                                          // 0x06C0(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SmokeId;                                           // 0x06D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSkillSmokeBreakTakerInfo              SmokeBreakTakerInfo;                               // 0x06D4(0x0040)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyFinishEvent(); // (Final, Native, Public) // @ 0x142B87350
	void CalculateActorsInside(TArray<TWeakObjectPtr<class AActor>>* InsideSmokeActorListResult); // (Final, Native, Public, HasOutParams) // @ 0x142B87370
	void CancelComponentLoad(); // (Final, Native, Protected) // @ 0x142B87440
	void ClearBoxCollision(); // (Final, Native, Protected) // @ 0x142B874A0
	void ClearServerVoxel(); // (Native, Protected) // @ 0x142B87500
	void CreateBoxCollision(const struct FVector& Center, const struct FVector& Forward, const struct FVector& Extent); // (Final, Native, Protected, HasDefaults) // @ 0x142B87520
	void CreateServerVoxel(struct FVector* Center, struct FVector* Forward, struct FVector* Right, struct FVector* Extent); // (Native, Protected, HasOutParams, HasDefaults) // @ 0x142B87650
	void CutBySphere(struct FVector* Center, float radius_0, bool* Result); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B877E0
	void GenerateBottomAndTop(); // (Final, Native, Public) // @ 0x142B879D0
	void GenerateNewSection(); // (Final, Native, Public) // @ 0x142B879F0
	class AActor* GetCharacterOwner(); // (Final, Native, Public) // @ 0x142B87A30
	struct FSoftObjectPath GetEmitParticleClassPath(); // (Final, Native, Protected, HasDefaults) // @ 0x142B87AC0
	void InitDeformableSmokeComponent(); // (Final, Native, Protected) // @ 0x142B87CF0
	void InitPseudoRandomSeed(); // (Final, Native, Protected) // @ 0x142B87D30
	void InitRuntimeData(); // (Final, Native, Protected) // @ 0x142B87D50
	void InitSmokeData(); // (Native, Public) // @ 0x141000790
	bool InSideSmoke(const struct FVector& OriginBaseLoc); // (Native, Public, HasOutParams, HasDefaults) // @ 0x142B87C50
	bool IsLowQuality(); // (Final, Native, Protected) // @ 0x142B87E60
	bool IsReady(); // (Final, Native, Public) // @ 0x142B87E90
	bool IsSmokeWallLowQuality(); // (Final, Native, Protected) // @ 0x142B87EC0
	bool IsUseVolumetric(); // (Final, Native, Public) // @ 0x142B87EF0
	bool IsVeryLowQuality(); // (Final, Native, Protected) // @ 0x142B87F20
	bool LineTest(const struct FVector& LineStart, const struct FVector& LineEnd, float* hitTime); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B87F50
	bool LineTestOnly(const struct FVector& LineStart, const struct FVector& LineEnd); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B881D0
	void MulticastDrawBox(int32 Index_0, const struct FVector& Center, const struct FVector& Extent, const struct FVector& Forward, float Duration); // (Net, NetReliable, Native, Event, NetMulticast, Public, HasDefaults, NetValidate) // @ 0x142B882D0
	void MulticastInDisappearing(bool isInDisappearing); // (Net, NetReliable, Native, Event, NetMulticast, Public, NetValidate) // @ 0x142B884E0
	void MulticastMoveTargetByIndex(int32 Index_0, const struct FVector& TargetPosition, const struct FVector& Forward); // (Net, NetReliable, Native, Event, NetMulticast, Public, HasDefaults, NetValidate) // @ 0x142B885A0
	void OnBeginCreate(); // (Native, Protected) // @ 0x142B886D0
	void OnBoxCollisionInit(class UBoxComponent* BoxComponent); // (Final, Native, Protected) // @ 0x142B886F0
	void OnDeformableSmokeComponentLoaded(const struct FSoftObjectPath& SoftObjectPath); // (Native, Protected, HasOutParams, HasDefaults) // @ 0x142B88770
	void OnFinishCreate(); // (Native, Protected) // @ 0x142B88850
	void OnRep_AuthorityRuntimeData(); // (Final, Native, Protected) // @ 0x142B888B0
	void OnRep_InDisappearing(); // (Final, Native, Protected) // @ 0x142B888D0
	void OnRep_SyncMoveList(); // (Final, Native, Protected) // @ 0x142A88400
	void OnRep_VisibleList(); // (Final, Native, Public) // @ 0x142B888F0
	void OnVolumeSmokeIndexChange(int32 CurrentLevelIndex); // (Native, Public) // @ 0x142B88910
	void ProcessSyncMoveList(const TArray<struct FVector>& InSyncMoveList, const TArray<struct FVector>& InSyncMoveForwardList); // (Final, Native, Public, HasOutParams) // @ 0x142B88AC0
	void RegisterBoxCollision(const struct FVector& Center, const struct FVector& Forward, const struct FVector& Right, const struct FVector& Extent); // (Native, Protected, HasDefaults) // @ 0x142B88C30
	void ServerSetMoveTargetByIndex(int32 Index_0, const struct FVector& TargetPosition, const struct FVector& Forward); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B88E30
	void SetMoveTarget(const struct FVector& TargetPosition, const struct FVector& Forward); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B88F50
	void SetMoveTargetByIndex(int32 Index_0, const struct FVector& TargetPosition, const struct FVector& Forward, int32 Source); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B89030
	void SetOwnerActor(class AActor* InActor); // (Final, Native, Public) // @ 0x142B89220
	void SetPlayerUIN(uint64 Uin); // (Final, Native, Public) // @ 0x142B892A0
	void SetSmokeStatePlaying(); // (Native, Public) // @ 0x141000850
	void StoreDSSyncData(); // (Final, Native, Protected) // @ 0x142B89340
	void SyncDSDataToRuntime(); // (Final, Native, Protected) // @ 0x142B89360
	void TickGenerateGrid(); // (Final, Native, Public) // @ 0x142B89400
	void TickLifeTime(float DeltaTime); // (Final, Native, Protected) // @ 0x142B89440
	void UnRegisterBoxCollision(); // (Native, Protected) // @ 0x142B89500

	int32 GetGridPileNum() const; // (Final, Native, Public, Const) // @ 0x142B87B00
	float GetPileMoveSizeX() const; // (Final, Native, Public, Const) // @ 0x142B87BC0
	bool IsBuildingMoveList() const; // (Final, Native, Public, Const) // @ 0x142B87D90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableActor")
	}
	static class AGPDeformableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGPDeformableActor>();
	}
};
DUMPER7_ASSERTS_AGPDeformableActor;

// Class GPDeformable.GPDeformableAnimModule
// 0x0018 (0x0040 - 0x0028)
class UGPDeformableAnimModule final : public UObject
{
public:
	class UGPDeformableSphereComponent*           DeformableSphereComponent;                         // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGPDeformableEmitSphere>        EmitList;                                          // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableAnimModule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableAnimModule")
	}
	static class UGPDeformableAnimModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableAnimModule>();
	}
};
DUMPER7_ASSERTS_UGPDeformableAnimModule;

// Class GPDeformable.GPDeformableShapeComponentBase
// 0x0218 (0x0310 - 0x00F8)
class alignas(0x10) UGPDeformableShapeComponentBase : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x98];                                      // 0x00F8(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QualitySettingIndex;                               // 0x0190(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         VolumeSmokeLevelIndex;                             // 0x0194(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentTODWeatherID;                               // 0x0198(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19C[0x94];                                     // 0x019C(0x0094)(Fixing Size After Last Property [ Dumper-7 ])
	class UProceduralMeshComponent*               GenerateMesh;                                      // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGPDeformableActorRuntimeData*          RuntimeDataPtr;                                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VoxelSize;                                         // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VerticalGridNum;                                   // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HonrizontalGridNum;                                // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PileNum;                                           // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSize;                                          // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridSizeY;                                         // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridSizeZ;                                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardGridDistanceScale;                          // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HonrizontalDistanceScale;                          // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalDistanceScale;                             // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesignCubeGrideSizeYInHighQuality;                 // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesignCubeGrideSizeZInHighQuality;                 // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInstance>       DefaultMaterialPath;                               // 0x0270(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             DefaultMeshAssetPath;                              // 0x0298(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      RuntimeDefaultMatInst;                             // 0x02C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               CacheMID;                                          // 0x02C8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSkillSmokeBreakTakerInfo              SmokeInfo;                                         // 0x02D0(0x0040)(NoDestructor, NativeAccessSpecifierPublic)

public:
	void AddGridDectionTree(int32 GridIndex); // (Final, Native, Protected) // @ 0x142B8E2F0
	bool ApplyVibilityList(TArray<bool>* InList); // (Native, Public, HasOutParams) // @ 0x142B8E370
	void BeginDisappearing(); // (Native, Public) // @ 0x141FA6330
	void CheckBurst(const struct FVector& BurstLocation, float BurstRadius, float BurstDelay, int32 SmokeIndex, struct FSmokeBreakInfo* SmokeBreakerInfo, struct FSkillSmokeBreakTakerInfo* SmokeBreakTakerInfo); // (Native, Public, HasOutParams, HasDefaults) // @ 0x142B8E460
	bool CheckCanSetSmokeStatePlaying(); // (Native, Public) // @ 0x142B8E6D0
	void CutBySphere(struct FVector* Center, float radius, bool* Result); // (Native, Public, HasOutParams, HasDefaults) // @ 0x142B8E700
	void GenerateNewSection(); // (Native, Public) // @ 0x141FA50E0
	void InitRuntimeData(class UGPDeformableActorRuntimeData* InDataPtr); // (Native, Public) // @ 0x142B8E820
	bool IsRunningAnimation(); // (Native, Public) // @ 0x142B8E8B0
	void OnCreateFinished(); // (Native, Protected) // @ 0x142A87380
	bool ReadVibilityList(TArray<bool>* InList); // (Native, Public, HasOutParams) // @ 0x142B8E8E0
	void SetPointState(int32 Index_0, ESmokeState NewState); // (Native, Public) // @ 0x142B8E9D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableShapeComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableShapeComponentBase")
	}
	static class UGPDeformableShapeComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableShapeComponentBase>();
	}
};
DUMPER7_ASSERTS_UGPDeformableShapeComponentBase;

// Class GPDeformable.GPDeformableBoxComponent
// 0x0020 (0x0330 - 0x0310)
class UGPDeformableBoxComponent final : public UGPDeformableShapeComponentBase
{
public:
	float                                         DensityTestSize;                                   // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_314[0x1C];                                     // 0x0314(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableBoxComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableBoxComponent")
	}
	static class UGPDeformableBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableBoxComponent>();
	}
};
DUMPER7_ASSERTS_UGPDeformableBoxComponent;

// Class GPDeformable.GPDeformableCubeAnimModule
// 0x0048 (0x0070 - 0x0028)
class UGPDeformableCubeAnimModule final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPDeformableShapeComponentBase*        ShapeComponent;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGPDeformableEmitVolumeCube>    EmitList;                                          // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableCubeAnimModule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableCubeAnimModule")
	}
	static class UGPDeformableCubeAnimModule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableCubeAnimModule>();
	}
};
DUMPER7_ASSERTS_UGPDeformableCubeAnimModule;

// Class GPDeformable.GPDeformableCubeRayMarchingComponent
// 0x00D0 (0x03E0 - 0x0310)
class UGPDeformableCubeRayMarchingComponent final : public UGPDeformableShapeComponentBase
{
public:
	uint8                                         Pad_310[0x8];                                      // 0x0310(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RenderTextureSizeX;                                // 0x0320(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RenderTextureSizeY;                                // 0x0324(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PaintDensity;                                      // 0x0328(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PaintRadius;                                       // 0x032C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VolumeDistanceToEdge;                              // 0x0330(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CubeScale;                                         // 0x0334(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterial*                              PaintMaterial;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                      RayMarchingMaterial;                               // 0x0340(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            BaseMesh;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoxScale;                                          // 0x0350(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         XYFrames;                                          // 0x0354(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   StaticComponent;                                   // 0x0358(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TillingBaseBox;                                    // 0x0360(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                TillingBaseValue;                                  // 0x036C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FarSteps;                                          // 0x0378(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NearSteps;                                         // 0x037C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FarDistanceForSteps;                               // 0x0380(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentRayMarchingSteps;                           // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DynamicRayMarchingMaterial;                        // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ZeroBasedAABBCenter;                               // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInitGenerating;                                   // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCreateCube;                                     // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CurrentRenderTarget;                               // 0x03A0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            CurrentCubeMeshAsset;                              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                      CurrentMaterialInstance;                           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                      CurrentHQCubeMaterialInstance;                     // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstance*>              CurrentMaterialInstanceArray;                      // 0x03C0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UStaticMesh*>                    CurrentMeshArray;                                  // 0x03D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void ClearRecalculateStepTimer(); // (Final, Native, Protected) // @ 0x142B874C0
	void ClearRuntimeAsset(); // (Final, Native, Protected) // @ 0x142B874E0
	void GenerateRayMarching(); // (Final, Native, Protected) // @ 0x142B87A10
	void StartRecalculateStepTimer(); // (Final, Native, Protected) // @ 0x142B89320
	void TickGenerateRayMarching(); // (Final, Native, Protected) // @ 0x142B89420
	void TickRecalculateStep(); // (Final, Native, Protected) // @ 0x142B894C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableCubeRayMarchingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableCubeRayMarchingComponent")
	}
	static class UGPDeformableCubeRayMarchingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableCubeRayMarchingComponent>();
	}
};
DUMPER7_ASSERTS_UGPDeformableCubeRayMarchingComponent;

// Class GPDeformable.GPDeformableEmitEntity
// 0x0000 (0x0028 - 0x0028)
class UGPDeformableEmitEntity final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableEmitEntity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableEmitEntity")
	}
	static class UGPDeformableEmitEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableEmitEntity>();
	}
};
DUMPER7_ASSERTS_UGPDeformableEmitEntity;

// Class GPDeformable.GPDeformableGameStateComponent
// 0x00D8 (0x01D0 - 0x00F8)
class UGPDeformableGameStateComponent : public UActorComponent
{
public:
	float                                         OriginVolumetricFogGridSizeZ;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginVolumetricFogGridSizeXY;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TemporalReprojection;                              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastRecordVolumetricViewDistance;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDynamicSetVolumetricViewDistance;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalFocusInside;                               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UExponentialHeightFogComponent> HeightFogComponent;                         // 0x010C(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocalControlledReleaseUAS;                      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AGPDeformableActor*>             DeformableActors;                                  // 0x0118(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class AGPDeformableActor*>             VolumeSmokeActors;                                 // 0x0128(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          PreInsideActorList;                                // 0x0138(0x0010)(Edit, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TWeakObjectPtr<class AActor>, TWeakObjectPtr<class AGPDeformableActor>> CharacterInSmokeMap; // 0x0148(0x0050)(Edit, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          TempActorList;                                     // 0x0198(0x0010)(Edit, ZeroConstructor, EditConst, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	int32                                         InSmokeWallBuffId;                                 // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TickActorInSideTime;                               // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOnlyCheckActorInsideInDS;                         // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickAccumulateTime;                                // 0x01B4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTickCheckActors;                                  // 0x01B8(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTickVolumeInFront;                                // 0x01B9(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentInFrontVolumeCount;                         // 0x01BC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LastCalcFrontVolumeFrame;                          // 0x01C0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           VolumeSmokeLevelTimer;                             // 0x01C8(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClearActorInside(); // (Final, Native, Protected) // @ 0x142B87460
	void ClearAllCharacterBuff(); // (Final, Native, Protected) // @ 0x142B87480
	void Explode(const struct FVector& centor, float radius); // (Final, Native, Public, HasDefaults) // @ 0x142B87900
	int32 GetCurrentQuality(); // (Native, Public) // @ 0x142B87A60
	int32 GetDeformableActorNum(); // (Final, Native, Public) // @ 0x142B87A90
	class AActor* GetInSmokeActorOwner(const class AActor* InActor); // (Final, Native, Public) // @ 0x142B87B30
	int32 GetVolumeSmokeLevelIndex(); // (Native, Public) // @ 0x142B87BF0
	bool HasVolumetricDeformableActor(); // (Native, Protected) // @ 0x142B87C20
	void InitHeightFogComponent(); // (Final, Native, Public) // @ 0x142B87D10
	void InitVolumetricFogGridSizeZ(); // (Final, Native, Public) // @ 0x142B87D70
	bool IsInsideDeformableActor(const struct FVector& InPos); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B87DC0
	bool LineTestDeformableActor(const struct FVector& LineStart, const struct FVector& LineEnd, float* hitTime); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x142B88090
	void OnLocalControlledBeginReleaseUAS(); // (Final, Native, Public) // @ 0x142B88870
	void OnLocalControlledEndReleaseUAS(); // (Final, Native, Public) // @ 0x142B88890
	void OnVolumeSmokeLevelTimerCallBack(); // (Native, Protected) // @ 0x142B889A0
	void ProcessLocalPlayerInSmokeWall(class AActor* LocalActor); // (Final, Native, Public) // @ 0x142B889C0
	void ProcessLocalPlayerOutSmokeWall(class AActor* LocalActor); // (Final, Native, Public) // @ 0x142B88A40
	void RegisterDeformableActor(class AGPDeformableActor* InDeformableActor); // (Final, Native, Public) // @ 0x142B88DB0
	void SetOverrideVolumetricViewDistance(float ViewDistance); // (Final, Native, Public) // @ 0x142B891A0
	void TickActorInSide(float DeltaTime); // (Final, Native, Protected) // @ 0x142B89380
	void TickVolumeSmokeInView(); // (Final, Native, Protected) // @ 0x142B894E0
	void UnRegisterDeformableActor(class AGPDeformableActor* InDeformableActor); // (Final, Native, Public) // @ 0x142B89520
	void UpdateDeformableActor(class AGPDeformableActor* InDeformableActor); // (Final, Native, Public) // @ 0x142B895A0
	void UpdateVolumetricFogGridSizeZ(); // (Final, Native, Public) // @ 0x142B89620
	void UpdateVolumetricViewDistance(); // (Final, Native, Public) // @ 0x142B89640

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableGameStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableGameStateComponent")
	}
	static class UGPDeformableGameStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableGameStateComponent>();
	}
};
DUMPER7_ASSERTS_UGPDeformableGameStateComponent;

// Class GPDeformable.GPDeformableInstancedSmokeComponent
// 0x0110 (0x0420 - 0x0310)
class UGPDeformableInstancedSmokeComponent final : public UGPDeformableShapeComponentBase
{
public:
	bool                                          bInitGenerating;                                   // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGeneratingMesh;                                 // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsCreateCube;                                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_319[0xB];                                      // 0x0319(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsTickAnimation;                                  // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CurrentCubeMeshAsset;                              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                      CurrentMaterialInstance;                           // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRenderInstance;                                   // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPDeformableCubeAnimModule*            AnimModule;                                        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTransform>                     InstancedTransforms;                               // 0x0350(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDeformableConfigAsset>         ConfigAssetArray;                                  // 0x0360(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UMeshComponent*>                 MeshList;                                          // 0x0370(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>       MaterialInstanceList;                              // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	int32                                         IteratorMeshInFrame;                               // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         IteratorCreateCubeInFrame;                         // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         IteratorDelayNewstMoveIndex;                       // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SizeRandomMin;                                     // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SizeRandomMax;                                     // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CubeRandomOffsetMin;                               // 0x03A4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CubeRandomOffsetMax;                               // 0x03B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ForwardSizeScale;                                  // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxWidthSize;                                      // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          EnableGeneratingInFlying;                          // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          EnableAnimation;                                   // 0x03C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C6[0x2];                                      // 0x03C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InitMaxRadius;                                     // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetRadius;                                      // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandLifeMinTime;                                 // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandLifeMaxTime;                                 // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandDelayLifeMinTime;                            // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandDelayLifeMaxTime;                            // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandLocLifeMinTime;                              // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandLocLifeMaxTime;                              // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandDelayLocLifeMinTime;                         // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandDelayLocLifeMaxTime;                         // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitFallMinSpeed;                                  // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitFallMaxSpeed;                                  // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PopDistance;                                       // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UseUASZ;                                           // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTimePerPile;                                  // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeginAnimModuleIndex;                              // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialParameterName;                             // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParameterCustomDataIndex;                          // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_414[0xC];                                      // 0x0414(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPDeformableInstancedSmokeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPDeformableInstancedSmokeComponent")
	}
	static class UGPDeformableInstancedSmokeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPDeformableInstancedSmokeComponent>();
	}
};
DUMPER7_ASSERTS_UGPDeformableInstancedSmokeComponent;

// Class GPDeformable.GPDeformableMeshComponent
// 0x0050 (0x0360 - 0x0310)
class UGPDeformableMeshComponent final : public UGPDeformableShapeComponentBase
{
public:
	float                                         DensityTestSize;                                   // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandMinRadius;                                   // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandMaxRadius;                                   // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PileNumStep;                                       // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseVerticalOffset;                                // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
