#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPGameHud

#include "Basic.hpp"

#include "GameCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GPGameHud.EMutexChangeReason
// NumValues: 0x0006
enum class EMutexChangeReason : uint8
{
	OccupyIdle                               = 0,
	ReleaseActive                            = 1,
	ReleaseOverTime                          = 2,
	Preempt                                  = 3,
	ForceRefresh                             = 4,
	EMutexChangeReason_MAX                   = 5,
};

// Enum GPGameHud.EWidgetPriorityType
// NumValues: 0x000C
enum class EWidgetPriorityType : uint8
{
	A                                        = 0,
	B                                        = 1,
	C                                        = 2,
	D                                        = 3,
	E                                        = 4,
	F                                        = 5,
	G                                        = 6,
	H                                        = 7,
	I                                        = 8,
	J                                        = 9,
	Never                                    = 10,
	EWidgetPriorityType_MAX                  = 11,
};

// Enum GPGameHud.GameHUDSate
// NumValues: 0x00BF
enum class EGameHUDSate : uint8
{
	GHS_None                                 = 0,
	GHS_Dead                                 = 1,
	GHS_Firing                               = 2,
	GHS_Aiming                               = 3,
	GHS_Settlement                           = 4,
	GHS_OpenMap                              = 5,
	GHS_Dying                                = 6,
	GHS_PrepareTime                          = 7,
	GHS_UseItem                              = 8,
	GHS_VaultAndClimb                        = 9,
	GHS_Operating3DUI                        = 10,
	GHS_CutScene                             = 11,
	GHS_DriveVehicle                         = 12,
	GHS_RideVehicle                          = 13,
	GHS_UseHeavyMachineGun                   = 14,
	GHS_Reloading                            = 15,
	GHS_DisposalBomb                         = 16,
	GHS_RescueSomeOne                        = 17,
	GHS_Burden                               = 18,
	GHS_OB                                   = 19,
	GHS_ForbidFire                           = 20,
	GHS_ClimbLadder                          = 21,
	GHS_SwitchAds                            = 22,
	GHS_SwitchPot                            = 23,
	GHS_UseTelescope                         = 24,
	GHS_Escaping                             = 25,
	GHS_Monitor                              = 26,
	GHS_PVEQuestPanelOnly                    = 27,
	GHS_VehicleLeanOut                       = 28,
	GHS_SOLQuestOperation                    = 29,
	GHS_SeamlessGameplay                     = 30,
	GHS_Redeploy                             = 31,
	GHS_FPPView                              = 32,
	GHS_InteractOnly                         = 33,
	GHS_Prone                                = 34,
	GHS_COUNTDOWN                            = 35,
	GHS_SOLEventSilent                       = 36,
	GHS_BeingRescue                          = 37,
	GHS_ScoreTips                            = 38,
	GHS_BreakthroughGeneralStrongBroadcast   = 39,
	GHS_KillerMark                           = 40,
	GHS_RoulettePanel                        = 41,
	GHS_SOLEvacuation                        = 42,
	GHS_WeaponChange                         = 43,
	GHS_VehicleForbidShoot                   = 44,
	GHS_VehicleMode_Common                   = 45,
	GHS_VehicleMode_Skill                    = 46,
	GHS_RedeployView                         = 47,
	GHS_Assassinate                          = 48,
	GHS_PlayingSubTitle                      = 49,
	GHS_SOLEvacuationPOI                     = 50,
	GHS_PCControlMode                        = 51,
	GHS_UseDetectorSkill                     = 52,
	GHS_BattleScoreDetails                   = 53,
	GHS_UseZipline                           = 54,
	GHS_Breakthrough_Transitioning           = 55,
	GHS_LiveSpectate                         = 56,
	GHS_VehicleForbidXPPChange               = 57,
	GHS_BreakthroughTopTimeCountDown         = 58,
	GHS_VehicleWeapon                        = 59,
	GHS_RaidRailRide                         = 60,
	GHS_Tutorial                             = 61,
	GHS_ObserverMode                         = 62,
	GHS_StingerMissile                       = 63,
	GHS_ContractAccess                       = 64,
	GHS_ObserverModeFreeCamera               = 65,
	GHS_BreakthroughPreMatchWaitPlayer       = 66,
	GHS_BreakthroughPreMatchChooseArm        = 67,
	GHS_BreakthroughPreMatchFirstDeploy      = 68,
	GHS_SOLBannerFlyIcon                     = 69,
	GHS_BulletTips                           = 70,
	GHS_AmmoAddTips                          = 71,
	GHS_SOLRadioInfoView                     = 72,
	GHS_SOLCaptureView                       = 73,
	GHS_SOLExitPayment                       = 74,
	GHS_BreakthroughSpecialStrongBroadcast   = 75,
	GHS_BreakthroughSectorActivedBroadcast   = 76,
	GHS_BreakthroughSectorAnchorCapView      = 77,
	GHS_SafeAreaView                         = 78,
	GHS_BlueprintWeapon                      = 79,
	GHS_BlueprintWeaponTips                  = 80,
	GHS_SOLEventProgress                     = 81,
	GHS_HackPCInfoView                       = 82,
	GHS_SOLContract                          = 83,
	GHS_SOLContractProgress                  = 84,
	GHS_SOLContractVote                      = 85,
	GHS_SOLPOITips                           = 86,
	GHS_UseBow                               = 87,
	GHS_BowCanCharge                         = 88,
	GHS_DyingView                            = 89,
	GHS_MiniMapDangerous                     = 90,
	GHS_CountDownViewNew                     = 91,
	GHS_SeamlessEntry                        = 92,
	GHS_SeamlessEntry_Tutorial               = 93,
	GHS_BreakthroughSupportReleaseView       = 94,
	GHS_SOLInterceptView                     = 95,
	GHS_BlueprintWeaponEstimatedTime         = 96,
	GHS_RealOpenBag                          = 97,
	GHS_RealOpenLoot                         = 98,
	GHS_RealLootSearching                    = 99,
	GHS_CodedLockView                        = 100,
	GHS_SOLKillerInfoCardView                = 101,
	GHS_ChatWindow                           = 102,
	GHS_WeaponInspect                        = 103,
	GHS_InteractPanel                        = 104,
	GHS_InteractRescue                       = 105,
	GHS_HudHitFeedBack                       = 106,
	GHS_EscPanel                             = 107,
	GHS_MarkingRoulette                      = 108,
	GHS_ContractInManningArea                = 109,
	GHS_VehicleWeaponDriver                  = 110,
	GHS_DeathDamageInfoPanel                 = 111,
	GHS_Redeploy_Rising                      = 112,
	GHS_UseElectricBow                       = 113,
	GHS_LiveReplay                           = 114,
	GHS_OBReplay                             = 115,
	GHS_RedeploySelectVehicle                = 116,
	GHS_RedeployHeroInfo                     = 117,
	GHS_RedeployArmSelectedView              = 118,
	GHS_UnlockingView                        = 119,
	GHS_SlienceMove                          = 120,
	GHS_CommonCountDownView                  = 121,
	GHS_TeamInfoDetail                       = 122,
	GHS_BreakthroughWeakBroadcast            = 124,
	GHS_SupportHudMode                       = 125,
	GHS_BreakthroughCharacterTransitionGuidanceEnd = 126,
	GHS_WholeRedeploy                        = 128,
	GHS_RedeployVehicleStore                 = 129,
	GHS_ScouterView                          = 130,
	GHS_ScouterTipsView                      = 131,
	GHS_GuidedCruiseMissile                  = 133,
	GHS_HDPerformance                        = 134,
	GHS_CommercializationRoulette            = 135,
	GHS_AmmoRoulette                         = 136,
	GHS_MPRankRoulette                       = 137,
	GHS_WeaponScopeRoulette                  = 138,
	GHS_MedicRoulette                        = 139,
	GHS_SafeHouseRange                       = 140,
	GHS_SafeHouseRangeInLane                 = 141,
	GHS_FirstDeployCountDown                 = 142,
	GHS_RedeploySelectArmItemHud             = 143,
	GHS_FiringBleeding                       = 145,
	GHS_ElectricArrowBleeding                = 146,
	GHS_SkillProcessBar                      = 147,
	GHS_BreakthroughIconStrongBroadcast      = 148,
	GHS_SnoicDirView                         = 149,
	GHS_UASActionProgressBar                 = 150,
	GHS_OpenParachute                        = 151,
	GHS_FirefightingAction                   = 152,
	GHS_CommonCancelBtn                      = 154,
	GHS_FlashDroneScreenEffect               = 156,
	GHS_OpenMoss                             = 157,
	GHS_RedeployWeaponStoreHud               = 158,
	GHS_RedeployWeaponPresetHud              = 159,
	GHS_ActiveAdrenaline                     = 160,
	GHS_UseThrowBlocking                     = 161,
	GHS_RedeployVehiclePartStore             = 162,
	GHS_SkillInspect                         = 163,
	GHS_EmoteAction                          = 164,
	GHS_RedeployCommanderView                = 165,
	GHS_PatrolVehicle                        = 166,
	GHS_SwimUnderWater                       = 167,
	GHS_SwimOxygenBar                        = 168,
	GHS_SwimDiveButton                       = 169,
	GHS_BreakthroughOrderItemBroadcast       = 170,
	GHS_InGameEquipmentRental                = 171,
	GHS_ArenaCountDownView                   = 172,
	GHS_ArenaStatusTipsBanner                = 173,
	GHS_TaskList                             = 174,
	GHS_InteractCarryBody                    = 175,
	GHS_UseSkill_BionicSpy                   = 179,
	GHS_Controllable_HideHUD                 = 180,
	GHS_Controllable_BionicBird              = 181,
	GHS_Controllable_BionicSpy               = 182,
	GHS_ControllableDrone                    = 190,
	GHS_BattleFieldCommanderSkillView        = 191,
	GHS_MPRankView                           = 192,
	GHS_JailBreak                            = 193,
	GHS_FingerprintView                      = 194,
	GHS_HackPCOperationMain                  = 195,
	GHS_CollectionRoom                       = 196,
	GHS_Rope                                 = 197,
	GHS_TacticalConquestEvolutionReviveDeployView = 198,
	GHS_RecycleFortification                 = 199,
	GHS_ButterRescue                         = 200,
	GHS_DeadReplay                           = 251,
	GHS_GuideDisableInput                    = 252,
	GHS_TutorialHideAllHUD                   = 253,
	GHS_LoadingHideAllHUD                    = 254,
	GHS_GlobalHideAllHUD                     = 255,
	GHS_MAX                                  = 256,
};

// Enum GPGameHud.EHUDCreateType
// NumValues: 0x0008
enum class EHUDCreateType : uint8
{
	OnDemand                                 = 0,
	OnDemandButPreload                       = 8,
	OnDemandButPreloadAndShow                = 12,
	Auto                                     = 16,
	AutoAndBlockGameFlow                     = 18,
	AutoAndShow                              = 20,
	AutoAndShowAndBlockGameFlow              = 22,
	EHUDCreateType_MAX                       = 23,
};

// Enum GPGameHud.VisibleChannel
// NumValues: 0x0009
enum class EVisibleChannel : uint8
{
	VisibleChannel_0                         = 0,
	VisibleChannel_1                         = 1,
	VisibleChannel_2                         = 2,
	VisibleChannel_3                         = 3,
	VisibleChannel_4                         = 4,
	VisibleChannel_5                         = 5,
	VisibleChannel_6                         = 6,
	VisibleChannel_7                         = 7,
	VisibleChannel_MAX                       = 8,
};

// Enum GPGameHud.LayerZorder
// NumValues: 0x000A
enum class ELayerZorder : uint8
{
	Zorder_None                              = 0,
	Zorder_ScreenEffect                      = 1,
	Zorder_Mark                              = 30,
	Zorder_Hint                              = 60,
	Zorder_Feedback                          = 90,
	Zorder_Common                            = 120,
	Zorder_Touch                             = 150,
	Zorder_Popup                             = 180,
	Zorder_LargePopup                        = 210,
	Zorder_MAX                               = 211,
};

// Enum GPGameHud.EUIViewUpdateFrequency
// NumValues: 0x0007
enum class EUIViewUpdateFrequency : uint8
{
	EveryFrame                               = 0,
	HighFrequency                            = 1,
	MidFrequency                             = 2,
	LowFrequency                             = 3,
	Freeze                                   = 4,
	VeryHighFrequency                        = 5,
	EUIViewUpdateFrequency_MAX               = 6,
};

// Enum GPGameHud.SelectedImgState
// NumValues: 0x0004
enum class ESelectedImgState : uint8
{
	SelectedImgState_Zero                    = 0,
	SelectedImgState_One                     = 1,
	SelectedImgState_Reduce                  = 2,
	SelectedImgState_MAX                     = 3,
};

// ScriptStruct GPGameHud.LayerItem
// 0x0030 (0x0030 - 0x0000)
struct FLayerItem final
{
public:
	struct FSoftClassPath                         ControllerSoftClass;                               // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         ViewSoftClass;                                     // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLayerItem;

// ScriptStruct GPGameHud.LayerContainerRow
// 0x0030 (0x0040 - 0x0010)
struct FLayerContainerRow final : public FDescRowBase
{
public:
	class FName                                   ViewName;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enable;                                            // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELayerZorder                                  ContainerZorder;                                   // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ZOrderOffset;                                      // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SafeZoneLayer;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLayerItem>                     Items;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EHUDCreateType                                HUDCreateType;                                     // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeverSleep;                                        // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LowFrequencyInvalidation;                          // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShippingNoCreate;                                 // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIViewUpdateFrequency                        UpdateFrequncy;                                    // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedIgnoreLowMemoryDestroy;                       // 0x003D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLayerContainerRow;

// ScriptStruct GPGameHud.MutexRegisterTableRow
// 0x0010 (0x0020 - 0x0010)
struct FMutexRegisterTableRow final : public FDescRowBase
{
public:
	class FName                                   WidgetName;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetPriorityType                           PriorityType;                                      // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreemptSamePriority;                              // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecoverAfterPreempted;                            // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OccupyTimeLimit;                                   // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMutexRegisterTableRow;

// ScriptStruct GPGameHud.MutexQueueItem
// 0x0030 (0x0030 - 0x0000)
struct FMutexQueueItem final
{
public:
	struct FMutexRegisterTableRow                 InfoRow;                                           // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UUserWidget*                            WidgetInstance;                                    // 0x0020(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OccupyTimeCount;                                   // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitingTimeCount;                                  // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMutexQueueItem;

// ScriptStruct GPGameHud.HudOnShowPassInitParam
// 0x0018 (0x0018 - 0x0000)
struct FHudOnShowPassInitParam final
{
public:
	uint8                                         Uint8Value1;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        Uint64Value1;                                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        Uint64Value2;                                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHudOnShowPassInitParam;

// ScriptStruct GPGameHud.BaseUIView_Params
// 0x0008 (0x0008 - 0x0000)
struct FBaseUIView_Params final
{
public:
	class UBaseUIView*                            View;                                              // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBaseUIView_Params;

// ScriptStruct GPGameHud.UIDebugItem
// 0x0020 (0x0020 - 0x0000)
struct FUIDebugItem final
{
public:
	class UBaseUIView*                            BaseUIView;                                        // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UIName;                                            // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebug;                                        // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUIDebugItem;

// ScriptStruct GPGameHud.AsyncUILoadID
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FAsyncUILoadID final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAsyncUILoadID;

// ScriptStruct GPGameHud.AnimationNameSelector
// 0x0008 (0x0008 - 0x0000)
struct FAnimationNameSelector final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAnimationNameSelector;

// ScriptStruct GPGameHud.BaseUIViewArray
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FBaseUIViewArray final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBaseUIViewArray;

}

