#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPGameInput

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGlobalDefines_structs.hpp"


namespace SDK
{

// Class GPGameInput.MobileInputButton
// 0x0018 (0x0040 - 0x0028)
class UMobileInputButton final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileInputButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileInputButton")
	}
	static class UMobileInputButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileInputButton>();
	}
};
DUMPER7_ASSERTS_UMobileInputButton;

// Class GPGameInput.GPInputDelegates
// 0x0040 (0x0070 - 0x0030)
class UGPInputDelegates final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(EGPInputModeType OldType, EGPInputModeType NewType)> OnInputModeChanged; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bBlocked)> OnInputGateChanged;                                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGPInputType InputType)> OnInputTypeChanged;                       // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGPGamepadInputType GamepadInputType)> OnGamepadChangeDetected;    // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UGPInputDelegates* Get(class UObject* WorldContext); // (Final, Native, Static, Public) // @ 0x142C2F5C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPInputDelegates")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPInputDelegates")
	}
	static class UGPInputDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPInputDelegates>();
	}
};
DUMPER7_ASSERTS_UGPInputDelegates;

// Class GPGameInput.GPInputHelper
// 0x00E0 (0x0110 - 0x0030)
class UGPInputHelper final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnGameplayInputMappingRegistered;                  // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	double                                        Last2KMTimeSec;                                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Last2GamepadTimeSec;                               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bThisInGameTipsNotAllowedUsingKM;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7F];                                      // 0x0081(0x007F)(Fixing Size After Last Property [ Dumper-7 ])
	EGPGamepadInputType                           GamepadInputType;                                  // 0x0100(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGPInputType                                  CurrentInputType;                                  // 0x0101(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGamepadToMouseSimulation;                         // 0x0102(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_103[0xD];                                      // 0x0103(0x000D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void ClearInputMode(class UObject* WorldContext, bool bIncludePersistent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2F3B0
	static class UGPInputHelper* Get(const class UObject* WorldContext); // (Final, Native, Static, Public) // @ 0x142C2F640
	static EGPGamepadInputType GetCurrentGamepadInputType(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2F7E0
	static EGPGamepadInputType GetCurrentGamepadInputTypeOrDefault(const class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2F860
	static EGPInputModeType GetCurrentInputMode(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2F8E0
	static EGPInputType GetCurrentInputType(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2F960
	static EGPInputType GetCurrentInputTypeOrDefault(const class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2F9E0
	static bool IsConsoleGamepadInput(const class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2FDD0
	static bool IsConsoleKeyboardInput(const class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2FE50
	static bool IsFakingTouch(); // (Final, Native, Static, Public) // @ 0x142C2FF00
	static bool IsGamepadInputEnable(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2FF30
	static bool IsGamepadInputGamePlayModeEnable(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2FFB0
	static bool IsKeyPressed(const class UObject* WorldContext, const struct FKey& InKey); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142C30030
	static bool IsTouchOrLMBEvent(const struct FPointerEvent& InPointerEvent); // (Final, Native, Static, Public, HasOutParams) // @ 0x142C30140
	static struct FKey MakeKeyByName(class FName KeyName); // (Final, Native, Static, Public) // @ 0x142C30270
	static void ReApplyInputMode(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C304B0
	static void SetInputGateEnabled(class UObject* WorldContext, bool bEnable); // (Final, Native, Static, Public) // @ 0x142C309A0
	static void SetTempInputMode_GameAndUI(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C30A60
	static void SetTempInputMode_GameOnly(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C30AD0
	static void SetTempInputMode_UIOnly(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C30B40
	static void ToggleGamepadMouseSimulation(class UObject* WorldContext, bool bInGamepadToMouseSimulation); // (Final, Native, Static, Public) // @ 0x142C30BB0
	static void WantInputMode_Enum(class UObject* WorldContext, EGPInputModeType EnumType, class FName ID, bool bEnable, bool bPersistent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C30FD0
	static void WantInputMode_ForceUIOnly(class UObject* WorldContext, class FName ID, bool bEnable, bool bPersistent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C31160
	static void WantInputMode_GameAndUI(class UObject* WorldContext, class FName ID, bool bEnable, bool bPersistent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C312A0
	static void WantInputMode_GameOnly(class UObject* WorldContext, class FName ID, bool bEnable, bool bPersistent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C313E0
	static void WantInputMode_UIOnly(class UObject* WorldContext, class FName ID, bool bEnable, bool bPersistent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C31520

	void OnStartGameInstance(class UGameInstance* InGameInstance); // (Final, Native, Protected) // @ 0x142C303B0
	void SetGamepadInputEnable(bool InbEnable); // (Final, Native, Public) // @ 0x142C30880
	void SetGamepadInputGamePlayModeEnable(bool InbEnable); // (Final, Native, Public) // @ 0x142C30910

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPInputHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPInputHelper")
	}
	static class UGPInputHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPInputHelper>();
	}
};
DUMPER7_ASSERTS_UGPInputHelper;

// Class GPGameInput.GPPlayerInput
// 0x00A0 (0x0448 - 0x03A8)
class UGPPlayerInput : public UPlayerInput
{
public:
	uint8                                         Pad_3A8[0xA0];                                     // 0x03A8(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPPlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPPlayerInput")
	}
	static class UGPPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPPlayerInput>();
	}
};
DUMPER7_ASSERTS_UGPPlayerInput;

// Class GPGameInput.MobilePlayerInput
// 0x0240 (0x0688 - 0x0448)
class UMobilePlayerInput : public UGPPlayerInput
{
public:
	float                                         NormalSensitivityX;                                // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalSensitivityY;                                // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              LockSensitivity;                                   // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LockMoveAngle;                                     // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTriggerDistFactorMax;                        // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTriggerDistFactorMin;                        // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTriggerSensitivityDivideNum;                 // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTriggerPhysicalSizeScalarMin;                // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTriggerPhysicalSizeScalarMax;                // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTriggerSizeStandard;                         // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintTriggerSizeZooming;                          // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuperSprintTriggerSizeStandard;                    // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SprintAnimTriggerSizeStandard;                     // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SilentWalkTriggerSize;                             // 0x0480(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AllowSprintAngle;                                  // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShowLockMoveShowAngle;                             // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERotationMethodType                           RotationMethod;                                    // 0x048C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48D[0x3];                                      // 0x048D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PhysicalSizeScalarMin;                             // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalSizeScalarMax;                             // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GyroRotationFactor;                                // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            SmoothRotationByFrameCurve;                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RotationSpeedAccelerationPiecewiseFunctionCurve_Normal; // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            RotationSpeedAccelerationPiecewiseFunctionCurve_Fire; // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StandardResolution;                                // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StandardScreenXYInch;                              // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardPPI;                                       // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardRotationAngleHalfScreen;                   // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardPixelNumHalfScreen;                        // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MobileInputAllowDisableInputReason;                // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 HotFixArray;                                       // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EMobileControlButtonType>              ButtonTypeForbidRotateInMovementArea;              // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PanelConfigNames;                                  // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector2D                              RotationInputLocation;                             // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_520[0x8];                                      // 0x0520(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMobileGameHandle*                      GameHandle;                                        // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_530[0x10];                                     // 0x0530(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMobileInputData>               MobileInputDataList;                               // 0x0540(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMobileInputData>               MobileInputDataList_Complete;                      // 0x0550(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_560[0x20];                                     // 0x0560(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmoothTouchData>               SmoothTouchDataList;                               // 0x0580(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_590[0xF8];                                     // 0x0590(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckWholeScreenRotationAreaReasonExist(const class FString& reason); // (Final, Native, Public) // @ 0x142C2F280
	struct FVector2D GetSmoothedTouchPosition(ETouchIndex FingerIndex); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x142C2FBE0
	void RegisterInterestedTouchIndex(ETouchIndex FingerIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x142C30520
	void RequestWholeScreenRotationArea(bool bRequest, const class FString& reason); // (Final, Native, Public) // @ 0x142C30710
	void UnRegisterInterestedTouchIndex(ETouchIndex FingerIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x142C30C70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobilePlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobilePlayerInput")
	}
	static class UMobilePlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobilePlayerInput>();
	}
};
DUMPER7_ASSERTS_UMobilePlayerInput;

// Class GPGameInput.HDPlayerInput
// 0x0050 (0x06D8 - 0x0688)
class UHDPlayerInput : public UMobilePlayerInput
{
public:
	float                                         CachedFinalSensitivity;                            // 0x0688(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CachedFinalSensitivityX;                           // 0x068C(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CachedFinalSensitivityY;                           // 0x0690(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CachedFinalGamepadSensitivity;                     // 0x0694(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHDAimingDebugInfo                     CachedDebugInfo;                                   // 0x0698(0x0010)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 LuaPath;                                           // 0x06A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClientSensitivitySettingHD*            ClientSensitivitySettingHD;                        // 0x06B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClientVehicleSettingHD*                ClientVehicleSettingHD;                            // 0x06C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(const struct FHDAimingDebugInfo& Info)> OnHDAimingDebugInfo;       // 0x06C8(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UHDPlayerInput* GetHDPlayerInput(const class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142C2FA60

	float GetCurADSSensitivity(float TarZoomRate); // (Final, Native, Public) // @ 0x142C2F750
	bool GetIsInZoomingProcess(); // (Final, Native, Public) // @ 0x142C2FB10
	bool GetIsInZoomInProcess(); // (Final, Native, Public) // @ 0x142C2FAE0
	float GetVehicleCurADSSensitivity(float TarZoomRate); // (Native, Public) // @ 0x142C2FC80
	float GetZoomingPercent(); // (Final, Native, Public) // @ 0x142C2FD10
	bool IsEntirelyZoomedIn(); // (Final, Native, Public) // @ 0x142C2FED0
	void OnMouseAxisInput(EMouseInputType MouseInputType); // (Native, Event, Public, BlueprintEvent) // @ 0x142C30330
	void OnZoomRateChanged(float NewRate); // (Native, Event, Public, BlueprintEvent) // @ 0x142C30430

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HDPlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HDPlayerInput")
	}
	static class UHDPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHDPlayerInput>();
	}
};
DUMPER7_ASSERTS_UHDPlayerInput;

// Class GPGameInput.MobileGameHandle
// 0x04C0 (0x04E8 - 0x0028)
class UMobileGameHandle : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMobileMoveHandleImpl*                  MoveHandleImpl;                                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClientSensitivitySetting*              ClientSensitivitySetting;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClientVehicleSetting*                  ClientVehicleSetting;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClientControlSetting*                  ClientControlSetting;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClientBaseSetting*                     ClientBaseSetting;                                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x90];                                      // 0x0060(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EMobileControlButtonType, struct FControlButtonInfo> ControlButtons;                        // 0x00F0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x58];                                     // 0x0140(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EMobileControlButtonType>              ReleaseButtonInfo;                                 // 0x0198(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A8[0x340];                                    // 0x01A8(0x0340)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float CalcDist(float FOV); // (Final, Native, Protected) // @ 0x142C2EFB0
	float CalcMDRadiansWithZoomRate(float BaseVFOV, float InMDV, float ZoomRate); // (Final, Native, Protected) // @ 0x142C2F040
	bool CheckWholeScreenRotationAreaReasonExist(const class FString& reason); // (Final, Native, Public) // @ 0x142C2F150
	bool CurrentIsWholeScreenRotationArea(); // (Final, Native, Public) // @ 0x142C2F470
	void EnableMovementTouchArea(bool bEnable); // (Final, Native, Public, BlueprintCallable) // @ 0x142C2F4A0
	void EnableRotateTouchArea(bool bEnable); // (Final, Native, Public, BlueprintCallable) // @ 0x142C2F530
	bool GetControlButtonAllowRotate(EMobileControlButtonType ControlButtonType); // (Final, Native, Public) // @ 0x142C2F6C0
	float GetSensitivityFactor(bool bGyroScope); // (Native, Protected) // @ 0x142C2FB40
	float HDistToVDist(float HDist); // (Final, Native, Protected) // @ 0x142C2FD40
	void RequestWholeScreenRotationArea(bool bRequest, const class FString& reason); // (Final, Native, Public) // @ 0x142C305A0
	void UpdateControlButtonRotateInfo(EMobileControlButtonType ControlButtonType, bool bAllowRotate); // (Final, Native, Public) // @ 0x142C30CF0
	void UpdateControlButtonRotateLimit(EMobileControlButtonType ControlButtonType, bool bInRotateLimitArea); // (Final, Native, Public) // @ 0x142C30DC0
	void UpdateControlButtonStatus(EMobileControlButtonType ControlButtonType, bool bIsPressed, int32 FingerIndex); // (Final, Native, Public) // @ 0x142C30E90
	void UpdateMoveFireModeSetting(); // (Final, Native, Protected) // @ 0x142C30F90
	void UpdateSprintTriggerSensitivity(); // (Final, Native, Protected) // @ 0x142C30FB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileGameHandle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileGameHandle")
	}
	static class UMobileGameHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileGameHandle>();
	}
};
DUMPER7_ASSERTS_UMobileGameHandle;

// Class GPGameInput.MobileFixedFireGameHandle
// 0x0000 (0x04E8 - 0x04E8)
class UMobileFixedFireGameHandle final : public UMobileGameHandle
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileFixedFireGameHandle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileFixedFireGameHandle")
	}
	static class UMobileFixedFireGameHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileFixedFireGameHandle>();
	}
};
DUMPER7_ASSERTS_UMobileFixedFireGameHandle;

// Class GPGameInput.MobileInputConfig
// 0x0200 (0x0228 - 0x0028)
class UMobileInputConfig final : public UObject
{
public:
	struct FMobileButtonStyleConfig               ButtonStyleConfig;                                 // 0x0028(0x003C)(Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButtonConfig                    DefaultButtonConfig;                               // 0x0064(0x00E0)(Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButtonConfig                    CustomButtonConfig;                                // 0x0144(0x00E0)(Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileInputConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileInputConfig")
	}
	static class UMobileInputConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileInputConfig>();
	}
};
DUMPER7_ASSERTS_UMobileInputConfig;

// Class GPGameInput.MobileMoveHandleImpl
// 0x0010 (0x0038 - 0x0028)
class UMobileMoveHandleImpl : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileMoveHandleImpl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileMoveHandleImpl")
	}
	static class UMobileMoveHandleImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileMoveHandleImpl>();
	}
};
DUMPER7_ASSERTS_UMobileMoveHandleImpl;

// Class GPGameInput.MobileMoveJoystickHandleImpl
// 0x0000 (0x0038 - 0x0038)
class UMobileMoveJoystickHandleImpl final : public UMobileMoveHandleImpl
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileMoveJoystickHandleImpl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileMoveJoystickHandleImpl")
	}
	static class UMobileMoveJoystickHandleImpl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileMoveJoystickHandleImpl>();
	}
};
DUMPER7_ASSERTS_UMobileMoveJoystickHandleImpl;

}

