#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPGameFlow

#include "Basic.hpp"

#include "GPGameFlow_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GPGameFlow.GPGameFlowUtils
// 0x0000 (0x0028 - 0x0028)
class UGPGameFlowUtils final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPGameFlowUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPGameFlowUtils")
	}
	static class UGPGameFlowUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPGameFlowUtils>();
	}
};
DUMPER7_ASSERTS_UGPGameFlowUtils;

// Class GPGameFlow.GPGameFlowStringArg
// 0x0010 (0x0038 - 0x0028)
class UGPGameFlowStringArg final : public UObject
{
public:
	class FString                                 RawString;                                         // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UGPGameFlowStringArg* FromString(class UObject* WorldContextObject, const class FString& Value); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14101B880

	class FString ToString(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x14101C3A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPGameFlowStringArg")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPGameFlowStringArg")
	}
	static class UGPGameFlowStringArg* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPGameFlowStringArg>();
	}
};
DUMPER7_ASSERTS_UGPGameFlowStringArg;

// Class GPGameFlow.GameFlowDelegates
// 0x0078 (0x00A8 - 0x0030)
class UGameFlowDelegates final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EGameFlowStageType GameFlowStage)> OnPreEnterGameFlowStage;        // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGameFlowStageType GameFlowStage)> OnEnterGameFlowStage;           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGameFlowStageType GameFlowStage)> OnPostEnterGameFlowStage;       // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGameFlowStageType GameFlowStage)> OnLeaveGameFlowStage;           // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGameFlowStageType GameFlowStage)> OnPostLeaveGameFlowStage;       // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameFlowGraph* CurrentGraph)> OnGameFlowGraphPlay;          // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGameFlowGraph* CurrentGraph)> OnGameFlowGraphStop;          // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UGameFlowDelegates* GetGameFlowDelegates(class UObject* Context); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14101BA80

	EGameFlowStageType GetCurGameFlowStage(); // (Final, Native, Public, BlueprintCallable) // @ 0x14101BA60
	EGameFlowStageType GetPendingNextGameFlowStage(); // (Final, Native, Public, BlueprintCallable) // @ 0x14101BB40
	EGameFlowStageType GetPreGameFlowStage(); // (Final, Native, Public, BlueprintCallable) // @ 0x14101BB60
	void OnGameFlowEnter(EGameFlowStageType GameFlowStage); // (Final, Native, Public) // @ 0x14101BFA0
	void UpdatePendingNextFlowStage(EGameFlowStageType InGameFlowStage); // (Final, Native, Public) // @ 0x14101C480

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFlowDelegates")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFlowDelegates")
	}
	static class UGameFlowDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFlowDelegates>();
	}
};
DUMPER7_ASSERTS_UGameFlowDelegates;

// Class GPGameFlow.GameFlowGraph
// 0x0078 (0x00A0 - 0x0028)
class UGameFlowGraph : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GFGraphName;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameFlowStage*                         CurrentStage;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UGameFlowStage>, class UGameFlowStage*> AllStageMap;                      // 0x0048(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	class UGameInstance*                          OwningGameInstance;                                // 0x0098(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static void OnLuaGameFlowEvent(class UGameInstance* GameInst, const class FString& MdlName, const class FString& EvtName, const class FString& ArgStr); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14101C020

	void BeginFlow(class UGameInstance* GameInstance); // (Final, Native, Public, BlueprintCallable) // @ 0x14101B3A0
	void EndFlow(); // (Final, Native, Public, BlueprintCallable) // @ 0x14101B7A0
	void GotoStage(TSubclassOf<class UGameFlowStage> GFStageClass, class UObject* Args); // (Final, Native, Public, BlueprintCallable) // @ 0x14101BB80
	void OnBeginFlow(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnEndFlow(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFlowGraph")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFlowGraph")
	}
	static class UGameFlowGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFlowGraph>();
	}
};
DUMPER7_ASSERTS_UGameFlowGraph;

// Class GPGameFlow.GPGameFlowStagePlayerBase
// 0x0010 (0x0040 - 0x0030)
class UGPGameFlowStagePlayerBase : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const class FString& FlowBranch)> OnFlowBranch;                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPGameFlowStagePlayerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPGameFlowStagePlayerBase")
	}
	static class UGPGameFlowStagePlayerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPGameFlowStagePlayerBase>();
	}
};
DUMPER7_ASSERTS_UGPGameFlowStagePlayerBase;

// Class GPGameFlow.GPLuaGameFlowEventListener
// 0x0038 (0x0068 - 0x0030)
class UGPLuaGameFlowEventListener final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const class FString& ArgStr)> OnLuaGameFlowEvent;                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGPLuaGameFlowEventListener* ListenLuaModuleEvent(class UGameFlowStage* GFStage, const class FString& ModuleEvent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14101BEA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPLuaGameFlowEventListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPLuaGameFlowEventListener")
	}
	static class UGPLuaGameFlowEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPLuaGameFlowEventListener>();
	}
};
DUMPER7_ASSERTS_UGPLuaGameFlowEventListener;

// Class GPGameFlow.GameFlowStage
// 0x0060 (0x0088 - 0x0028)
class UGameFlowStage : public UObject
{
public:
	TArray<class UGPLuaGameFlowEventListener*>    ListLuaGameFlowEventListeners;                     // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                LastLeaveArgs;                                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableGlobalLuaModuleFuncAndEvent;                // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameFlowStageType                            FlowStageType;                                     // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameFlowStageType                            PendingNextFlowStage;                              // 0x005A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GFStageName;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameFlowStage>             GFStageBackClass;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameFlowGraph*                         Owner;                                             // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPGameFlowStagePlayerBase*             Player;                                            // 0x0080(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static bool IsAsanOpen(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14101BC40

	void BeginStage(class UObject* Args); // (Native, Public) // @ 0x14101B420
	void CallLuaGlobalFunction(const class FString& FuncName); // (Final, Native, Protected, BlueprintCallable) // @ 0x14101B4B0
	void CallLuaModuleFunction(const class FString& ModuleFunc, const class FString& ArgStr); // (Final, Native, Protected, BlueprintCallable) // @ 0x14101B570
	void Delay(float Duration, const struct FLatentActionInfo& LatentInfo); // (Final, Native, Protected, BlueprintCallable) // @ 0x14101B6B0
	void EndStage(); // (Native, Public) // @ 0x140C99650
	void Leave(const class FString& FlowBranch, class UObject* Args); // (Final, Native, Protected, BlueprintCallable) // @ 0x14101BC60
	void LeaveToBack(class UObject* Args); // (Final, Native, Protected, BlueprintCallable) // @ 0x14101BD60
	void LeaveToStage(TSubclassOf<class UGameFlowStage> GFStageClass, class UObject* Args); // (Final, Native, Protected, BlueprintCallable) // @ 0x14101BDE0
	void OnBeginStage(class UObject* Args); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnEndStage(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnTick(float DeltaTime); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameFlowStage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameFlowStage")
	}
	static class UGameFlowStage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameFlowStage>();
	}
};
DUMPER7_ASSERTS_UGameFlowStage;

// Class GPGameFlow.GPGameFlowStagePlayer
// 0x0000 (0x0040 - 0x0040)
class UGPGameFlowStagePlayer final : public UGPGameFlowStagePlayerBase
{
public:
	static class UGPGameFlowStagePlayer* EnterGameFlowStage(class UGameFlowGraph* GFGraph, TSubclassOf<class UGameFlowStage> GFStageClass); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14101B7C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPGameFlowStagePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPGameFlowStagePlayer")
	}
	static class UGPGameFlowStagePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPGameFlowStagePlayer>();
	}
};
DUMPER7_ASSERTS_UGPGameFlowStagePlayer;

// Class GPGameFlow.GPGameFlowGraphPlayer
// 0x0008 (0x0038 - 0x0030)
class UGPGameFlowGraphPlayer final : public UGameInstanceSubsystem
{
public:
	class UGameFlowGraph*                         CurrentGraph;                                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UGameFlowGraph* Play(TSubclassOf<class UGameFlowGraph> GFGraphClass); // (Final, Native, Public, BlueprintCallable) // @ 0x14101C2F0
	void Stop(); // (Final, Native, Public, BlueprintCallable) // @ 0x14101C380

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPGameFlowGraphPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPGameFlowGraphPlayer")
	}
	static class UGPGameFlowGraphPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPGameFlowGraphPlayer>();
	}
};
DUMPER7_ASSERTS_UGPGameFlowGraphPlayer;

}

