#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPGameInput

#include "Basic.hpp"


namespace SDK
{

// Enum GPGameInput.EGPGamepadInputType
// NumValues: 0x0003
enum class EGPGamepadInputType : uint8
{
	XBox360                                  = 0,
	Sony                                     = 1,
	EGPGamepadInputType_MAX                  = 2,
};

// Enum GPGameInput.EGPInputModeType
// NumValues: 0x0007
enum class EGPInputModeType : uint8
{
	None                                     = 0,
	GameOnly                                 = 1,
	UIOnly                                   = 2,
	GameAndUI                                = 3,
	ForceUIOnly                              = 4,
	Count                                    = 5,
	EGPInputModeType_MAX                     = 6,
};

// Enum GPGameInput.EGPInputType
// NumValues: 0x0005
enum class EGPInputType : uint8
{
	MouseAndKeyboard                         = 0,
	Gamepad                                  = 1,
	Touch                                    = 2,
	Count                                    = 3,
	EGPInputType_MAX                         = 4,
};

// Enum GPGameInput.EMobileTouchType
// NumValues: 0x0005
enum class EMobileTouchType : uint8
{
	Begin                                    = 0,
	FirstMove                                = 1,
	Move                                     = 2,
	End                                      = 3,
	EMobileTouchType_MAX                     = 4,
};

// Enum GPGameInput.EMobileControlButtonType
// NumValues: 0x0034
enum class EMobileControlButtonType : uint8
{
	EControlButtonType_None                  = 0,
	EControlButtonType_Jump                  = 1,
	EControlButtonType_Crouch                = 2,
	EControlButtonType_Prone                 = 3,
	EControlButtonType_Aim                   = 4,
	EControlButtonType_Fire                  = 5,
	EControlButtonType_LeftPeek              = 6,
	EControlButtonType_RightPeek             = 7,
	EControlButtonType_LeftFire              = 8,
	EControlButtonType_Throw                 = 9,
	EControlButtonType_SilentWalk            = 10,
	EControlButtonType_Eye                   = 11,
	EControlButtonType_FastMelee             = 12,
	EControlButtonType_VaultClimb            = 13,
	ControlButtonType_Zipline                = 14,
	ControlButtonType_Parachute              = 15,
	ControlButtonType_Assassinate            = 16,
	ControlButtonType_CarryBody              = 17,
	ControlButtonType_Interact0              = 18,
	ControlButtonType_Interact1              = 19,
	ControlButtonType_Interact2              = 20,
	ControlButtonType_PickUp                 = 21,
	ControlButtonType_ItemDetail             = 22,
	EControlButtonType_SkillX                = 23,
	EControlButtonType_SkillG                = 24,
	EControlButtonType_SkillV                = 25,
	EControlButtonType_Skill4                = 26,
	EControlButtonType_Skill5                = 27,
	EControlButtonType_SkillSelf             = 28,
	EControlButtonType_SkillActiveMine       = 29,
	EControlButtonType_SkillRecyleMine       = 30,
	EControlButtonType_Relink                = 31,
	EControlButtonType_Marking               = 32,
	EControlButtonType_Commercialization     = 33,
	EControlButtonType_SkillInspect          = 34,
	EControlButtonType_Reload                = 35,
	EControlButtonType_ChangeScope           = 36,
	EControlButtonType_VehicleSkill1         = 37,
	EControlButtonType_VehicleSkill2         = 38,
	EControlButtonType_VehicleSkill3         = 39,
	EControlButtonType_VehicleSkill4         = 40,
	EControlButtonType_VehicleFire           = 41,
	EControlButtonType_VehicleLeftFire       = 42,
	EControlButtonType_VehicleJoystickFire   = 43,
	EControlButtonType_VehicleJoystickLeftFire = 44,
	EControlButtonType_SuperSprint           = 45,
	EControlButtonType_VehicleSecondWeaponFire = 46,
	EControlButtonType_SwimDown              = 47,
	EControlButtonType_SwimUp                = 48,
	EControlButtonType_VehicleSwitchWeaponFastFire = 49,
	EControlButtonType_VehicleFreeCamera     = 50,
	EMobileControlButtonType_MAX             = 51,
};

// Enum GPGameInput.EJoystickMode
// NumValues: 0x0003
enum class EJoystickMode : uint8
{
	EJoystickMode_Character                  = 0,
	EJoystickMode_Vehicle                    = 1,
	EJoystickMode_MAX                        = 2,
};

// Enum GPGameInput.EMouseInputType
// NumValues: 0x0006
enum class EMouseInputType : uint8
{
	ENormalWeapon                            = 0,
	EVehicleDriveWeapon                      = 1,
	EHelicopterDriveWeapon                   = 2,
	EVehicleWeapon                           = 3,
	EJet                                     = 4,
	EMouseInputType_MAX                      = 5,
};

// Enum GPGameInput.EGyroscopeInputForbidReason
// NumValues: 0x0002
enum class EGyroscopeInputForbidReason : uint8
{
	EForbidReason_NumMax                     = 0,
	EForbidReason_MAX                        = 1,
};

// Enum GPGameInput.EMobileInputPhase
// NumValues: 0x0006
enum class EMobileInputPhase : uint8
{
	MobileInputPhase_Began                   = 0,
	MobileInputPhase_Moved                   = 1,
	MobileInputPhase_Stationary              = 2,
	MobileInputPhase_Ended                   = 3,
	MobileInputPhase_Canceled                = 4,
	MobileInputPhase_MAX                     = 5,
};

// Enum GPGameInput.EGPInputMode
// NumValues: 0x0004
enum class EGPInputMode : uint8
{
	GameOnly                                 = 0,
	GameAndUI                                = 1,
	UIOnly                                   = 2,
	EGPInputMode_MAX                         = 3,
};

// ScriptStruct GPGameInput.HDAimingDebugInfo
// 0x0010 (0x0010 - 0x0000)
struct FHDAimingDebugInfo final
{
public:
	float                                         DeltaMouseX;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaMouseY;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScopeZoomRate;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ADSIndex;                                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHDAimingDebugInfo;

// ScriptStruct GPGameInput.SmoothTouchData
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x04) FSmoothTouchData final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmoothTouchData;

// ScriptStruct GPGameInput.MobileInputData
// 0x005C (0x005C - 0x0000)
struct alignas(0x04) FMobileInputData final
{
public:
	uint8                                         Pad_0[0x5C];                                       // 0x0000(0x005C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMobileInputData;

// ScriptStruct GPGameInput.MobileButton
// 0x001C (0x001C - 0x0000)
struct FMobileButton final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinScale;                                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxScale;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Alpha;                                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         AnchorType;                                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMobileButton;

// ScriptStruct GPGameInput.MobileButtonConfig
// 0x00E0 (0x00E0 - 0x0000)
struct FMobileButtonConfig final
{
public:
	struct FMobileButton                          MovementButton;                                    // 0x0000(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButton                          RotationButton;                                    // 0x001C(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButton                          FixedFireButton;                                   // 0x0038(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButton                          FollowFireButton;                                  // 0x0054(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButton                          MoveFireButton;                                    // 0x0070(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButton                          JumpButton;                                        // 0x008C(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButton                          CrouchButton;                                      // 0x00A8(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButton                          RightHand;                                         // 0x00C4(0x001C)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMobileButtonConfig;

// ScriptStruct GPGameInput.MobileButtonStyle
// 0x000C (0x000C - 0x0000)
struct FMobileButtonStyle final
{
public:
	float                                         Width;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Type;                                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixed;                                            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMobileButtonStyle;

// ScriptStruct GPGameInput.MobileButtonStyleConfig
// 0x003C (0x003C - 0x0000)
struct FMobileButtonStyleConfig final
{
public:
	struct FMobileButtonStyle                     MovementButton;                                    // 0x0000(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButtonStyle                     RotationButton;                                    // 0x000C(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButtonStyle                     FireButton;                                        // 0x0018(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButtonStyle                     JumpButton;                                        // 0x0024(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FMobileButtonStyle                     CrouchButton;                                      // 0x0030(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMobileButtonStyleConfig;

// ScriptStruct GPGameInput.FireAxesRecordData
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FFireAxesRecordData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFireAxesRecordData;

// ScriptStruct GPGameInput.FireAxesRecordDataItem
// 0x0014 (0x0014 - 0x0000)
struct alignas(0x04) FFireAxesRecordDataItem final
{
public:
	uint8                                         Pad_0[0x14];                                       // 0x0000(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFireAxesRecordDataItem;

// ScriptStruct GPGameInput.FireInputRecordData
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FFireInputRecordData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFireInputRecordData;

// ScriptStruct GPGameInput.FireInputRecordDataItem
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FFireInputRecordDataItem final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFireInputRecordDataItem;

// ScriptStruct GPGameInput.ControlButtonInfo
// 0x0020 (0x0020 - 0x0000)
struct FControlButtonInfo final
{
public:
	bool                                          bAllowRotate;                                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInRotateLimitationArea;                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPressed;                                        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FingerIndex;                                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowMove;                                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DelegateOwner;                                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FControlButtonInfo;

// ScriptStruct GPGameInput.MobileTouchEvent
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x04) FMobileTouchEvent final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMobileTouchEvent;

}

