#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPGameHud

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UITween_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGameHud_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "HudFramework_classes.hpp"
#include "GameCore_classes.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// Class GPGameHud.HUDComponent
// 0x0000 (0x0028 - 0x0028)
class UHUDComponent : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDComponent")
	}
	static class UHUDComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDComponent>();
	}
};
DUMPER7_ASSERTS_UHUDComponent;

// Class GPGameHud.BaseUIView
// 0x00F8 (0x03E8 - 0x02F0)
class UBaseUIView : public UUserWidget
{
public:
	bool                                          bIsHud;                                            // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LocalFocusActor;                                   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseUIController*                      ViewController;                                    // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         UserDefinedPanelNameList;                          // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ChangeRootVisibleFlag;                             // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickWhenHidden;                                   // 0x0319(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeverSleep;                                       // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31B[0x1];                                      // 0x031B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaitForDestroyTime;                                // 0x031C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ViewName;                                          // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPInputModeType                              WantedInputMode;                                   // 0x0328(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_329[0xF];                                      // 0x0329(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                DynamicRoot;                                       // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_340[0x8];                                      // 0x0340(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGameHUDSate>                          AlwaysShowGameHudState;                            // 0x0348(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<EGameHUDSate>                          VisibleGameHudState;                               // 0x0358(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<EGameHUDSate>                          InVisibleGameHudState;                             // 0x0368(0x0010)(BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bControlByUiState;                                 // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PanelOwner;                                        // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimationNameSelector                 FadeInAnimationName;                               // 0x0388(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimationNameSelector                 FadeOutAnimationName;                              // 0x0390(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIAnimationController                 AnimationController;                               // 0x0398(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class UWidgetAnimation*>               AllUMGAnimations;                                  // 0x03B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bInFadeIn;                                         // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInFadeOut;                                        // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3CA[0x6];                                      // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       UMGFadeInAnimation;                                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       UMGFadeOutAnimation;                               // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCacheScreenOCStaticMeshOn;                        // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddScreenOCStaticMesh(); // (Final, Native, Protected) // @ 0x142BE6E70
	void BP_BeginTouch(ETouchIndex FingerIndex, const struct FVector& Location); // (Event, Public, HasDefaults, BlueprintEvent) // @ 0x14B5B5E20
	void BP_InitAlwaysShowGameHUDState(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_InitInVisibleGameHudState(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_InitVisibleGameHudState(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnHide(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnInit(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnShow(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnShowWithWeaponEnable(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool CheckPrepareShow(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE72E0
	TArray<class UWidgetAnimation*> GetAllAnimations(); // (Final, Native, Public) // @ 0x142BE75D0
	class UWidget* GetDynamicRoot(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE76B0
	class UObject* GetPanelOwner(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE7940
	class UWidgetAnimation* GetUMGFadeInAnim(); // (Native, Public) // @ 0x142BE7990
	class UWidgetAnimation* GetUMGFadeOutAnim(); // (Native, Public) // @ 0x142BE79C0
	bool HasFadeInAnimation(); // (Final, Native, Public) // @ 0x142BE79F0
	bool HasFadeOutAnimation(); // (Final, Native, Public) // @ 0x142BE7A20
	void HideSelf(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE7AD0
	void Init(); // (Final, Native, Public) // @ 0x142BE7AF0
	void InitGameHudState(); // (Native, Public) // @ 0x142BE7B10
	bool IsEnableScreenOCStaticMeshWhenShow(); // (Native, Protected) // @ 0x142BE7B50
	void OnAnimationFinished_Implementation(const class UWidgetAnimation* Animation); // (Native, Public) // @ 0x142012200
	void OnFadeInAnimationEnd(); // (Native, Public) // @ 0x142BE7D00
	void OnFadeOutAnimationEnd(); // (Native, Public) // @ 0x142BE7D20
	bool PlayFadeInAnimation(); // (Native, Public) // @ 0x142BE8110
	bool PlayFadeOutAnimation(); // (Native, Public) // @ 0x142BE8140
	void PreInit(); // (Final, Native, Public) // @ 0x142BE8170
	void RefreshFadeOutAnimation(); // (Native, Public) // @ 0x142BE8190
	void RemoveScreenOCStaticMesh(); // (Final, Native, Protected) // @ 0x142BE8230
	void SetDynamicRoot(class UWidget* root); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE82E0
	void ShowSelf(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE8800
	void StopFadeInAnimation(); // (Native, Public) // @ 0x142BE8840
	void StopFadeOutAnimation(); // (Native, Public) // @ 0x142BE8860

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseUIView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseUIView")
	}
	static class UBaseUIView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseUIView>();
	}
};
DUMPER7_ASSERTS_UBaseUIView;

// Class GPGameHud.BaseHUD
// 0x0280 (0x06E0 - 0x0460)
class ABaseHUD : public AHUD
{
public:
	uint8                                         Pad_460[0x8];                                      // 0x0460(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBatchUIController*>             Controllers;                                       // 0x0468(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         SafeZoneValue;                                     // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47C[0x54];                                     // 0x047C(0x0054)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bStartInGame;                                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAsyncUILoadID>                 AsyncUILoadIDs;                                    // 0x04D8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSoftClassPath, class UClass*>    AsyncLoadedControllerClassCache;                   // 0x04E8(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSoftClassPath, class UClass*>    AsyncLoadedViewClassCache;                         // 0x0538(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x78];                                     // 0x0588(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UMobileGamePad*                         Gamepad;                                           // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 LocalFocusActor;                                   // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_610[0x10];                                     // 0x0610(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DefaultUIDataTable_Name;                           // 0x0620(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             DefaultUIDataTable;                                // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UHUDComponent>>      HUDComponentClass;                                 // 0x0630(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSet<class FName>                             HUDBlackLists;                                     // 0x0640(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UHUDComponent*>                  HUDComponents;                                     // 0x0690(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6A0[0x18];                                     // 0x06A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULuaUIHudBaseView*>              HudList;                                           // 0x06B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudManager*                            NewHudManager;                                     // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHudManager>                HudManagerClass;                                   // 0x06D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class ABaseHUD* GetHUD(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142BE76E0

	void AcumInitializeAsyncLoadingProgress(class FName LoadedViewName, int32 AccNum); // (Final, Native, Protected) // @ 0x142BE6D30
	void AddHudOrState(class FName Name_0); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE6DF0
	bool AddToRoot(class UWidget* UIIns, int32 UILayer, int32 ZOrder); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool AddUI(class UWidget* UIIns, bool bIsInSafeZone, int32 ZOrder); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE6E90
	void AsyncLoadPanel(class FName PanelConfigName, class UObject* PanelOwner); // (Final, Native, Public) // @ 0x142BE6F90
	void AsyncLoadPanelDelegate(class FName PanelConfigName, class UObject* PanelOwner, TMulticastInlineDelegate<void(const class FString& FunctionName, class UBaseUIView* View)> LoadedDelegate); // (Final, Native, Public) // @ 0x142BE7050
	void CallBaseUIViewShowDelegate(const class FString& FunctionName, class UBaseUIView* View); // (Final, Native, Protected) // @ 0x142BE71E0
	void CreateLuaPanelWithSubUIList(class FName PanelConfigName, class UObject* PanelOwner, const TArray<class FName>& SubUIs); // (Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void CreatePanel(class FName PanelConfigName); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void CreatePanels(const class FName& UIDataTableType, const class FString& RuleOnlyLuaHudTableName, const class FString& RuleOnlyLuaBaseHudTableName); // (Native, Public, HasOutParams) // @ 0x142BE7320
	void DeletePanels(const class FName& UIDataTableType); // (Native, Public, HasOutParams) // @ 0x142BE74B0
	void DestroyPanel(class FName PanelConfigName); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE7550
	TArray<class FName> GetAllLuaPanelName(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	class AActor* GetLocalFocusActor(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE7760
	class ULuaUIBaseView* GetLuaPanel(class FName PanelConfigName); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FName GetLuaPanelDesc(class FName LuaPanelName); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	TArray<class FName> GetNotLoadedBlockGameFlowHUDNames(); // (Final, Native, Public) // @ 0x142BE7790
	TArray<class UBaseUIView*> GetPanel(class FName PanelConfigName); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE7810
	void HidePanel(class FName PanelConfigName); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE7A50
	void Initialize(); // (Final, Native, Protected) // @ 0x142BE7B30
	bool IsInitializeFinished(); // (Final, Native, Public) // @ 0x142BE7B80
	bool MovePanelToLayer(class FName PanelConfigName, ELayerZorder NewLayerZOrder); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE7BC0
	void NotifyLuaHUDStartInGame(); // (Native, Protected) // @ 0x141000790
	void OnCreateNewFirstPlayerController(class APlayerController* NewPlayerController); // (Final, Native, Public) // @ 0x142BE7C80
	void OnDestroyPanel(class FName PanelConfigName); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnGameHudStateChanged(); // (Final, Native, Protected) // @ 0x142BE7D40
	void OnHidePanel(class FName PanelConfigName); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnHudMutexChanged(const struct FMutexQueueItem& PreHolder, const struct FMutexQueueItem& CurHolder, EMutexChangeReason ChangeReason, class UGPCommonHUDScreenMutex* MutexObj); // (Final, Native, Protected) // @ 0x142BE7D60
	void OnInitializeAsyncLoadingFinish(); // (Final, Native, Protected) // @ 0x142BE7F90
	void OnLoadingViewShutDown(); // (Final, Native, Protected) // @ 0x142BE7FB0
	void OnPreGarbageCollect(); // (Final, Native, Public) // @ 0x142BE7FD0
	void OnSeamlessTravelEnd(bool bReconnect); // (Final, Native, Protected) // @ 0x142BE7FF0
	void OnSetCinematicMode(bool bCinematicMode); // (Final, Native, Public) // @ 0x142BE8080
	void OnShowPanel(class FName PanelConfigName, class UObject* PanelOwner); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void RemoveHudOrState(class FName Name_0); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE81B0
	bool RemoveUI(class UWidget* UIIns); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE8250
	void SetRootUISafeZone(float InSafeZoneValue); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE8360
	void ShowGamepad(bool bShowGamepad); // (Final, Exec, Native, Public) // @ 0x142BE83E0
	void ShowLuaPanelWithSubUIList(class FName PanelConfigName, class UObject* PanelOwner, const TArray<class FName>& SubUIs); // (Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void ShowPanel(class FName PanelConfigName, class UObject* PanelOwner); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE8470
	void ShowPanelDelegate(class FName PanelConfigName, class UObject* PanelOwner, TMulticastInlineDelegate<void(const class FString& FunctionName, class UBaseUIView* View)> ViewShowDelegate); // (Final, Native, Public) // @ 0x142BE8530
	void ShowPanelWithFunctionName(class FName PanelConfigName, class UObject* PanelOwner, const class FString& FunctionName); // (Final, Native, Public, BlueprintCallable) // @ 0x142BE86C0
	void StartInGame(); // (Final, Native, Protected) // @ 0x142BE8820
	void UpdatePanelSwitcherHD(); // (Final, Native, Public) // @ 0x142BE8880

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseHUD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseHUD")
	}
	static class ABaseHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABaseHUD>();
	}
};
DUMPER7_ASSERTS_ABaseHUD;

// Class GPGameHud.BaseMutexUIView
// 0x0010 (0x03F8 - 0x03E8)
class UBaseMutexUIView : public UBaseUIView
{
public:
	class FName                                   MutexRegName;                                      // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGotMutex;                                         // 0x03F0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseMutexUIView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMutexUIView")
	}
	static class UBaseMutexUIView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMutexUIView>();
	}
};
DUMPER7_ASSERTS_UBaseMutexUIView;

// Class GPGameHud.BaseUIController
// 0x0080 (0x00A8 - 0x0028)
class UBaseUIController : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBaseUIView>                ViewClass;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ZOrder;                                            // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  ChannelTagContainer;                               // 0x0060(0x0020)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsSafeZone;                                       // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x1];                                       // 0x0081(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          m_NeverSleep;                                      // 0x0082(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLowFrequencyInvalidation;                         // 0x0083(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseUIView*                            View;                                              // 0x0088(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ABaseHUD*                               BaseHUD;                                           // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                ViewPanelOwner;                                    // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStartInGame;                                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Init(class ABaseHUD* HUD); // (Native, Public) // @ 0x14101B420
	bool IsNeverSleep(); // (Final, Native, Public) // @ 0x142BE7BA0
	void OnInit(); // (Native, Public) // @ 0x140C99650
	void OnStartInGame(); // (Native, Public) // @ 0x140C991D0
	void StartInGame(); // (Native, Public) // @ 0x140EDBCB0

	class APlayerController* GetPlayerOwner() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x142BE7960

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseUIController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseUIController")
	}
	static class UBaseUIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseUIController>();
	}
};
DUMPER7_ASSERTS_UBaseUIController;

// Class GPGameHud.BatchUIController
// 0x0068 (0x0110 - 0x00A8)
class UBatchUIController final : public UBaseUIController
{
public:
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBaseUIController*>              ChildControllers;                                  // 0x00B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FSoftClassPath, class UBaseUIController*> ControllerClassPathToBaseUIControllers;    // 0x00C0(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BatchUIController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BatchUIController")
	}
	static class UBatchUIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchUIController>();
	}
};
DUMPER7_ASSERTS_UBatchUIController;

// Class GPGameHud.BatchUIView
// 0x00F8 (0x04E0 - 0x03E8)
class UBatchUIView final : public UBaseUIView
{
public:
	ELayerZorder                                  ViewLayer;                                         // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           UIRootContent;                                     // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, class UPanelWidget*>      CacheViewContents;                                 // 0x03F8(0x0050)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_448[0x8];                                      // 0x0448(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBaseUIView*>                    CachedSubBaseUIViews;                              // 0x0450(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UBaseUIView*>                    SubViews;                                          // 0x0460(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<struct FSoftClassPath, class UBaseUIView*> ViewClassPathToBaseUIViews;                      // 0x0470(0x0050)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C0[0x10];                                     // 0x04C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        SafeZoneWidgets;                                   // 0x04D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	bool AddUI(class UWidget* UIIns, bool bIsInSafeZone, int32 ZOrder); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEB460
	bool RemoveUI(class UWidget* UIIns); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEC410
	void SetRootUISafeZone(float InSafeZoneValue); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEC5E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BatchUIView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BatchUIView")
	}
	static class UBatchUIView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBatchUIView>();
	}
};
DUMPER7_ASSERTS_UBatchUIView;

// Class GPGameHud.CommonHUDView
// 0x0008 (0x03F0 - 0x03E8)
class UCommonHUDView : public UBaseUIView
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BPTickFromCpp(float DateTime); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void OnHUDStateChanged(); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEBF50

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonHUDView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonHUDView")
	}
	static class UCommonHUDView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonHUDView>();
	}
};
DUMPER7_ASSERTS_UCommonHUDView;

// Class GPGameHud.GPBaseHudController
// 0x0000 (0x0070 - 0x0070)
class UGPBaseHudController final : public UBaseHudController
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBaseHudController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBaseHudController")
	}
	static class UGPBaseHudController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBaseHudController>();
	}
};
DUMPER7_ASSERTS_UGPBaseHudController;

// Class GPGameHud.GPBaseHudView
// 0x0008 (0x0370 - 0x0368)
class UGPBaseHudView : public UBaseHudView
{
public:
	bool                                          bCacheScreenOCStaticMeshOn;                        // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddScreenOCStaticMesh(); // (Final, Native, Protected) // @ 0x142BEB250
	bool IsEnableScreenOCStaticMeshWhenShow(); // (Native, Protected) // @ 0x142BEBE00
	void RemoveScreenOCStaticMesh(); // (Final, Native, Protected) // @ 0x142BEC320

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBaseHudView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBaseHudView")
	}
	static class UGPBaseHudView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBaseHudView>();
	}
};
DUMPER7_ASSERTS_UGPBaseHudView;

// Class GPGameHud.GPCommonHUDScreenMutex
// 0x0068 (0x0090 - 0x0028)
class UGPCommonHUDScreenMutex final : public UObject
{
public:
	class FName                                   MutexName;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTableSystemManagerBase*            MutexRegisterTableManager;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMutexQueueItem                        CurrentHolder;                                     // 0x0038(0x0030)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FMutexQueueItem>                MutexWaitingQueue;                                 // 0x0068(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint64                                        LocalPlayerUin;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           RegisterMutexViewNameArray;                        // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	bool AddTailMutexWaitingQueue(const struct FMutexQueueItem& InQueueItem); // (Final, Native, Private) // @ 0x142BEB340
	bool Contains(class UBaseMutexUIView* MutexUIView); // (Final, Native, Public) // @ 0x142BEB560
	void ForceRefresh(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEB660
	float GetWaitingMutexSeconds(class FName RegisteredName, class UUserWidget* Widget); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEBA80
	void InitMutex(class FName InMutexName, class UDataTableSystemManagerBase* InMutexRegisterTableManager); // (Final, Native, Public) // @ 0x142BEBCB0
	bool IsCurrentHolder(class UBaseMutexUIView* MutexUIView); // (Final, Native, Public) // @ 0x142BEBD70
	bool PopMutexWaitingQueue(struct FMutexQueueItem* OutQueueItem); // (Final, Native, Private, HasOutParams) // @ 0x142BEBF70
	bool PushMutexWaitingQueue(const struct FMutexQueueItem& InQueueItem); // (Final, Native, Private) // @ 0x142BEC040
	void ReleaseMutex(class FName RegisteredName, class UUserWidget* Widget); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEC160
	void ReleaseMutex_Inner(EMutexChangeReason ChangeReason); // (Final, Native, Private) // @ 0x142BEC2A0
	void RequestMutex(class FName RegisteredName, class UUserWidget* Widget); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEC4A0
	void TickMutex(float DeltaTime); // (Final, Native, Public) // @ 0x142BEC660

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPCommonHUDScreenMutex")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPCommonHUDScreenMutex")
	}
	static class UGPCommonHUDScreenMutex* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPCommonHUDScreenMutex>();
	}
};
DUMPER7_ASSERTS_UGPCommonHUDScreenMutex;

// Class GPGameHud.HUDMutexHDEventTipsDataTableManager
// 0x0008 (0x0038 - 0x0030)
class UHUDMutexHDEventTipsDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDMutexHDEventTipsDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDMutexHDEventTipsDataTableManager")
	}
	static class UHUDMutexHDEventTipsDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDMutexHDEventTipsDataTableManager>();
	}
};
DUMPER7_ASSERTS_UHUDMutexHDEventTipsDataTableManager;

// Class GPGameHud.HUDMutexMiniMapBottomDataTableManager
// 0x0008 (0x0038 - 0x0030)
class UHUDMutexMiniMapBottomDataTableManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDMutexMiniMapBottomDataTableManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDMutexMiniMapBottomDataTableManager")
	}
	static class UHUDMutexMiniMapBottomDataTableManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDMutexMiniMapBottomDataTableManager>();
	}
};
DUMPER7_ASSERTS_UHUDMutexMiniMapBottomDataTableManager;

// Class GPGameHud.GPGameHudDelegates
// 0x0158 (0x0188 - 0x0030)
class UGPGameHudDelegates final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnBaseHudInit;                                     // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UObject* View)> OnGameBaseUIViewInit;                        // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBeforeHUDStateChanged;                           // 0x0068(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              PostOnGameHudStateChanged;                         // 0x0078(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x20];                                      // 0x0088(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FText Text)> OnDisplayCommonBanner;                          // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FText Text, float Duration)> OnDisplayCommonBannerWithDuration; // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* BossActor, class FText StripText, float HeightOffset)> OnDisplayBossBloodStrip; // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnGMHudCreated;                                    // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bShow, bool bIsValid)> AirDropVehicleTipHUD;                  // 0x00E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bShow, bool bIsValid)> FreeBuildTipHUD;                       // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName ViewName)> OnHUDViewAsyncLoaded;                       // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(float Progress, const TArray<class FName>& BlockGameFlowViewNameArray)> OnHUDInitializeAsyncLoadProgress; // 0x0118(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHUDInitializeAsyncLoadComplete;                  // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnLoadingViewShutDown;                             // 0x0138(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TDelegate<void()>                             AddScreenOCStaticMesh;                             // 0x0148(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             RemoveScreenOCStaticMesh;                          // 0x0158(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsShow, class FName InteractName)> OnHUDInteractTipsShowOrHide; // 0x0168(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsOpen)>  OnAutoFlushPressedOpenOrClose;                     // 0x0178(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UGPGameHudDelegates* Get(class UObject* GameContextObject); // (Final, Native, Static, Public) // @ 0x142BEB6A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPGameHudDelegates")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPGameHudDelegates")
	}
	static class UGPGameHudDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPGameHudDelegates>();
	}
};
DUMPER7_ASSERTS_UGPGameHudDelegates;

// Class GPGameHud.GPMobileCustomLayoutBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UGPMobileCustomLayoutBPLibrary final : public UObject
{
public:
	static void FetchAllCustomLayoutAppearance(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142BEB5F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPMobileCustomLayoutBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPMobileCustomLayoutBPLibrary")
	}
	static class UGPMobileCustomLayoutBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPMobileCustomLayoutBPLibrary>();
	}
};
DUMPER7_ASSERTS_UGPMobileCustomLayoutBPLibrary;

// Class GPGameHud.HUDClipmap
// 0x0030 (0x02E8 - 0x02B8)
class UHUDClipmap final : public UClipmap
{
public:
	struct FIntPoint                              PatchCountXY;                                      // 0x02B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMipCount;                                       // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ReservedPatchCountXY;                              // 0x02C4(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ClipMapSizeXY;                                     // 0x02CC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      AllSubtextures;                                    // 0x02D8(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDClipmap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDClipmap")
	}
	static class UHUDClipmap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDClipmap>();
	}
};
DUMPER7_ASSERTS_UHUDClipmap;

// Class GPGameHud.HUDLoadSetting
// 0x0068 (0x00A0 - 0x0038)
class UHUDLoadSetting final : public UDeveloperSettings
{
public:
	TArray<class FString>                         AllowedAutoLoadNames;                              // 0x0038(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x58];                                      // 0x0048(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDLoadSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDLoadSetting")
	}
	static class UHUDLoadSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDLoadSetting>();
	}
};
DUMPER7_ASSERTS_UHUDLoadSetting;

// Class GPGameHud.HUDMutexManager
// 0x0020 (0x0050 - 0x0030)
class UHUDMutexManager final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(const struct FMutexQueueItem& PreHolder, const struct FMutexQueueItem& CurHolder, EMutexChangeReason ChangeReason, class UGPCommonHUDScreenMutex* MutexObj)> OnMutexChanged; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UGPCommonHUDScreenMutex*                HUDScreenMutex_HDEventTips;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPCommonHUDScreenMutex*                HUDScreenMutex_MiniMapBottom;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UHUDMutexManager* Get(class UObject* WorldContext); // (Final, Native, Static, Public) // @ 0x142BEB760

	void ForceRefreshMutex(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEB680
	bool IsVisible(class UBaseUIView* UIView); // (Final, Native, Public) // @ 0x142BEBE30
	void ReleaseMutex(class UBaseMutexUIView* BaseMutexUIView); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEC220
	void RequestMutex(class UBaseMutexUIView* BaseMutexUIView); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEC560
	void TickMutex(float DeltaTime); // (Final, Native, Public) // @ 0x142BEC6E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDMutexManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDMutexManager")
	}
	static class UHUDMutexManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDMutexManager>();
	}
};
DUMPER7_ASSERTS_UHUDMutexManager;

// Class GPGameHud.HUDStateManager
// 0x0098 (0x00C8 - 0x0030)
class UHUDStateManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EGameHUDSate State)> OnGameHudStateAdded;                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EGameHUDSate State)> OnGameHudStateRemoved;                        // 0x0048(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMap<EGameHUDSate, struct FBaseUIViewArray>   BaseUIViewMaps;                                    // 0x0058(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHUDStateManager* Get(class UObject* WorldContext); // (Final, Native, Static, Public) // @ 0x142BEB7E0

	void AddState(EGameHUDSate State, bool bForceRefresh); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEB270
	TArray<int32> GetStateArray(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEBA00
	bool HasAllState(const TArray<EGameHUDSate>& States); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x142BEBB40
	bool HasState(EGameHUDSate State); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEBC20
	bool IsVisible_Lua(class ULuaUIHudBaseView* UIView); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEBEC0
	void RemoveState(EGameHUDSate State, bool bForceRefresh); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEC340

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDStateManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDStateManager")
	}
	static class UHUDStateManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDStateManager>();
	}
};
DUMPER7_ASSERTS_UHUDStateManager;

// Class GPGameHud.LuaHudView
// 0x0018 (0x0620 - 0x0608)
class ULuaHudView final : public ULuaUIBaseView
{
public:
	uint8                                         Pad_608[0x8];                                      // 0x0608(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LocalFocusActor;                                   // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_618[0x8];                                      // 0x0618(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeforeOnStartLocalFocus(class AActor* TargetActor); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BeforeOnStopLocalFocus(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnDestroy(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnHide(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnInit(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnShow(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void DoDestroy(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void DoHide(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void DoShow(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void DoTick(float DeltaTime); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	bool GetNeedInvalidationRoot(); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEEE00
	class APlayerState* GetPlayerState(); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEEE40
	bool IsInShowState(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEF00
	bool IsInShowState_Lua(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	bool IsSafeZone(); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEEF60
	void OnInit(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void OnStartLocalFocus(class AActor* TargetActor); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void OnStopLocalFocus(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void SetNeedInvalidationRoot(bool bNeedRoot); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEF470
	void SetSafeZone(bool bInSafeZone); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEF5F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaHudView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaHudView")
	}
	static class ULuaHudView* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaHudView>();
	}
};
DUMPER7_ASSERTS_ULuaHudView;

// Class GPGameHud.LuaUIHudBaseView
// 0x0058 (0x0660 - 0x0608)
class ULuaUIHudBaseView : public ULuaUIBaseView
{
public:
	TArray<EGameHUDSate>                          AlwaysShowGameHudState;                            // 0x0608(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EGameHUDSate>                          VisibleGameHudState;                               // 0x0618(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EGameHUDSate>                          InVisibleGameHudState;                             // 0x0628(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          NeedUpdate;                                        // 0x0638(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickElapsedTime;                                   // 0x063C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickInterval;                                      // 0x0640(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bControlByUiState;                                 // 0x0644(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LocalFocusActor;                                   // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_650[0x8];                                      // 0x0650(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                DynamicRoot;                                       // 0x0658(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void AddStateToAlwaysShowGameHudState(EGameHUDSate State); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEE850
	void AddStateToInVisibleGameHudState(EGameHUDSate State); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEE900
	void AddStateToVisibleGameHudState(EGameHUDSate State); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEE9B0
	void BeforeOnStartLocalFocus(class AActor* TargetActor); // (Native, Event, Public, BlueprintEvent) // @ 0x142BEEB60
	void BeforeOnStopLocalFocus(); // (Native, Event, Public, BlueprintEvent) // @ 0x141FA50A0
	class UWidget* GetDynamicRoot(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEDB0
	class AGameStateBase* GetGameState(); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEEDD0
	bool GetNeedInvalidationRoot(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEE20
	class APlayerState* GetPlayerState(); // (Final, Native, Protected, BlueprintCallable) // @ 0x142BEEE70
	void Hide(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEEA0
	void Hide_Lua(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void HideSelf(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEEA0
	void InitGameHudState(); // (Native, Event, Public, BlueprintEvent) // @ 0x142BEEEC0
	bool IsInShowState(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEF30
	bool IsInShowState_Lua(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool IsSafeZone(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEF80
	void OnClose(); // (Native, Event, Public, BlueprintEvent) // @ 0x141FA5080
	void OnGameHudStateChanged(); // (Native, Event, Public, BlueprintEvent) // @ 0x142BEF0B0
	void OnHide(); // (Native, Event, Public, BlueprintEvent) // @ 0x141FA5100
	void OnOpen(); // (Native, Event, Public, BlueprintEvent) // @ 0x140EE3BE0
	void OnPreOpen(); // (Native, Event, Public, BlueprintEvent) // @ 0x140EE3BA0
	void OnShow(); // (Native, Event, Public, BlueprintEvent) // @ 0x141FA50E0
	void OnStartLocalFocus(class AActor* TargetActor); // (Native, Event, Public, BlueprintEvent) // @ 0x142BEF160
	void OnStopLocalFocus(); // (Native, Event, Public, BlueprintEvent) // @ 0x142BEF1F0
	void RemoveStateFromAlwaysShowGameHudState(EGameHUDSate State); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF230
	void RemoveStateFromInVisibleGameHudState(EGameHUDSate State); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF2C0
	void RemoveStateFromVisibleGameHudState(EGameHUDSate State); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF350
	void SetDynamicRoot(class UWidget* root); // (Final, Native, Public, BlueprintCallable) // @ 0x1417AB010
	void SetNeedInvalidationRoot(bool bNeedRoot); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF4F0
	void SetSafeZone(bool bInSafeZone); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF670
	void Show(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF6F0
	void Show_Lua(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ShowSelf(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF6F0
	void StartLocalFocus(class AActor* TargetActor); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF710
	void StopLocalFocus(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEF790
	void Update(float Delta); // (Native, Event, Public, BlueprintEvent) // @ 0x142BEF7B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaUIHudBaseView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaUIHudBaseView")
	}
	static class ULuaUIHudBaseView* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaUIHudBaseView>();
	}
};
DUMPER7_ASSERTS_ULuaUIHudBaseView;

// Class GPGameHud.LuaUIHudOldView
// 0x0000 (0x0660 - 0x0660)
class ULuaUIHudOldView final : public ULuaUIHudBaseView
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaUIHudOldView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaUIHudOldView")
	}
	static class ULuaUIHudOldView* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaUIHudOldView>();
	}
};
DUMPER7_ASSERTS_ULuaUIHudOldView;

// Class GPGameHud.MobileDraggableButton
// 0x0010 (0x04A8 - 0x0498)
class UMobileDraggableButton : public UButton
{
public:
	bool                                          bCanDrag;                                          // 0x0498(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PressedSoundName;                                  // 0x049C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CompositionWidgetPosition(const struct FVector2D& DeltaMove, const struct FGeometry& MyGeometry); // (Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x142BEEBF0
	void FetchCustomLayoutAppearance(); // (Native, Public, BlueprintCallable) // @ 0x142BEED00
	bool IsDragging(); // (Final, Native, Public, BlueprintCallable) // @ 0x142BEEEE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MobileDraggableButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MobileDraggableButton")
	}
	static class UMobileDraggableButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMobileDraggableButton>();
	}
};
DUMPER7_ASSERTS_UMobileDraggableButton;

// Class GPGameHud.MobileGamePad
// 0x0158 (0x0180 - 0x0028)
class UMobileGamePad final : public UObject
{
public:
	TArray<class UMobileGamePadView*>             VisibleViewCache;                                  // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
