#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPGlobalDefines

#include "Basic.hpp"

#include "GPGlobalDefines_structs.hpp"
#include "Engine_classes.hpp"
#include "PerfGear_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "CustomStats_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GPGlobalDefines.BlueprintFunctionHelper
// 0x0000 (0x0028 - 0x0028)
class UBlueprintFunctionHelper final : public UBlueprintFunctionLibrary
{
public:
	static void RerunConstructionScripts(class AActor* Actor); // (Final, Native, Static, Private, BlueprintCallable) // @ 0x144C83BF0
	static void SnapToFixedAngle(class USplineComponent* SplineComp, const TArray<float>& AllowedAngles, bool bSnapToGround, TArray<struct FVector>* ResultPoints); // (Final, Native, Static, Private, HasOutParams, BlueprintCallable) // @ 0x144C859B0
	static void SnapToFixedAngleXY(class USplineComponent* SplineComp, const TArray<float>& AllowedAngles, bool bSnapToGround, TArray<struct FVector>* ResultPoints); // (Final, Native, Static, Private, HasOutParams, BlueprintCallable) // @ 0x144C85BC0
	static void SnapToGround(class USplineComponent* SplineComp, bool bInAlign); // (Final, Native, Static, Private, BlueprintCallable) // @ 0x144C85DD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintFunctionHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintFunctionHelper")
	}
	static class UBlueprintFunctionHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintFunctionHelper>();
	}
};
DUMPER7_ASSERTS_UBlueprintFunctionHelper;

// Class GPGlobalDefines.ClientSettingHelperHD
// 0x0010 (0x0040 - 0x0030)
class UClientSettingHelperHD : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void AddOutOfGameApplySetting(class FName ID); // (Final, Native, Static, Public) // @ 0x144C8A760
	static void ClearOutOfGameApplySettings(); // (Final, Native, Static, Public) // @ 0x144C8AB20
	static class FText GetDisplayNameByID(class FName ID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144C8BC30
	static TArray<class FName> GetOutOfGameApplySettings(); // (Final, Native, Static, Public) // @ 0x144C8C180
	static bool IsEditor(); // (Final, Native, Static, Public) // @ 0x142483770
	static class FString MergeJson(const TMap<class FString, class FString>& JsonMap); // (Final, Native, Static, Public) // @ 0x144C8CAE0
	static void RemoveOutOfGameApplySetting(class FName ID); // (Final, Native, Static, Public) // @ 0x144C8CCD0

	void ResetToDefault(); // (Final, Native, Public) // @ 0x144C8CD40
	void SaveToDefault(); // (Final, Native, Public) // @ 0x1413F3970
	void SaveToSaved(); // (Final, Native, Public) // @ 0x144C8CD60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientSettingHelperHD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientSettingHelperHD")
	}
	static class UClientSettingHelperHD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientSettingHelperHD>();
	}
};
DUMPER7_ASSERTS_UClientSettingHelperHD;

// Class GPGlobalDefines.ClientVehicleSettingHD
// 0x03B8 (0x03F8 - 0x0040)
class UClientVehicleSettingHD final : public UClientSettingHelperHD
{
public:
	bool                                          CannonCamFollow;                                   // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          VehiclePlaneMouseReverse;                          // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleSensitivityOuterSettingHD      DriverWeaponSensitivity;                           // 0x0048(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FVehicleSensitivityOuterSettingHD      HelicopterDriverWeaponSensitivity;                 // 0x00A0(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FVehicleSensitivityOuterSettingHD      PassengerWeaponSensitivity;                        // 0x00F8(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FVehicleSensitivityOuterSettingHD      JetSensitivity;                                    // 0x0150(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FAxisSensitivitySettingHD              JetAxisSensitivity;                                // 0x01A8(0x0018)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FOVRatioTPP;                                       // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ZoomDataTableGUID;                                 // 0x01C8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoomDataTableGUID2;                                // 0x01D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoomDataTableGUID3;                                // 0x01E8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoomDataTableGUID4;                                // 0x01F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GamepadZoomDataTableGUID;                          // 0x0208(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GamepadZoomDataTableGUID2;                         // 0x0218(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GamepadZoomDataTableGUID3;                         // 0x0228(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GamepadZoomDataTableGUID4;                         // 0x0238(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CannonCamFollowGamepad;                            // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleSensitivityOuterSettingHD      DriverWeaponSensitivityGamepad;                    // 0x0250(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FVehicleSensitivityOuterSettingHD      HelicopterDriverWeaponSensitivityGamepad;          // 0x02A8(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FVehicleSensitivityOuterSettingHD      PassengerWeaponSensitivityGamepad;                 // 0x0300(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FVehicleSensitivityOuterSettingHD      JetSensitivityGamepad;                             // 0x0358(0x0058)(Edit, BlueprintVisible, Config, NativeAccessSpecifierPublic)
	struct FAxisSensitivitySettingHD              JetAxisSensitivityGamepad;                         // 0x03B0(0x0018)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FAxisSensitivitySettingHD              HelicopterDriverWeaponAxisSensitivity;             // 0x03C8(0x0018)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FAxisSensitivitySettingHD              HelicopterDriverWeaponAxisSensitivityGamepad;      // 0x03E0(0x0018)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClientVehicleSettingHD* Get(const class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144C8B200

	void AddZoomDataHD(EMouseSensitivityMode MouseInputType, const struct FWeaponZoomDataHD& ZoomDataHD, bool bIsGamepad); // (Final, Native, Public, HasOutParams) // @ 0x144C8A7D0
	void AddZoomratedMDV(EMouseSensitivityMode MouseInputType, const struct FZoomratedDataHD& ZoomDataHD, bool bIsGamepad); // (Final, Native, Public, HasOutParams) // @ 0x144C8A940
	void ClearZoomDataHD(EMouseSensitivityMode MouseInputType, bool bIsGamepad); // (Final, Native, Public) // @ 0x144C8AB40
	void ClearZoomratedMDV(EMouseSensitivityMode MouseInputType, bool bIsGamepad); // (Final, Native, Public) // @ 0x144C8AC10
	float GetCustomADSSensitivityByIndex(EMouseSensitivityMode MouseInputType, int32 Index_0, int32 SubIndex, bool bIsGamepad); // (Final, Native, Public) // @ 0x144C8B910
	void SetADSSensitivityByIndex(EMouseSensitivityMode MouseInputType, int32 Index_0, int32 SubIndex, float Value, bool bIsGamepad); // (Final, Native, Public) // @ 0x144C8CEC0
	void SetZoomratedMDVByIndex(EMouseSensitivityMode MouseInputType, int32 Index_0, float Value, bool bIsGamepad); // (Final, Native, Public) // @ 0x144C8D900

	float GetZoomratedMDVByIndex(EMouseSensitivityMode MouseInputType, int32 Index_0, bool bIsGamepad) const; // (Final, Native, Public, Const) // @ 0x144C8C8B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientVehicleSettingHD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientVehicleSettingHD")
	}
	static class UClientVehicleSettingHD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientVehicleSettingHD>();
	}
};
DUMPER7_ASSERTS_UClientVehicleSettingHD;

// Class GPGlobalDefines.GPTriggerBase
// 0x0040 (0x03B8 - 0x0378)
class AGPTriggerBase : public ATriggerBox
{
public:
	EGPTriggerMode                                TriggerMode;                                       // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGPTriggerAuth                                TriggerAuth;                                       // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_37A[0x2];                                      // 0x037A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LevelEnvEvent;                                     // 0x037C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  SpecialTrigger;                                    // 0x0388(0x0028)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWhenEndOverlap;                                   // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTriggerMute;                                      // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTriggerOnce;                                      // 0x03B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDebugDraw;                                        // 0x03B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TriggerNum;                                        // 0x03B4(0x0004)(Edit, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BP_DoTrigger(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	bool CheckTriggerMode(class AActor* OverlapActor); // (Native, Protected, BlueprintCallable) // @ 0x141FB1480
	void OnLevelEnvEvent(const class UObject* EventSourceObject, class FName EventName); // (Native, Protected) // @ 0x144C96520
	void OnRep_ReplicatedTriggerNum(); // (Final, Native, Protected) // @ 0x144C965F0
	void OnTriggerBeginOverlapInternal(class AActor* OverlappedActor, class AActor* OtherActor); // (Final, Native, Protected) // @ 0x144C96610
	void OnTriggerEndOverlapInternal(class AActor* OverlappedActor, class AActor* OtherActor); // (Final, Native, Protected) // @ 0x144C966D0
	void Reset(); // (Native, Public, BlueprintCallable) // @ 0x142A88DE0
	void RPC_OnServerTriggered(); // (Net, NetReliable, Native, Event, NetMulticast, Protected) // @ 0x141006B20
	void TestReset(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C96C70
	void TestTrigger(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C96C90
	void TryTrigger(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C96ED0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPTriggerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPTriggerBase")
	}
	static class AGPTriggerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGPTriggerBase>();
	}
};
DUMPER7_ASSERTS_AGPTriggerBase;

// Class GPGlobalDefines.ClientBHDSetting
// 0x0180 (0x01C0 - 0x0040)
class UClientBHDSetting final : public UClientSettingHelperHD
{
public:
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bVaultTriggerMode;                                 // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanMouseTurnMelee;                                // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparateSideAiming;                               // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScopeUseRT;                                       // 0x0053(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSceneFOVCalcOpenCameraFOV;                        // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHitEffectColor                               HitEffectColor;                                    // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PassengerWeaponSensitivity;                        // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenFlagVoice;                                    // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlagColorA;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseSensitivity;                                   // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalSensitivity;                               // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizontalSensitivity;                             // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseADSSensitivity;                                // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimVerticalSensitivity;                            // 0x0074(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimHorizontalSensitivity;                          // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESensitivityModeHD                            SensitivityMode;                                   // 0x007C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeaponZoomDataHD>              ZoomDataHD;                                        // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FZoomratedDataHD>               ZoomratedMDV;                                      // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	float                                         MDV;                                               // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MDVSwitchingMode;                                  // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllVerticalMMReversed;                            // 0x00A8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInfantryVerticalMMReversed;                       // 0x00A9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGunnerVerticalMMReversed;                         // 0x00AA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GamepadMDV;                                        // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWeaponZoomDataHD>              GamepadZoomDataHD;                                 // 0x00B0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bUseGamepadCustomADS;                              // 0x00C0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GamepadMDVSwitchingMode;                           // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HorizontalGamepadSensitivity;                      // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VerticalGamepadSensitivity;                        // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimHorizontalGamepadSensitivity;                   // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimVerticalGamepadSensitivity;                     // 0x00D4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESensitivityModeHD                            GamepadSensitivityMode;                            // 0x00D8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FZoomratedDataHD>               GamepadZoomratedMDV;                               // 0x00E0(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bAllVerticalMMReversedGamepad;                     // 0x00F0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInfantryVerticalMMReversedGamepad;                // 0x00F1(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGunnerVerticalMMReversedGamepad;                  // 0x00F2(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGamepadSensitivityCurveType                  GamepadSensitivityCurveType;                       // 0x00F3(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGamepadExtraSensitivityDataHD         ExtraSensitivityDataHD;                            // 0x00F4(0x0010)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FGamepadExtraSensitivityDataHD         ADSExtraSensitivityDataHD;                         // 0x0104(0x0010)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FGamepadThumbRestrictDataHD            GamepadRightThumbRestrictDataHD;                   // 0x0114(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FGamepadThumbRestrictDataHD            GamepadLeftThumbRestrictDataHD;                    // 0x0120(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GamepadSensitivityPresetMode;                      // 0x012C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableScopeCustom;                                // 0x0130(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisplay_PerformanceStatus;                        // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePickupDetailHUD;                            // 0x0132(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHurtCloseLootPanel;                               // 0x0133(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMapAutoRotateSol;                                 // 0x0134(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InfantryVision;                                    // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleVision;                                     // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirPlaneVision;                                    // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MpMapScale;                                        // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TextLanguage;                                      // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VoiceLanguage;                                     // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeAll;                                         // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume_Music;                                      // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume_SFX;                                        // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume_UI;                                         // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume_VO;                                         // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume_GVoice;                                     // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume_Microphone;                                 // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AudioDynamicRange;                                 // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AudioLevel;                                        // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MicrophoneButtonType;                              // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThreeDAudioType;                                   // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AudioInputDevice;                                  // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioOutputDevice;                                 // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpeakingChanel;                                    // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ListeningChanel;                                   // 0x01BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClientBHDSetting* Get(const class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144C82120

	void CacheSettingJson(const class FString& InJson); // (Final, Native, Public, BlueprintCallable) // @ 0x144C82020
	float GetBHDPresetValueByType(const TMap<EGamepadSensitivityPresetType, float>& Map, EGamepadSensitivityPresetType Type); // (Final, Native, Public, HasOutParams) // @ 0x144C82910
	class FString GetCachedSettingJson(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C82BF0
	void SetADSSensitivityByIndex(int32 Index_0, int32 SubIndex, float Value, bool bIsGamepad); // (Final, Native, Public) // @ 0x144C84880
	void SetZoomratedMDVByIndex(int32 Index_0, float Value, bool bIsGamepad); // (Final, Native, Public) // @ 0x144C858B0

	float GetCustomADSSensitivityByIndex(int32 Index_0, int32 SubIndex, bool bIsGamepad) const; // (Final, Native, Public, Const) // @ 0x144C82F70
	float GetZoomratedMDVByIndex(int32 Index_0, bool bIsGamepad) const; // (Final, Native, Public, Const) // @ 0x144C83AA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientBHDSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientBHDSetting")
	}
	static class UClientBHDSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientBHDSetting>();
	}
};
DUMPER7_ASSERTS_UClientBHDSetting;

// Class GPGlobalDefines.ClientDebugSetting
// 0x0018 (0x0048 - 0x0030)
class UClientDebugSetting final : public UEngineSubsystem
{
public:
	bool                                          bOverrideWalkRunArea;                              // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Movement_RunValue;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Movement_SilentWalkXValue;                         // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Movement_SilentWalkYValue;                         // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWalkRunArea;                                  // 0x0040(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SaveDataConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C84700

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientDebugSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientDebugSetting")
	}
	static class UClientDebugSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientDebugSetting>();
	}
};
DUMPER7_ASSERTS_UClientDebugSetting;

// Class GPGlobalDefines.ClientGameSetting
// 0x0078 (0x00A8 - 0x0030)
class UClientGameSetting final : public UWorldSubsystem
{
public:
	bool                                          bUnderFPPMode;                                     // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SensibilityValue;                                  // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensibilityValue_NoZooming;                        // 0x0038(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensibilityValue_MechanicalScope;                  // 0x003C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensibilityValue_2XScope;                          // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SensibilityMinValue;                               // 0x0044(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMsaa;                                          // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MobileMsaaCount;                                   // 0x004C(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ScalabilityQualityLevel;                           // 0x0050(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPhysicsDyingEnable;                               // 0x0054(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPhysicsDyingAnimProfileEnable;                    // 0x0055(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPhysicsDyingIgnoreBoneHitResponce;                // 0x0056(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowXPPSwitchButton;                              // 0x0057(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowGMButton;                                     // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAimCamOffsetFovTest;                          // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDebugInfo;                                    // 0x005A(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShowDebugInfoType;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnScopeUseRTChanged;                               // 0x0060(0x0010)(BlueprintVisible, ZeroConstructor, Config, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnReloadOpModeChanged;                             // 0x0070(0x0010)(BlueprintVisible, ZeroConstructor, Config, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUseDofChanged;                                   // 0x0080(0x0010)(BlueprintVisible, ZeroConstructor, Config, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSeparateSideAimingChanged;                       // 0x0090(0x0010)(BlueprintVisible, ZeroConstructor, Config, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x1];                                       // 0x00A0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseRotationInputForDebug;                         // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScopeUseRT;                                       // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparateSideAiming;                               // 0x00A3(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReloadOpModeSlide;                                // 0x00A4(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDof;                                           // 0x00A5(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClientGameSetting* Get(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144C824A0

	bool GetReloadOpMode(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C83110
	bool GetScopeUseRT(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C83190
	bool GetUseDof(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C83690
	void SaveDataConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C84760
	void SetReloadOpMode(bool bSlideMode); // (Final, Native, Public, BlueprintCallable) // @ 0x144C85110
	void SetScopeUseRT(bool InUseRT); // (Final, Native, Public, BlueprintCallable) // @ 0x144C852B0
	void SetSeparateSideAiming(bool InSeparateSideAiming); // (Final, Native, Public, BlueprintCallable) // @ 0x144C85790
	void SetUseDof(bool InUseDof); // (Final, Native, Public, BlueprintCallable) // @ 0x144C85820

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientGameSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientGameSetting")
	}
	static class UClientGameSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientGameSetting>();
	}
};
DUMPER7_ASSERTS_UClientGameSetting;

// Class GPGlobalDefines.ClientSettingDelagate
// 0x0110 (0x0140 - 0x0030)
class UClientSettingDelagate final : public UEngineSubsystem
{
public:
	TMulticastInlineDelegate<void(const TArray<class FString>& ResetPanelList)> OnSettingPanelReset; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnResetBaseSetting;                                // 0x0040(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnResetDisplaySetting;                             // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCameraModeChange;                                // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCustomLayoutChange;                              // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCusmtomButtonChange;                             // 0x0080(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnClientSettingLeanPeekChange;                     // 0x0090(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              SilentWalkModeChangeDelegate;                      // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnAfterSettingPanelReset;                          // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              MoveFireModeChangeDelegate;                        // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              SprintTriggerSensitivityChangeDelegate;            // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              MarkingButtonChangeDelegate;                       // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCloseSystemSetting;                              // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnControlSettingChange;                            // 0x0100(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnReloadOptionChange;                              // 0x0110(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCrouchToSteeringChange;                          // 0x0120(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMixLoadingChange;                                // 0x0130(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClientSettingDelagate* Get(const class UObject* WorldContextObject); // (Final, Native, Static, Public) // @ 0x144C82690

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientSettingDelagate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientSettingDelagate")
	}
	static class UClientSettingDelagate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientSettingDelagate>();
	}
};
DUMPER7_ASSERTS_UClientSettingDelagate;

// Class GPGlobalDefines.ClientDisplaySetting
// 0x0028 (0x0058 - 0x0030)
class UClientDisplaySetting final : public UEngineSubsystem
{
public:
	int32                                         SafeZoneValue;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoOptimize;                                     // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         DisplayQuality;                                    // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         FrameQuality;                                      // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayStyle;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HudSafeZone;                                       // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHitEffectColor                               HitEffectColor;                                    // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FrameStyle;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEyesProtection;                                   // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNickName;                                     // 0x0055(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClientDisplaySetting* Get(const class UObject* GameContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144C823A0

	bool GetSafeZoneIsSet(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C83130
	int32 GetSafeZoneValue(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C83160
	void ResetToDefault(const TArray<class FString>& ResetPanelList); // (Final, Native, Public, HasOutParams) // @ 0x144C83FC0
	void SaveDataConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C84720
	void SaveFlushConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x144C84860
	void SetSafeZoneValue(int32 Value); // (Final, Native, Public, BlueprintCallable) // @ 0x144C851A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClientDisplaySetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClientDisplaySetting")
	}
	static class UClientDisplaySetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClientDisplaySetting>();
	}
};
DUMPER7_ASSERTS_UClientDisplaySetting;

// Class GPGlobalDefines.ClientBaseSetting
// 0x01A8 (0x01D8 - 0x0030)
class UClientBaseSetting final : public UEngineSubsystem
{
public:
	bool                                          bIsAimAssistOpen;                                  // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAimMagnify;                                     // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInventoryAutoOrganize;                          // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     ShotGunFireMode;                                   // 0x0033(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     SRFireMode;                                        // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     CompoundBowFireMode;                               // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     AbilityItemFireMode;                               // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSRInstantFire;                                    // 0x0037(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScopeOpenMode                                VehicleScopeOpenMode;                              // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScopeOpenMode                                ScopeOpenMode;                                     // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EScopeOpenMode                                SideAimOpenMode;                                   // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuickScopeOpenMode                           QuickScopeOpen;                                    // 0x003B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanFireOnQuickScopeOpen;                          // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWeaponItemType, bool>                   QuickScopeOpenMap;                                 // 0x0040(0x0050)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenAbilityItem;                         // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenFixedWeapon;                         // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuickScopeOpenMode                           QuickScopeOpen_MP;                                 // 0x0092(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanFireOnQuickScopeOpen_MP;                       // 0x0093(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWeaponItemType, bool>                   QuickScopeOpenMap_MP;                              // 0x0098(0x0050)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenAbilityItem_MP;                      // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenFixedWeapon_MP;                      // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     ShotGunFireMode_MP;                                // 0x00EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     SRFireMode_MP;                                     // 0x00EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     CompoundBowFireMode_MP;                            // 0x00EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFireMode                                     AbilityItemFireMode_MP;                            // 0x00ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuickScopeOpenMode                           QuickScopeOpen_Overseas;                           // 0x00EE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenAbilityItem_Overseas;                // 0x00EF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenFixedWeapon_Overseas;                // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuickScopeOpenMode                           QuickScopeOpen_MP_Overseas;                        // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenAbilityItem_MP_Overseas;             // 0x00F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QuickScopeOpenFixedWeapon_MP_Overseas;             // 0x00F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableReloadOnAiming;                             // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReloadBreakMirror;                                // 0x00F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanSprintBreakZoom;                               // 0x00F6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
