#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPLineRenderer

#include "Basic.hpp"

#include "GPLineRenderer_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GPLineRenderer.GPLineRendererComponent
// 0x00B0 (0x07B0 - 0x0700)
class UGPLineRendererComponent final : public UMeshComponent
{
public:
	bool                                          bEnableUpdateOnlyLineData;                         // 0x06F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LineMaterial;                                      // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceBoundCenterInComponent;                      // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FLineSection>              Sections;                                          // 0x0710(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<int32, class UMaterialInstanceDynamic*>  SectionMaterials;                                  // 0x0760(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void CreateLine(int32 SectionIndex, const TArray<struct FVector>& Vertices, const struct FLinearColor& Color, float Thickness, bool bScreenSpace); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x141CCFBC0
	void CreateLine2Points(int32 SectionIndex, const struct FVector& StartPoint, const struct FVector& EndPoint, const struct FLinearColor& Color, float Thickness, int32 NumSegments, bool bScreenSpace); // (Final, Native, Public, HasOutParams, HasDefaults) // @ 0x141CCF990
	void CreateLineWithNormal(int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<struct FVector>& Normals, const struct FLinearColor& Color, float Thickness, bool bScreenSpace); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141CCFDA0
	void RemoveAllLines(); // (Final, Native, Public, BlueprintCallable) // @ 0x141CD00D0
	void RemoveLine(int32 SectionIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x141CD00F0
	void SetLineVisible(int32 SectionIndex, bool bNewVisibility); // (Final, Native, Public, BlueprintCallable) // @ 0x141CD0170
	void UpdateLine(int32 SectionIndex, const TArray<struct FVector>& Vertices, const TArray<struct FVector>& Normals); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141CD0230

	int32 GetNumSections() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141CD0010
	bool IsLineVisible(int32 SectionIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141CD0040

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPLineRendererComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPLineRendererComponent")
	}
	static class UGPLineRendererComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPLineRendererComponent>();
	}
};
DUMPER7_ASSERTS_UGPLineRendererComponent;

}

