#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPMovieScene

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "GameCore_structs.hpp"


namespace SDK
{

// ScriptStruct GPMovieScene.ConsoleCommandTrackTabRow
// 0x0080 (0x0090 - 0x0010)
struct FConsoleCommandTrackTabRow final : public FDescRowBase
{
public:
	class FText                                   MenuName;                                          // 0x0010(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   MenuTips;                                          // 0x0028(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SectionDisplayName;                                // 0x0040(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FString                                 ConsoleVariable;                                   // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0068(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldExecuteResetCommand;                        // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ResetCommand;                                      // 0x0080(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConsoleCommandTrackTabRow;

// ScriptStruct GPMovieScene.GPMovieSceneConsoleCommandTemplate
// 0x0048 (0x0068 - 0x0020)
struct FGPMovieSceneConsoleCommandTemplate final : public FMovieSceneEvalTemplate
{
public:
	class FString                                 ConsoleVariableName;                               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 Value;                                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 LastValue;                                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldExecuteResetCommand;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ResetCommand;                                      // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGPMovieSceneConsoleCommandTemplate;

// ScriptStruct GPMovieScene.GPMovieSceneSubtitlesParams
// 0x0008 (0x0008 - 0x0000)
struct FGPMovieSceneSubtitlesParams final
{
public:
	class FName                                   SubtitlesID;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPMovieSceneSubtitlesParams;

// ScriptStruct GPMovieScene.GPMovieSceneSubtitlesTemplate
// 0x0008 (0x0028 - 0x0020)
struct FGPMovieSceneSubtitlesTemplate final : public FMovieSceneEvalTemplate
{
public:
	struct FGPMovieSceneSubtitlesParams           Params;                                            // 0x0020(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGPMovieSceneSubtitlesTemplate;

}

