#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPPhysics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPPhysics_structs.hpp"


namespace SDK
{

// Class GPPhysics.GPPhysicsSimulatableComponent
// 0x0000 (0x00F8 - 0x00F8)
class UGPPhysicsSimulatableComponent : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPPhysicsSimulatableComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPPhysicsSimulatableComponent")
	}
	static class UGPPhysicsSimulatableComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPPhysicsSimulatableComponent>();
	}
};
DUMPER7_ASSERTS_UGPPhysicsSimulatableComponent;

// Class GPPhysics.GPAdvancedBoxComponent
// 0x0000 (0x05C0 - 0x05C0)
class UGPAdvancedBoxComponent final : public UBoxComponent
{
public:
	bool                                          bContributeToMass;                                 // 0x05B8(0x0001)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAdvancedBoxComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAdvancedBoxComponent")
	}
	static class UGPAdvancedBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAdvancedBoxComponent>();
	}
};
DUMPER7_ASSERTS_UGPAdvancedBoxComponent;

// Class GPPhysics.GPBuoyancyComponent
// 0x0270 (0x0368 - 0x00F8)
class UGPBuoyancyComponent final : public UActorComponent
{
public:
	struct FBuoyancyForceSetting                  BuoyancySetting;                                   // 0x00F8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EDampingForceType                             DampingForceType;                                  // 0x0110(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSimpleDampingForceSetting             SimpleDampingSetting;                              // 0x0114(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FComplexDampingForceSetting            ComplexDampingSetting;                             // 0x0134(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	int32                                         SlammingWaterPointThreshold;                       // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawDebug;                                        // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    SimulatingComponent;                               // 0x0160(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   BuoyancyMeshComponent;                             // 0x0168(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FBuoyancyTriangleSimulatingResult> TriangleSimulatingResults;                      // 0x0170(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 UnderWaterTriangleIndexArray;                      // 0x0180(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_190[0x8];                                      // 0x0190(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTriangleSimulatedForce>        TriangleSimulatedForces;                           // 0x0198(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWaterWaveOffsetResult>         WaveOffsetResults;                                 // 0x01B0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 TriangleWaveOffsetResultIndexArray;                // 0x01C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D0[0x38];                                     // 0x01D0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuoyancySubmergedState                SubmergedState;                                    // 0x0208(0x0044)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        LocalVertices;                                     // 0x0250(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 TriangleIndices;                                   // 0x0260(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector>                        WorldVertices;                                     // 0x0270(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0xD0];                                     // 0x0280(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterDataAssetsStreamer*               WaterDataAssetsStreamer;                           // 0x0350(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AOpenWorldWaterWaveGenerator*           WaterWaveGenerator;                                // 0x0358(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOpenWorldWaterSubsystem*               WaterSubsystem;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPBuoyancyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPBuoyancyComponent")
	}
	static class UGPBuoyancyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPBuoyancyComponent>();
	}
};
DUMPER7_ASSERTS_UGPBuoyancyComponent;

// Class GPPhysics.GPPhysics
// 0x0000 (0x0028 - 0x0028)
class UGPPhysics final : public UObject
{
public:
	static bool BoxLineIntersect(const struct FTransform& LocalToWorldNoScale, const struct FVector& Center, const struct FVector& Extend, const struct FVector& Start, const struct FVector& End, struct FVector* OutHitLoc, struct FVector* OutHitNormal, float* OutHitTime); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD6010
	static bool BoxTraceMulti(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, const struct FVector& HalfSize, const struct FRotator& Orientation, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD6320
	static bool BoxTraceMultiForObjects(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, const struct FVector& HalfSize, const struct FRotator& Orientation, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD6670
	static bool BoxTraceSingle(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, const struct FVector& HalfSize, const struct FRotator& Orientation, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD6A10
	static bool BoxTraceSingleForObjects(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, const struct FVector& HalfSize, const struct FRotator& Orientation, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD6D80
	static bool CapsuleLineIntersect(const struct FTransform& LocalToWorldNoScale, float radius, float Length, const struct FVector& Start, const struct FVector& End, struct FVector* OutHitLoc, struct FVector* OutHitNormal, float* OutHitTime); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD7140
	static bool CapsuleTraceMulti(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, float radius, float HalfHeight, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD7420
	static bool CapsuleTraceMultiForObjects(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, float radius, float HalfHeight, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD7750
	static bool CapsuleTraceSingle(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, float radius, float HalfHeight, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD7AD0
	static bool CapsuleTraceSingleForObjects(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, float radius, float HalfHeight, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD7E20
	static bool CheckDropIgnoreListPositionWrapper(class UWorld* World, const struct FVector& InPos, float radius, struct FVector* OutPos, struct FRotator* OutRotate, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD81D0
	static bool CheckDropPoint(class UWorld* World, const struct FVector& StartLoc, TArray<class AActor*>* ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD8410
	static bool CheckDropPositionOnGroundWrapper(class UWorld* World, const struct FVector& InPos, float BoxExtent, float* ZOffset, struct FVector* OutPos, struct FRotator* OutRotate, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD8570
	static bool CheckHitPointOnGround(const struct FHitResult& HitResult); // (Final, Native, Static, Public, HasOutParams) // @ 0x144CD8800
	static bool CheckSingleDropPositionWrapper(class AActor* Actor, const struct FVector& InPos, float radius, struct FVector* OutPos, struct FRotator* OutRotate); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD88D0
	static bool GetMultiLineTraceSingleByChannel(class UWorld* World, struct FHitResult* AddHitResult, struct FHitResult* HitResult, TArray<struct FHitResult>* OutHits, const TArray<class AActor*>& IgnoreActors, const TArray<TSubclassOf<class AActor>>& PenetrationTypes, struct FVector* WorldEnd, const struct FVector& Start, const struct FVector& End, float* OuterTime); // (Final, Native, Static, Private, HasOutParams, HasDefaults) // @ 0x144CD8A90
	static bool GetSimpleCheckPassedCharMeshs(TArray<class USkeletalMeshComponent*>* SimpleCheckPassedCharMeshs, class UWorld* World, const TArray<class AActor*>& IgnoreActors, const struct FVector& Start, const struct FVector& WorldEnd, bool IgnoreHidden); // (Final, Native, Static, Private, HasOutParams, HasDefaults) // @ 0x144CD8F40
	static bool LineTraceMulti(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD9200
	static bool LineTraceMultiForObjects(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD94B0
	static bool LineTraceSingle(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD97C0
	static bool LineTraceSingleForObjects(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD9A80
	static bool MeshTraceSingle(class USkeletalMeshComponent* SkelComp, const struct FVector& Start, const struct FVector& End, struct FHitResult* OutHitResult); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD9D90
	static bool SphereLineIntersect(const struct FVector& Origin, float radius, const struct FVector& Start, const struct FVector& End, struct FVector* OutHitLoc, struct FVector* OutHitNormal, float* OutHitTime); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CD9F50
	static bool SphereLineIntersectExtend(const struct FVector& Origin, float radius, const struct FVector& Start, const struct FVector& Dir, float Length, struct FVector* OutHitLoc, struct FVector* OutHitNormal, float* OutHitTime); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDA1E0
	static bool SphereTraceMulti(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, float radius, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDA480
	static bool SphereTraceMultiForObjects(class UWorld* World, TArray<struct FHitResult>* OutHits, const struct FVector& Start, const struct FVector& End, float radius, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDA770
	static bool SphereTraceSingle(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, float radius, ECollisionChannel TraceChannel, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDAAB0
	static bool SphereTraceSingleForObjects(class UWorld* World, struct FHitResult* OutHit, const struct FVector& Start, const struct FVector& End, float radius, const TArray<ECollisionChannel>& ObjectTypes, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDADB0
	static bool ViewTraceSingle(class UWorld* World, const TArray<class AActor*>& IgnoreActors, const struct FVector& Start, const struct FVector& End, bool IgnoreHidden, struct FHitResult* OutHitResult); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDB110
	static int32 WeaponTraceMulti(class UWorld* World, const TArray<class AActor*>& IgnoreActors, const TArray<TSubclassOf<class AActor>>& PenetrationTypes, const struct FVector& Start, const struct FVector& End, bool IgnoreHidden, TArray<struct FHitResult>* OutHitsResult); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDB390
	static int32 WeaponTraceMultiExtend(class UWorld* World, const TArray<class AActor*>& IgnoreActors, const TArray<TSubclassOf<class AActor>>& PenetrationTypes, const struct FVector& Start, const struct FVector& End, bool IgnoreHidden, TArray<struct FHitResult>* OutHitsResult); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDB6A0
	static bool WeaponTraceSingle(class UWorld* World, const TArray<class AActor*>& IgnoreActors, const struct FVector& Start, const struct FVector& End, bool IgnoreHidden, struct FHitResult* OutHitResult); // (Final, Native, Static, Public, HasOutParams, HasDefaults) // @ 0x144CDB9B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPPhysics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPPhysics")
	}
	static class UGPPhysics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPPhysics>();
	}
};
DUMPER7_ASSERTS_UGPPhysics;

// Class GPPhysics.GPPhysicsContactModifiable
// 0x0000 (0x0000 - 0x0000)
class IGPPhysicsContactModifiable final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPPhysicsContactModifiable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPPhysicsContactModifiable")
	}
	static class IGPPhysicsContactModifiable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGPPhysicsContactModifiable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGPPhysicsContactModifiable;

}

