#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPRenderer

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class GPRenderer.ParticleRenderComponent2D
// 0x0040 (0x0290 - 0x0250)
class UParticleRenderComponent2D final : public USceneComponent
{
public:
	float                                         AspectRatio;                                       // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OrthoWidth;                                        // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0258(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AEmitter*                               Emitter;                                           // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UParticleSystemComponent*>       DrawedParticleArray;                               // 0x0268(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UParticleSystemComponent*>       CullingParticleArray;                              // 0x0278(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DrawMaterialParticlesToRenderTarget(const TArray<class UParticleSystemComponent*>& InParticleSystemComponents, class UTextureRenderTarget2D* InRenderTarget); // (Final, Native, Public, HasOutParams) // @ 0x144CFC320

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleRenderComponent2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleRenderComponent2D")
	}
	static class UParticleRenderComponent2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleRenderComponent2D>();
	}
};
DUMPER7_ASSERTS_UParticleRenderComponent2D;

}

