#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPResource

#include "Basic.hpp"

#include "GameCore_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GPResource_structs.hpp"


namespace SDK
{

// Class GPResource.FXComponentManager
// 0x0198 (0x01C8 - 0x0030)
class UFXComponentManager final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x148];                                     // 0x0030(0x0148)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXResourceContainerComponent*>  CacheResourceComponents;                           // 0x0178(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_188[0x18];                                     // 0x0188(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFXResourceContainerComponent*>  CachePendingManagerRemoveComponents;               // 0x01A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B0[0x18];                                     // 0x01B0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFXComponentManager* Get(class UWorld* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144D3C240

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FXComponentManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FXComponentManager")
	}
	static class UFXComponentManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFXComponentManager>();
	}
};
DUMPER7_ASSERTS_UFXComponentManager;

// Class GPResource.FXResourceContainerComponent
// 0x05F0 (0x0E10 - 0x0820)
class UFXResourceContainerComponent final : public UParticleSystemComponent
{
public:
	uint8                                         Pad_820[0x10];                                     // 0x0820(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoActive;                                       // 0x0830(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FxResourceId;                                      // 0x0834(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAudioAutoPlayOnLoaded;                            // 0x083C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_83D[0x47];                                     // 0x083D(0x0047)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EffectResourceId;                                  // 0x0884(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResourceFXRow                         ResourceFX;                                        // 0x0890(0x02D0)(NativeAccessSpecifierPublic)
	struct FResourceAudioRow                      ResourceAudioFX;                                   // 0x0B60(0x01A0)(NativeAccessSpecifierPublic)
	TSet<class UObject*>                          CacheObjects;                                      // 0x0D00(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D50[0x14];                                     // 0x0D50(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RecordTranslucencySortOrder;                       // 0x0D64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D68[0x14];                                     // 0x0D68(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsSetStencilOutside;                              // 0x0D7C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D7D[0x33];                                     // 0x0D7D(0x0033)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UObject*>                          CacheAudioObjects;                                 // 0x0DB0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         RTPCValue_Character;                               // 0x0E00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E04[0xC];                                      // 0x0E04(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFXResourceContainerComponent* AcquireFromPool(const class UObject* WorldContext, class FName FXName, uint8 inFxQualityOverride); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144D3C7F0
	static bool DeactivateEffect(class UFXResourceContainerComponent* TargetEffect, int32 TargetEffectHandle); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144D3CA80
	static class UFXResourceContainerComponent* PlayEffect(class UObject* WorldContext, const class FName& EffectId, const struct FTransform& PlayTransform, class AActor* CreatorOwner, bool bUseObjectPool, class USceneComponent* Socket, class FName InSocketName, bool bIsHighFrequency, EFXResourceCompPriority Priority, bool bEnableInstanceLimit, class ACHARACTER* InCharacterToBlame, float RTPCValue); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x144D3CE50

	void ActivatePSC(bool bFlagAsJustAttached, bool bEnableDelayPlay); // (Final, Native, Public, BlueprintCallable) // @ 0x144D3C8E0
	void BP_Activate(bool bReset); // (Final, Native, Public, BlueprintCallable) // @ 0x144D3C9B0
	void BP_Deactivate(); // (Final, Native, Public, BlueprintCallable) // @ 0x144D3CA40
	void ClearOutsideSetFXStencil(); // (Final, Native, Public) // @ 0x144D3CA60
	void DeactivatePSC(bool bDoFadeOutCheck, int32 TargetEffectHandle); // (Final, Native, Public, BlueprintCallable) // @ 0x144D3CB40
	void KillTargetEmitter(class FName EmiterName); // (Native, Public) // @ 0x144D3CCC0
	void OnPSLoaded(const struct FSoftObjectPath& ResourcePaths); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x144D3CD50
	void OnRecycleReset(); // (Final, Native, Protected) // @ 0x144D3CE30
	bool PlayResourceSoundOnly(const class FName& ResourceFXId, bool bInAutoActive); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x144D3D210
	void ProcessTranslucencySortInPlay(); // (Final, Native, Protected) // @ 0x144D3D2F0
	void ProcessTranslucencySortInRecover(); // (Final, Native, Protected) // @ 0x144D3D310
	void SetFXStencilOutside(int32 Value, ERendererStencilMask StencilMask); // (Final, Native, Public) // @ 0x144D3D330
	bool SetResourceFX(const class FName& ResourceFXId, bool bInAutoActive); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x144D3D3F0

	int32 GetHandleIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x144D3CC00
	bool IsHandleIndexValid(const int32 CheckHandleIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x144D3CC30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FXResourceContainerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FXResourceContainerComponent")
	}
	static class UFXResourceContainerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFXResourceContainerComponent>();
	}
};
DUMPER7_ASSERTS_UFXResourceContainerComponent;

// Class GPResource.ResourceAnimManager
// 0x0010 (0x0040 - 0x0030)
class UResourceAnimManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceAnimManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceAnimManager")
	}
	static class UResourceAnimManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceAnimManager>();
	}
};
DUMPER7_ASSERTS_UResourceAnimManager;

// Class GPResource.ResourceFXManager
// 0x0060 (0x0090 - 0x0030)
class UResourceFXManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UParticleSystem*>     FXSPCache;                                         // 0x0040(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceFXManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceFXManager")
	}
	static class UResourceFXManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceFXManager>();
	}
};
DUMPER7_ASSERTS_UResourceFXManager;

// Class GPResource.ResourceAudioManager
// 0x0010 (0x0040 - 0x0030)
class UResourceAudioManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceAudioManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceAudioManager")
	}
	static class UResourceAudioManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceAudioManager>();
	}
};
DUMPER7_ASSERTS_UResourceAudioManager;

// Class GPResource.ClassesResourceAudioManager
// 0x0010 (0x0040 - 0x0030)
class UClassesResourceAudioManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClassesResourceAudioManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClassesResourceAudioManager")
	}
	static class UClassesResourceAudioManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClassesResourceAudioManager>();
	}
};
DUMPER7_ASSERTS_UClassesResourceAudioManager;

// Class GPResource.ResourceDecalManager
// 0x0010 (0x0040 - 0x0030)
class UResourceDecalManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceDecalManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceDecalManager")
	}
	static class UResourceDecalManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceDecalManager>();
	}
};
DUMPER7_ASSERTS_UResourceDecalManager;

// Class GPResource.ResourceLightManager
// 0x0010 (0x0040 - 0x0030)
class UResourceLightManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceLightManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceLightManager")
	}
	static class UResourceLightManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceLightManager>();
	}
};
DUMPER7_ASSERTS_UResourceLightManager;

// Class GPResource.ResourceCommercializationManager
// 0x0010 (0x0040 - 0x0030)
class UResourceCommercializationManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceCommercializationManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceCommercializationManager")
	}
	static class UResourceCommercializationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceCommercializationManager>();
	}
};
DUMPER7_ASSERTS_UResourceCommercializationManager;

// Class GPResource.ResourceCraterManager
// 0x0010 (0x0040 - 0x0030)
class UResourceCraterManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceCraterManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceCraterManager")
	}
	static class UResourceCraterManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceCraterManager>();
	}
};
DUMPER7_ASSERTS_UResourceCraterManager;

// Class GPResource.ResourceCraterSizeManager
// 0x0010 (0x0040 - 0x0030)
class UResourceCraterSizeManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResourceCraterSizeManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResourceCraterSizeManager")
	}
	static class UResourceCraterSizeManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResourceCraterSizeManager>();
	}
};
DUMPER7_ASSERTS_UResourceCraterSizeManager;

}

