#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPTools

#include "Basic.hpp"


namespace SDK
{

// Enum GPTools.EGPTFlowMessageLevel
// NumValues: 0x0004
enum class EGPTFlowMessageLevel : uint8
{
	Log                                      = 0,
	Warning                                  = 1,
	Error                                    = 2,
	EGPTFlowMessageLevel_MAX                 = 3,
};

// Enum GPTools.EGPTConsoleCommandScope
// NumValues: 0x0004
enum class EGPTConsoleCommandScope : uint8
{
	Client                                   = 0,
	Server                                   = 1,
	All                                      = 2,
	EGPTConsoleCommandScope_MAX              = 3,
};

// ScriptStruct GPTools.GPToolInfo
// 0x0030 (0x0030 - 0x0000)
struct FGPToolInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGPToolBase>                ImplClass;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Permission;                                        // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ScriptPath;                                        // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPToolInfo;

}

