#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPUserInterfaceCore

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GameCore_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GPUserInterfaceCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGameInput_structs.hpp"


namespace SDK
{

// Class GPUserInterfaceCore.LuaUIBaseView
// 0x0318 (0x0608 - 0x02F0)
class ULuaUIBaseView : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x2C];                                     // 0x02F0(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBPAutoPlay;                                       // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaPath;                                           // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBindLuaPath;                                      // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLuaPaint;                                      // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCacheLuaTable;                                    // 0x0332(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransformWorld;                                   // 0x0333(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSwallowClick;                                     // 0x0334(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterceptPreviewMouse;                            // 0x0335(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleClick;                                      // 0x0336(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleClickR;                                     // 0x0337(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleClickMid;                                   // 0x0338(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleDoubleClick;                                // 0x0339(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleHover;                                      // 0x033A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33B[0x1];                                      // 0x033B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DoubleClickInterval;                               // 0x033C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DoubleClickIntervalHD;                             // 0x0340(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClickWaitDoubleClick;                             // 0x0344(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleLongPress;                                  // 0x0345(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_346[0x2];                                      // 0x0346(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LongPressInterval;                                 // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LongPressCancelDistance;                           // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreciseClick;                                     // 0x0350(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseNativeTouchEvent;                              // 0x0351(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPointerEvent& InGestureEvent)> OnCustomDragLogic;                   // 0x0354(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ContentAreaHD;                                     // 0x0368(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsOpenConsoleConfig;                              // 0x0378(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ContentAreaConsole;                                // 0x037C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	ELuaUIBaseViewWantedInputMode                 WantedInputMode;                                   // 0x038C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseClipzone;                                      // 0x038D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38E[0xA2];                                     // 0x038E(0x00A2)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PanelOwner;                                        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHandleDrag;                                       // 0x0438(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandleDrop;                                       // 0x0439(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43A[0x1];                                      // 0x043A(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	ETriggerDragLogic                             TriggerDragLogic;                                  // 0x043B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewDragMode                                 DragMode;                                          // 0x043C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43D[0x3];                                      // 0x043D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DragAngle;                                         // 0x0440(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragDropVerticalDeltaThreshold;                    // 0x0444(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FastDragAngle;                                     // 0x0448(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULuaDragDropOperation>      LuaDragDropOp;                                     // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCancelDragWhenLongPressTrigger;                   // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DragTriggerDistance;                               // 0x045C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragThreshold;                                     // 0x0460(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDragPointSampleNum;                             // 0x0464(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreFirstSample;                                // 0x0468(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnMouseEnterEvent;                                 // 0x0470(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMouseLeaveEvent;                                 // 0x0480(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPressed;                                         // 0x0490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnReleased;                                        // 0x04A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnHovered;                                         // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnUnhovered;                                       // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent)> OnFocusReceivedEvent; // 0x04D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFocusEvent& InFocusEvent)> OnFocusLostEvent;         // 0x04E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFocusEvent& InFocusEvent)> OnAddedToFocusPathEvent;  // 0x04F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFocusEvent& InFocusEvent)> OnRemovedFromFocusPathEvent; // 0x0500(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EGPUIFocusEffectType                          FocusEffectType;                                   // 0x0510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoHittestNavigation;                              // 0x0511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_512[0xD6];                                     // 0x0512(0x00D6)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SuffixThemeID;                                     // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoApplyThemeID;                                 // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F9[0xF];                                      // 0x05F9(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<struct FVector2D> GetLastDragCurveData(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144EE55E0
	static class FString GetLastDragCurveDataText(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144EE5660

	void Bp_SynchronizeProperties(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Bp_SynchronizePropertiesEditorOnly(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void CallLuaLifeFunction(EUIState LifeFunction); // (Final, Native, Public) // @ 0x144EE53E0
	void DragDrop_LuaCall(const class FString& FuncName, class ULuaDragDropOperation* Operation); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5460
	void ForceStopLongPressTimer(); // (Final, Native, Public) // @ 0x144EE5560
	class UWidget* GetDesiredFocusWidget(); // (Native, Event, Protected, BlueprintEvent) // @ 0x144EE55B0
	EFocusCause GetLastFocusCause(); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE56E0
	class UObject* GetPanelOwner(); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5710
	struct FMargin GetSafeZoneSize(); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5730
	class UWidget* GetWidgetByName(class FName WidgetName); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5840
	class UWidget* GetWidgetByName_CheckLuaBinding(class FName WidgetName, bool* bRelyLuaBinding); // (Final, Native, Public, HasOutParams) // @ 0x144EE58D0
	bool IsAnimationPlayingExactly(const class UWidgetAnimation* InAnimation); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE59A0
	bool IsAnyAnimationPlayingRealtime(); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5A30
	void LuaInsHasRelease(); // (Final, Native, Public) // @ 0x144EE5A90
	void LuaRemoveFromParent(); // (Final, Native, Public) // @ 0x144EE5AB0
	void OnClicked_Test(); // (Final, Native, Public) // @ 0x140C994B0
	void OnDoubleClicked_Test(); // (Final, Native, Public) // @ 0x140C994B0
	void OnImmediateClicked_Test(); // (Final, Native, Public) // @ 0x140C994B0
	void OnLongPressed_Test(); // (Final, Native, Public) // @ 0x140C994B0
	void OnSetThemeIDChanged(const class FString& InThemeID); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PlayAni(bool bForward); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PlayAniLua(bool bForward); // (Final, Native, Public) // @ 0x144EE5B50
	void RecursiveCallLuaLifeFunction(EUIState LifeFunction); // (Final, Native, Public) // @ 0x144EE5CC0
	void RegisterLifeFunction(EUIState LifeFunction); // (Final, Native, Public) // @ 0x144EE5D40
	void SetPanelOwner(class UObject* InOwner); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5DC0
	void SetSkipDragStartDistanceCheck(bool bIsEnable); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5E40
	bool TryFindNavigationFoucasable(class UUserWidget* RootWidget); // (Final, Native, Public) // @ 0x144EE5F50
	void UpdateThemeIDOnly(const class FString& InThemeID); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE6010

	class UUserWidget* GetViewParent(bool bLuaParentOnly) const; // (Final, Native, Public, Const) // @ 0x144EE57A0
	bool IsInSafeZone() const; // (Final, Native, Public, Const) // @ 0x144EE5A60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaUIBaseView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaUIBaseView")
	}
	static class ULuaUIBaseView* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaUIBaseView>();
	}
};
DUMPER7_ASSERTS_ULuaUIBaseView;

// Class GPUserInterfaceCore.DFNavigationSelectorBase
// 0x0028 (0x0630 - 0x0608)
class UDFNavigationSelectorBase : public ULuaUIBaseView
{
public:
	class UWidget*                                SelectorRoot;                                      // 0x0608(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDFNavigationSelectorClipping*          SelectorClipping;                                  // 0x0610(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_618[0x18];                                     // 0x0618(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetForceHideSelectorRoot(bool bEnable); // (Final, Native, Static, Public) // @ 0x144EDE030
	static void SetHighlight_DirectlyOrNavigation(bool bEnable); // (Final, Native, Static, Public) // @ 0x144EDE290

	void Bind(); // (Final, Native, Public) // @ 0x144EDC5C0
	void HideSelector(); // (Final, Native, Public) // @ 0x144EDD1B0
	void OnFocusMenuEvent(bool bInMenu); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnStyleChanged(class FName InNewStyle); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ShowSelector(); // (Final, Native, Public) // @ 0x144EDECD0
	void Unbind(); // (Final, Native, Public) // @ 0x144EDF2C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFNavigationSelectorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFNavigationSelectorBase")
	}
	static class UDFNavigationSelectorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFNavigationSelectorBase>();
	}
};
DUMPER7_ASSERTS_UDFNavigationSelectorBase;

// Class GPUserInterfaceCore.DFNavigationSelectorStyleInterface
// 0x0000 (0x0000 - 0x0000)
class IDFNavigationSelectorStyleInterface final
{
public:
	class FName GetNavigationSelectorStyle(); // (Native, Event, Public, BlueprintEvent) // @ 0x144BC5990
	class UWidget* GetNavigationSelectorTarget(); // (Native, Event, Public, BlueprintEvent) // @ 0x144BC58B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFNavigationSelectorStyleInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFNavigationSelectorStyleInterface")
	}
	static class IDFNavigationSelectorStyleInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDFNavigationSelectorStyleInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDFNavigationSelectorStyleInterface;

// Class GPUserInterfaceCore.DFNavigationSelectorStyle
// 0x0010 (0x0618 - 0x0608)
class UDFNavigationSelectorStyle : public ULuaUIBaseView
{
public:
	bool                                          bAutoNavAnim;                                      // 0x0608(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_609[0x3];                                      // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FocusLoopAnimDelay;                                // 0x060C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_610[0x8];                                      // 0x0610(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UUMGSequencePlayer* PlayAutoAnimation(class FName AnimationName, int32 NumberOfLoops, EUMGSequencePlayMode PlayMode, bool bJumpToEnd); // (Final, Native, Protected, BlueprintCallable) // @ 0x144EDD7A0
	void PlayStyleEffect(); // (Final, Native, Public) // @ 0x144EDD8F0
	void ResetState(); // (Final, Native, Public) // @ 0x144EDDC80
	void StopAutoAnimation(class FName AnimationName); // (Final, Native, Protected, BlueprintCallable) // @ 0x144EDECF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFNavigationSelectorStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFNavigationSelectorStyle")
	}
	static class UDFNavigationSelectorStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFNavigationSelectorStyle>();
	}
};
DUMPER7_ASSERTS_UDFNavigationSelectorStyle;

// Class GPUserInterfaceCore.DFNavigationSelectorClipping
// 0x0010 (0x0178 - 0x0168)
class UDFNavigationSelectorClipping final : public UPanelWidget
{
public:
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFNavigationSelectorClipping")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFNavigationSelectorClipping")
	}
	static class UDFNavigationSelectorClipping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFNavigationSelectorClipping>();
	}
};
DUMPER7_ASSERTS_UDFNavigationSelectorClipping;

// Class GPUserInterfaceCore.GPAnalogCursorAccelerationManager
// 0x0008 (0x0038 - 0x0030)
class UGPAnalogCursorAccelerationManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAnalogCursorAccelerationManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAnalogCursorAccelerationManager")
	}
	static class UGPAnalogCursorAccelerationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAnalogCursorAccelerationManager>();
	}
};
DUMPER7_ASSERTS_UGPAnalogCursorAccelerationManager;

// Class GPUserInterfaceCore.GPAnalogCursorInputMappingManager
// 0x0008 (0x0038 - 0x0030)
class UGPAnalogCursorInputMappingManager final : public UDataTableSystemManagerBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPAnalogCursorInputMappingManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPAnalogCursorInputMappingManager")
	}
	static class UGPAnalogCursorInputMappingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPAnalogCursorInputMappingManager>();
	}
};
DUMPER7_ASSERTS_UGPAnalogCursorInputMappingManager;

// Class GPUserInterfaceCore.GPUINavigationDebugger
// 0x0000 (0x0028 - 0x0028)
class UGPUINavigationDebugger final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationDebugger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationDebugger")
	}
	static class UGPUINavigationDebugger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationDebugger>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationDebugger;

// Class GPUserInterfaceCore.GPUINavigationGlobalConfig
// 0x0060 (0x0098 - 0x0038)
class UGPUINavigationGlobalConfig final : public UDeveloperSettings
{
public:
	class FName                                   UILayerRoot;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UILayerPanelPrefix;                                // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x50];                                      // 0x0048(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationGlobalConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationGlobalConfig")
	}
	static class UGPUINavigationGlobalConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationGlobalConfig>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationGlobalConfig;

// Class GPUserInterfaceCore.GPUINavigationGroup
// 0x0168 (0x0190 - 0x0028)
class UGPUINavigationGroup final : public UObject
{
public:
	TDelegate<void(class UWidget* InWidget)>      FocusProxyMaker;                                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const TArray<int64>& InHandle)> FocusProxyResolver;                               // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseCustomFocusProxy;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x27];                                      // 0x0049(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPUINavigationStrategyBase*            NavStrategy;                                       // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x74];                                      // 0x0078(0x0074)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomSimulateMouseKeyConfigName;                  // 0x00EC(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0x14];                                      // 0x00F4(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UGPUINavigationGroup* FocusedNavGroup)> OnNavGroupFocusReceivedEvent; // 0x0108(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UGPUINavigationGroup* FocusedNavGroup)> OnNavGroupFocusLostEvent; // 0x0118(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x68];                                     // 0x0128(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddChildGroup(class UGPUINavigationGroup* InGroup); // (Final, Native, Public) // @ 0x144EDC4C0
	void AddNavWidgetToArray(class UWidget* InWidget); // (Final, Native, Public) // @ 0x144EDC540
	void BindDynamicNavConfig(const class FName InConfigName); // (Final, Native, Public) // @ 0x144EDC5E0
	void BuildNavigation(); // (Final, Native, Public) // @ 0x144EDC6E0
	void ClearCustomSimulateMouseKeyConfigName(); // (Final, Native, Public) // @ 0x144EDC760
	void FocusWidgetByProxy(const TArray<int64>& ProxyHandle, const bool bUseSelectedEffect); // (Final, Native, Public) // @ 0x144EDCA10
	class UWidget* GetLastFocusUWidget(); // (Final, Native, Public) // @ 0x144EDCE40
	class UGPUINavigationStrategyBase* GetOwnerNavStrategy(); // (Final, Native, Public) // @ 0x144EDCEC0
	void MarkIsDefaultFocusGroup(); // (Final, Native, Public) // @ 0x144EDD370
	void MarkIsGlobalGroup(bool bIsGlobal); // (Final, Native, Protected) // @ 0x144EDD390
	void MarkIsStackControlGroup(); // (Final, Native, Public) // @ 0x144EDD4F0
	void RemoveChildGroup(class UGPUINavigationGroup* InGroup); // (Final, Native, Public) // @ 0x144EDDA40
	void RemoveNodeRelations(); // (Final, Native, Public) // @ 0x144EDDBC0
	void RemoveParentGroup(); // (Final, Native, Public) // @ 0x144EDDC60
	void SetAnalogCursorStickySlowdownFactor(float InFactor); // (Final, Native, Public) // @ 0x144EDDD90
	void SetAutoUseRootGeometrySize(bool bAutoUse); // (Final, Native, Public) // @ 0x144EDDE10
	void SetCustomSimulateMouseKeyConfigName(const class FName InConfigName); // (Final, Native, Public) // @ 0x144EDDE90
	void SetEnableRightStickScrolling(const bool bEnableScrolling); // (Final, Native, Protected) // @ 0x144EDDF10
	void SetFocusRecoveryEnabled(bool bEnable); // (Final, Native, Public) // @ 0x144EDDFA0
	void SetNavSelectorStyle(const class FName& InStyle); // (Final, Native, Public, HasOutParams) // @ 0x144EDE310
	void SetNavSelectorWidgetVisibility(const bool bSelectorVisible); // (Final, Native, Public) // @ 0x144EDE3A0
	void SetOnlyNavInUINavWidgets(bool Inbool); // (Final, Native, Public) // @ 0x144EDE430
	void SetOwnerWidget(class UWidget* InWidget); // (Final, Native, Public) // @ 0x144EDE4B0
	void SetParentGroup(class UGPUINavigationGroup* InGroup); // (Final, Native, Public) // @ 0x144EDE530
	void SetRestoreOnFocusLostEnabled(bool bEnable); // (Final, Native, Protected) // @ 0x144EDE5B0
	void SetRootWidget(class UWidget* InWidget); // (Final, Native, Public) // @ 0x144EDE640
	void SetScrollAnalogStick(const EGPUIAnalogStick InAnalogStick); // (Final, Native, Public) // @ 0x144EDE6C0
	void SetScrollInfo(class UWidget* InScrollRecipient, const EGPUINavScrollingCondition InScrollingCondition); // (Final, Native, Public) // @ 0x144EDE740
	void SetScrollRecipient(class UWidget* InScrollRecipient); // (Final, Native, Public) // @ 0x144EDE800
	void SetSimulatedClickIsIgnored(bool bInIgnore); // (Final, Native, Public) // @ 0x144EDE880
	void SetUpdateFocusOnScrollEnabled(bool bEnable); // (Final, Native, Protected) // @ 0x144EDE9A0
	void SetWidgetFocusedAction(const EGPUINavWidgetFocusedAction InNewFoucsedAction); // (Final, Native, Public) // @ 0x144EDEBD0

	bool CanSimulateClick() const; // (Final, Native, Public, Const) // @ 0x144EDC700
	float GetAnalogCursorStickySlowdownFactor() const; // (Final, Native, Public, Const) // @ 0x144EDCD60
	class FName GetCustomSimulateMouseKeyConfigName() const; // (Final, Native, Public, Const) // @ 0x144EDCD90
	EFocusCause GetLastFocusLostCause() const; // (Final, Native, Protected, Const) // @ 0x144EDCDB0
	float GetLastFocusLostElapsedTime() const; // (Final, Native, Protected, Const) // @ 0x144EDCDE0
	float GetLastFocusLostTime() const; // (Final, Native, Protected, Const) // @ 0x144EDCE10
	EUINavigation GetLastNavigationType() const; // (Final, Native, Public, Const) // @ 0x144EDCE70
	class FName GetNavSelectorStyle() const; // (Final, Native, Protected, Const) // @ 0x144EDCEA0
	class UWidget* GetOwnerWidget() const; // (Final, Native, Public, Const) // @ 0x144EDCEF0
	class UGPUINavigationGroup* GetParentGroup() const; // (Final, Native, Public, Const) // @ 0x144EDCF20
	bool GetRestoreOnFocusLostEnabled() const; // (Final, Native, Protected, Const) // @ 0x144EDCF50
	class UWidget* GetRootWidget() const; // (Final, Native, Public, Const) // @ 0x144EDCF80
	bool GetUpdateFocusOnScrollEnabled() const; // (Final, Native, Protected, Const) // @ 0x144EDCFB0
	bool IsFocusRecoveryEnabled() const; // (Final, Native, Public, Const) // @ 0x144EDD1D0
	bool IsGroupEnabled() const; // (Final, Native, Public, Const) // @ 0x144EDD230
	bool IsGroupType(const EGPUINavigationGroupType InTestType) const; // (Final, Native, Public, Const) // @ 0x144EDD260
	bool IsShowNavSelectorWidget() const; // (Final, Native, Protected, Const) // @ 0x144EDD320
	bool RestoreFocus() const; // (Final, Native, Public, Const) // @ 0x144EDDCA0
	bool SetUserFocus(class UWidget* Widget, const bool bUseSelectedEffect, const bool bScrollToTarget) const; // (Final, Native, Public, Const) // @ 0x144EDEAC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationGroup")
	}
	static class UGPUINavigationGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationGroup>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationGroup;

// Class GPUserInterfaceCore.GPUINavigationManager
// 0x01E8 (0x0218 - 0x0030)
class UGPUINavigationManager final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(bool bOldWidet, const struct FGeometry& OldGeo, bool bNewWidget, const struct FGeometry& NewGeo, const struct FFocusEvent& FocusEvent)> OnNavigationChangedFocusEvent; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x40];                                      // 0x0040(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGPUINavigationGroup*>           NavGroups;                                         // 0x0080(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UGPUINavigationGroup*>           GlobalNavGroups;                                   // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A0[0x30];                                      // 0x00A0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGPUINavigationGroup*>           PendingFocusNavGroups;                             // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x50];                                      // 0x00E0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UGPUINavigationDebugger*                NavigationDebugger;                                // 0x0130(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x58];                                     // 0x0138(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bOnSimulatedDraging)> OnSimulateLeftMouseDragChanged;         // 0x0190(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsEnableFreeAnalogCursor)> OnUsingFreeAnalogCursorStateChanged; // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x68];                                     // 0x01B0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGPUINavigationManager* Get(class UObject* WorldContext); // (Final, Native, Static, Public) // @ 0x144EDCCE0

	int32 ActivateDynamicConfig(const class FName InConfigName, class UObject* InOwnerWidget, int32 InPriority); // (Final, Native, Public) // @ 0x144EDC3C0
	void BuildGroupTree(class UWidget* MainRootWidget); // (Final, Native, Public) // @ 0x144EDC660
	bool CanSimulateClickUnderCursor(); // (Final, Native, Public) // @ 0x144EDC730
	void DeactivateAllDynamicConfigs(); // (Final, Native, Public) // @ 0x144EDC790
	void DeactivateDynamicConfig(const int32 InHandle); // (Final, Native, Public) // @ 0x144EDC7B0
	void DeactivateDynamicConfigsbyWidget(const class UObject* InOwnerWidget); // (Final, Native, Public) // @ 0x144EDC830
	class UGPUINavigationGroup* FindNearGroup(class UGPUINavigationGroup* InGroup, const TArray<TWeakObjectPtr<class UGPUINavigationGroup>>& TargetGroups); // (Final, Native, Protected) // @ 0x144EDC8B0
	void FocusWidgetByProxy(class UGPUINavigationGroup* TargetGroup, const TArray<int64>& ProxyHandle); // (Final, Native, Public) // @ 0x144EDCB80
	void HandleInputMethodChanged(EGPInputType NewInputMethod); // (Final, Native, Public) // @ 0x144EDCFE0
	void HandleInputModeChanged(EGPInputModeType OldType, EGPInputModeType NewType); // (Final, Native, Public) // @ 0x144EDD060
	void HideFreeAnalogCursor(bool bRestoreFocus); // (Final, Native, Public) // @ 0x144EDD120
	bool IsFreeAnalogCursorMoving(); // (Final, Native, Public) // @ 0x144EDD200
	bool IsOnSimulatedMouseDraging(); // (Final, Native, Public) // @ 0x144EDD2F0
	bool IsStopSimulatedMouseDrag(); // (Final, Native, Public) // @ 0x144EDD340
	void MarkIsGlobalGroup(class UGPUINavigationGroup* InGroup, bool bIsGlobal); // (Final, Native, Public) // @ 0x144EDD420
	void OnPopUIChanged(const class UWidget* PopUI, const class UWidget* StackUI, bool bAdd); // (Final, Native, Protected) // @ 0x144EDD510
	void OnPopUIPreChange(); // (Final, Native, Protected) // @ 0x144EDD620
	void OnScrollEnd(); // (Final, Native, Protected) // @ 0x144EDD640
	void OnScrolling(); // (Final, Native, Protected) // @ 0x144EDD660
	void OnScrollingWithOffset(float ScrollOffset); // (Final, Native, Protected) // @ 0x144EDD680
	void OnStackUIChange(const class UWidget* StackUI); // (Final, Native, Protected) // @ 0x144EDD700
	void OnStackUIPreChange(); // (Final, Native, Protected) // @ 0x144EDD780
	bool RegisterAnalogCursor(); // (Final, Native, Public) // @ 0x144EDD910
	class UGPUINavigationGroup* RegisterNavigationGroup(class UWidget* RootWidget, class UWidget* OwnerWidget, const class FName NavStrategyName); // (Final, Native, Public) // @ 0x144EDD940
	void RemoveFocusHistoryFromWidget(class UWidget* InWidget); // (Final, Native, Public) // @ 0x144EDDAC0
	void RemoveNavigationGroup(class UWidget* InWidget); // (Final, Native, Public) // @ 0x144EDDB40
	void RemoveOneNavigationGroup(class UGPUINavigationGroup* InGroup); // (Final, Native, Public) // @ 0x144EDDBE0
	bool RestoreFocus(const class UWidget* InTargetUIWidget, const bool bSkipCheckCurSelect); // (Final, Native, Public) // @ 0x144EDDCD0
	void SetFreeAnalogCursorAutoFocusDisabled(class UWidget* InWidget, bool bInDisabled); // (Final, Native, Public) // @ 0x144EDE0B0
	void SetFreeAnalogCursorIsBlocked(class UWidget* InWidget, bool bInBlock, bool bAllowAnalogNavigation); // (Final, Native, Public) // @ 0x144EDE180
	void SetTrySimulateMouseDrag(bool bEnableSimulatedDrag); // (Final, Native, Public) // @ 0x144EDE910
	void SetUpdateFocusOnScrolling(bool bEnable); // (Final, Native, Public) // @ 0x144EDEA30
	void ShowFreeAnalogCursor(class UWidget* WidgetTocenterize); // (Final, Native, Public) // @ 0x144EDEC50
	bool StopSimulateMouseDrag(); // (Final, Native, Public) // @ 0x144EDED70
	class UGPUINavigationGroup* TryFindTargetGroup(class UGPUINavigationGroup* BeginGroup, class UGPUINavigationGroup* BaseGroup, EUINavigation InNavigationType); // (Final, Native, Public) // @ 0x144EDEDA0
	void TryFocusDefaultWidgetByGroup(class UGPUINavigationGroup* TargetGroup); // (Final, Native, Public) // @ 0x144EDEEA0
	bool TryFocusLastGroup(const TArray<class UGPUINavigationGroup*>& InGroups); // (Final, Native, Public) // @ 0x144EDEF20
	bool TryFocusLastGroupByOwner(class UWidget* Owner); // (Final, Native, Public) // @ 0x144EDF050
	void TryRecordProxy(class UWidget* InWidget); // (Final, Native, Public) // @ 0x144EDF0E0
	void TryRestoreProxy(class UWidget* InWidget); // (Final, Native, Public) // @ 0x144EDF160
	bool TrySimulateMouseClick(); // (Final, Native, Public) // @ 0x144EDF1E0
	bool TrySimulateMouseDrag(class UWidget* TryDragWidget); // (Final, Native, Public) // @ 0x144EDF210
	void UnRegisterAnalogCursor(); // (Final, Native, Public) // @ 0x144EDF2A0
	bool UsingFreeAnalogCursor(); // (Final, Native, Public) // @ 0x144EDF2E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationManager")
	}
	static class UGPUINavigationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationManager>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationManager;

// Class GPUserInterfaceCore.GPUINavigationProxyInterface
// 0x0000 (0x0000 - 0x0000)
class IGPUINavigationProxyInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationProxyInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationProxyInterface")
	}
	static class IGPUINavigationProxyInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGPUINavigationProxyInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGPUINavigationProxyInterface;

// Class GPUserInterfaceCore.GPUINavigationScrollInterface
// 0x0000 (0x0000 - 0x0000)
class IGPUINavigationScrollInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationScrollInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationScrollInterface")
	}
	static class IGPUINavigationScrollInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGPUINavigationScrollInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGPUINavigationScrollInterface;

// Class GPUserInterfaceCore.GPUINavigationStrategyBase
// 0x0058 (0x0080 - 0x0028)
class UGPUINavigationStrategyBase : public UObject
{
public:
	TDelegate<void(class UWidget* CurFocusWidget, EUINavigation InNavigationType)> NavRule_CustomTargeting; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(EUINavigation InNavigationType)> NavRule_CustomBoundary;                          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UGPUINavigationGroup* BeginGroup, class UGPUINavigationGroup* BaseGroup, EUINavigation InNavigationType)> NavRule_TargetGroup; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(class UGPUINavigationGroup* FromGroup, class UGPUINavigationGroup* ToGroup, EUINavigation InNavigationType)> NavRule_EnterGroupFocusWidget; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetBestFocusNoEditableText(); // (Final, Native, Public) // @ 0x1413EEBF0
	void SetBestFocusNoEditableText(bool bInCondition); // (Final, Native, Public) // @ 0x144EE2DE0
	void SetBestFocusWidgetDefaultType(const EGPUINavGroupBestDefaultType InNewBestDefaultType); // (Final, Native, Public) // @ 0x144EE2E70
	void SetDifferentParentTransStrategy(const EGPUINavGroupTransSimpleStrategy InNewStrategy); // (Final, Native, Public) // @ 0x144EE2EF0
	void SetSameParentTransStrategy(const EGPUINavGroupTransSimpleStrategy InNewStrategy); // (Final, Native, Public) // @ 0x144EE3340
	void WrapBoundary(const TArray<EUINavigation>& InNavDirections); // (Final, Native, Public) // @ 0x144EE3770

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationStrategyBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationStrategyBase")
	}
	static class UGPUINavigationStrategyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationStrategyBase>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationStrategyBase;

// Class GPUserInterfaceCore.GPUINavigationStrategy_Closest
// 0x0008 (0x0088 - 0x0080)
class UGPUINavigationStrategy_Closest final : public UGPUINavigationStrategyBase
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalDistanceType(const EGPUINavigationDistanceType InDistanceType); // (Final, Native, Public) // @ 0x144EE3240
	void SetVerticalDistanceType(const EGPUINavigationDistanceType InDistanceType); // (Final, Native, Public) // @ 0x144EE3630

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationStrategy_Closest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationStrategy_Closest")
	}
	static class UGPUINavigationStrategy_Closest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationStrategy_Closest>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationStrategy_Closest;

// Class GPUserInterfaceCore.GPUINavigationStrategy_Grid1D
// 0x0008 (0x0088 - 0x0080)
class UGPUINavigationStrategy_Grid1D final : public UGPUINavigationStrategyBase
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetIsVerticalType(bool IsVerticalType); // (Final, Native, Public) // @ 0x144EE32C0
	void SetUsePrevNextNavigation(bool UsePrevNextNavigation); // (Final, Native, Public) // @ 0x144EE3440

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationStrategy_Grid1D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationStrategy_Grid1D")
	}
	static class UGPUINavigationStrategy_Grid1D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationStrategy_Grid1D>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationStrategy_Grid1D;

// Class GPUserInterfaceCore.GPUINavigationStrategy_Gunsmith
// 0x0028 (0x00A8 - 0x0080)
class UGPUINavigationStrategy_Gunsmith final : public UGPUINavigationStrategyBase
{
public:
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetGunCenter(const struct FVector2D& NewGunCenter); // (Final, Native, Public, HasDefaults) // @ 0x144EE2F70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationStrategy_Gunsmith")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationStrategy_Gunsmith")
	}
	static class UGPUINavigationStrategy_Gunsmith* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationStrategy_Gunsmith>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationStrategy_Gunsmith;

// Class GPUserInterfaceCore.GPUINavigationStrategy_Hittest
// 0x0010 (0x0090 - 0x0080)
class UGPUINavigationStrategy_Hittest final : public UGPUINavigationStrategyBase
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHitPadding(const float InHitPadding); // (Final, Native, Public) // @ 0x144EE2FF0
	void SetHittestFallbackConfig(const EGPUINavHittestFallbackType HittestFallbackType, const bool bEnable, const bool bEnableOtherSweptTest); // (Final, Native, Public) // @ 0x144EE3070
	void SetHittestFallbackDistanceType(const EGPUINavHittestFallbackType HittestFallbackType, const EGPUINavigationDistanceType DistanceType); // (Final, Native, Public) // @ 0x144EE3180
	void SetSweptOffset(const float InOffset); // (Final, Native, Public) // @ 0x144EE33C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationStrategy_Hittest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationStrategy_Hittest")
	}
	static class UGPUINavigationStrategy_Hittest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationStrategy_Hittest>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationStrategy_Hittest;

// Class GPUserInterfaceCore.GPUINavigationStrategy_LuaExtension
// 0x0010 (0x0090 - 0x0080)
class UGPUINavigationStrategy_LuaExtension final : public UGPUINavigationStrategyBase
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHitPadding(const float InHitPadding); // (Final, Native, Public) // @ 0x144EE2FF0
	void SetHittestFallbackConfig(const EGPUINavHittestFallbackType HittestFallbackType, const bool bEnable, const bool bEnableOtherSweptTest); // (Final, Native, Public) // @ 0x144EE3070
	void SetHittestFallbackDistanceType(const EGPUINavHittestFallbackType HittestFallbackType, const EGPUINavigationDistanceType DistanceType); // (Final, Native, Public) // @ 0x144EE3180
	void SetSweptOffset(const float InOffset); // (Final, Native, Public) // @ 0x144EE33C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationStrategy_LuaExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationStrategy_LuaExtension")
	}
	static class UGPUINavigationStrategy_LuaExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationStrategy_LuaExtension>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationStrategy_LuaExtension;

// Class GPUserInterfaceCore.GPUINavigationUtils
// 0x0000 (0x0028 - 0x0028)
class UGPUINavigationUtils final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class ULuaUIBaseView*> GetAllLuaParents(class UWidget* InWidget); // (Final, Native, Static, Public) // @ 0x144EE2710
	static EUINavigation GetNatigationTypeFromNavigationEvent(const struct FNavigationEvent& Event); // (Final, Native, Static, Public, HasOutParams) // @ 0x144EE2830
	static ENavigationGenesis GetNavigationGenesisFromNavigationEvent(const struct FNavigationEvent& Event); // (Final, Native, Static, Public, HasOutParams) // @ 0x144EE28F0
	static class UWidget* GetParentWidgetByClassName(class UWidget* From, const class FString& ClassName); // (Final, Native, Static, Public) // @ 0x144EE29B0
	static class UWidget* GetTopWidgetBelow(class UWidget* From, class UWidget* Below); // (Final, Native, Static, Public) // @ 0x144EE2AB0
	static bool IsDirectChildWidgetOf(class UWidget* InWidget, class UWidget* Parent); // (Final, Native, Static, Public) // @ 0x144EE2B70
	static bool IsNavigationEnabled(); // (Final, Native, Static, Public) // @ 0x144EE2C30
	static bool IsWidgetInFocusPath(uint32 UserIndex, class UWidget* Widget); // (Final, Native, Static, Public) // @ 0x144EE2C60
	static bool IsWidgetInParent(class UWidget* InWidget, class UWidget* Parent); // (Final, Native, Static, Public) // @ 0x144EE2D20
	static bool SetUserFocusToGameViewport(const class UObject* InObject); // (Final, Native, Static, Public) // @ 0x144EE34C0
	static bool SetUserFocusToWidget(const class UObject* InObject, class UWidget* InWidget, const bool bUseSelectedEffect); // (Final, Native, Static, Public) // @ 0x144EE3540
	static bool TryAutoFocus(uint32 UserIndex, class UUserWidget* RootWidget); // (Final, Native, Static, Public) // @ 0x144EE36B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUINavigationUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUINavigationUtils")
	}
	static class UGPUINavigationUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUINavigationUtils>();
	}
};
DUMPER7_ASSERTS_UGPUINavigationUtils;

// Class GPUserInterfaceCore.GPUIScreenAdaptInterface
// 0x0000 (0x0000 - 0x0000)
class IGPUIScreenAdaptInterface final
{
public:
	void OverrideScreenAdaptType(EGPScreenAdaptType InType); // (Native, Public, BlueprintCallable) // @ 0x144EE5AD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUIScreenAdaptInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUIScreenAdaptInterface")
	}
	static class IGPUIScreenAdaptInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGPUIScreenAdaptInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGPUIScreenAdaptInterface;

// Class GPUserInterfaceCore.GPUIScreenAdaptProvider
// 0x0020 (0x0050 - 0x0030)
class UGPUIScreenAdaptProvider final : public UEngineSubsystem
{
public:
	struct FScreenDetectionWeights                Weights;                                           // 0x0030(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UGPUIScreenAdaptProvider* Get(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144EE5580

	bool QueryScreenParams(struct FSimpleScreenParams* OutParams); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x144EE5BE0
	void SetUserOverrideType(EGPUserOverrideAdaptType InType); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5ED0
	EGPScreenAdaptType UpdateGlobalScreenAdaptType(); // (Final, Native, Public, BlueprintCallable) // @ 0x144EE5FE0

	EGPUserOverrideAdaptType GetUserOverrideType() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x144EE5770

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUIScreenAdaptProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUIScreenAdaptProvider")
	}
	static class UGPUIScreenAdaptProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUIScreenAdaptProvider>();
	}
};
DUMPER7_ASSERTS_UGPUIScreenAdaptProvider;

// Class GPUserInterfaceCore.LuaDragDropOperation
// 0x0040 (0x00C8 - 0x0088)
class ULuaDragDropOperation : public UDragDropOperation
{
public:
	struct FVector2D                              DragOffset;                                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TargetPosition;                                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MousePosition;                                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCancelByUser;                                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            WidgetReference;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBroadcastLuaEvent;                                // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaEventName;                                      // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaDragDropOperation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaDragDropOperation")
	}
	static class ULuaDragDropOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULuaDragDropOperation>();
	}
};
DUMPER7_ASSERTS_ULuaDragDropOperation;

// Class GPUserInterfaceCore.UGPUINavigationStrategy_Cursor
// 0x0000 (0x0080 - 0x0080)
class UUGPUINavigationStrategy_Cursor final : public UGPUINavigationStrategyBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGPUINavigationStrategy_Cursor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGPUINavigationStrategy_Cursor")
	}
	static class UUGPUINavigationStrategy_Cursor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGPUINavigationStrategy_Cursor>();
	}
};
