#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPUserInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "SlateCore_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPUserInterfaceCore_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "GPUserInterface_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "RuntimeFilesDownloader_structs.hpp"
#include "UMGToolKits_classes.hpp"
#include "Slate_structs.hpp"
#include "WaterFallScrollBox_classes.hpp"
#include "GameCore_classes.hpp"


namespace SDK
{

// Class GPUserInterface.DFInvalidationBox
// 0x0000 (0x0180 - 0x0180)
class UDFInvalidationBox final : public UInvalidationBox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFInvalidationBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFInvalidationBox")
	}
	static class UDFInvalidationBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFInvalidationBox>();
	}
};
DUMPER7_ASSERTS_UDFInvalidationBox;

// Class GPUserInterface.DFTextBlockStateWidgetStyle
// 0x12D8 (0x1308 - 0x0030)
class UDFTextBlockStateWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FDFTextBlockButtonStateStyle           TextBlockStateStyle;                               // 0x0030(0x12D8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFTextBlockStateWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFTextBlockStateWidgetStyle")
	}
	static class UDFTextBlockStateWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFTextBlockStateWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UDFTextBlockStateWidgetStyle;

// Class GPUserInterface.DFUserWidgetBase
// 0x0068 (0x0358 - 0x02F0)
class UDFUserWidgetBase : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x8];                                      // 0x02F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SuffixThemeID;                                     // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoApplyThemeID;                                 // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFlowAnimType                                 FlowAnimType;                                      // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMuteWhenDisableStyle;                             // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30B[0x5];                                      // 0x030B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bActivated)> OnEnableStyleChanged;                            // 0x0310(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& InThemeID)> OnThemeIDChanged;                 // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x28];                                     // 0x0330(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnHide(); // (Native, Public, BlueprintCallable) // @ 0x141FA6350
	void OnHideBegin(); // (Native, Public, BlueprintCallable) // @ 0x141FA6390
	void OnSetThemeIDChanged(const class FString& InThemeID); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnShow(); // (Native, Public, BlueprintCallable) // @ 0x141FA6370
	void OnShowBegin(); // (Native, Public, BlueprintCallable) // @ 0x142BE7B10
	void PlayAutoAnimation(const class FString& AnimationName, int32 NumberOfLoops, EUMGSequencePlayMode PlayMode, bool bJumpToEnd); // (Final, Native, Public, BlueprintCallable) // @ 0x144E7E370
	void StopAutoAnimation(const class FString& AnimationName); // (Final, Native, Public, BlueprintCallable) // @ 0x144E7E860

	bool GetActivatedState() const; // (Final, Native, Public, Const) // @ 0x144E7E220

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFUserWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFUserWidgetBase")
	}
	static class UDFUserWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFUserWidgetBase>();
	}
};
DUMPER7_ASSERTS_UDFUserWidgetBase;

// Class GPUserInterface.DFBidirectionalSlider
// 0x05F0 (0x0948 - 0x0358)
class UDFBidirectionalSlider final : public UDFUserWidgetBase
{
public:
	class UDFSlider*                              SliderLeft;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFSlider*                              SliderRight;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFProgressBar*                         ProgressBar;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SliderBarWidth;                                    // 0x0370(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftValue;                                         // 0x0374(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightValue;                                        // 0x0378(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepValue;                                         // 0x037C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastLeftValue;                                     // 0x0380(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastRightValue;                                    // 0x0384(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinValue;                                          // 0x0388(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxValue;                                          // 0x038C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepValueDecimalPlaces;                            // 0x0390(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float LeftValue, float RightValue)> OnValueUpdated;                // 0x0398(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bUseSingleStickMode;                               // 0x03A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   LeftRightSwitchKey;                                // 0x03B0(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CurrentSliderIsRight;                              // 0x03C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSliderStyle                           OverrideSliderStyleForGamepad;                     // 0x03D0(0x0370)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FProgressBarStyle                      OverrideProgressBarStyleForGamepad;                // 0x0740(0x01B8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_8F8[0x50];                                     // 0x08F8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInputTypeChanged(EGPInputType InInputType); // (Final, Native, Public) // @ 0x144E5C550
	void InitValue(float InLeftValue, float InRightValue, float InMinValue, float InMaxValue); // (Final, Native, Public) // @ 0x144E5C710
	void OnSetValue(float InValue, bool bIsRight, bool bNeedCallback); // (Final, Native, Private) // @ 0x144E5CD20
	void OnSliderLeftValueChanged(float InValue); // (Final, Native, Private) // @ 0x144E5CE30
	void OnSliderRightValueChanged(float InValue); // (Final, Native, Private) // @ 0x144E5CEB0
	void ProcessSliderValueUpdated(float InValue, bool bIsRight); // (Final, Native, Private) // @ 0x144E5D0E0
	void SetCurrentSlider(bool Bright); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D9A0
	void SetStepValue(float InStepValue); // (Final, Native, Private) // @ 0x144E5DEB0
	void ToggleCurrentSlider(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5DFB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBidirectionalSlider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBidirectionalSlider")
	}
	static class UDFBidirectionalSlider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBidirectionalSlider>();
	}
};
DUMPER7_ASSERTS_UDFBidirectionalSlider;

// Class GPUserInterface.GPWidgetTiltActor
// 0x0000 (0x0370 - 0x0370)
class AGPWidgetTiltActor final : public AActor
{
public:
	bool IsDestroy(); // (Native, Event, Public, BlueprintEvent) // @ 0x144A3A390

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPWidgetTiltActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPWidgetTiltActor")
	}
	static class AGPWidgetTiltActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGPWidgetTiltActor>();
	}
};
DUMPER7_ASSERTS_AGPWidgetTiltActor;

// Class GPUserInterface.DFGridPanel
// 0x0018 (0x01B0 - 0x0198)
class UDFGridPanel final : public UGridPanel
{
public:
	bool                                          bFramingAvance;                                    // 0x0198(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FramingNumber;                                     // 0x019C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A0[0x10];                                     // 0x01A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFGridPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFGridPanel")
	}
	static class UDFGridPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFGridPanel>();
	}
};
DUMPER7_ASSERTS_UDFGridPanel;

// Class GPUserInterface.DFAspectRatioBoxSlot
// 0x0018 (0x0050 - 0x0038)
class UDFAspectRatioBoxSlot final : public UPanelSlot
{
public:
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x16];                                      // 0x003A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFAspectRatioBoxSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFAspectRatioBoxSlot")
	}
	static class UDFAspectRatioBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFAspectRatioBoxSlot>();
	}
};
DUMPER7_ASSERTS_UDFAspectRatioBoxSlot;

// Class GPUserInterface.DFRichTextBlockCheckStateWidgetStyle
// 0x19A0 (0x19D0 - 0x0030)
class UDFRichTextBlockCheckStateWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FDFRichTextBlockCheckStateStyle        RichTextBlockStateStyle;                           // 0x0030(0x19A0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFRichTextBlockCheckStateWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFRichTextBlockCheckStateWidgetStyle")
	}
	static class UDFRichTextBlockCheckStateWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFRichTextBlockCheckStateWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UDFRichTextBlockCheckStateWidgetStyle;

// Class GPUserInterface.DFAspectRatioBox
// 0x0028 (0x0190 - 0x0168)
class UDFAspectRatioBox final : public UContentWidget
{
public:
	struct FIntPoint                              MaxRatio;                                          // 0x0168(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              MinRatio;                                          // 0x0170(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseMaxRatio : 1;                                  // 0x0178(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMinRatio : 1;                                  // 0x0178(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bViewportSpace : 1;                                // 0x0178(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_179[0x17];                                     // 0x0179(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFAspectRatioBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFAspectRatioBox")
	}
	static class UDFAspectRatioBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFAspectRatioBox>();
	}
};
DUMPER7_ASSERTS_UDFAspectRatioBox;

// Class GPUserInterface.DFImage
// 0x0070 (0x0338 - 0x02C8)
class UDFImage : public UImage
{
public:
	bool                                          bLazyLoadBrush;                                    // 0x02C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoLazyLoadBrush;                                // 0x02C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CA[0x6];                                      // 0x02CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 ResourceSoftObject;                                // 0x02D0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CurrentLoadingBrush;                               // 0x02F8(0x0018)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bKeepColor;                                        // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CachedColorAndOpacity;                             // 0x0314(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_324[0x14];                                     // 0x0324(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AsyncSetImageBySoftObjectPath(const struct FSoftObjectPath& ImagePath, bool bAutoResize, bool bInKeepColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x144E72D50
	void AsyncSetImageID(class FName ImageID, bool bAutoResize); // (Final, Native, Public, BlueprintCallable) // @ 0x144E72F00
	void AsyncSetImagePath(const class FString& ImagePath, bool bAutoResize); // (Final, Native, Public, BlueprintCallable) // @ 0x144E72FD0
	void Clear(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E73180
	struct FSoftObjectPath GetCurrentLoadingBrush(); // (Final, Native, Public, HasDefaults) // @ 0x144E733F0
	void SetBrushFromSoft(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E73D30
	void SetBrushSoft(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E73D50
	void SetBrushTiling(ESlateBrushTileType Tiling); // (Final, Native, Public, BlueprintCallable) // @ 0x144E73D70
	void SetImage(class UObject* ImageAsset, bool bAutoResize); // (Final, Native, Public, BlueprintCallable) // @ 0x144E74260
	void SetImageSize(const struct FSoftObjectPath& ImagePath); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x144E74330

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFImage")
	}
	static class UDFImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFImage>();
	}
};
DUMPER7_ASSERTS_UDFImage;

// Class GPUserInterface.DFBackgroundBlur
// 0x0018 (0x02F8 - 0x02E0)
class UDFBackgroundBlur final : public UBackgroundBlur
{
public:
	int32                                         LowQualityFallbackBrushIndex;                      // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Delay_RefreshCacheBlurRT;                          // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseBlurRotation;                                  // 0x02E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E9[0xF];                                      // 0x02E9(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RefreshCacheBlurRT(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D1B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBackgroundBlur")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBackgroundBlur")
	}
	static class UDFBackgroundBlur* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBackgroundBlur>();
	}
};
DUMPER7_ASSERTS_UDFBackgroundBlur;

// Class GPUserInterface.DFHttpImage
// 0x0038 (0x0370 - 0x0338)
class UDFHttpImage final : public UDFImage
{
public:
	class FString                                 Http_Url;                                          // 0x0338(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool isSuccess)> DFHttpImageSetImageFinishDelegate;                // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class URuntimeFilesDownloaderProxy*           DownloaderProxy;                                   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_360[0x10];                                     // 0x0360(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UTexture2D* LoadImageTexture2D(const class FString& ImagePath); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E73600

	void OnDownloaderResult(EDownloadResult Result, const class FString& LastModified); // (Final, Native, Public) // @ 0x144E73760
	void SetHttpImage(const class FString& URL); // (Final, Native, Public, BlueprintCallable) // @ 0x144E741A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFHttpImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFHttpImage")
	}
	static class UDFHttpImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFHttpImage>();
	}
};
DUMPER7_ASSERTS_UDFHttpImage;

// Class GPUserInterface.DFBackgroundBoxSlot
// 0x0010 (0x0048 - 0x0038)
class UDFBackgroundBoxSlot final : public UPanelSlot
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBackgroundBoxSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBackgroundBoxSlot")
	}
	static class UDFBackgroundBoxSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBackgroundBoxSlot>();
	}
};
DUMPER7_ASSERTS_UDFBackgroundBoxSlot;

// Class GPUserInterface.DFContainerBase
// 0x0020 (0x0188 - 0x0168)
class UDFContainerBase : public UContentWidget
{
public:
	uint8                                         Pad_168[0x20];                                     // 0x0168(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFContainerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFContainerBase")
	}
	static class UDFContainerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFContainerBase>();
	}
};
DUMPER7_ASSERTS_UDFContainerBase;

// Class GPUserInterface.DFInputTypeVisibilityReContainer
// 0x0018 (0x01A0 - 0x0188)
class UDFInputTypeVisibilityReContainer final : public UDFContainerBase
{
public:
	EGPInputType                                  VisibilityInputType;                               // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableInputTypeVisibility;                        // 0x0189(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlatformInputTypeVisibility>   ExtendedPlatformData;                              // 0x0190(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	struct FPlatformInputTypeVisibility GetActiveConfig(); // (Final, Native, Public) // @ 0x144E73380
	void InputTypeChanged(EGPInputType InputType); // (Final, Native, Protected) // @ 0x144E734D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFInputTypeVisibilityReContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFInputTypeVisibilityReContainer")
	}
	static class UDFInputTypeVisibilityReContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFInputTypeVisibilityReContainer>();
	}
};
DUMPER7_ASSERTS_UDFInputTypeVisibilityReContainer;

// Class GPUserInterface.DFBackgroundBox
// 0x0020 (0x0188 - 0x0168)
class UDFBackgroundBox final : public UContentWidget
{
public:
	struct FIntPoint                              OverrideContentSize;                               // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBackgroundStretchType                        StretchHD;                                         // 0x0170(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBackgroundStretchType                        StretchMobile;                                     // 0x0171(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x16];                                     // 0x0172(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetContentSize(const struct FIntPoint& InSize); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x144E5D910
	void SetStretch(EBackgroundStretchType InStretch); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5DF30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBackgroundBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBackgroundBox")
	}
	static class UDFBackgroundBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBackgroundBox>();
	}
};
DUMPER7_ASSERTS_UDFBackgroundBox;

// Class GPUserInterface.DFZeroSizeBox
// 0x0010 (0x0178 - 0x0168)
class UDFZeroSizeBox final : public UContentWidget
{
public:
	uint8                                         Pad_168[0x10];                                     // 0x0168(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFZeroSizeBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFZeroSizeBox")
	}
	static class UDFZeroSizeBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFZeroSizeBox>();
	}
};
DUMPER7_ASSERTS_UDFZeroSizeBox;

// Class GPUserInterface.DFNamedSlot
// 0x0000 (0x0178 - 0x0178)
class UDFNamedSlot : public UNamedSlot
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFNamedSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFNamedSlot")
	}
	static class UDFNamedSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFNamedSlot>();
	}
};
DUMPER7_ASSERTS_UDFNamedSlot;

// Class GPUserInterface.DFBlurSlotReContainer
// 0x0028 (0x01A0 - 0x0178)
class UDFBlurSlotReContainer final : public UDFNamedSlot
{
public:
	struct FSoftObjectPath                        BlurWidgetPath;                                    // 0x0178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FullPath;                                          // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnBlurWidgetLoaded(const struct FSoftObjectPath& SoftObject); // (Final, Native, Protected, HasDefaults) // @ 0x144E5C930

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBlurSlotReContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBlurSlotReContainer")
	}
	static class UDFBlurSlotReContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBlurSlotReContainer>();
	}
};
DUMPER7_ASSERTS_UDFBlurSlotReContainer;

// Class GPUserInterface.FDFCommonButtonWidgetStyle
// 0x23F0 (0x2420 - 0x0030)
class UFDFCommonButtonWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FDFCommonButtonStyle                   CommonButtonStyle;                                 // 0x0030(0x23F0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FDFCommonButtonWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FDFCommonButtonWidgetStyle")
	}
	static class UFDFCommonButtonWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFDFCommonButtonWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UFDFCommonButtonWidgetStyle;

// Class GPUserInterface.DFBorder
// 0x0000 (0x02C0 - 0x02C0)
class UDFBorder final : public UBorder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBorder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBorder")
	}
	static class UDFBorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBorder>();
	}
};
DUMPER7_ASSERTS_UDFBorder;

// Class GPUserInterface.DFButton
// 0x0050 (0x04E8 - 0x0498)
class UDFButton final : public UButton
{
public:
	int64                                         ButtonID;                                          // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PressedSoundName;                                  // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HoveredSoundName;                                  // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPUIFocusEffectType                          FocusEffectType;                                   // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent)> OnFocusReceivedEvent; // 0x04B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFocusEvent& InFocusEvent)> OnFocusLostEvent;         // 0x04C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D8[0x10];                                     // 0x04D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CloseDefaultSound(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5C3B0
	EFocusCause GetLastFocusCause(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5C4B0
	void OpenDefaultSound(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5CFC0
	void OverHoveredLoadSound(class FName SoundName); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5CFE0
	void OverLoadSound(class FName SoundName); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D060
	void SetButtonID(int64 NewButtonID); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D410
	void SetClickIsIgnored(bool bInIgnore); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D6F0
	void SetIsFocusable(bool InIsFocusable); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5DBC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFButton")
	}
	static class UDFButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFButton>();
	}
};
DUMPER7_ASSERTS_UDFButton;

// Class GPUserInterface.DFBrushButtonStateWidgetStyle
// 0x0518 (0x0548 - 0x0030)
class UDFBrushButtonStateWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FDFBrushButtonStateStyle               BrushStateStyle;                                   // 0x0030(0x0518)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFBrushButtonStateWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFBrushButtonStateWidgetStyle")
	}
	static class UDFBrushButtonStateWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFBrushButtonStateWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UDFBrushButtonStateWidgetStyle;

// Class GPUserInterface.DFCanvasPanel
// 0x0000 (0x01D0 - 0x01D0)
class UDFCanvasPanel final : public UCanvasPanel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFCanvasPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCanvasPanel")
	}
	static class UDFCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCanvasPanel>();
	}
};
DUMPER7_ASSERTS_UDFCanvasPanel;

// Class GPUserInterface.DFCanvasPosReContainer
// 0x0070 (0x01F8 - 0x0188)
class UDFCanvasPosReContainer final : public UDFContainerBase
{
public:
	struct FAnchorData                            AnchorDataHD;                                      // 0x0188(0x0028)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnchorData                            AnchorDataMobile;                                  // 0x01B0(0x0028)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FPlatformCanvasPos>             ExtendedPlatformData;                              // 0x01D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E8[0x10];                                     // 0x01E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FAnchorData GetAnchorData() const; // (Final, Native, Public, Const) // @ 0x144E5C460

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFCanvasPosReContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCanvasPosReContainer")
	}
	static class UDFCanvasPosReContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCanvasPosReContainer>();
	}
};
DUMPER7_ASSERTS_UDFCanvasPosReContainer;

// Class GPUserInterface.DFCarouselProV2ItemBase
// 0x0098 (0x06A0 - 0x0608)
class UDFCarouselProV2ItemBase final : public ULuaUIBaseView
{
public:
	uint8                                         Pad_608[0x48];                                     // 0x0608(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           OriginalColor;                                     // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PageIndex;                                         // 0x0660(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CacheSlotIndex;                                    // 0x0664(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVertical;                                       // 0x0668(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_669[0x3];                                      // 0x0669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UDFExCommonCarouselProV2> CarouselProV2;                                    // 0x066C(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_674[0x2C];                                     // 0x0674(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnClicked(int32 InPageIndex); // (Native, Event, Public, BlueprintEvent) // @ 0x144AC09B0
	void OnHover(int32 InPageIndex); // (Native, Event, Public, BlueprintEvent) // @ 0x144E5CA60
	bool OnLoadOuterData(class UDFExCommonCarouselProV2* InCarouselPro, int32 InPageIndex, int32 InCacheSlotIndex); // (Native, Event, Public, BlueprintEvent) // @ 0x144E5CAF0
	void OnPress(int32 InPageIndex); // (Native, Event, Public, BlueprintEvent) // @ 0x144E5CC00
	void OnRelease(int32 InPageIndex); // (Native, Event, Public, BlueprintEvent) // @ 0x144E5CC90
	void OnUnHover(int32 InPageIndex); // (Native, Event, Public, BlueprintEvent) // @ 0x144E5CF30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFCarouselProV2ItemBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCarouselProV2ItemBase")
	}
	static class UDFCarouselProV2ItemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCarouselProV2ItemBase>();
	}
};
DUMPER7_ASSERTS_UDFCarouselProV2ItemBase;

// Class GPUserInterface.GPUserInterfaceUtil
// 0x0000 (0x0028 - 0x0028)
class UGPUserInterfaceUtil final : public UObject
{
public:
	static bool CheckAbsolutePointInsideWidget(const class UWidget* InWidget, const struct FVector2D& AbsolutePosition, struct FVector2D* CorrectVector); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x144E81C60
	static void ClearUserFocus(uint32 UserIndex, EFocusCause ReasonFocusIsChanging); // (Final, Native, Static, Public) // @ 0x144E81DD0
	static float FindConsoleVariable_Float(const class FString& CVarStr); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E81EC0
	static int32 FindConsoleVariable_Int32(const class FString& CVarStr); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E81FE0
	static struct FSoftObjectPath GetDefaultCommon_WhiteBlock(); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x144E823B0
	static struct FVector2D GetDisplayMetrics_SlateApplication(); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x144E823F0
	static struct FVector2D GetSizeInScreen_ActiveTopLevelWindow(); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x144E82660
	static struct FVector2D GetViewportSize_ActiveTopLevelWindow(); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x144E82920
	static bool HasAnyUserFocus(uint32 UserIndex); // (Final, Native, Static, Public) // @ 0x144E82960
	static bool IsAOverlapByB(const struct FVector4& BoundingBoxA, const struct FVector4& BoundingBoxB, struct FVector2D* CorrectVector); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x144E82A70
	static bool IsSlatePostProcessorEnable(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E82BC0
	static bool IsSupportsBackbufferSampling(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E82BF0
	static bool IsThemeIDValid(const class FString& ThemeID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E82C20
	static bool IsThemeIDZero(const class FString& ThemeID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E82CE0
	static bool IsWidgetRealyEnabled(const class UWidget* InWidget, bool bDirectParent, bool bIncludeEnableState, bool bIncludeActiveState); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E82DA0
	static bool IsWidgetRealyVisible(class UWidget* InWidget); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E82EF0
	static void OverrideGUITextureAmplifiedRate(float NewValue); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E83050
	static class UUserWidget* TestAddUserWidgetPathToCanvasPanel(TSoftClassPtr<class UClass> SoftClassPtr, class UCanvasPanel* CanvasPanel_Root); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E832C0
	static void WaitUntilWidgetVisible(class UObject* WorldContextObject, class UWidget* InWidget, const struct FLatentActionInfo& LatentInfo); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x144E83590

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPUserInterfaceUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPUserInterfaceUtil")
	}
	static class UGPUserInterfaceUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPUserInterfaceUtil>();
	}
};
DUMPER7_ASSERTS_UGPUserInterfaceUtil;

// Class GPUserInterface.DFCDNImage
// 0x00A0 (0x0368 - 0x02C8)
class UDFCDNImage final : public UImage
{
public:
	struct FSoftObjectPath                        BackgroundPath;                                    // 0x02C8(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedBackground;                                   // 0x02E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CDN_Url;                                           // 0x02E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CDN_Tag;                                           // 0x02F8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompareVersion;                                   // 0x0308(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class FString& CDNUrl)> CNDSetImageFinishDelegate;           // 0x0310(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x40];                                     // 0x0320(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UCDNIconDownManager*                    CDNIconManager;                                    // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AysncLoadCallback(const class FString& FileSavePath, bool bCompareVer, bool bReDownload); // (Final, Native, Private) // @ 0x144E5C010
	void ClearCDNTexture(const class FString& ETag); // (Final, Native, Private) // @ 0x144E5C290
	void SetBackgroundData(bool NeedBackground); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D1D0
	void SetBackgroundImage(const struct FSoftObjectPath& Path, bool bAutoSize); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x144E5D260
	void SetCDNImage(const class FString& URL, bool bMatchSize, const class FString& Tag); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D510
	void SetCompareVersion(bool bNeedCompare); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D880
	void SetImage(class UObject* ImageAsset, bool bAutoResize); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5DA30
	void SetImageByDownloader(int32 HashCode, ECdnDownResult Result); // (Final, Native, Public) // @ 0x144E5DB00
	void SetLoadImage(const class FString& Path); // (Final, Native, Private) // @ 0x144E5DCE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFCDNImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCDNImage")
	}
	static class UDFCDNImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCDNImage>();
	}
};
DUMPER7_ASSERTS_UDFCDNImage;

// Class GPUserInterface.GPPersistentRootUIBase
// 0x0038 (0x0640 - 0x0608)
class UGPPersistentRootUIBase : public ULuaUIBaseView
{
public:
	uint8                                         Pad_608[0x18];                                     // 0x0608(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           UIContent;                                         // 0x0620(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USafeZone*                              UISafeZoneFrame;                                   // 0x0628(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_630[0x10];                                     // 0x0630(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddToPersistentFrameLayer(class UWidget* UIIns, int32 ZOrder, ELuaUILayer LayerType); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool AddUI(class UWidget* UIIns, int32 ZOrder, ELuaUILayer LayerType); // (Final, Native, Public, BlueprintCallable) // @ 0x144E81B60
	bool FreshSafeZone(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E82100
	void OnPersistentRootPrepared_Internal(); // (Final, Native, Private) // @ 0x140EE3BE0
	bool RemoveUI(class UWidget* UIIns); // (Final, Native, Public, BlueprintCallable) // @ 0x144E83170

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GPPersistentRootUIBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GPPersistentRootUIBase")
	}
	static class UGPPersistentRootUIBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGPPersistentRootUIBase>();
	}
};
DUMPER7_ASSERTS_UGPPersistentRootUIBase;

// Class GPUserInterface.DFCheckBox
// 0x0138 (0x0938 - 0x0800)
class UDFCheckBox final : public UCheckbox
{
public:
	EButtonClickMethod                            ClickMethod;                                       // 0x0800(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonTouchMethod                            TouchMethod;                                       // 0x0801(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EButtonPressMethod                            PressMethod;                                       // 0x0802(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_803[0x1D];                                     // 0x0803(0x001D)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ButtonID;                                          // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUncheckedClicked;                                // 0x0828(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUncheckedPressed;                                // 0x0838(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUncheckedReleased;                               // 0x0848(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUncheckedHovered;                                // 0x0858(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUncheckedUnhovered;                              // 0x0868(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCheckedClicked;                                  // 0x0878(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCheckedPressed;                                  // 0x0888(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCheckedReleased;                                 // 0x0898(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCheckedHovered;                                  // 0x08A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCheckedUnhovered;                                // 0x08B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnCheckedReleasedNoClicked;                        // 0x08C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnUncheckedReleasedNoClicked;                      // 0x08D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector2D                              PressedScale;                                      // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CheckedSoundName;                                  // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UncheckedSoundName;                                // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HoveredSoundName;                                  // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_908[0x1];                                      // 0x0908(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EGPUIFocusEffectType                          FocusEffectType;                                   // 0x0909(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90A[0x6];                                      // 0x090A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent)> OnFocusReceivedEvent; // 0x0910(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FFocusEvent& InFocusEvent)> OnFocusLostEvent;         // 0x0920(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_930[0x8];                                      // 0x0930(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EFocusCause GetLastFocusCause(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5C4E0
	void NavigationClick(); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5C880
	void SetButtonID(int64 NewButtonID); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D490
	void SetIsFocusable(bool InIsFocusable); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5DC50

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFCheckBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFCheckBox")
	}
	static class UDFCheckBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFCheckBox>();
	}
};
DUMPER7_ASSERTS_UDFCheckBox;

// Class GPUserInterface.DFClipCanvasPanel
// 0x0020 (0x01F0 - 0x01D0)
class UDFClipCanvasPanel final : public UCanvasPanel
{
public:
	class UWidget*                                ClipChild;                                         // 0x01D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSize;                                         // 0x01D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D9[0x17];                                     // 0x01D9(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetClipChild(class UWidget* InChild); // (Final, Native, Public, BlueprintCallable) // @ 0x144E5D780

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFClipCanvasPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFClipCanvasPanel")
	}
	static class UDFClipCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFClipCanvasPanel>();
	}
};
DUMPER7_ASSERTS_UDFClipCanvasPanel;

// Class GPUserInterface.FDFCommonPopWindowWidgetStyle
// 0x05C0 (0x05F0 - 0x0030)
class UFDFCommonPopWindowWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FDFCommonPopWindowStyle                CommonPopWindowStyle;                              // 0x0030(0x05C0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FDFCommonPopWindowWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FDFCommonPopWindowWidgetStyle")
	}
	static class UFDFCommonPopWindowWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFDFCommonPopWindowWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UFDFCommonPopWindowWidgetStyle;

// Class GPUserInterface.DFColorReContainer
// 0x0050 (0x01D8 - 0x0188)
class UDFColorReContainer final : public UDFContainerBase
{
public:
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0188(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LinearColorHD;                                     // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LinearColorMobile;                                 // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPlatformColor>                 ExtendedPlatformData;                              // 0x01B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C8[0x10];                                     // 0x01C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity); // (Final, BlueprintCosmetic, Native, Public, HasDefaults, BlueprintCallable) // @ 0x144E5D800

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFColorReContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFColorReContainer")
	}
	static class UDFColorReContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFColorReContainer>();
	}
};
DUMPER7_ASSERTS_UDFColorReContainer;

// Class GPUserInterface.DFColorWheel
// 0x0040 (0x0190 - 0x0150)
class UDFColorWheel final : public UWidget
{
public:
	struct FLinearColor                           SelectColor;                                       // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FLinearColor& ColorValue)> LinearColorChangeValue;    // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x20];                                     // 0x0170(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetSelectColor(const struct FLinearColor& sColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x144E5DDA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFColorWheel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFColorWheel")
	}
	static class UDFColorWheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFColorWheel>();
	}
};
DUMPER7_ASSERTS_UDFColorWheel;

// Class GPUserInterface.DFComboBoxString
// 0x0000 (0x0ED0 - 0x0ED0)
class UDFComboBoxString final : public UComboBoxString
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DFComboBoxString")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DFComboBoxString")
	}
	static class UDFComboBoxString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDFComboBoxString>();
	}
};
DUMPER7_ASSERTS_UDFComboBoxString;

// Class GPUserInterface.DFCommonAddDecHolder
// 0x0070 (0x03C8 - 0x0358)
class UDFCommonAddDecHolder final : public UDFUserWidgetBase
