#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPUserInterfaceCore

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GPResource_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameCore_structs.hpp"


namespace SDK
{

// Enum GPUserInterfaceCore.EUIState
// NumValues: 0x000B
enum class EUIState : uint8
{
	Init                                     = 0,
	Open                                     = 1,
	ShowBegin                                = 2,
	Show                                     = 3,
	HideBegin                                = 4,
	Hide                                     = 5,
	CloseBegin                               = 6,
	Close                                    = 7,
	Mute                                     = 8,
	Release                                  = 9,
	EUIState_MAX                             = 10,
};

// Enum GPUserInterfaceCore.EGPUIFocusEffectType
// NumValues: 0x0004
enum class EGPUIFocusEffectType : uint8
{
	None                                     = 0,
	SeparatedFocusEffect                     = 1,
	ShareHoverEffect                         = 2,
	EGPUIFocusEffectType_MAX                 = 3,
};

// Enum GPUserInterfaceCore.EViewDragMode
// NumValues: 0x0004
enum class EViewDragMode : uint8
{
	Normal                                   = 0,
	ValidateAngle                            = 1,
	InverseValidateAngle                     = 2,
	EViewDragMode_MAX                        = 3,
};

// Enum GPUserInterfaceCore.ETriggerDragLogic
// NumValues: 0x0003
enum class ETriggerDragLogic : uint8
{
	DistanceCheck                            = 0,
	DragPointSample                          = 1,
	ETriggerDragLogic_MAX                    = 2,
};

// Enum GPUserInterfaceCore.ELuaUIBaseViewWantedInputMode
// NumValues: 0x0005
enum class ELuaUIBaseViewWantedInputMode : uint8
{
	None                                     = 0,
	GameOnly                                 = 1,
	UIOnly                                   = 2,
	GameAndUI                                = 3,
	ELuaUIBaseViewWantedInputMode_MAX        = 4,
};

// Enum GPUserInterfaceCore.EGPUINavigationGroupType
// NumValues: 0x0005
enum class EGPUINavigationGroupType : uint8
{
	None                                     = 0,
	Stack                                    = 1,
	DefaultFocus                             = 2,
	StackAndDefaultFocus                     = 3,
	EGPUINavigationGroupType_MAX             = 4,
};

// Enum GPUserInterfaceCore.EGPUIAnalogStick
// NumValues: 0x0003
enum class EGPUIAnalogStick : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Max                                      = 2,
};

// Enum GPUserInterfaceCore.EGPUINavScrollingCondition
// NumValues: 0x0003
enum class EGPUINavScrollingCondition : uint8
{
	None                                     = 0,
	Default                                  = 1,
	EGPUINavScrollingCondition_MAX           = 2,
};

// Enum GPUserInterfaceCore.EGPUINavWidgetFocusedAction
// NumValues: 0x0004
enum class EGPUINavWidgetFocusedAction : uint8
{
	Default                                  = 0,
	Click                                    = 1,
	OnlyDPadClick                            = 2,
	EGPUINavWidgetFocusedAction_MAX          = 3,
};

// Enum GPUserInterfaceCore.EGPAnalogCursorInputMappingType
// NumValues: 0x0004
enum class EGPAnalogCursorInputMappingType : uint8
{
	SlowToFast                               = 0,
	Linear                                   = 1,
	FastToSlow                               = 2,
	EGPAnalogCursorInputMappingType_MAX      = 3,
};

// Enum GPUserInterfaceCore.EGPAnalogCursorAccelerationType
// NumValues: 0x0004
enum class EGPAnalogCursorAccelerationType : uint8
{
	SlowToFast                               = 0,
	Linear                                   = 1,
	FastToSlow                               = 2,
	EGPAnalogCursorAccelerationType_MAX      = 3,
};

// Enum GPUserInterfaceCore.EGPUINavDirection
// NumValues: 0x0004
enum class EGPUINavDirection : uint8
{
	Invalid                                  = 0,
	Next                                     = 1,
	Previous                                 = 2,
	EGPUINavDirection_MAX                    = 3,
};

// Enum GPUserInterfaceCore.EQuadrantType
// NumValues: 0x0006
enum class EQuadrantType : uint8
{
	FirstQuadrant                            = 0,
	SecondQuadrant                           = 1,
	ThirdQuadrant                            = 2,
	FourthQuadrant                           = 3,
	Invalid                                  = 4,
	EQuadrantType_MAX                        = 5,
};

// Enum GPUserInterfaceCore.EClockwiseDirection
// NumValues: 0x0004
enum class EClockwiseDirection : uint8
{
	Clockwise                                = 0,
	Counterclockwise                         = 1,
	Invalid                                  = 2,
	EClockwiseDirection_MAX                  = 3,
};

// Enum GPUserInterfaceCore.EGPUINavHittestFallbackType
// NumValues: 0x0003
enum class EGPUINavHittestFallbackType : uint8
{
	Horizental                               = 0,
	Vertical                                 = 1,
	Max                                      = 2,
};

// Enum GPUserInterfaceCore.EGPUINavGroupBestDefaultType
// NumValues: 0x0003
enum class EGPUINavGroupBestDefaultType : uint8
{
	Default                                  = 0,
	TopLeft                                  = 1,
	EGPUINavGroupBestDefaultType_MAX         = 2,
};

// Enum GPUserInterfaceCore.EGPUINavGroupTransSimpleStrategy
// NumValues: 0x0007
enum class EGPUINavGroupTransSimpleStrategy : uint8
{
	Default                                  = 0,
	Hittest                                  = 1,
	Distance                                 = 2,
	LastFocused                              = 4,
	HittestOrDistance                        = 3,
	LastFocusedOrHittestOrDistance           = 7,
	EGPUINavGroupTransSimpleStrategy_MAX     = 8,
};

// Enum GPUserInterfaceCore.EGPUINavigationDistanceType
// NumValues: 0x0005
enum class EGPUINavigationDistanceType : uint8
{
	None                                     = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Euclidean                                = 3,
	EGPUINavigationDistanceType_MAX          = 4,
};

// Enum GPUserInterfaceCore.EDynamicNavConfigPriority
// NumValues: 0x0003
enum class EDynamicNavConfigPriority : uint8
{
	UI_Stack                                 = 0,
	UI_Pop                                   = 1,
	UI_MAX                                   = 2,
};

// Enum GPUserInterfaceCore.EGPUINavigationSimulateMouseDragState
// NumValues: 0x0004
enum class EGPUINavigationSimulateMouseDragState : uint8
{
	Stop                                     = 0,
	Start                                    = 1,
	OnDraging                                = 2,
	EGPUINavigationSimulateMouseDragState_MAX = 3,
};

// Enum GPUserInterfaceCore.EGPUINavigationSimulateMouseKeyType
// NumValues: 0x0004
enum class EGPUINavigationSimulateMouseKeyType : uint8
{
	LMB                                      = 0,
	CMB                                      = 1,
	RMB                                      = 2,
	EGPUINavigationSimulateMouseKeyType_MAX  = 3,
};

// Enum GPUserInterfaceCore.EGPUINavigationEventType
// NumValues: 0x000B
enum class EGPUINavigationEventType : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Up                                       = 2,
	Down                                     = 3,
	Next                                     = 4,
	Previous                                 = 5,
	AnalogVertical                           = 6,
	AnalogHorizontal                         = 7,
	Accept                                   = 8,
	Back                                     = 9,
	EGPUINavigationEventType_MAX             = 10,
};

// Enum GPUserInterfaceCore.EGPFreeAnalogCursorKeyType
// NumValues: 0x0004
enum class EGPFreeAnalogCursorKeyType : uint8
{
	Enable                                   = 0,
	Disable                                  = 1,
	Ignore                                   = 2,
	EGPFreeAnalogCursorKeyType_MAX           = 3,
};

// Enum GPUserInterfaceCore.EGPUINavigationDynamicConfigType
// NumValues: 0x0003
enum class EGPUINavigationDynamicConfigType : uint8
{
	Override                                 = 0,
	Coexist                                  = 1,
	EGPUINavigationDynamicConfigType_MAX     = 2,
};

// Enum GPUserInterfaceCore.EGPUserOverrideAdaptType
// NumValues: 0x0004
enum class EGPUserOverrideAdaptType : uint8
{
	Auto                                     = 0,
	ForceMonitor                             = 1,
	ForceTV                                  = 2,
	EGPUserOverrideAdaptType_MAX             = 3,
};

// Enum GPUserInterfaceCore.EGPScreenAdaptType
// NumValues: 0x0004
enum class EGPScreenAdaptType : uint8
{
	Monitor                                  = 0,
	TV                                       = 1,
	TVUltra                                  = 2,
	EGPScreenAdaptType_MAX                   = 3,
};

// Enum GPUserInterfaceCore.EBackRootType
// NumValues: 0x0005
enum class EBackRootType : uint8
{
	None                                     = 0,
	Image                                    = 1,
	Media                                    = 2,
	CustomBP                                 = 3,
	EBackRootType_MAX                        = 4,
};

// Enum GPUserInterfaceCore.ELuaUILayer
// NumValues: 0x0016
enum class ELuaUILayer : uint8
{
	Sub                                      = 0,
	HUD                                      = 10,
	HUD_ScreenEffect                         = 11,
	HUD_Mark                                 = 12,
	HUD_Common                               = 13,
	HUD_Hint                                 = 14,
	HUD_Feedback                             = 15,
	HUD_Touch                                = 16,
	HUD_Popup                                = 17,
	HUD_LargePopup                           = 18,
	BackRoot                                 = 21,
	Scene                                    = 22,
	Root                                     = 23,
	Stack                                    = 24,
	Top                                      = 25,
	Loading                                  = 26,
	Pop                                      = 27,
	Tip                                      = 28,
	Mask                                     = 29,
	Admin                                    = 30,
	Watermark                                = 31,
	ELuaUILayer_MAX                          = 32,
};

// ScriptStruct GPUserInterfaceCore.GPAnalogCursorInputMappingRow
// 0x0030 (0x0040 - 0x0010)
struct FGPAnalogCursorInputMappingRow final : public FResourceBaseRow
{
public:
	EGPAnalogCursorInputMappingType               CurveType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             Curve;                                             // 0x0018(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAnalogCursorInputMappingRow;

// ScriptStruct GPUserInterfaceCore.GPAnalogCursorAccelerationRow
// 0x0030 (0x0040 - 0x0010)
struct FGPAnalogCursorAccelerationRow final : public FResourceBaseRow
{
public:
	EGPAnalogCursorAccelerationType               CurveType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UCurveFloat>             Curve;                                             // 0x0018(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPAnalogCursorAccelerationRow;

// ScriptStruct GPUserInterfaceCore.GPUINavigationGroupStackLogic
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGPUINavigationGroupStackLogic final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPUINavigationGroupStackLogic;

// ScriptStruct GPUserInterfaceCore.NavGroupStackData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FNavGroupStackData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNavGroupStackData;

// ScriptStruct GPUserInterfaceCore.GPUINavigationSortedWidgetList
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGPUINavigationSortedWidgetList final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPUINavigationSortedWidgetList;

// ScriptStruct GPUserInterfaceCore.GPUINavigationWidgetData
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FGPUINavigationWidgetData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPUINavigationWidgetData;

// ScriptStruct GPUserInterfaceCore.GPUINavHittestFallbackConfig
// 0x0003 (0x0003 - 0x0000)
struct FGPUINavHittestFallbackConfig final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOtherSweptTest;                             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPUINavigationDistanceType                   DistanceType;                                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUINavHittestFallbackConfig;

// ScriptStruct GPUserInterfaceCore.GPUINavFocusProxy
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FGPUINavFocusProxy final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPUINavFocusProxy;

// ScriptStruct GPUserInterfaceCore.GPUINavSelectorInfo
// 0x0018 (0x0018 - 0x0000)
struct FGPUINavSelectorInfo final
{
public:
	bool                                          bShowNavSelectorWidget;                            // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NavSelectorStyle;                                  // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                NavSelectorTarget;                                 // 0x0010(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUINavSelectorInfo;

// ScriptStruct GPUserInterfaceCore.GPUINavScrollInfo
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FGPUINavScrollInfo final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPUINavScrollInfo;

// ScriptStruct GPUserInterfaceCore.GPUINavGroupTransParameters
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FGPUINavGroupTransParameters final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPUINavGroupTransParameters;

// ScriptStruct GPUserInterfaceCore.GPUINavigationFocusResult
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FGPUINavigationFocusResult final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPUINavigationFocusResult;

// ScriptStruct GPUserInterfaceCore.GPUINavigationSimulateMouseKeyInfo
// 0x0020 (0x0020 - 0x0000)
struct FGPUINavigationSimulateMouseKeyInfo final
{
public:
	EGPUINavigationSimulateMouseKeyType           SimulatedMouseKey;                                 // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Key;                                               // 0x0008(0x0018)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUINavigationSimulateMouseKeyInfo;

// ScriptStruct GPUserInterfaceCore.GPUINavigationSimulateMouseKeyConfigRowHD
// 0x0010 (0x0020 - 0x0010)
struct FGPUINavigationSimulateMouseKeyConfigRowHD final : public FDescRowBase
{
public:
	TArray<struct FGPUINavigationSimulateMouseKeyInfo> KeyInfos;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUINavigationSimulateMouseKeyConfigRowHD;

// ScriptStruct GPUserInterfaceCore.GPUINavigationKeyMapping
// 0x0018 (0x0018 - 0x0000)
struct FGPUINavigationKeyMapping final
{
public:
	EGPUINavigationEventType                      EventType;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           Keys;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUINavigationKeyMapping;

// ScriptStruct GPUserInterfaceCore.GPUINavigationDynamicConfigRowHD
// 0x0018 (0x0028 - 0x0010)
struct FGPUINavigationDynamicConfigRowHD final : public FDescRowBase
{
public:
	EGPUINavigationDynamicConfigType              ConfigType;                                        // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGPUINavigationKeyMapping>      Mappings;                                          // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUINavigationDynamicConfigRowHD;

// ScriptStruct GPUserInterfaceCore.GPUINavigationConfigRowHD
// 0x0018 (0x0028 - 0x0010)
struct FGPUINavigationConfigRowHD final : public FDescRowBase
{
public:
	struct FGPUINavigationKeyMapping              Mapping;                                           // 0x0010(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUINavigationConfigRowHD;

// ScriptStruct GPUserInterfaceCore.ScreenDeviceScore
// 0x0010 (0x0010 - 0x0000)
struct FScreenDeviceScore final
{
public:
	float                                         MonitorScore;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TVScore;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Confidence;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAmbiguousZone;                                  // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FScreenDeviceScore;

// ScriptStruct GPUserInterfaceCore.ScreenDetectionWeights
// 0x001C (0x001C - 0x0000)
struct FScreenDetectionWeights final
{
public:
	float                                         SizeWeight;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PPIWeight;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResolutionFamilyWeight;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeAreaWeight;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AmbiguousZoneMinSize;                              // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AmbiguousZoneMaxSize;                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinConfidenceThreshold;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FScreenDetectionWeights;

// ScriptStruct GPUserInterfaceCore.SimpleScreenParams
// 0x0030 (0x0030 - 0x0000)
struct FSimpleScreenParams final
{
public:
	float                                         PhysicalSize;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalWidth;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalHeight;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResolutionWidth;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResolutionHeight;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                SafeAreaMargin;                                    // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         PixelDensity;                                      // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AspectRatio;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPUserOverrideAdaptType                      UserOverride;                                      // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleScreenParams;

}

