#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPUserInterface

#include "Basic.hpp"

#include "GPUserInterfaceCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GPGameInput_structs.hpp"
#include "Engine_structs.hpp"
#include "GameCore_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Enum GPUserInterface.EButtonState
// NumValues: 0x000A
enum class EButtonState : uint8
{
	Activated                                = 0,
	FocusReceived                            = 1,
	Hovered                                  = 2,
	Pressed                                  = 3,
	Deactivated                              = 4,
	DeFocusReceived                          = 5,
	DeHovered                                = 6,
	DePressed                                = 7,
	Disabled                                 = 8,
	EButtonState_MAX                         = 9,
};

// Enum GPUserInterface.ECheckButtonState
// NumValues: 0x000A
enum class ECheckButtonState : uint8
{
	Checked                                  = 0,
	CheckedFocusReceived                     = 1,
	CheckedHovered                           = 2,
	CheckedPressed                           = 3,
	Unchecked                                = 4,
	UncheckedFocusReceived                   = 5,
	UncheckedHovered                         = 6,
	UncheckedPressed                         = 7,
	Disabled                                 = 8,
	ECheckButtonState_MAX                    = 9,
};

// Enum GPUserInterface.EFilterStateType
// NumValues: 0x0004
enum class EFilterStateType : uint8
{
	NoOrder                                  = 0,
	InOrder                                  = 1,
	DeOrder                                  = 2,
	EFilterStateType_MAX                     = 3,
};

// Enum GPUserInterface.ECarouselV2ScrollDirection
// NumValues: 0x0003
enum class ECarouselV2ScrollDirection : uint8
{
	Carousel_Left                            = 0,
	Carousel_Right                           = 1,
	Carousel_MAX                             = 2,
};

// Enum GPUserInterface.ECarouselV2Curve
// NumValues: 0x0006
enum class ECarouselV2Curve : uint8
{
	Const                                    = 0,
	Linear                                   = 1,
	Quad                                     = 2,
	EaseInOutQuad                            = 3,
	Cubic                                    = 4,
	ECarouselV2Curve_MAX                     = 5,
};

// Enum GPUserInterface.ETipsTriggerReason
// NumValues: 0x0007
enum class ETipsTriggerReason : uint8
{
	Hover                                    = 0,
	Click                                    = 1,
	ClickBlankSpace                          = 2,
	Manually                                 = 3,
	OnClose                                  = 4,
	ParentHidden                             = 5,
	ETipsTriggerReason_MAX                   = 6,
};

// Enum GPUserInterface.ETipsConstrainMode
// NumValues: 0x0006
enum class ETipsConstrainMode : uint8
{
	Free                                     = 0,
	ConstrainInViewport                      = 1,
	ConstrainInTipsRoot                      = 2,
	ConstrainInWidgetByPath                  = 3,
	ConstrainInGivenWidget                   = 4,
	ETipsConstrainMode_MAX                   = 5,
};

// Enum GPUserInterface.ETipsTriggerEventMode
// NumValues: 0x0004
enum class ETipsTriggerEventMode : uint8
{
	BindNearestParent                        = 0,
	BindWidgetByPath                         = 1,
	Custom                                   = 3,
	ETipsTriggerEventMode_MAX                = 4,
};

// Enum GPUserInterface.ETipsDirection
// NumValues: 0x0005
enum class ETipsDirection : uint8
{
	Left                                     = 0,
	Top                                      = 1,
	Right                                    = 2,
	Bottom                                   = 3,
	ETipsDirection_MAX                       = 4,
};

// Enum GPUserInterface.ETipsAnchorSpace
// NumValues: 0x0004
enum class ETipsAnchorSpace : uint8
{
	Relative                                 = 0,
	SurroundingParent                        = 1,
	SurroundingByPath                        = 2,
	ETipsAnchorSpace_MAX                     = 3,
};

// Enum GPUserInterface.ETipsAttachMode
// NumValues: 0x0003
enum class ETipsAttachMode : uint8
{
	Static                                   = 0,
	Mouse                                    = 1,
	ETipsAttachMode_MAX                      = 2,
};

// Enum GPUserInterface.EDFButtonPresetStyleType
// NumValues: 0x0007
enum class EDFButtonPresetStyleType : uint8
{
	Custom                                   = 0,
	ThemeV1                                  = 1,
	ThemeV2                                  = 2,
	ThemeV3                                  = 3,
	ThemeV4                                  = 4,
	DynamicTheme                             = 5,
	EDFButtonPresetStyleType_MAX             = 6,
};

// Enum GPUserInterface.EButtonHoverAnimType
// NumValues: 0x0003
enum class EButtonHoverAnimType : uint8
{
	Parallel                                 = 0,
	Sequential                               = 1,
	EButtonHoverAnimType_MAX                 = 2,
};

// Enum GPUserInterface.EDFCheckButtonPresetStyleType
// NumValues: 0x0007
enum class EDFCheckButtonPresetStyleType : uint8
{
	Custom                                   = 0,
	ThemeV1                                  = 1,
	ThemeV2                                  = 2,
	ThemeV3                                  = 3,
	ThemeV4                                  = 4,
	DynamicTheme                             = 5,
	EDFCheckButtonPresetStyleType_MAX        = 6,
};

// Enum GPUserInterface.ECheckButtonHoverAnimType
// NumValues: 0x0003
enum class ECheckButtonHoverAnimType : uint8
{
	Parallel                                 = 0,
	Sequential                               = 1,
	ECheckButtonHoverAnimType_MAX            = 2,
};

// Enum GPUserInterface.EDFCommonPopWindowStyleType
// NumValues: 0x0005
enum class EDFCommonPopWindowStyleType : uint8
{
	Custom                                   = 0,
	ThemeV1                                  = 1,
	ThemeV2                                  = 2,
	DynamicTheme                             = 3,
	EDFCommonPopWindowStyleType_MAX          = 4,
};

// Enum GPUserInterface.ETextChecked
// NumValues: 0x0003
enum class ETextChecked : uint8
{
	Unchecked                                = 0,
	Checked                                  = 1,
	ETextChecked_MAX                         = 2,
};

// Enum GPUserInterface.EDFDefaultScrollBoxType
// NumValues: 0x0003
enum class EDFDefaultScrollBoxType : uint8
{
	None                                     = 0,
	Shared                                   = 1,
	EDFDefaultScrollBoxType_MAX              = 2,
};

// Enum GPUserInterface.EDFDefaultScrollBarType
// NumValues: 0x0006
enum class EDFDefaultScrollBarType : uint8
{
	None                                     = 0,
	Shared                                   = 1,
	Shared2                                  = 2,
	Shared3                                  = 3,
	Shared4                                  = 4,
	EDFDefaultScrollBarType_MAX              = 5,
};

// Enum GPUserInterface.EDropDownSelection
// NumValues: 0x0003
enum class EDropDownSelection : uint8
{
	Single                                   = 0,
	Multiple                                 = 1,
	EDropDownSelection_MAX                   = 2,
};

// Enum GPUserInterface.ETabType
// NumValues: 0x0004
enum class ETabType : uint8
{
	HorizontalTab                            = 0,
	VerticalTab                              = 1,
	Other                                    = 2,
	ETabType_MAX                             = 3,
};

// Enum GPUserInterface.ESizeSetting
// NumValues: 0x0006
enum class ESizeSetting : uint8
{
	TabWidth                                 = 0,
	TabHeight                                = 1,
	OptionWidth                              = 2,
	OptionHeight                             = 3,
	Other                                    = 4,
	ESizeSetting_MAX                         = 5,
};

// Enum GPUserInterface.ESizeMode
// NumValues: 0x0003
enum class ESizeMode : uint8
{
	TabSize                                  = 0,
	OptionSize                               = 1,
	ESizeMode_MAX                            = 2,
};

// Enum GPUserInterface.ETabLevel
// NumValues: 0x0003
enum class ETabLevel : uint8
{
	PrimaryTab                               = 0,
	SecondaryTab                             = 1,
	ETabLevel_MAX                            = 2,
};

// Enum GPUserInterface.ESliderCyclePosition
// NumValues: 0x0006
enum class ESliderCyclePosition : uint8
{
	ZeroPercent                              = 0,
	FiftyPercent                             = 1,
	HundredPercent                           = 2,
	Num                                      = 3,
	Invalid                                  = 4,
	ESliderCyclePosition_MAX                 = 5,
};

// Enum GPUserInterface.EFlowAnimType
// NumValues: 0x0004
enum class EFlowAnimType : uint8
{
	Normal                                   = 0,
	Weak                                     = 1,
	Custom                                   = 2,
	EFlowAnimType_MAX                        = 3,
};

// Enum GPUserInterface.EWorkingState
// NumValues: 0x0005
enum class EWorkingState : uint8
{
	Terminal                                 = 0,
	Initing                                  = 1,
	Idle                                     = 2,
	Working                                  = 3,
	EWorkingState_MAX                        = 4,
};

// Enum GPUserInterface.EDFWidgetStyleType
// NumValues: 0x0005
enum class EDFWidgetStyleType : uint8
{
	None                                     = 0,
	CommonButton                             = 1,
	CommonCheckButton                        = 2,
	CommonPopWindow                          = 3,
	EDFWidgetStyleType_MAX                   = 4,
};

// Enum GPUserInterface.EBackgroundStretchType
// NumValues: 0x0004
enum class EBackgroundStretchType : uint8
{
	None                                     = 0,
	ScaleToFill                              = 1,
	ScaleToFit                               = 2,
	EBackgroundStretchType_MAX               = 3,
};

// ScriptStruct GPUserInterface.DFComputeTextStyle
// 0x02D0 (0x02D8 - 0x0008)
struct FDFComputeTextStyle final : public FSlateWidgetStyle
{
public:
	class FText                                   ShowText;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         ComputeTextScale;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomizeStyle;                                   // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TableRowID;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FontStyleID;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TextRenderTranslation;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyCustomStyle;                                 // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        TextRawStyle;                                      // 0x0048(0x0290)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFComputeTextStyle;

// ScriptStruct GPUserInterface.DFCommonPopWindowStyle
// 0x05B8 (0x05C0 - 0x0008)
struct FDFCommonPopWindowStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateBrush                            BackgroundImage;                                   // 0x0008(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundContentImage;                            // 0x0098(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CenterImage;                                       // 0x0128(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BottomImage;                                       // 0x01B8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CloseImage;                                        // 0x0248(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFComputeTextStyle                    TitleTextStyle;                                    // 0x02D8(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   ThemePopColorKey;                                  // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefaultStyle;                                    // 0x05B8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFCommonPopWindowStyle;

// ScriptStruct GPUserInterface.PlatformCanvasPos
// 0x002C (0x002C - 0x0000)
struct FPlatformCanvasPos final
{
public:
	EGPScreenAdaptType                            ScreenAdaptType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchorData                            AnchorData;                                        // 0x0004(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformCanvasPos;

// ScriptStruct GPUserInterface.PlatformColor
// 0x0014 (0x0014 - 0x0000)
struct FPlatformColor final
{
public:
	EGPScreenAdaptType                            ScreenAdaptType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LinearColor;                                       // 0x0004(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformColor;

// ScriptStruct GPUserInterface.DFCommonTabContent
// 0x0040 (0x0040 - 0x0000)
struct FDFCommonTabContent final
{
public:
	class FText                                   TextContent;                                       // 0x0000(0x0018)(Edit, NativeAccessSpecifierPublic)
	class UPaperSprite*                           ImageContent;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ImageContentSoftPath;                              // 0x0020(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowMainTitleText;                                // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowIcon;                                         // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BlockState;                                        // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              NamedSlotVisibility;                               // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFCommonTabContent;

// ScriptStruct GPUserInterface.DropDownItemData
// 0x0038 (0x0038 - 0x0000)
struct FDropDownItemData final
{
public:
	class FText                                   KeyText;                                           // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   RightText;                                         // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bShowRightText;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDropDownItemData;

// ScriptStruct GPUserInterface.DFCommonTabGroupContent
// 0x0050 (0x0050 - 0x0000)
struct FDFCommonTabGroupContent final
{
public:
	struct FDFCommonTabContent                    MainTabContent;                                    // 0x0000(0x0040)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FDFCommonTabContent>            SubTabContents;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFCommonTabGroupContent;

// ScriptStruct GPUserInterface.PlatformInputTypeVisibility
// 0x0003 (0x0003 - 0x0000)
struct FPlatformInputTypeVisibility final
{
public:
	EGPScreenAdaptType                            ScreenAdaptType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPInputType                                  VisibilityInputType;                               // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableInputTypeVisibility;                        // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformInputTypeVisibility;

// ScriptStruct GPUserInterface.PlatformVisibility
// 0x0002 (0x0002 - 0x0000)
struct FPlatformVisibility final
{
public:
	EGPScreenAdaptType                            ScreenAdaptType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              SlateVisibility;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlatformVisibility;

// ScriptStruct GPUserInterface.DFBrushCheckStateStyle
// 0x0510 (0x0518 - 0x0008)
struct FDFBrushCheckStateStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateBrush                            Checked;                                           // 0x0008(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedFocusReceived;                              // 0x0098(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedHovered;                                    // 0x0128(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            CheckedPressed;                                    // 0x01B8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Unchecked;                                         // 0x0248(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UncheckedFocusReceived;                            // 0x02D8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UncheckedHovered;                                  // 0x0368(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UncheckedPressed;                                  // 0x03F8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Disabled;                                          // 0x0488(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFBrushCheckStateStyle;

// ScriptStruct GPUserInterface.DFRichTextStyle
// 0x02D0 (0x02D8 - 0x0008)
struct FDFRichTextStyle final : public FSlateWidgetStyle
{
public:
	class FText                                   ShowText;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         RichTextScale;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomizeStyle;                                   // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TableRowID;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   FontStyleID;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              TextRenderTranslation;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideDefaultStyle;                             // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        TextRawStyle;                                      // 0x0048(0x0290)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFRichTextStyle;

// ScriptStruct GPUserInterface.DFRichTextBlockCheckStateStyle
// 0x1998 (0x19A0 - 0x0008)
struct FDFRichTextBlockCheckStateStyle final : public FSlateWidgetStyle
{
public:
	struct FDFRichTextStyle                       Checked;                                           // 0x0008(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       CheckedFocusReceived;                              // 0x02E0(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       CheckedPressed;                                    // 0x05B8(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       CheckedHovered;                                    // 0x0890(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       Unchecked;                                         // 0x0B68(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       UncheckedFocusReceived;                            // 0x0E40(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       UncheckedPressed;                                  // 0x1118(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       UncheckedHovered;                                  // 0x13F0(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       Disabled;                                          // 0x16C8(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFRichTextBlockCheckStateStyle;

// ScriptStruct GPUserInterface.DFCommonCheckButtonStyle
// 0x23F0 (0x23F8 - 0x0008)
struct FDFCommonCheckButtonStyle final : public FSlateWidgetStyle
{
public:
	struct FDFBrushCheckStateStyle                BackGroundStateStyle;                              // 0x0008(0x0518)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFBrushCheckStateStyle                ImageIconStateStyle;                               // 0x0520(0x0518)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextBlockCheckStateStyle        MainTitleStateStyle;                               // 0x0A38(0x19A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   CheckedSoundName;                                  // 0x23D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UncheckedSoundName;                                // 0x23E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HoveredSoundName;                                  // 0x23E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsIconRevert;                                      // 0x23F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefaultStyle;                                    // 0x23F1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23F2[0x6];                                     // 0x23F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFCommonCheckButtonStyle;

// ScriptStruct GPUserInterface.DFBrushButtonStateStyle
// 0x0510 (0x0518 - 0x0008)
struct FDFBrushButtonStateStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateBrush                            Activated;                                         // 0x0008(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Hovered;                                           // 0x0098(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FocusReceived;                                     // 0x0128(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Pressed;                                           // 0x01B8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Deactivated;                                       // 0x0248(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DeHovered;                                         // 0x02D8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DeFocusReceived;                                   // 0x0368(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DePressed;                                         // 0x03F8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Disabled;                                          // 0x0488(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFBrushButtonStateStyle;

// ScriptStruct GPUserInterface.DFRichTextBlockButtonStateStyle
// 0x1998 (0x19A0 - 0x0008)
struct FDFRichTextBlockButtonStateStyle final : public FSlateWidgetStyle
{
public:
	struct FDFRichTextStyle                       Activated;                                         // 0x0008(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       FocusReceived;                                     // 0x02E0(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       Pressed;                                           // 0x05B8(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       Hovered;                                           // 0x0890(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       Deactivated;                                       // 0x0B68(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       DeFocusReceived;                                   // 0x0E40(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       DePressed;                                         // 0x1118(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       DeHovered;                                         // 0x13F0(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextStyle                       Disabled;                                          // 0x16C8(0x02D8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFRichTextBlockButtonStateStyle;

// ScriptStruct GPUserInterface.DFCommonButtonStyle
// 0x23E8 (0x23F0 - 0x0008)
struct FDFCommonButtonStyle final : public FSlateWidgetStyle
{
public:
	struct FDFBrushButtonStateStyle               BackGroundStateStyle;                              // 0x0008(0x0518)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFBrushButtonStateStyle               ImageIconStateStyle;                               // 0x0520(0x0518)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFRichTextBlockButtonStateStyle       MainTitleStateStyle;                               // 0x0A38(0x19A0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   PressedSoundName;                                  // 0x23D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HoveredSoundName;                                  // 0x23E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsIconRevert;                                      // 0x23E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefaultStyle;                                    // 0x23E9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23EA[0x6];                                     // 0x23EA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFCommonButtonStyle;

// ScriptStruct GPUserInterface.DFTextStyle
// 0x02A8 (0x02B0 - 0x0008)
struct FDFTextStyle final : public FSlateWidgetStyle
{
public:
	class FText                                   ShowText;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TextRawStyle;                                      // 0x0020(0x0290)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFTextStyle;

// ScriptStruct GPUserInterface.DFTextBlockCheckStateStyle
// 0x12D0 (0x12D8 - 0x0008)
struct FDFTextBlockCheckStateStyle final : public FSlateWidgetStyle
{
public:
	struct FDFTextStyle                           Checked;                                           // 0x0008(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           CheckedPressed;                                    // 0x02B8(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           CheckedHovered;                                    // 0x0568(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           Unchecked;                                         // 0x0818(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           UncheckedPressed;                                  // 0x0AC8(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           UncheckedHovered;                                  // 0x0D78(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           Disabled;                                          // 0x1028(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFTextBlockCheckStateStyle;

// ScriptStruct GPUserInterface.DFTextBlockButtonStateStyle
// 0x12D0 (0x12D8 - 0x0008)
struct FDFTextBlockButtonStateStyle final : public FSlateWidgetStyle
{
public:
	struct FDFTextStyle                           Activated;                                         // 0x0008(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           Pressed;                                           // 0x02B8(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           Hovered;                                           // 0x0568(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           Deactivated;                                       // 0x0818(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           DePressed;                                         // 0x0AC8(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           DeHovered;                                         // 0x0D78(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDFTextStyle                           Disabled;                                          // 0x1028(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFTextBlockButtonStateStyle;

// ScriptStruct GPUserInterface.DFRichTextConfigStyle
// 0x02A0 (0x02A8 - 0x0008)
struct FDFRichTextConfigStyle final : public FSlateWidgetStyle
{
public:
	class UDataTable*                             TextStyleSet;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideDefaultStyle;                             // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        TextRawStyle;                                      // 0x0018(0x0290)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFRichTextConfigStyle;

// ScriptStruct GPUserInterface.DFButtonStateStyle
// 0x0688 (0x0690 - 0x0008)
struct FDFButtonStateStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x298];                                      // 0x0008(0x0298)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Activated;                                         // 0x02A0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Hovered;                                           // 0x0330(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Pressed;                                           // 0x03C0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Deactivated;                                       // 0x0450(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DeHovered;                                         // 0x04E0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DePressed;                                         // 0x0570(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Disabled;                                          // 0x0600(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFButtonStateStyle;

// ScriptStruct GPUserInterface.DFScrollBarStyle
// 0x06E0 (0x06E8 - 0x0008)
struct FDFScrollBarStyle final : public FSlateWidgetStyle
{
public:
	struct FScrollBarStyle                        RawStyle;                                          // 0x0008(0x0518)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FVector2D                              ScrollbarThickness;                                // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                ScrollbarPadding;                                  // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NormalBackgroundImage;                             // 0x0538(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HoveredBackgroundImage;                            // 0x05C8(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DraggedBackgroundImage;                            // 0x0658(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDFScrollBarStyle;

// ScriptStruct GPUserInterface.WaitingInfo
// 0x0018 (0x0018 - 0x0000)
struct FWaitingInfo final
{
public:
	class UWidget*                                WaitingWidget;                                     // 0x0000(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInSafeZone;                                     // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InZOrder;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELuaUILayer                                   LayerType;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWaitingInfo;

// ScriptStruct GPUserInterface.GPUIImageConfigRow
// 0x0020 (0x0030 - 0x0010)
struct FGPUIImageConfigRow final : public FDescRowBase
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0010(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LoadGroup;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUIImageConfigRow;

// ScriptStruct GPUserInterface.GPUICommomConfigRow
// 0x00C0 (0x00D0 - 0x0010)
struct FGPUICommomConfigRow final : public FDescRowBase
{
public:
	struct FSlateBrush                            LowQualityFallbackBrush;                           // 0x0010(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Common_WhiteBlock;                                 // 0x00A0(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Common_transition;                                 // 0x00B8(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPUICommomConfigRow;

// ScriptStruct GPUserInterface.DFThemeStyleData
// 0x0020 (0x0020 - 0x0000)
struct FDFThemeStyleData final
{
public:
	struct FSoftObjectPath                        StylePath;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDFWidgetStyleType                            StyleType;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDFThemeStyleData;

// ScriptStruct GPUserInterface.TextColorDefineRow
// 0x0010 (0x0020 - 0x0010)
struct FTextColorDefineRow final : public FDescRowBase
{
public:
	struct FLinearColor                           LinearColor;                                       // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTextColorDefineRow;

// ScriptStruct GPUserInterface.ThemeItemDataRow
// 0x0060 (0x0068 - 0x0008)
struct FThemeItemDataRow final : public FTableRowBase
{
public:
	class FString                                 Key;                                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThemeID;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemID;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        RewardBgImage;                                     // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        RewardSubLevel;                                    // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThemeItemDataRow;

// ScriptStruct GPUserInterface.ThemeItemMapDataRow
// 0x0020 (0x0028 - 0x0008)
struct FThemeItemMapDataRow final : public FTableRowBase
{
public:
	class FString                                 ItemID;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThemeID;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThemeItemMapDataRow;

// ScriptStruct GPUserInterface.ThemeBundleDataRow
// 0x0040 (0x0048 - 0x0008)
struct FThemeBundleDataRow final : public FTableRowBase
{
public:
	class FString                                 BundleId;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThemeID;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OnlineTime;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OfflineTime;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThemeBundleDataRow;

// ScriptStruct GPUserInterface.ThemeMainDataRow
// 0x0140 (0x0148 - 0x0008)
struct FThemeMainDataRow final : public FTableRowBase
{
public:
	class FString                                 ThemeID;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FinalThemeState;                                   // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MainThemeTitle;                                    // 0x0020(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        MainThemeIcon;                                     // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonButtonStyleV1;                               // 0x0050(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonButtonStyleV2;                               // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonButtonStyleV3;                               // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonButtonStyleV4;                               // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonCheckButtonStyleV1;                          // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonCheckButtonStyleV2;                          // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonCheckButtonStyleV3;                          // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonCheckButtonStyleV4;                          // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        CommonPopWindowStyle;                              // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        ThemeShadowImage;                                  // 0x0128(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ThemeColorKey;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FThemeMainDataRow;

}

