#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPWeaponFSM

#include "Basic.hpp"

#include "GPWeaponDefineForPlugin_structs.hpp"


namespace SDK
{

// Enum GPWeaponFSM.EEventEnumBase
// NumValues: 0x0004
enum class EEventEnumBase : uint8
{
	EBeginJump                               = 0,
	EStartRun                                = 1,
	EOnHit                                   = 2,
	EEventEnumBase_MAX                       = 3,
};

// Enum GPWeaponFSM.EStateEnumBase
// NumValues: 0x0004
enum class EStateEnumBase : uint8
{
	EBegin                                   = 0,
	ERunning                                 = 1,
	EFinish                                  = 2,
	EStateEnumBase_MAX                       = 3,
};

// ScriptStruct GPWeaponFSM.GotoStateCmd
// 0x0020 (0x0020 - 0x0000)
struct FGotoStateCmd final
{
public:
	class FName                                   NewStateName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EventName;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGPWeaponEventDataBase                 EventObject;                                       // 0x0010(0x0008)(NativeAccessSpecifierPublic)
	bool                                          Force;                                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGotoStateCmd;

// ScriptStruct GPWeaponFSM.NameArray
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FNameArray final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNameArray;

// ScriptStruct GPWeaponFSM.RTStateTransition
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FRTStateTransition
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SourceState;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetState;                                       // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRTStateTransition;

// ScriptStruct GPWeaponFSM.RTStateTransitionEventHit
// 0x0008 (0x0020 - 0x0018)
struct FRTStateTransitionEventHit final : public FRTStateTransition
{
public:
	class FName                                   HitEventName;                                      // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRTStateTransitionEventHit;

// ScriptStruct GPWeaponFSM.RTStateTransitionSourceFinish
// 0x0000 (0x0018 - 0x0018)
struct FRTStateTransitionSourceFinish final : public FRTStateTransition
{
};
DUMPER7_ASSERTS_FRTStateTransitionSourceFinish;

// ScriptStruct GPWeaponFSM.RTStateTransitionSourceConditionFinish
// 0x0010 (0x0028 - 0x0018)
struct FRTStateTransitionSourceConditionFinish final : public FRTStateTransition
{
public:
	bool                                          bOverrideTargetState;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OverrideTargetState;                               // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRTStateTransitionSourceConditionFinish;

// ScriptStruct GPWeaponFSM.StateTransitions
// 0x0038 (0x0038 - 0x0000)
struct FStateTransitions final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRTStateTransitionEventHit>     TransEventHits;                                    // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FRTStateTransitionSourceFinish> TransSourceFinishes;                               // 0x0018(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FRTStateTransitionSourceConditionFinish> TransSourceConditionFinishes;             // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStateTransitions;

}

