#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GPWeaponRuntime

#include "Basic.hpp"

#include "GPWeaponDefineForPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GPWeaponRuntime.EProjectileTrajectoryFlag
// NumValues: 0x0008
enum class EProjectileTrajectoryFlag : uint8
{
	TrajectoryFlagNone                       = 0,
	TrajectoryFlagStart                      = 1,
	TrajectoryFlagBounce                     = 2,
	TrajectoryFlagStop                       = 3,
	TrajectoryFlagForce                      = 4,
	TrajectoryFlagMedium                     = 5,
	TrajectoryFlagZeroGravityEnd             = 6,
	EProjectileTrajectoryFlag_MAX            = 7,
};

// Enum GPWeaponRuntime.EActorPoolMethod
// NumValues: 0x0005
enum class EActorPoolMethod : uint8
{
	None                                     = 0,
	AutoRelease                              = 1,
	ManualRelease                            = 2,
	ManualRelease_OnComplete                 = 3,
	EActorPoolMethod_MAX                     = 4,
};

// Enum GPWeaponRuntime.EProjectileEvent
// NumValues: 0x0005
enum class EProjectileEvent : uint8
{
	EVENT_STOP                               = 0,
	EVENT_BOUNCE                             = 1,
	EVENT_EXPLOSION                          = 2,
	EVENT_PenetratingMedium                  = 3,
	EVENT_MAX_0                              = 4,
};

// Enum GPWeaponRuntime.EProjectileCustomReplicateRole
// NumValues: 0x0004
enum class EProjectileCustomReplicateRole : uint8
{
	None                                     = 0,
	Publisher                                = 1,
	Subscriber                               = 2,
	EProjectileCustomReplicateRole_MAX       = 3,
};

// Enum GPWeaponRuntime.EFakeBulletRole
// NumValues: 0x0004
enum class EFakeBulletRole : uint8
{
	FBRoleNone                               = 0,
	FBRoleFake                               = 1,
	FBRoleMaster                             = 2,
	EFakeBulletRole_MAX                      = 3,
};

// Enum GPWeaponRuntime.EGPWeaponEasingType
// NumValues: 0x0020
enum class EGPWeaponEasingType : uint8
{
	Linear                                   = 0,
	EaseInSine                               = 1,
	EaseOutSine                              = 2,
	EaseInOutSine                            = 3,
	EaseInQuad                               = 4,
	EaseOutQuad                              = 5,
	EaseInOutQuad                            = 6,
	EaseInCubic                              = 7,
	EaseOutCubic                             = 8,
	EaseInOutCubic                           = 9,
	EaseInQuart                              = 10,
	EaseOutQuart                             = 11,
	EaseInOutQuart                           = 12,
	EaseInQuint                              = 13,
	EaseOutQuint                             = 14,
	EaseInOutQuint                           = 15,
	EaseInExpo                               = 16,
	EaseOutExpo                              = 17,
	EaseInOutExpo                            = 18,
	EaseInCirc                               = 19,
	EaseOutCirc                              = 20,
	EaseInOutCirc                            = 21,
	EaseInBack                               = 22,
	EaseOutBack                              = 23,
	EaseInOutBack                            = 24,
	EaseInElastic                            = 25,
	EaseOutElastic                           = 26,
	EaseInOutElastic                         = 27,
	EaseInBounce                             = 28,
	EaseOutBounce                            = 29,
	EaseInOutBounce                          = 30,
	EGPWeaponEasingType_MAX                  = 31,
};

// Enum GPWeaponRuntime.EGPWeaponAnimHandIKType
// NumValues: 0x0005
enum class EGPWeaponAnimHandIKType : uint8
{
	None                                     = 0,
	Primary                                  = 1,
	Pistol                                   = 2,
	LongWeapon                               = 3,
	EGPWeaponAnimHandIKType_MAX              = 4,
};

// Enum GPWeaponRuntime.EWeaponOverrideUseAttachParentBound
// NumValues: 0x0004
enum class EWeaponOverrideUseAttachParentBound : uint8
{
	Dont_Override                            = 0,
	Force_Dont_UseAttachParentBound          = 1,
	Force_UseAttachParentBound               = 2,
	EWeaponOverrideUseAttachParentBound_MAX  = 3,
};

// Enum GPWeaponRuntime.EWeaponRepCondition
// NumValues: 0x0003
enum class EWeaponRepCondition : uint8
{
	None                                     = 0,
	Ob                                       = 1,
	EWeaponRepCondition_MAX                  = 2,
};

// Enum GPWeaponRuntime.EGPWeaponFireModeSubType
// NumValues: 0x0003
enum class EGPWeaponFireModeSubType : uint8
{
	Default                                  = 0,
	Secondary                                = 1,
	EGPWeaponFireModeSubType_MAX             = 2,
};

// Enum GPWeaponRuntime.EFiringModeContext
// NumValues: 0x0005
enum class EFiringModeContext : uint8
{
	Blueprint                                = 0,
	DataTable                                = 1,
	WeaponDesc                               = 2,
	Input                                    = 3,
	Max                                      = 4,
};

// Enum GPWeaponRuntime.EFireModeRole
// NumValues: 0x0004
enum class EFireModeRole : uint8
{
	FireModeROLE_SimulatedProxy              = 0,
	FireModeROLE_AutonomousProxy             = 1,
	FireModeROLE_Authority                   = 2,
	FireModeROLE_MAX                         = 3,
};

// Enum GPWeaponRuntime.EWeaponFuncAppearanceHideReason
// NumValues: 0x0012
enum class EWeaponFuncAppearanceHideReason : uint8
{
	None                                     = 0,
	HideAllWeapon                            = 1,
	AttachParentHidden                       = 2,
	StateHidden                              = 3,
	XPPHidden                                = 4,
	FPPAttachBack                            = 5,
	ErrorSocket                              = 6,
	FPPInteraction                           = 8,
	InPending                                = 9,
	WeaponFeatureChange                      = 10,
	Inactive                                 = 11,
	DelayVisible                             = 12,
	ReplayWorld                              = 13,
	HideAllWeapon_ByExtraTag                 = 14,
	SocketOccupied                           = 15,
	UseLeftHand                              = 16,
	SocketNotExist                           = 17,
	EWeaponFuncAppearanceHideReason_MAX      = 18,
};

// Enum GPWeaponRuntime.EGPPhysicalSurfaceGroup
// NumValues: 0x0009
enum class EGPPhysicalSurfaceGroup : uint8
{
	Default                                  = 0,
	Cement                                   = 1,
	Soil                                     = 2,
	Water                                    = 3,
	Grass                                    = 4,
	Glass                                    = 5,
	Wood                                     = 6,
	NoSurfaceEffect                          = 7,
	EGPPhysicalSurfaceGroup_MAX              = 8,
};

// Enum GPWeaponRuntime.EGPReplicatedDataOperation
// NumValues: 0x0004
enum class EGPReplicatedDataOperation : uint8
{
	EGPReplicatedDataOperation_Add           = 0,
	EGPReplicatedDataOperation_Delete        = 1,
	EGPReplicatedDataOperation_Modify        = 2,
	EGPReplicatedDataOperation_MAX           = 3,
};

// Enum GPWeaponRuntime.EWeaponThrowableUnderWaterExplosionType
// NumValues: 0x0004
enum class EWeaponThrowableUnderWaterExplosionType : uint8
{
	None                                     = 0,
	IntoWaterStartPreExp                     = 1,
	OutFromWaterStartExp                     = 2,
	EWeaponThrowableUnderWaterExplosionType_MAX = 3,
};

// Enum GPWeaponRuntime.EWeaponThrowableExplosionType
// NumValues: 0x000B
enum class EWeaponThrowableExplosionType : uint8
{
	None                                     = 0,
	Hit                                      = 1,
	Timer                                    = 2,
	Stop                                     = 3,
	Interval                                 = 4,
	Manual                                   = 5,
	HitGround                                = 6,
	HitEnemy                                 = 7,
	HitVehicle                               = 8,
	HitOrTimer                               = 9,
	EWeaponThrowableExplosionType_MAX        = 10,
};

// Enum GPWeaponRuntime.EWeaponThrowableEffectType
// NumValues: 0x0006
enum class EWeaponThrowableEffectType : uint8
{
	None                                     = 0,
	Damage                                   = 1,
	Smoke                                    = 2,
	Flash                                    = 3,
	Incendiary                               = 4,
	EWeaponThrowableEffectType_MAX           = 5,
};

// Enum GPWeaponRuntime.EPreViewRole
// NumValues: 0x0005
enum class EPreViewRole : uint8
{
	ROLE_None                                = 0,
	ROLE_SimulatedProxy                      = 1,
	ROLE_AutonomousProxy                     = 2,
	ROLE_Authority                           = 3,
	ROLE_MAX                                 = 4,
};

// Enum GPWeaponRuntime.ECharacterOwnerObserveState
// NumValues: 0x0004
enum class ECharacterOwnerObserveState : uint8
{
	ObState_None                             = 0,
	ObState_PendingOb                        = 1,
	ObState_Observed                         = 2,
	ObState_MAX                              = 3,
};

// ScriptStruct GPWeaponRuntime.GPWeaponDamageHitInfo
// 0x0020 (0x0020 - 0x0000)
struct FGPWeaponDamageHitInfo final
{
public:
	class AActor*                                 FromActor;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ToActor;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamgeAmount;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPWeaponDamageHitInfo;

// ScriptStruct GPWeaponRuntime.ActorPoolElem
// 0x0010 (0x0010 - 0x0000)
struct FActorPoolElem final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorPoolElem;

// ScriptStruct GPWeaponRuntime.GPReplicatedFloatWeaponData
// 0x0008 (0x0008 - 0x0000)
struct FGPReplicatedFloatWeaponData final
{
public:
	uint8                                         DataIndex;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DataValue;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPReplicatedFloatWeaponData;

// ScriptStruct GPWeaponRuntime.GPReplicatedFloatWeaponDataArray
// 0x0010 (0x0010 - 0x0000)
struct FGPReplicatedFloatWeaponDataArray final
{
public:
	TArray<struct FGPReplicatedFloatWeaponData>   Items;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPReplicatedFloatWeaponDataArray;

// ScriptStruct GPWeaponRuntime.ProjectileTrajectoryItem
// 0x0030 (0x0030 - 0x0000)
struct FProjectileTrajectoryItem final
{
public:
	EProjectileTrajectoryFlag                     Flag;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Time;                                              // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0008(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0014(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x0020(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EProjectileMedium                             Medium;                                            // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProjectileTrajectoryItem;

// ScriptStruct GPWeaponRuntime.ActorPool
// 0x0038 (0x0038 - 0x0000)
struct FActorPool final
{
public:
	TArray<struct FActorPoolElem>                 FreeActors;                                        // 0x0000(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         InUseActors_Auto;                                  // 0x0010(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         InUseActors_Manual;                                // 0x0020(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActorPool;

// ScriptStruct GPWeaponRuntime.ProjectileTrajectory
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FProjectileTrajectory final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProjectileTrajectory;

// ScriptStruct GPWeaponRuntime.RPGExplosionInfo
// 0x0020 (0x0020 - 0x0000)
struct FRPGExplosionInfo final
{
public:
	EPhysicalSurface                              ProjectileHitSurface;                              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitLandScape;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ExplosionPlane;                                    // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeHitVfx;                                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeExplosionInAirVfx;                            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRPGExplosionInfo;

// ScriptStruct GPWeaponRuntime.RepProjectileTrajectory
// 0x0020 (0x0020 - 0x0000)
struct FRepProjectileTrajectory final
{
public:
	TArray<struct FProjectileTrajectoryItem>      Data;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         Front;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rear;                                              // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSize;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRepProjectileTrajectory;

// ScriptStruct GPWeaponRuntime.WorldActorPool
// 0x0068 (0x0068 - 0x0000)
struct FWorldActorPool final
{
public:
	TMap<class UClass*, struct FActorPool>        WorldActorPool;                                    // 0x0000(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UWorld*                                 PoolWorld;                                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWorldActorPool;

// ScriptStruct GPWeaponRuntime.GPCircleArrayDataBase
// 0x000C (0x000C - 0x0000)
struct FGPCircleArrayDataBase final
{
public:
	int32                                         Front;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Rear;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         size;                                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPCircleArrayDataBase;

// ScriptStruct GPWeaponRuntime.GPProjectileInfo
// 0x0004 (0x0004 - 0x0000)
struct FGPProjectileInfo final
{
public:
	float                                         ReplicatedTime;                                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPProjectileInfo;

// ScriptStruct GPWeaponRuntime.ProjectileRuntimeContext
// 0x0098 (0x0098 - 0x0000)
struct FProjectileRuntimeContext final
{
public:
	class AGPProjectile*                          FakeProjectile;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPProjectile*                          MasterProjectile;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFakeProjectileReleased;                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x32];                                      // 0x0011(0x0032)(Fixing Size After Last Property [ Dumper-7 ])
	EProjectileMedium                             Medium;                                            // 0x0043(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MediumBorderLoc;                                   // 0x0044(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProjectileRuntimeContext;

// ScriptStruct GPWeaponRuntime.ProjectileConfig
// 0x0038 (0x0038 - 0x0000)
struct FProjectileConfig final
{
public:
	TSubclassOf<class USceneComponent>            ViewComponentClass;                                // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UProjectileViewMovementComponent> ViewMovementClass;                           // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeSpanOnStop;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeSpan;                                          // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTimeModify;                                 // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNetJitterBuffer;                            // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTimeModifyOnSpawn;                          // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NetJitterTolerant;                                 // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportCustomReplicate;                           // 0x0020(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCustomReplicate;                            // 0x0021(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NetRelevantDistance;                               // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStableMovement;                             // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StableMoveStep;                                    // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAccurateOptimize;                           // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FProjectileConfig;

// ScriptStruct GPWeaponRuntime.ProjectileEvent
// 0x0024 (0x0024 - 0x0000)
struct FProjectileEvent final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProjectileEvent                              Event;                                             // 0x0004(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0008(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeHitVfx;                                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeExplosionInAirVfx;                            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalRebased;                                     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProjectileMedium                             Medium;                                            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MediumNormal;                                      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProjectileEvent;

// ScriptStruct GPWeaponRuntime.GPProjectileMovementHitInfo
// 0x001C (0x001C - 0x0000)
struct FGPProjectileMovementHitInfo final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitNormal;                                         // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveTime;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPProjectileMovementHitInfo;

// ScriptStruct GPWeaponRuntime.PredictProjectilePathFixStepParams
// 0x0008 (0x0068 - 0x0060)
struct FPredictProjectilePathFixStepParams final : public FPredictProjectilePathParams
{
public:
	float                                         ProjectileCapsuleHeight;                           // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirDragFactor;                                     // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPredictProjectilePathFixStepParams;

// ScriptStruct GPWeaponRuntime.RepRPGExplosionInfo
// 0x0028 (0x0028 - 0x0000)
struct FRepRPGExplosionInfo final
{
public:
	uint64                                        Guid;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRPGExplosionInfo                      RPGExplosionInfo;                                  // 0x0008(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRepRPGExplosionInfo;

// ScriptStruct GPWeaponRuntime.RepProjectileEvent
// 0x0030 (0x0030 - 0x0000)
struct FRepProjectileEvent final
{
public:
	uint64                                        Guid;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProjectileEvent                       Event;                                             // 0x0008(0x0024)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRepProjectileEvent;

// ScriptStruct GPWeaponRuntime.RepProjectileTrajectoryItem
// 0x0038 (0x0038 - 0x0000)
struct FRepProjectileTrajectoryItem final
{
public:
	uint64                                        Guid;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProjectileTrajectoryItem              TrajectoryItem;                                    // 0x0008(0x0030)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRepProjectileTrajectoryItem;

// ScriptStruct GPWeaponRuntime.GPWeaponBitTag
// 0x0020 (0x0020 - 0x0000)
struct FGPWeaponBitTag final
{
public:
	uint64                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x18];                                       // 0x0008(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGPWeaponBitTag;

// ScriptStruct GPWeaponRuntime.WeaponBulletBaseInitParam
// 0x0128 (0x0128 - 0x0000)
struct FWeaponBulletBaseInitParam final
{
public:
	struct FVector                                BulletSpawnLoc;                                    // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               BulletSpawnRot;                                    // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                InitVelocity;                                      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitSpeed;                                         // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitSpeedFor3P;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Gravity;                                           // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedInWaterFactor;                                // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        FireId;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        BulletIndex;                                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FireTime;                                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        BulletId;                                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFakeBulletRole                               FakeBulletRole;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeDamage;                                       // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplicateTo1P;                                    // 0x005A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplicateTo3P;                                    // 0x005B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCustomReplication;                          // 0x005C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NetRelevantDistance;                               // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStableMovement;                             // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StableMoveStep;                                    // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLinearMove;                                 // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 WeaponOwner;                                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACHARACTER*                             CharacterOwner;                                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGPWeaponFireModeBase*                  FireMode;                                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExplodeAttackerValueId;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        WeaponOwnerId;                                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        VehicleId;                                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInVehicleLeanOut;                               // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPenetratedLimbs;                                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             LimbsHitResult;                                    // 0x00A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponBulletBaseInitParam;

// ScriptStruct GPWeaponRuntime.ProjectilePoolState
// 0x0004 (0x0004 - 0x0000)
struct FProjectilePoolState final
{
public:
	uint32                                        PoolStateValue;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProjectilePoolState;

// ScriptStruct GPWeaponRuntime.RepBulletInfo
// 0x003C (0x0048 - 0x000C)
struct FRepBulletInfo final : public FFastArraySerializerItem
{
public:
	int32                                         BulletIndex;                                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Instigator;                                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPWeaponBulletProjectile*              Bullet;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnBullet;                                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRepBulletInfo;

// ScriptStruct GPWeaponRuntime.RepBulletInfoArray
// 0x0010 (0x0118 - 0x0108)
struct FRepBulletInfoArray final : public FFastArraySerializer
{
public:
	TArray<struct FRepBulletInfo>                 Items;                                             // 0x0108(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRepBulletInfoArray;

// ScriptStruct GPWeaponRuntime.BulletInfo
// 0x0048 (0x0048 - 0x0000)
struct FBulletInfo final
{
public:
	int32                                         BulletIndex;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerCheck;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Instigator;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClientCheck;                                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPWeaponBulletProjectile*              Bullet;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnBullet;                                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBulletInfo;

// ScriptStruct GPWeaponRuntime.WeaponBulletTeleportMovement
// 0x00A0 (0x00A0 - 0x0000)
struct alignas(0x04) FWeaponBulletTeleportMovement final
{
public:
	uint8                                         Pad_0[0xA0];                                       // 0x0000(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponBulletTeleportMovement;

// ScriptStruct GPWeaponRuntime.WeaponBulletRuntimeContext
// 0x0090 (0x0090 - 0x0000)
struct FWeaponBulletRuntimeContext final
{
public:
	class UGPWeaponDataComponentFiring*           DCFiring;                                          // 0x0000(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LastCheckLocation;                                 // 0x0008(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasGenerateDamage;                                // 0x0014(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldMakeDamage;                                 // 0x0015(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ProjectileMaxDamageDistanceSqr;                    // 0x0018(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectileViewFadeoutDistanceSqr;                  // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnore;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>            CompsToIgnore;                                     // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x9];                                       // 0x0048(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bValid;                                            // 0x0051(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x3E];                                      // 0x0052(0x003E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponBulletRuntimeContext;

// ScriptStruct GPWeaponRuntime.WeaponBulletProjectileInitParam
// 0x0030 (0x0030 - 0x0000)
struct FWeaponBulletProjectileInitParam final
{
public:
	float                                         ReleaseDelayOnHit;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ViewHiddenDelayOnStop;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMoveByOwner;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ProjectileMaxDamageDistance;                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectileViewFadeoutDistance;                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BulletRadius;                                      // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinColCheckDistSq;                                 // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ProjectileExplosionInAirTime;                      // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ProjectileExplosionInAirAlwaysPreview;             // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActorPoolMethod                              ActorPoolMethod;                                   // 0x0029(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportPenetratingWater;                          // 0x002A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponBulletProjectileInitParam;

// ScriptStruct GPWeaponRuntime.GPWeaponBulletOnHitParams
// 0x0004 (0x0004 - 0x0000)
struct FGPWeaponBulletOnHitParams final
{
public:
	bool                                          bMakeDamage;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeHitVfx;                                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMakeExplosionInAirVfx;                            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProjectileMedium                             Medium;                                            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPWeaponBulletOnHitParams;

// ScriptStruct GPWeaponRuntime.BulletSpawnParam
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FBulletSpawnParam final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBulletSpawnParam;

// ScriptStruct GPWeaponRuntime.BulletPath
// 0x0020 (0x0020 - 0x0000)
struct FBulletPath final
{
public:
	struct FSoftObjectPath                        Path;                                              // 0x0000(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 BulletClass;                                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBulletPath;

// ScriptStruct GPWeaponRuntime.StickyInfo
// 0x0038 (0x0038 - 0x0000)
struct FStickyInfo final
{
public:
	struct FVector                                CachedRelativeLocToBone;                           // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWeaponIdentity                        CachedWeaponIdentity;                              // 0x0018(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CachedWeaponCharOwner;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSticky;                                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MarkInvalid;                                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStickyInfo;

// ScriptStruct GPWeaponRuntime.GPWeaponBulletThrowableProjectileInfo
// 0x0074 (0x0074 - 0x0000)
struct FGPWeaponBulletThrowableProjectileInfo final
{
public:
	struct FVector                                InitLocation;                                      // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitVelocity;                                      // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RotationRate;                                      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLifeTime;                                       // 0x0024(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityScale;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldBounce;                                     // 0x002C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Bounciness;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallBounciness;                                    // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CeilingBounciness;                                 // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CharacterBounciness;                               // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CharacterFriction;                                 // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeMoveDistance;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BounceVelocityStopLimited;                         // 0x004C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageDistance;                                    // 0x0050(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FullExplodeDamageDistance;                         // 0x0054(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FixedMoveFrame;                                    // 0x005C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterDragFactorLow;                                // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterDragFactorHigh;                               // 0x0064(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaterDragChangeVelocity;                           // 0x0068(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
