#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "GPWeaponRuntime_structs.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum Hall.EMainFlowCtrlType
// NumValues: 0x0003
enum class EMainFlowCtrlType : uint8
{
	MainFlowCtrl_SOL                         = 0,
	MainFlowCtrl_MP                          = 1,
	MainFlowCtrl_MAX                         = 2,
};

// Enum Hall.EHallDisplayTargetType
// NumValues: 0x0008
enum class EHallDisplayTargetType : uint8
{
	None                                     = 0,
	Character                                = 1,
	Item                                     = 2,
	Weapon                                   = 3,
	Vehicle                                  = 4,
	WeaponPendant                            = 5,
	SafeBox                                  = 6,
	EHallDisplayTargetType_MAX               = 7,
};

// Enum Hall.EHallCharacterAnim
// NumValues: 0x0017
enum class EHallCharacterAnim : uint8
{
	PrevAnim0                                = 0,
	PrevAnim1                                = 1,
	PrevAnim2                                = 2,
	PrevAnim3                                = 3,
	PrevAnim4                                = 4,
	PrevAnim5                                = 5,
	PrevAnim6                                = 6,
	PrevAnim7                                = 7,
	PrevAnim8                                = 8,
	PrevAnim9                                = 9,
	PrevAnim10                               = 10,
	PrevAnim11                               = 11,
	PrevAnim12                               = 12,
	PrevAnim13                               = 13,
	PrevAnim14                               = 14,
	PrevAnim15                               = 15,
	PrevAnim16                               = 16,
	PrevAnim17                               = 17,
	PrevAnim18                               = 18,
	PrevAnim19                               = 19,
	PrevAnim20                               = 20,
	PrevAnim21                               = 21,
	EHallCharacterAnim_MAX                   = 22,
};

// Enum Hall.EPrevAnimHallCharacter
// NumValues: 0x001A
enum class EPrevAnimHallCharacter : uint8
{
	PrevAnimCharacter0                       = 0,
	PrevAnimCharacter1                       = 1,
	PrevAnimCharacter2                       = 2,
	PrevAnimCharacter3                       = 3,
	PrevAnimCharacter4                       = 4,
	PrevAnimCharacter5                       = 5,
	PrevAnimCharacter6                       = 6,
	PrevAnimCharacter7                       = 7,
	PrevAnimCharacter8                       = 8,
	PrevAnimCharacter9                       = 9,
	PrevAnimCharacter10                      = 10,
	PrevAnimCharacter11                      = 11,
	PrevAnimCharacter12                      = 12,
	PrevAnimCharacter13                      = 13,
	PrevAnimCharacter14                      = 14,
	PrevAnimCharacter15                      = 15,
	PrevAnimCharacter16                      = 16,
	PrevAnimCharacter17                      = 17,
	PrevAnimCharacter18                      = 18,
	PrevAnimCharacter19                      = 19,
	PrevAnimCharacter20                      = 20,
	PrevAnimCharacter21                      = 21,
	PrevAnimCharacter22                      = 22,
	PrevAnimCharacter23                      = 23,
	PrevAnimCharacter24                      = 24,
	EPrevAnimHallCharacter_MAX               = 25,
};

// Enum Hall.ELoadLevelStateSeq
// NumValues: 0x0004
enum class ELoadLevelStateSeq : uint8
{
	ELoadLevelStateSequence                  = 0,
	ELoadLevelStateAvatar                    = 1,
	ELoadLevelStateFinish                    = 2,
	ELoadLevelStateSeq_MAX                   = 3,
};

// Enum Hall.EMagicTowerRoleType
// NumValues: 0x0005
enum class EMagicTowerRoleType : uint8
{
	None                                     = 0,
	Item                                     = 1,
	Monster                                  = 2,
	NPC                                      = 3,
	EMagicTowerRoleType_MAX                  = 4,
};

// Enum Hall.EHallDisplayTouchType
// NumValues: 0x0004
enum class EHallDisplayTouchType : uint8
{
	None                                     = 0,
	OneFingerTouch                           = 1,
	TwoFingerTouch                           = 2,
	EHallDisplayTouchType_MAX                = 3,
};

// Enum Hall.EHallRotationType
// NumValues: 0x0004
enum class EHallRotationType : uint8
{
	None                                     = 0,
	Character                                = 1,
	Camera                                   = 2,
	EHallRotationType_MAX                    = 3,
};

// Enum Hall.EHallDisplayType
// NumValues: 0x000F
enum class EHallDisplayType : uint8
{
	None                                     = 0,
	Mall                                     = 1,
	Individual                               = 2,
	BattlePass                               = 3,
	Activity                                 = 4,
	Collection                               = 5,
	LevelUnlock                              = 6,
	Blueprint                                = 7,
	Capture2D                                = 8,
	Resever1                                 = 91,
	Resever2                                 = 92,
	Resever3                                 = 93,
	Resever4                                 = 94,
	Resever5                                 = 95,
	EHallDisplayType_MAX                     = 96,
};

// Enum Hall.EHallCharacterLevelSequenceState
// NumValues: 0x0007
enum class EHallCharacterLevelSequenceState : uint8
{
	None                                     = 0,
	Loading                                  = 1,
	Loaded                                   = 2,
	Processing                               = 3,
	Finished                                 = 4,
	Done                                     = 5,
	EHallCharacterLevelSequenceState_MAX     = 6,
};

// Enum Hall.EHallCameraTouchType
// NumValues: 0x0004
enum class EHallCameraTouchType : uint8
{
	None                                     = 0,
	OneFingerTouch                           = 1,
	TwoFingerTouch                           = 2,
	EHallCameraTouchType_MAX                 = 3,
};

// Enum Hall.EHallCharacterDisplayStage
// NumValues: 0x000F
enum class EHallCharacterDisplayStage : uint8
{
	Nothing                                  = 0,
	HallNormal                               = 1,
	Hall_Hero                                = 2,
	Deposit                                  = 3,
	RoleInfo                                 = 4,
	HeroDisplay                              = 5,
	SettlementSucceed_Stage1                 = 6,
	SettlementSucceed_Stage2                 = 7,
	SettlementSucceed_Stage2_Team            = 8,
	SettlementSucceed_Stage3                 = 9,
	SettlementFailed_Stage1                  = 10,
	SettlementFailed_Stage2                  = 11,
	SettlementFailed_Stage2_Team             = 12,
	IrisPreparation                          = 13,
	EHallCharacterDisplayStage_MAX           = 14,
};

// Enum Hall.EHallMainDisplayType
// NumValues: 0x002A
enum class EHallMainDisplayType : uint8
{
	None                                     = 0,
	Main                                     = 1,
	Team                                     = 2,
	Equip                                    = 3,
	Depository                               = 4,
	Profile                                  = 5,
	Hero                                     = 6,
	Fashion                                  = 7,
	Fashion_Head                             = 8,
	Fashion_Upper                            = 9,
	Fashion_Lower                            = 10,
	Fashion_Bag                              = 11,
	Fashion_Overview                         = 12,
	Weapon                                   = 13,
	Settlement_Succeed                       = 14,
	Settlement_Succeed_Stage2                = 15,
	Settlement_Succeed_Team_Near             = 16,
	Settlement_Succeed_Team_Far              = 17,
	Settlement_Failed                        = 18,
	Settlement_Failed_Team                   = 19,
	TakingSupplies                           = 20,
	TakingMedicine                           = 21,
	HeroHallInSeq                            = 22,
	IrisPreparation                          = 23,
	Weapon_Item1                             = 24,
	BattleFieldInTeamPrepare                 = 25,
	BattleFieldInTeam                        = 26,
	CrackedSettlementMVP1                    = 27,
	CrackedSettlementMVP2                    = 28,
	CrackedSettlementMVP3                    = 29,
	CrackedSettlementMVP4                    = 30,
	CrackedSettlementTeam                    = 31,
	CrackedSettlementMVP1Moving              = 32,
	CrackedSettlementMVP2Moving              = 33,
	CrackedSettlementMVP3Moving              = 34,
	CrackedSettlementMVP4Moving              = 35,
	CrackedSettlementTeamMoving              = 36,
	WeaponZoom                               = 37,
	WeaponZoom_2                             = 38,
	Equip2                                   = 39,
	EquipMedicine                            = 40,
	EHallMainDisplayType_MAX                 = 41,
};

// Enum Hall.ELoadLevelState
// NumValues: 0x0006
enum class ELoadLevelState : uint8
{
	ELoadLevelStateInit                      = 0,
	ELoadLevelStateUnLoadPre                 = 1,
	ELoadLevelStateLoad                      = 2,
	ELoadLevelStateFinish                    = 3,
	ELoadLevelStateNeedRefresh               = 4,
	ELoadLevelState_MAX                      = 5,
};

// Enum Hall.ELoadLevelOpType
// NumValues: 0x0003
enum class ELoadLevelOpType : uint8
{
	ELoadLevelOpType_Load                    = 0,
	ELoadLevelOpType_Unload                  = 1,
	ELoadLevelOpType_MAX                     = 2,
};

// Enum Hall.ETransformType
// NumValues: 0x0003
enum class ETransformType : uint8
{
	Transform                                = 0,
	Attach                                   = 1,
	ETransformType_MAX                       = 2,
};

// Enum Hall.EMandelBrickStatus
// NumValues: 0x0006
enum class EMandelBrickStatus : uint8
{
	MandelBrickStatus_UnOpen                 = 0,
	MandelBrickStatus_Openning70             = 1,
	MandelBrickStatus_Openning85             = 2,
	MandelBrickStatus_Openning100            = 3,
	MandelBrickStatus_Opened                 = 4,
	MandelBrickStatus_MAX                    = 5,
};

// Enum Hall.EMoveDir
// NumValues: 0x0006
enum class EMoveDir : uint8
{
	None                                     = 0,
	MoveUp                                   = 1,
	MoveDown                                 = 2,
	MoveLeft                                 = 3,
	MoveRight                                = 4,
	EMoveDir_MAX                             = 5,
};

// Enum Hall.EHallCharacterAnimStateMechineType
// NumValues: 0x0007
enum class EHallCharacterAnimStateMechineType : uint8
{
	Default                                  = 0,
	Equip                                    = 1,
	Hero                                     = 2,
	Team                                     = 3,
	CrackedSettlement                        = 4,
	MainFlowHall                             = 5,
	EHallCharacterAnimStateMechineType_MAX   = 6,
};

// Enum Hall.EHallTeamDisplayStage
// NumValues: 0x0003
enum class EHallTeamDisplayStage : uint8
{
	Normal                                   = 0,
	Settlement                               = 1,
	EHallTeamDisplayStage_MAX                = 2,
};

// Enum Hall.EMatchCtrlType
// NumValues: 0x0003
enum class EMatchCtrlType : uint8
{
	SOL_MatchCtrl                            = 0,
	MP_MatchCtrl                             = 1,
	EMatchCtrlType_MAX                       = 2,
};

// Enum Hall.EMiniWorldType
// NumValues: 0x0003
enum class EMiniWorldType : uint8
{
	Operator                                 = 0,
	Match                                    = 1,
	EMiniWorldType_MAX                       = 2,
};

// Enum Hall.ETransformRule
// NumValues: 0x0003
enum class ETransformRule : uint8
{
	Absolute                                 = 0,
	Relative                                 = 1,
	ETransformRule_MAX                       = 2,
};

// Enum Hall.ESandBoxMapModeType
// NumValues: 0x0008
enum class ESandBoxMapModeType : uint8
{
	None                                     = 0,
	SafeHouse                                = 1,
	SOL                                      = 2,
	SOLHighValue                             = 3,
	RaidSimple                               = 4,
	RaidNormal                               = 5,
	RaidHard                                 = 6,
	ESandBoxMapModeType_MAX                  = 7,
};

// Enum Hall.ESandBoxMapCameraTransitionMode
// NumValues: 0x0006
enum class ESandBoxMapCameraTransitionMode : uint8
{
	None                                     = 0,
	TopToPOI                                 = 1,
	POIToTop                                 = 2,
	POIToPOI                                 = 3,
	CurToLock                                = 4,
	ESandBoxMapCameraTransitionMode_MAX      = 5,
};

// Enum Hall.ESandBoxMapState
// NumValues: 0x000C
enum class ESandBoxMapState : uint8
{
	None                                     = 0,
	Locked                                   = 1,
	UnLock                                   = 2,
	Selected                                 = 3,
	Unselect                                 = 4,
	LockedToUnlock                           = 5,
	LockedToSelected                         = 6,
	UnlockToSelected                         = 7,
	SelectedToLocked                         = 8,
	SelectedToUnlock                         = 9,
	UnlockToLocked                           = 10,
	ESandBoxMapState_MAX                     = 11,
};

// ScriptStruct Hall.HallCharacterMotionInfo
// 0x0168 (0x0168 - 0x0000)
struct FHallCharacterMotionInfo final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseStartPosition;                                 // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartPosition;                                     // 0x0004(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetPosition;                                    // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     MovementCurve;                                     // 0x0020(0x00A0)(Edit, NativeAccessSpecifierPublic)
	float                                         TargetRelativeYaw;                                 // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     RotationCurve;                                     // 0x00C8(0x00A0)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallCharacterMotionInfo;

// ScriptStruct Hall.MainFlowSeqInfo
// 0x0040 (0x0040 - 0x0000)
struct FMainFlowSeqInfo final
{
public:
	struct FSoftObjectPath                        SeqPath;                                           // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class ALevelSequenceActor>     SeqActor;                                          // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMainFlowSeqInfo;

// ScriptStruct Hall.PositionConfig
// 0x0010 (0x0010 - 0x0000)
struct FPositionConfig final
{
public:
	bool                                          bEnableChangePosition;                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetPosition;                                    // 0x0004(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPositionConfig;

// ScriptStruct Hall.HallDisplayInfoBase
// 0x0050 (0x0050 - 0x0000)
struct FHallDisplayInfoBase final
{
public:
	TWeakObjectPtr<class ACameraActor>            CameraDefault;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            CameraNear;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            CameraFar;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            CameraStart;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraSpeed;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraTime;                                        // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPWeaponEasingType                           CameraSpeedEasingType;                             // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHallDisplayTargetType                        DisplayTargetType;                                 // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LockMoveStartTargetAlpha;                          // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSupportCameraRollback : 1;                        // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraRollbackSpeed;                               // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CameraReboundEnable;                               // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraReboundYawRange;                             // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraReboundPitchRange;                           // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         radius;                                            // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExpandScale;                                       // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallDisplayInfoBase;

// ScriptStruct Hall.HallCharacterProxy
// 0x0060 (0x0060 - 0x0000)
struct FHallCharacterProxy final
{
public:
	class AHallCharacter*                         SpawnedHallCharacter;                              // 0x0000(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHallCharacterAppearanceProxyComponent* CharacterAppearanceComp;                           // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<ECharacterAvatarPart, class USkeletalMeshComponent*> SkMeshCompCache;                       // 0x0010(0x0050)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallCharacterProxy;

// ScriptStruct Hall.HallCharacterIKInfo
// 0x00C0 (0x00C0 - 0x0000)
struct FHallCharacterIKInfo final
{
public:
	bool                                          bForbidLeftHandIK;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LeftHandIKTransform;                               // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimSequence*                          LeftHandIKPose;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForbidRightHandIK;                                // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RightHandIKTransform;                              // 0x0050(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimSequence*                          RightHandIKPose;                                   // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x11];                                      // 0x0088(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	EAdapterItemType                              HandIKTargetAdapterType;                           // 0x0099(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x16];                                      // 0x009A(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 LeftHandIKTargetAdapter;                           // 0x00B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 RightHandIKTargetAdapter;                          // 0x00B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallCharacterIKInfo;

// ScriptStruct Hall.HallCharacterSpawnInfo
// 0x0018 (0x0018 - 0x0000)
struct FHallCharacterSpawnInfo final
{
public:
	class FString                                 CharacterID;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  SpawnPoint;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallCharacterSpawnInfo;

// ScriptStruct Hall.HallWeaponAnimInfo
// 0x0048 (0x0048 - 0x0000)
struct FHallWeaponAnimInfo final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        LoadedAnimations;                                  // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x28];                                      // 0x0020(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHallWeaponAnimInfo;

// ScriptStruct Hall.HallUsingWeaponAnim
// 0x0148 (0x0148 - 0x0000)
struct FHallUsingWeaponAnim final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      IdleAnim;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      IdleFaceAnim;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ReadyAnim;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Idle2ReadyAnim;                                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Ready2IdleAnim;                                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      PlayingAnim;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      GetWeaponAnim;                                     // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      IdleShowAnim;                                      // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      IdleShowFaceAnim;                                  // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ArmorStartShowAnim;                                // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ArmorLoopShowAnim;                                 // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      ArmorStopShowAnim;                                 // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementIdle1Anim;                               // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementIdle2Anim;                               // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementIdle3Anim;                               // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementIdle4Anim;                               // 0x0090(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementWalk1Anim;                               // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementWalk2Anim;                               // 0x00A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementWalk3Anim;                               // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementWalk4Anim;                               // 0x00B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementShowAnim;                                // 0x00B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamWalk1Anim;                           // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamWalk2Anim;                           // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamWalk3Anim;                           // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamWalk4Anim;                           // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamIdle1Anim;                           // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamIdle2Anim;                           // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamIdle3Anim;                           // 0x00F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      SettlementTeamIdle4Anim;                           // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallIdle1Anim;                             // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallIdle2Anim;                             // 0x0108(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallIdle3Anim;                             // 0x0110(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallIdle4Anim;                             // 0x0118(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallShow1Anim;                             // 0x0120(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallShow2Anim;                             // 0x0128(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallShow3Anim;                             // 0x0130(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      MainFlowHallShow4Anim;                             // 0x0138(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPlayingAnim;                                   // 0x0140(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHallUsingWeaponAnim;

// ScriptStruct Hall.LoadLevelContext
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FLoadLevelContext final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadLevelContext;

// ScriptStruct Hall.MandelBrick
// 0x0028 (0x0028 - 0x0000)
struct FMandelBrick final
{
public:
	class AStaticMeshActor*                       MandelActor;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               EmissionEffectMaterial;                            // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ThresHold;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemQuality;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMandelBrickStatus                            MandelBrickStatus;                                 // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMandelBrick;

// ScriptStruct Hall.LuckyNestSeqInfo
// 0x0040 (0x0040 - 0x0000)
struct FLuckyNestSeqInfo final
{
public:
	struct FSoftObjectPath                        SeqPath;                                           // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class ALevelSequenceActor>     SeqActor;                                          // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLuckyNestSeqInfo;

// ScriptStruct Hall.CameraManagerParams
// 0x001C (0x001C - 0x0000)
struct alignas(0x04) FCameraManagerParams final
{
public:
	uint8                                         Pad_0[0x1C];                                       // 0x0000(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraManagerParams;

// ScriptStruct Hall.HallCharacterDisplayStageInfo
// 0x0188 (0x0188 - 0x0000)
struct FHallCharacterDisplayStageInfo final
{
public:
	class FString                                 DisplayCharacterID;                                // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AHallCharacter>             CharacterClass;                                    // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  SpawnPoint;                                        // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHallCharacterMotionInfo               MotionInfo;                                        // 0x0020(0x0168)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallCharacterDisplayStageInfo;

// ScriptStruct Hall.HallMainDisplayInfo
// 0x004C (0x004C - 0x0000)
struct FHallMainDisplayInfo final
{
public:
	TWeakObjectPtr<class ACameraActor>            CameraDefault;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            CameraNear;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            CameraFar;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            CameraStart;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraSpeed;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPWeaponEasingType                           CameraSpeedEasingType;                             // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LockMoveStartTargetAlpha;                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSupportCameraRollback : 1;                        // 0x002C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraRollbackSpeed;                               // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CameraReboundEnable;                               // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraReboundYawRange;                             // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraReboundPitchRange;                           // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CamerePostProcessEnable;                           // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         radius;                                            // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallMainDisplayInfo;

// ScriptStruct Hall.HallSettlementSnapshotCandidate
// 0x0020 (0x0020 - 0x0000)
struct FHallSettlementSnapshotCandidate final
{
public:
	class AHallCharacter*                         CHARACTER;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneCaptureComponent2D*               SceneCaptureComponent;                             // 0x0010(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialBillboardComponent*            MaterialBillboardComponent;                        // 0x0018(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHallSettlementSnapshotCandidate;

// ScriptStruct Hall.UIFollowInfo
// 0x0010 (0x0010 - 0x0000)
struct FUIFollowInfo final
{
public:
	TWeakObjectPtr<class UUserWidget>             UserWidget;                                        // 0x0000(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  TargetPos;                                         // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUIFollowInfo;

// ScriptStruct Hall.SandBoxMapCamConfig
// 0x0030 (0x0030 - 0x0000)
struct FSandBoxMapCamConfig final
{
public:
	TWeakObjectPtr<class AActor>                  TargetPos;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            TargetCamera;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class AActor>>          SubLevels;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class ULevelSequence*                         POIToDetailSeq;                                    // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelSequence*                         DetailToPOISeq;                                    // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSandBoxMapCamConfig;

}

