#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Hall_structs.hpp"
#include "GPWeaponRuntime_structs.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "GPAudioRuntime_structs.hpp"
#include "InputCore_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// Class Hall.HallDisplayCtrlBase
// 0x0018 (0x0388 - 0x0370)
class AHallDisplayCtrlBase : public AActor
{
public:
	class FName                                   HallDisplayTypeStr;                                // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         fPureModeAspectRatio;                              // 0x0378(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37C[0xC];                                      // 0x037C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleItemRotation(); // (Native, Public) // @ 0x141009910
	void HandleRotationByGamepad(const struct FVector2D& RotationVertor); // (Native, Public, HasDefaults) // @ 0x14AFEB370
	void HandleScaleByGamepad(float InValue); // (Native, Public) // @ 0x14AFEB3F0
	void OnDisplayCtrlInit(); // (Native, Public) // @ 0x141006B20
	void OnDisplayCtrlUnInit(); // (Native, Public) // @ 0x1410000F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallDisplayCtrlBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallDisplayCtrlBase")
	}
	static class AHallDisplayCtrlBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallDisplayCtrlBase>();
	}
};
DUMPER7_ASSERTS_AHallDisplayCtrlBase;

// Class Hall.HallSecretServiceCtrl
// 0x00C8 (0x0450 - 0x0388)
class AHallSecretServiceCtrl final : public AHallDisplayCtrlBase
{
public:
	class UHallCameraCtrlComponentBase*           CameraCtrlComponent;                               // 0x0388(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FHallDisplayInfoBase> DisplayInfoMap;                                   // 0x0390(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, class ALevelSequenceActor*> LevelSequenceActors;                             // 0x03E0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_430[0x20];                                     // 0x0430(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayCurrentSequence(const class FString& InSeqName); // (Final, Native, Public) // @ 0x14B005050
	void ResetType(); // (Final, Native, Public) // @ 0x14B0052D0
	void SetDisplayType(const class FString& InDisplayType); // (Final, Native, Public, BlueprintCallable) // @ 0x14B0053D0
	void StopSequence(const class FString& InSeqName); // (Final, Native, Public) // @ 0x14B005C80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallSecretServiceCtrl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallSecretServiceCtrl")
	}
	static class AHallSecretServiceCtrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallSecretServiceCtrl>();
	}
};
DUMPER7_ASSERTS_AHallSecretServiceCtrl;

// Class Hall.HallArmoryDisplayCtrl
// 0x01C8 (0x0550 - 0x0388)
class AHallArmoryDisplayCtrl final : public AHallDisplayCtrlBase
{
public:
	class UHallWeaponDisplayComponent*            HallWeaponDisplayComponent;                        // 0x0388(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallCameraCtrlComponentBase*           CameraCtrlComponent;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallGeneralRotateComponent*            GeneralRotateComponent;                            // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallItemDisplayComponent*              ItemDisplayComponent;                              // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x18];                                     // 0x03A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TouchedActor;                                      // 0x03C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         FogActors;                                         // 0x03C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D8[0x90];                                     // 0x03D8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                BoardBGMatPaths;                                   // 0x0468(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FHallDisplayInfoBase> DisplayInfoMap;                                 // 0x0478(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCanInteract;                                      // 0x04C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bTouchPressed)> OnTouchPressedSignature;                      // 0x04D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bMelee)>   OnWeaponDisplayedSignature;                        // 0x04E0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bReboundEnable;                                    // 0x04F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWeaponItemType, int32>                  WeaponTypeMaxScaleMap;                             // 0x04F8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bModifyCameraScaleEnable;                          // 0x0548(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ZoomSensitivity;                                   // 0x054C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void DestroyItem(); // (Final, Native, Public) // @ 0x14AFE2590
	class AActor* GetDisplayTargetActor(); // (Final, Native, Public) // @ 0x14AFE2770
	TMulticastInlineDelegate<void(bool bTouchPressed)> GetOnTouchPressed(); // (Final, Native, Public) // @ 0x14AFE2950
	class AActor* GetWeaponActor(); // (Final, Native, Public) // @ 0x14AFE2A10
	void OnDisplayWeaponSet(bool bIsMelee); // (Final, Native, Public) // @ 0x14AFE2BE0
	void ResetWeapon(); // (Final, Native, Public) // @ 0x14AFE2FD0
	void SetCanInteractState(bool InCanInteract); // (Final, Native, Public) // @ 0x14AFE3300
	void SetDisplayItem(const class FString& InItemID); // (Final, Native, Public) // @ 0x14AFE3770
	void SetDisplayType(const class FString& InDisplayType); // (Final, Native, Public) // @ 0x14AFE39B0
	void SetDisplayWeapon(class UModularWeaponDesc* WeaponDesc, uint64 WeaponID, bool IsMeleeWeapon, bool bSwitchCameraEnabled); // (Final, Native, Public) // @ 0x14AFE3BF0
	void SetDisplayWeaponAutoBoundAdapter(class UModularWeaponDesc* WeaponDesc, uint64 WeaponID, bool bSwitchCameraEnabled, bool IsMeleeWeapon); // (Final, Native, Public) // @ 0x14AFE3E40
	void SetEnableTrans(bool bEnableTrans); // (Final, Native, Public) // @ 0x14AFE3F90
	void SetIsAdapter(bool IsAdapter); // (Final, Native, Public) // @ 0x14AFE41C0
	void SetReboundActive(bool bReboundActive); // (Final, Native, Public) // @ 0x14AFE4650
	void SetScaleMinAndMax(float Min, float Max); // (Final, Native, Public) // @ 0x14AFE4770
	void SetUseBowWeapon(bool isUseBowWeapon); // (Final, Native, Public) // @ 0x14AFE49B0
	void SetWheelInteract(bool InCanInteract); // (Final, Native, Public) // @ 0x14AFE4B60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallArmoryDisplayCtrl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallArmoryDisplayCtrl")
	}
	static class AHallArmoryDisplayCtrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallArmoryDisplayCtrl>();
	}
};
DUMPER7_ASSERTS_AHallArmoryDisplayCtrl;

// Class Hall.HallBattlePassDisplayCtrl
// 0x00A0 (0x0428 - 0x0388)
class AHallBattlePassDisplayCtrl final : public AHallDisplayCtrlBase
{
public:
	class UHallCameraCtrlComponentBase*           CameraCtrlComponent;                               // 0x0388(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallWeaponDisplayComponent*            WeaponDisplayComponent;                            // 0x0390(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallItemDisplayComponent*              BreastPlateDisplayComponent;                       // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallItemDisplayComponent*              BagDisplayComponent;                               // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallItemDisplayComponent*              ChestHangingDisplayComponent;                      // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallItemDisplayComponent*              ItemDisplayComponentPendant;                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallItemDisplayComponent*              ItemDisplayComponentHelmet;                        // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallItemDisplayComponent*              ItemDisplayComponentMedicine;                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHallSceneVideoPlayerComponent*         VideoDisplayComponent;                             // 0x03C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FHallDisplayInfoBase> DisplayInfoMap;                                   // 0x03D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DestroyItemHelmet(); // (Final, Native, Public) // @ 0x14AFE25B0
	void DestroyItemMedicine(); // (Final, Native, Public) // @ 0x14AFE25D0
	class FString GetDisplayType(); // (Final, Native, Public) // @ 0x14AFE27A0
	void PlayVideo(const class FString& InMediaID); // (Final, Native, Public) // @ 0x14AFE2D80
	void SetActorHiddenInGameByTag(const class FString& sTag, bool bVisible); // (Final, Native, Public) // @ 0x14AFE2FF0
	void SetDisplayBag(uint64 InItemID); // (Final, Native, Public) // @ 0x14AFE35F0
	void SetDisplayBreastPlate(uint64 InItemID); // (Final, Native, Public) // @ 0x14AFE3670
	void SetDisplayChestHanging(uint64 InItemID); // (Final, Native, Public) // @ 0x14AFE36F0
	void SetDisplayItemHelmet(uint64 InItemID); // (Final, Native, Public) // @ 0x14AFE3830
	void SetDisplayItemMedicinel(uint64 InItemID); // (Final, Native, Public) // @ 0x14AFE38B0
	void SetDisplayItemPendant(uint64 InItemID); // (Final, Native, Public) // @ 0x14AFE3930
	void SetDisplayType(const class FString& DisplayType); // (Final, Native, Public) // @ 0x14AFE3AD0
	void SetDisplayWeapon(class UModularWeaponDesc* WeaponDesc, bool IsMeleeWeapon, int64 UINameID); // (Final, Native, Public) // @ 0x14AFE3D40
	void StopVideo(); // (Final, Native, Public) // @ 0x14AFE4C30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallBattlePassDisplayCtrl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallBattlePassDisplayCtrl")
	}
	static class AHallBattlePassDisplayCtrl* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallBattlePassDisplayCtrl>();
	}
};
DUMPER7_ASSERTS_AHallBattlePassDisplayCtrl;

// Class Hall.HallSurroundingCtrlComponent
// 0x0058 (0x0150 - 0x00F8)
class UHallSurroundingCtrlComponent final : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AStaticMeshActor>        BgPlate;                                           // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AStaticMeshActor>        FloorPlate;                                        // 0x0108(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             BgPlateMats;                                       // 0x0110(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AStaticMeshActor>        BgFog;                                             // 0x0120(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             BgFogMats;                                         // 0x0128(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         DistanceFromBgToCamera;                            // 0x0138(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          HallFogEffects;                                    // 0x0140(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	void SetBgTexFromImg(class AStaticMeshActor* BgActor, class UImage* Image); // (Final, Native, Public, BlueprintCallable) // @ 0x14B005310

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallSurroundingCtrlComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallSurroundingCtrlComponent")
	}
	static class UHallSurroundingCtrlComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHallSurroundingCtrlComponent>();
	}
};
DUMPER7_ASSERTS_UHallSurroundingCtrlComponent;

// Class Hall.HallCameraCtrlComponentBase
// 0x0178 (0x0270 - 0x00F8)
class alignas(0x10) UHallCameraCtrlComponentBase final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void()>              HallCameraMovedDone;                               // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	bool                                          bAdjustCameraFOV;                                  // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxViewportScale;                                  // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinViewportScale;                                  // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCameraFOV;                                      // 0x0114(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinCameraFOV;                                      // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CustomViewTargetActor;                             // 0x0120(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACineCameraActor*                       CustomCineCameraActor;                             // 0x0128(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ASceneCapture2D>         SceneCapture;                                      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneCaptureComponent2D*               SceneCaptureComp;                                  // 0x0148(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 HallTargetActor;                                   // 0x0150(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_158[0x18];                                     // 0x0158(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CachedTouchedActor;                                // 0x0170(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_178[0x38];                                     // 0x0178(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CameraPivotActor;                                  // 0x01B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B8[0x18];                                     // 0x01B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SeqCameraPoint;                                    // 0x01D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            CameraCustom;                                      // 0x01D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateYawCameraVel;                                // 0x01E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotatePitchCameraVel;                              // 0x01E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotateLagEnabled;                                 // 0x01E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotateInterpSpeed;                                 // 0x01EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F0[0x1];                                      // 0x01F0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCharacterLookAtEnable;                            // 0x01F1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReboundTransitionLastTime;                         // 0x01F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F8[0x68];                                     // 0x01F8(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CurrTargetActor;                                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ACameraActor* GetCustomViewTarget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2740
	void SetCustonViewTarget(); // (Final, Native, Public) // @ 0x14AFE35D0

	class ACineCameraActor* GetCustomCineCamera() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE2710

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallCameraCtrlComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallCameraCtrlComponentBase")
	}
	static class UHallCameraCtrlComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHallCameraCtrlComponentBase>();
	}
};
DUMPER7_ASSERTS_UHallCameraCtrlComponentBase;

// Class Hall.HallWeaponShowPreviewer
// 0x0058 (0x03C8 - 0x0370)
class AHallWeaponShowPreviewer final : public AActor
{
public:
	class UHallLightGroupComponent*               HallLightGroupComponent;                           // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WeaponSpawnPointName;                              // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LightSpawnPointName;                               // 0x0388(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultLightGroupName;                             // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        WeaponSkinId;                                      // 0x0398(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        PreviewWeaponID;                                   // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        PreviewSkinID;                                     // 0x03A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenWeaponAdapter;                                // 0x03B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBound;                                          // 0x03B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinBound;                                          // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AAssembleWeaponActor>    PreviewWeaponActor;                                // 0x03BC(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallWeaponShowPreviewer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallWeaponShowPreviewer")
	}
	static class AHallWeaponShowPreviewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallWeaponShowPreviewer>();
	}
};
DUMPER7_ASSERTS_AHallWeaponShowPreviewer;

// Class Hall.HallCharacter
// 0x00D0 (0x0890 - 0x07C0)
class AHallCharacter : public AHallCharacterBase
{
public:
	TMulticastInlineDelegate<void()>              HallCharacterSetup;                                // 0x07C0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HallCharacterStartSetup;                           // 0x07D0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HallCharacterDestroy;                              // 0x07E0(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	class UHallCharacterAppearanceProxyComponent* AppearanceProxyComponent;                          // 0x07F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHallCharacterWeaponComponent*          WeaponComponent;                                   // 0x07F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_800[0x8];                                      // 0x0800(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnHallCharacterAnimPlayEnd;                        // 0x0808(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnHallCharacterAnimSetChanged;                     // 0x0818(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	bool                                          bDefaultTickable;                                  // 0x0828(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_829[0x67];                                     // 0x0829(0x0067)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DestroyCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2530
	void EquipWeapon(class UModularWeaponDesc* WeaponDesc); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2610
	class UModularWeaponDesc* GetEquippedWeaponDesc(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2820
	bool GetIsHaveSetUpCallBack(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2850
	bool GetIsSetUp(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2880
	void HallCharacterShowAnimEnd(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2A40
	bool HaveSettlementAnim(int32 PosId); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2A60
	int64 IsAvatarPakExist(class FName InAvatarId); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2AF0
	bool isFemale(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2BB0
	void OnHallCharacterAnimSetChangedEvent(); // (Final, Native, Protected) // @ 0x14AFE2C70
	void RecalculateAppearancePriority(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2EA0
	void RemoveAvatarExtraMeshes(bool Immediately); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2EC0
	void ResetAppearance(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2F50
	void ResetBodyShapeShiftType(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2F70
	void ResetLocation(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2F90
	void ResetRotation(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2FB0
	void SetAvatarByFString(const class FString& InAvatarId); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE3160
	void SetBodyShapeShiftTypeByFashionId(class FName InFashionId); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE3280
	void SetCharacterAnimState(const class FString& State); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE3390
	void SetCharacterAnimStateMechine(const class FString& StateMechine); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE34B0
	void SetExtraPartMeshCastShadow(bool bCastShadow); // (Final, Native, Public) // @ 0x14AFE4020
	void SetExtraPartMeshForceLOD(int32 InForceID); // (Final, Native, Public) // @ 0x14AFE40B0
	void SetExtraSkillItemHiddenInGame(bool IsHidden); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE4130
	void SetLocation(const struct FVector& TargetLoc); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14AFE4250
	void SetLookAtSpeedStrength(float Strength); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE42E0
	void SetLookAtTarget(const struct FVector& Target); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14AFE4360
	void SetLookAtWeight(float Weight); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE43F0
	void SetMainFlowHallPosId(int32 PosId, bool PlayShow); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE4470
	void SetNotUseFaceAnim(bool bNotUseFaceAnim); // (Final, Native, Public) // @ 0x14AFE4530
	void SetPrisonerState(bool bInIsPrisoner); // (Final, Native, Public) // @ 0x14AFE45C0
	void SetRotation(const struct FRotator& TargetRot); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14AFE46E0
	void SetSettlementCharacterPosId(int32 PosId); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE4830
	void SetSettlementTeamCharacterPosId(int32 PosId); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE48B0
	void SetSuitAvatarWithSequence(class FName ItemID); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE4930
	void SetUseResolveObject(bool InIsUseResolveObject); // (Final, Native, Public) // @ 0x14AFE4A40
	void SetUseSimpleFaceAnim(bool bUseSimpleFaceAnim); // (Final, Native, Public) // @ 0x14AFE4AD0
	void UnequipWeapon(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE4C50

	class FString GetAvatarID() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE2690
	float GetLookAtSpeedStrength() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE28B0
	struct FVector GetLookAtTarget() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE28E0
	float GetLookAtWeight() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE2920
	struct FVector GetOriginalLocation() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE2990
	struct FRotator GetOriginalRotation() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE29D0
	bool IsEquippedWithWeapon() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14AFE2B80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallCharacter")
	}
	static class AHallCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallCharacter>();
	}
};
DUMPER7_ASSERTS_AHallCharacter;

// Class Hall.HallCharacterAnimPreviewer
// 0x0128 (0x0498 - 0x0370)
class AHallCharacterAnimPreviewer final : public AActor
{
public:
	bool                                          bSpawnWhenMapLoaded;                               // 0x0370(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepInPIE;                                        // 0x0371(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPrevAnimHallCharacter                        PreviewHallCharacterID;                            // 0x0372(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_373[0x5];                                      // 0x0373(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewCharacterID;                                // 0x0378(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHallCharacterAnim                            PreviewHallCharacterAnim;                          // 0x0388(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSpecificAnimBP;                                // 0x0389(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAnimInstance>              PrevAnimBP;                                        // 0x0390(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakingWeapon;                                     // 0x0398(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewPresetWeaponID;                             // 0x03A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PreviewEquipment_Helmet;                           // 0x03B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakingHelmet;                                     // 0x03C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewEquipment_ChestHanging;                     // 0x03C8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakingChestHanging;                               // 0x03D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewEquipment_Bag;                              // 0x03E0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakingBag;                                        // 0x03F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreviewEquipment_BreastPlate;                      // 0x03F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakingBreastPlate;                                // 0x0408(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  PlayerSpawnPoint;                                  // 0x040C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AHallCharacter>             CharacterClass;                                    // 0x0418(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AHallMainDisplayCtrl>    HallDisplayCtrl;                                   // 0x0420(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHallItemDisplayComponent*              ItemDisplayComponent;                              // 0x0428(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PreviewItemId;                                     // 0x0430(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  WeaponSpawnPoint;                                  // 0x0440(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        PreviewWeaponID;                                   // 0x0448(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        PreviewSkinID;                                     // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenWeaponAdapter;                                // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_459[0x3];                                      // 0x0459(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBound;                                          // 0x045C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinBound;                                          // 0x0460(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class ACameraActor>            DebugHallCamera;                                   // 0x0464(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          TeammateSpawnPoints;                               // 0x0470(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FHallCharacterProxy>            HallCharacterProxies;                              // 0x0480(0x0010)(Edit, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AAssembleWeaponActor>    PreviewWeaponActor;                                // 0x0490(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void CreatePlayerCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE24F0
	void CreateTeamCharacters(); // (Final, Native, Public) // @ 0x14AFE2510
	void DestroyDisplayWeapon(); // (Final, Native, Public) // @ 0x14AFE2550
	void DestroyHallCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE2570
	void DestroyTeamCharacters(); // (Final, Native, Public) // @ 0x14AFE25F0
	void OnLoadWeaponCompleted(bool Succeeded); // (Final, Native, Private) // @ 0x14AFE2C90
	void OpenPreviewDoc(); // (Final, Native, Public) // @ 0x14AFE2D20
	void OpenPreviewTable(); // (Final, Native, Public) // @ 0x14AFE2D40
	void OpenWeaponSkinDatatable(); // (Final, Native, Public) // @ 0x14AFE2D60
	void SpawnDisplayItem(); // (Final, Native, Public) // @ 0x14AFE4BF0
	void SpawnDisplayWeapon(); // (Final, Native, Public) // @ 0x14AFE4C10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallCharacterAnimPreviewer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallCharacterAnimPreviewer")
	}
	static class AHallCharacterAnimPreviewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallCharacterAnimPreviewer>();
	}
};
DUMPER7_ASSERTS_AHallCharacterAnimPreviewer;

// Class Hall.HallCharacterAppearanceProxyComponent
// 0x03D8 (0x0A60 - 0x0688)
class UHallCharacterAppearanceProxyComponent final : public UDFMCharacterAppearanceProxyComponent
{
public:
	uint8                                         Pad_688[0x180];                                    // 0x0688(0x0180)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHallWeaponAnimInfo                    EmptyHandAnimInfo;                                 // 0x0808(0x0048)(Protected, NativeAccessSpecifierProtected)
	struct FHallWeaponAnimInfo                    DefaultWeaponAnimInfo;                             // 0x0850(0x0048)(Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FHallWeaponAnimInfo> DefaultWeaponSubTypesAnimInfoMap;                  // 0x0898(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FHallWeaponAnimInfo                    CurrentWeaponAnimInfo;                             // 0x08E8(0x0048)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_930[0xD8];                                     // 0x0930(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UMaterialInstance*>   UIRenderIngoreMatInstMap;                          // 0x0A08(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A58[0x8];                                      // 0x0A58(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallCharacterAppearanceProxyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallCharacterAppearanceProxyComponent")
	}
	static class UHallCharacterAppearanceProxyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHallCharacterAppearanceProxyComponent>();
	}
};
DUMPER7_ASSERTS_UHallCharacterAppearanceProxyComponent;

// Class Hall.HallCharacterCameraActor
// 0x00B0 (0x0DA0 - 0x0CF0)
class AHallCharacterCameraActor : public ACameraActor
{
public:
	class USplineComponent*                       SplineIn;                                          // 0x0CF0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       SplineCameraMovePath;                              // 0x0CF8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       SplineTemp;                                        // 0x0D00(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D08[0x98];                                     // 0x0D08(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FVector GetViewTargetLocation(const class ACameraActor* Camera, const class AActor* TargetActor); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14AFE7B00

	void CreateCameraMovePath(class ACameraActor* SourceActor, const struct FVector& ViewSourceLocation, const struct FVector& ViewTargetLocation, float Speed, float LockMoveStartTargetAlpha, float radius, float ExpandScale, bool bUseZAxis); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14AFE6E40
	void DoPreview(class ACameraActor* SourceActor, const struct FVector& ViewSourceLocation, const struct FVector& InViewTargetLocation, float Speed, float LockMoveStartTargetAlpha); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14AFE7180
	void EnableDebug(bool bDebug); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7350
	struct FTransform GetCameraTransform(const class ACameraActor* CameraActor, float Alpha, bool* bBlendRotation); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14AFE75A0
	float GetDuration(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7840
	void RemoveCameraMovePath(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7F60
	void RemoveCameraPathConfig(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7F80
	void ResetPreview(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7FC0
	void SetDuration(float InDuration); // (Final, Native, Private, BlueprintCallable) // @ 0x14AFE84F0
	void SetEasingType(EGPWeaponEasingType InEasingType); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE8570
	void SetRollbackCamera(const class AHallCharacterCameraActor* InRollbackCamera); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE8710

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallCharacterCameraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallCharacterCameraActor")
	}
	static class AHallCharacterCameraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHallCharacterCameraActor>();
	}
};
DUMPER7_ASSERTS_AHallCharacterCameraActor;

// Class Hall.HallCharacterCtrlComponentBase
// 0x0070 (0x0168 - 0x00F8)
class UHallCharacterCtrlComponentBase final : public UActorComponent
{
public:
	TSubclassOf<class AHallCharacter>             CharacterClass;                                    // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  MainCharacterSpawnPoint;                           // 0x0100(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class AActor>>          CharacterSpawnPoints;                              // 0x0108(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<int32, class AHallCharacter*>            AllSlotCharacter;                                  // 0x0118(0x0050)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void DestroyCharacterBySlot(const int32& InSlotId); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14AFE70B0
	void DestroyPlayerCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7160
	class AHallCharacter* GetPlayerCharacter(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7910
	class AHallCharacter* GetPlayerCharacterBySlot(int32 InSlot); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE7940
	struct FVector GetPlayerCharacterPositionBySlot(int32 InSlot); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14AFE79D0
	class AHallCharacter* SpawnPlayerCharacterWithSlot(int32 InSlot); // (Final, Native, Public, BlueprintCallable) // @ 0x14AFE8A40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallCharacterCtrlComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallCharacterCtrlComponentBase")
	}
	static class UHallCharacterCtrlComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHallCharacterCtrlComponentBase>();
	}
};
DUMPER7_ASSERTS_UHallCharacterCtrlComponentBase;

// Class Hall.HallDisplayLevelSequenceComponentBase
// 0x00A8 (0x01A0 - 0x00F8)
class alignas(0x10) UHallDisplayLevelSequenceComponentBase : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x40];                                      // 0x00F8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CameraActor;                                       // 0x0138(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x50];                                     // 0x0140(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    HallDisplayLevelSequenceActor;                     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCameraCutTriggered(class UCameraComponent* CameraComponent); // (Final, Native, Private) // @ 0x14AFEB530
	void OnMovieSequenceEventFinished(); // (Final, Native, Private) // @ 0x14AFEB640
	void OnMovieSequenceEventPause(); // (Final, Native, Private) // @ 0x14AFEB660
	void OnMovieSequenceEventPlay(); // (Final, Native, Private) // @ 0x14AFEB680
	void OnMovieSequenceEventStop(); // (Final, Native, Private) // @ 0x14AFEB6A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HallDisplayLevelSequenceComponentBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HallDisplayLevelSequenceComponentBase")
	}
	static class UHallDisplayLevelSequenceComponentBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHallDisplayLevelSequenceComponentBase>();
	}
};
DUMPER7_ASSERTS_UHallDisplayLevelSequenceComponentBase;

// Class Hall.HallCharacterLevelSeqComponentBase
// 0x00C0 (0x0260 - 0x01A0)
class UHallCharacterLevelSeqComponentBase final : public UHallDisplayLevelSequenceComponentBase
{
public:
	uint8                                         Pad_1A0[0x4];                                      // 0x01A0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HeroItemFashionId;                                 // 0x01A4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FromAlpha;                                         // 0x01AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ToAlpha;                                           // 0x01B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartFadeDuration;                                 // 0x01B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopFadeDuration;                                  // 0x01B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FadeColor;                                         // 0x01BC(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CC[0xC];                                      // 0x01CC(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAttachWatch;                                      // 0x01D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOperator;                                       // 0x01D9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCameraFade;                                    // 0x01DA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PlayAfterOtherLoaded;                              // 0x01DB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HallCharacterBindingTag;                           // 0x01DC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PoseFrame;                                         // 0x01E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
