#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeadMountedDisplay

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HeadMountedDisplay_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class HeadMountedDisplay.HeadMountedDisplayFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UHeadMountedDisplayFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CalibrateExternalTrackingToHMD(const struct FTransform& ExternalTrackingTransform); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C267380
	static bool EnableHMD(bool bEnable); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2676D0
	static void EnableLowPersistenceMode(bool bEnable); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1412AF220
	static TArray<struct FXRDeviceId> EnumerateTrackedDevices(const class FName SystemId, EXRTrackedDeviceType DeviceType); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2679D0
	static void GetDevicePose(const struct FXRDeviceId& XRDeviceId, bool* bIsTracked, struct FRotator* Orientation, bool* bHasPositionalTracking, struct FVector* Position); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C267B70
	static void GetDeviceWorldPose(class UObject* WorldContext, const struct FXRDeviceId& XRDeviceId, bool* bIsTracked, struct FRotator* Orientation, bool* bHasPositionalTracking, struct FVector* Position); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C267D60
	static class FName GetHMDDeviceName(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C267F90
	static EHMDWornState GetHMDWornState(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C267FD0
	static int32 GetNumOfTrackingSensors(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268140
	static void GetOrientationAndPosition(struct FRotator* DeviceRotation, struct FVector* DevicePosition); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14C268170
	static float GetPixelDensity(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268310
	static void GetPositionalTrackingCameraParameters(struct FVector* CameraOrigin, struct FRotator* CameraRotation, float* HFOV, float* VFOV, float* CameraDistance, float* NearPlane, float* FarPlane); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14C268340
	static float GetScreenPercentage(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C2685B0
	static EHMDTrackingOrigin GetTrackingOrigin(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C2685E0
	static void GetTrackingSensorParameters(struct FVector* Origin, struct FRotator* Rotation, float* LeftFOV, float* RightFOV, float* TopFOV, float* BottomFOV, float* Distance, float* NearPlane, float* FarPlane, bool* IsActive, int32 Index_0); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14C268620
	static struct FTransform GetTrackingToWorldTransform(class UObject* WorldContext); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14C268A00
	static void GetVRFocusState(bool* bUseFocus, bool* bHasFocus); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14C268AC0
	static float GetWorldToMetersScale(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268BA0
	static bool HasValidTrackingPosition(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268C30
	static bool IsDeviceTracking(const struct FXRDeviceId& XRDeviceId); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14C268C80
	static bool IsHeadMountedDisplayConnected(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268D20
	static bool IsHeadMountedDisplayEnabled(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268D50
	static bool IsInLowPersistenceMode(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14101BC40
	static bool IsSpectatorScreenModeControllable(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C269070
	static void ResetOrientationAndPosition(float Yaw, EOrientPositionSelector Options); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2690C0
	static void SetClippingPlanes(float Near, float Far); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2691F0
	static void SetSpectatorScreenMode(ESpectatorScreenMode Mode); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C269650
	static void SetSpectatorScreenModeTexturePlusEyeLayout(const struct FVector2D& EyeRectMin, const struct FVector2D& EyeRectMax, const struct FVector2D& TextureRectMin, const struct FVector2D& TextureRectMax, bool bDrawEyeFirst, bool bClearBlack, bool bUseAlpha); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14C2696C0
	static void SetSpectatorScreenTexture(class UTexture* InTexture); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2698B0
	static void SetTrackingOrigin(EHMDTrackingOrigin Origin); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2699A0
	static void SetWorldToMetersScale(class UObject* WorldContext, float NewScale); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C269A90
	static void UpdateExternalTrackingHMDPosition(const struct FTransform& ExternalTrackingTransform); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C269B60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HeadMountedDisplayFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HeadMountedDisplayFunctionLibrary")
	}
	static class UHeadMountedDisplayFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeadMountedDisplayFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UHeadMountedDisplayFunctionLibrary;

// Class HeadMountedDisplay.MotionControllerComponent
// 0x00B0 (0x0640 - 0x0590)
class UMotionControllerComponent final : public UPrimitiveComponent
{
public:
	int32                                         PlayerIndex;                                       // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControllerHand                               Hand;                                              // 0x058C(0x0001)(BlueprintVisible, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MotionSource;                                      // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bDisableLowLatencyUpdate : 1;                      // 0x0598(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_599[0x3];                                      // 0x0599(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ETrackingStatus                               CurrentTrackingStatus;                             // 0x059C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisplayDeviceModel;                               // 0x059D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59E[0x2];                                      // 0x059E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DisplayModelSource;                                // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            CustomDisplayMesh;                                 // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             DisplayMeshMaterialOverrides;                      // 0x05B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C0[0x60];                                     // 0x05C0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    DisplayComponent;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_628[0x18];                                     // 0x0628(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetHandJointPosition(int32 jointIndex, bool* bValueFound); // (Final, Native, Protected, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C268000
	float GetParameterValue(class FName InName, bool* bValueFound); // (Final, Native, Protected, HasOutParams, BlueprintCallable) // @ 0x14C268240
	void OnMotionControllerUpdated(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void SetAssociatedPlayerIndex(const int32 NewPlayer); // (Final, Native, Public, BlueprintCallable) // @ 0x14C269170
	void SetCustomDisplayMesh(class UStaticMesh* NewDisplayMesh); // (Final, Native, Public, BlueprintCallable) // @ 0x14C2692A0
	void SetDisplayModelSource(const class FName NewDisplayModelSource); // (Final, Native, Public, BlueprintCallable) // @ 0x14C269320
	void SetShowDeviceModel(const bool bShowControllerModel); // (Final, Native, Public, BlueprintCallable) // @ 0x14C2695C0
	void SetTrackingMotionSource(const class FName NewSource); // (Final, Native, Public, BlueprintCallable) // @ 0x14C269920
	void SetTrackingSource(const EControllerHand NewSource); // (Final, Native, Public, BlueprintCallable) // @ 0x14C269A10

	EControllerHand GetTrackingSource() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C2689D0
	bool IsTracked() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C2690A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotionControllerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotionControllerComponent")
	}
	static class UMotionControllerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionControllerComponent>();
	}
};
DUMPER7_ASSERTS_UMotionControllerComponent;

// Class HeadMountedDisplay.MotionTrackedDeviceFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMotionTrackedDeviceFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DisableMotionTrackingForComponent(const class UMotionControllerComponent* MotionControllerComponent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267470
	static void DisableMotionTrackingOfAllControllers(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2674E0
	static void DisableMotionTrackingOfControllersForPlayer(int32 PlayerIndex); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267500
	static void DisableMotionTrackingOfDevice(int32 PlayerIndex, EControllerHand Hand); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267570
	static void DisableMotionTrackingOfSource(int32 PlayerIndex, class FName SourceName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267620
	static bool EnableMotionTrackingForComponent(class UMotionControllerComponent* MotionControllerComponent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267750
	static bool EnableMotionTrackingOfDevice(int32 PlayerIndex, EControllerHand Hand); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2677D0
	static bool EnableMotionTrackingOfSource(int32 PlayerIndex, class FName SourceName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267890
	static TArray<class FName> EnumerateMotionSources(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267950
	static class FName GetActiveTrackingSystemName(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267B30
	static int32 GetMaximumMotionTrackedControllerCount(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C2680E0
	static int32 GetMotionTrackingEnabledControllerCount(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268110
	static bool IsMotionSourceTracking(int32 PlayerIndex, class FName SourceName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C268D80
	static bool IsMotionTrackedDeviceCountManagementNecessary(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268E40
	static bool IsMotionTrackingEnabledForComponent(const class UMotionControllerComponent* MotionControllerComponent); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268E70
	static bool IsMotionTrackingEnabledForDevice(int32 PlayerIndex, EControllerHand Hand); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268EF0
	static bool IsMotionTrackingEnabledForSource(int32 PlayerIndex, class FName SourceName); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14C268FB0
	static void SetIsControllerMotionTrackingEnabledByDefault(bool Enable); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C2693A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MotionTrackedDeviceFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MotionTrackedDeviceFunctionLibrary")
	}
	static class UMotionTrackedDeviceFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionTrackedDeviceFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMotionTrackedDeviceFunctionLibrary;

// Class HeadMountedDisplay.VRNotificationsComponent
// 0x0090 (0x0188 - 0x00F8)
class UVRNotificationsComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void()>              HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HMDTrackingInitializedDelegate;                    // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HMDRecenteredDelegate;                             // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HMDLostDelegate;                                   // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HMDReconnectedDelegate;                            // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HMDConnectCanceledDelegate;                        // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HMDPutOnHeadDelegate;                              // 0x0158(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              HMDRemovedFromHeadDelegate;                        // 0x0168(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              VRControllerRecenteredDelegate;                    // 0x0178(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VRNotificationsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VRNotificationsComponent")
	}
	static class UVRNotificationsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVRNotificationsComponent>();
	}
};
DUMPER7_ASSERTS_UVRNotificationsComponent;

// Class HeadMountedDisplay.XRAssetFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UXRAssetFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UPrimitiveComponent* AddDeviceVisualizationComponentBlocking(class AActor* Target, const struct FXRDeviceId& XRDeviceId, bool bManualAttachment, const struct FTransform& RelativeTransform); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C266B20
	static class UPrimitiveComponent* AddNamedDeviceVisualizationComponentBlocking(class AActor* Target, const class FName SystemName, const class FName DeviceName, bool bManualAttachment, const struct FTransform& RelativeTransform, struct FXRDeviceId* XRDeviceId); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C267150

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("XRAssetFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"XRAssetFunctionLibrary")
	}
	static class UXRAssetFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXRAssetFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UXRAssetFunctionLibrary;

// Class HeadMountedDisplay.AsyncTask_LoadXRDeviceVisComponent
// 0x0030 (0x0060 - 0x0030)
class UAsyncTask_LoadXRDeviceVisComponent final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const class UPrimitiveComponent* LoadedComponent)> OnModelLoaded;  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UPrimitiveComponent* LoadedComponent)> OnLoadFailure;  // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    SpawnedComponent;                                  // 0x0058(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UAsyncTask_LoadXRDeviceVisComponent* AddDeviceVisualizationComponentAsync(class AActor* Target, const struct FXRDeviceId& XRDeviceId, bool bManualAttachment, const struct FTransform& RelativeTransform, class UPrimitiveComponent** NewComponent); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C266900
	static class UAsyncTask_LoadXRDeviceVisComponent* AddNamedDeviceVisualizationComponentAsync(class AActor* Target, const class FName SystemName, const class FName DeviceName, bool bManualAttachment, const struct FTransform& RelativeTransform, struct FXRDeviceId* XRDeviceId, class UPrimitiveComponent** NewComponent); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14C266EC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTask_LoadXRDeviceVisComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTask_LoadXRDeviceVisComponent")
	}
	static class UAsyncTask_LoadXRDeviceVisComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTask_LoadXRDeviceVisComponent>();
	}
};
DUMPER7_ASSERTS_UAsyncTask_LoadXRDeviceVisComponent;

// Class HeadMountedDisplay.XRLoadingScreenFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UXRLoadingScreenFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddLoadingScreenSplash(class UTexture* Texture, const struct FVector& translation, const struct FRotator& Rotation, const struct FVector2D& size, const struct FRotator& DeltaRotation, bool bClearBeforeAdd); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14C266CE0
	static void ClearLoadingScreenSplashes(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C267450
	static void HideLoadingScreen(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C268C60
	static void SetLoadingScreen(class UTexture* Texture, const struct FVector2D& Scale, const struct FVector& offset, bool bShowLoadingMovie, bool bShowOnSet); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable) // @ 0x14C269420
	static void ShowLoadingScreen(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14C269B40

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("XRLoadingScreenFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"XRLoadingScreenFunctionLibrary")
	}
	static class UXRLoadingScreenFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXRLoadingScreenFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UXRLoadingScreenFunctionLibrary;

}

