#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTN

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HTN_structs.hpp"


namespace SDK
{

// Class HTN.HTNComponent
// 0x0148 (0x02A0 - 0x0158)
class UHTNComponent final : public UBrainComponent
{
public:
	uint8                                         Pad_158[0x10];                                     // 0x0158(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTN*                                   CurrentHTNAsset;                                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAITask_MakeHTNPlan*                    CurrentPlanningTask;                               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0x40];                                     // 0x0178(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHTNNode*>                       InstancedNodes;                                    // 0x01B8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 PlanMemory;                                        // 0x01C8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UWorldStateProxy*                       PlanningWorldStateProxy;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWorldStateProxy*                       BlackboardProxy;                                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UObject*, float>                   CooldownOwnerToEndTimeMap;                         // 0x01E8(0x0050)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, class UHTN*>        GameplayTagToDynamicHTNMap;                        // 0x0238(0x0050)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_288[0x18];                                     // 0x0288(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCooldownDuration(const class UObject* CooldownOwner, float CooldownDuration, bool bAddToExistingDuration); // (Final, Native, Public, BlueprintCallable) // @ 0x1411188F0
	void CancelActivePlanning(); // (Final, Native, Public, BlueprintCallable) // @ 0x141118A00
	void ForceReplan(bool bForceAbortPlan, bool bForceRestartActivePlanning, bool bForceDeferToNextFrame); // (Final, Native, Public, BlueprintCallable) // @ 0x141118B40
	bool NotifyEventBasedDecoratorCondition(class UHTNDecorator* Decorator, bool bRawConditionValue, bool bCanAbortPlanInstantly); // (Final, Native, Public, BlueprintCallable) // @ 0x14111A0C0
	bool SetDynamicHTN(const struct FGameplayTag& InjectTag, class UHTN* HTN, bool bForceAbortCurrentPlanIfChanged); // (Final, Native, Public, BlueprintCallable) // @ 0x14111A290
	void StartHTN(class UHTN* Asset); // (Final, Native, Public, BlueprintCallable) // @ 0x14111B180
	void StopHTN(bool bDisregardLatentAbort); // (Final, Native, Public, BlueprintCallable) // @ 0x14111B200

	class UWorldStateProxy* GetBlackboardProxy() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141118D70
	float GetCooldownEndTime(const class UObject* CooldownOwner) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141118D90
	class UHTN* GetCurrentHTN() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141118E30
	class UHTN* GetDynamicHTN(const struct FGameplayTag& InjectTag) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141118E50
	class UWorldStateProxy* GetPlanningWorldStateProxy() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141119110
	class UWorldStateProxy* GetWorldStateProxy(bool bForPlanning) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141119230
	bool HasActivePlan() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111A000
	bool IsPlanning() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111A060
	bool IsWaitingForAbortingTasks() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111A090

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNComponent")
	}
	static class UHTNComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNComponent>();
	}
};
DUMPER7_ASSERTS_UHTNComponent;

// Class HTN.AITask_HTNMoveTo
// 0x0008 (0x0118 - 0x0110)
class UAITask_HTNMoveTo final : public UAITask_MoveTo
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITask_HTNMoveTo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITask_HTNMoveTo")
	}
	static class UAITask_HTNMoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITask_HTNMoveTo>();
	}
};
DUMPER7_ASSERTS_UAITask_HTNMoveTo;

// Class HTN.AITask_MakeHTNPlan
// 0x0088 (0x00F8 - 0x0070)
class UAITask_MakeHTNPlan final : public UAITask
{
public:
	class UHTNComponent*                          OwnerComponent;                                    // 0x0070(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHTN*                                   TopLevelHTN;                                       // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlackboardComponent*                   BlackboardComponent;                               // 0x0080(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_88[0x40];                                      // 0x0088(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTNTask*                               CurrentTask;                                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x20];                                      // 0x00D0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIsWaitingForTaskToProducePlanSteps : 1;           // 0x00F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITask_MakeHTNPlan")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITask_MakeHTNPlan")
	}
	static class UAITask_MakeHTNPlan* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITask_MakeHTNPlan>();
	}
};
DUMPER7_ASSERTS_UAITask_MakeHTNPlan;

// Class HTN.EnvQueryContext_HTNBlueprintBase
// 0x0018 (0x0040 - 0x0028)
class UEnvQueryContext_HTNBlueprintBase final : public UEnvQueryContext
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TempQuerierActor;                                  // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetQuerierLocation() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x141119130
	class UWorldStateProxy* GetWorldState() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141119200
	void ProvideActorsSet(class UObject* QuerierObject, class AActor* QuerierActor, TArray<class AActor*>* ResultingActorsSet) const; // (Event, Public, HasOutParams, BlueprintEvent, Const) // @ 0x14B5B5E20
	void ProvideLocationsSet(class UObject* QuerierObject, class AActor* QuerierActor, TArray<struct FVector>* ResultingLocationSet) const; // (Event, Public, HasOutParams, BlueprintEvent, Const) // @ 0x14B5B5E20
	void ProvideSingleActor(class UObject* QuerierObject, class AActor* QuerierActor, class AActor** ResultingActor) const; // (Event, Public, HasOutParams, BlueprintEvent, Const) // @ 0x14B5B5E20
	void ProvideSingleLocation(class UObject* QuerierObject, class AActor* QuerierActor, struct FVector* ResultingLocation) const; // (Event, Public, HasOutParams, HasDefaults, BlueprintEvent, Const) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_HTNBlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_HTNBlueprintBase")
	}
	static class UEnvQueryContext_HTNBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_HTNBlueprintBase>();
	}
};
DUMPER7_ASSERTS_UEnvQueryContext_HTNBlueprintBase;

// Class HTN.EnvQueryContext_HTNQuerierLocation
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_HTNQuerierLocation final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryContext_HTNQuerierLocation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryContext_HTNQuerierLocation")
	}
	static class UEnvQueryContext_HTNQuerierLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryContext_HTNQuerierLocation>();
	}
};
DUMPER7_ASSERTS_UEnvQueryContext_HTNQuerierLocation;

// Class HTN.HTN
// 0x0038 (0x0060 - 0x0028)
class UHTN final : public UObject
{
public:
	TArray<class UHTNStandaloneNode*>             StartNodes;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UHTNDecorator*>                  RootDecorators;                                    // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UHTNService*>                    RootServices;                                      // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UBlackboardData*                        BlackboardAsset;                                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTN")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTN")
	}
	static class UHTN* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTN>();
	}
};
DUMPER7_ASSERTS_UHTN;

// Class HTN.HTNBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UHTNBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool RunHTN(class AAIController* AIController, class UHTN* HTNAsset); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14111A1D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNBlueprintLibrary")
	}
	static class UHTNBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UHTNBlueprintLibrary;

// Class HTN.HTNNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UHTNNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearWorldStateValue(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x141118A20
	static void ForceReplan(class UHTNNode* Node, bool bForceAbortPlan, bool bForceRestartActivePlanning); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141118C60
	static bool GetLocationFromWorldState(class UHTNNode* Node, const struct FBlackboardKeySelector& KeySelector, struct FVector* OutLocation, class AActor** OutActor); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141118EE0
	static class UWorldStateProxy* GetOwnersWorldState(const class UHTNNode* Node); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x141119090
	static struct FVector GetSelfLocationFromWorldState(class UHTNNode* Node); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x141119170
	static class AActor* GetWorldStateValueAsActor(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x1411192D0
	static bool GetWorldStateValueAsBool(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141119400
	static class UClass* GetWorldStateValueAsClass(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141119520
	static uint8 GetWorldStateValueAsEnum(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141119650
	static float GetWorldStateValueAsFloat(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141119770
	static int32 GetWorldStateValueAsInt(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x1411198A0
	static class FName GetWorldStateValueAsName(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x1411199C0
	static class UObject* GetWorldStateValueAsObject(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141119AF0
	static struct FRotator GetWorldStateValueAsRotator(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x141119C20
	static class FString GetWorldStateValueAsString(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141119D60
	static struct FVector GetWorldStateValueAsVector(class UHTNNode* Node, const struct FBlackboardKeySelector& Key); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x141119EC0
	static void SetWorldStateValueAsBool(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, bool Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111A390
	static void SetWorldStateValueAsClass(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, class UClass* Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111A4E0
	static void SetWorldStateValueAsEnum(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, uint8 Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111A630
	static void SetWorldStateValueAsFloat(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, float Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111A780
	static void SetWorldStateValueAsInt(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, int32 Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111A8D0
	static void SetWorldStateValueAsName(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, class FName Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111AA20
	static void SetWorldStateValueAsObject(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, class UObject* Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111AB70
	static void SetWorldStateValueAsRotator(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, const struct FRotator& Value); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14111ACC0
	static void SetWorldStateValueAsString(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, const class FString& Value); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14111AE30
	static void SetWorldStateValueAsVector(class UHTNNode* Node, const struct FBlackboardKeySelector& Key, const struct FVector& Value); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14111B010

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNodeLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNodeLibrary")
	}
	static class UHTNNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNodeLibrary>();
	}
};
DUMPER7_ASSERTS_UHTNNodeLibrary;

// Class HTN.HTNNode
// 0x0038 (0x0060 - 0x0028)
class UHTNNode : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NodeName;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHTNNode*                               TemplateNode;                                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTN*                                   HTNAsset;                                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHTNComponent*                          OwnerComponent;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class FString GetNodeName() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111E3D0
	class UHTNComponent* GetOwnerComponent() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111E450

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode")
	}
	static class UHTNNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode>();
	}
};
DUMPER7_ASSERTS_UHTNNode;

// Class HTN.HTNDecorator
// 0x0008 (0x0068 - 0x0060)
class UHTNDecorator : public UHTNNode
{
public:
	uint8                                         BitPad_60_0 : 6;                                   // 0x0060(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bInverseCondition : 1;                             // 0x0060(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCheckConditionOnPlanEnter : 1;                    // 0x0060(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCheckConditionOnPlanExit : 1;                     // 0x0061(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCheckConditionOnPlanRecheck : 1;                  // 0x0061(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCheckConditionOnTick : 1;                         // 0x0061(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsInversed() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111A030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator")
	}
	static class UHTNDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator;

// Class HTN.HTNDecorator_BlackboardBase
// 0x0028 (0x0090 - 0x0068)
class UHTNDecorator_BlackboardBase : public UHTNDecorator
{
public:
	struct FBlackboardKeySelector                 BlackboardKey;                                     // 0x0068(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_BlackboardBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_BlackboardBase")
	}
	static class UHTNDecorator_BlackboardBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_BlackboardBase>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_BlackboardBase;

// Class HTN.HTNDecorator_Blackboard
// 0x0030 (0x00C0 - 0x0090)
class UHTNDecorator_Blackboard final : public UHTNDecorator_BlackboardBase
{
public:
	int32                                         IntValue;                                          // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FloatValue;                                        // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 StringValue;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 CachedDescription;                                 // 0x00A8(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         OperationType;                                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bCanAbortPlanInstantly : 1;                        // 0x00B9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_Blackboard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_Blackboard")
	}
	static class UHTNDecorator_Blackboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_Blackboard>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_Blackboard;

// Class HTN.HTNDecorator_BlueprintBase
// 0x0020 (0x0088 - 0x0068)
class UHTNDecorator_BlueprintBase final : public UHTNDecorator
{
public:
	uint8                                         bShowPropertyDetails : 1;                          // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x1F];                                      // 0x0069(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveExecutionFinish(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn, EHTNNodeResult NodeResult); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveExecutionStart(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTick(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn, float DeltaTime); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20

	bool PerformConditionCheck(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn, EHTNDecoratorConditionCheckType CheckType) const; // (Event, Protected, BlueprintEvent, Const) // @ 0x14B5B5E20
	int32 ReceiveModifyStepCost(int32 OriginalCost, class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn) const; // (Event, Protected, BlueprintEvent, Const) // @ 0x14B5B5E20
	void ReceiveOnPlanEnter(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn) const; // (Event, Protected, BlueprintEvent, Const) // @ 0x14B5B5E20
	void ReceiveOnPlanExit(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn) const; // (Event, Protected, BlueprintEvent, Const) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_BlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_BlueprintBase")
	}
	static class UHTNDecorator_BlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_BlueprintBase>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_BlueprintBase;

// Class HTN.HTNDecorator_Cooldown
// 0x0008 (0x0070 - 0x0068)
class UHTNDecorator_Cooldown final : public UHTNDecorator
{
public:
	float                                         CooldownDuration;                                  // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_Cooldown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_Cooldown")
	}
	static class UHTNDecorator_Cooldown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_Cooldown>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_Cooldown;

// Class HTN.HTNDecorator_DistanceCheck
// 0x0058 (0x00C0 - 0x0068)
class UHTNDecorator_DistanceCheck final : public UHTNDecorator
{
public:
	struct FBlackboardKeySelector                 A;                                                 // 0x0068(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 B;                                                 // 0x0090(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         MinDistance;                                       // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_DistanceCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_DistanceCheck")
	}
	static class UHTNDecorator_DistanceCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_DistanceCheck>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_DistanceCheck;

// Class HTN.HTNDecorator_FocusScope
// 0x0038 (0x00A0 - 0x0068)
class UHTNDecorator_FocusScope final : public UHTNDecorator
{
public:
	uint8                                         bSetNewFocus : 1;                                  // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 FocusTarget;                                       // 0x0070(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         FocusPriority;                                     // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_FocusScope")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_FocusScope")
	}
	static class UHTNDecorator_FocusScope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_FocusScope>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_FocusScope;

// Class HTN.HTNDecorator_GuardValue
// 0x0048 (0x00D8 - 0x0090)
class UHTNDecorator_GuardValue final : public UHTNDecorator_BlackboardBase
{
public:
	struct FWorldstateSetValueContainer           Value;                                             // 0x0090(0x0040)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         bSetValueOnEnterPlan : 1;                          // 0x00D0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRestoreValueOnExitPlan : 1;                       // 0x00D0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRestoreValueOnAbort : 1;                          // 0x00D0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_GuardValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_GuardValue")
	}
	static class UHTNDecorator_GuardValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_GuardValue>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_GuardValue;

// Class HTN.HTNDecorator_ModifyCost
// 0x0008 (0x0070 - 0x0068)
class UHTNDecorator_ModifyCost final : public UHTNDecorator
{
public:
	float                                         Scale;                                             // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bias;                                              // 0x006C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_ModifyCost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_ModifyCost")
	}
	static class UHTNDecorator_ModifyCost* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_ModifyCost>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_ModifyCost;

// Class HTN.HTNDecorator_TraceTest
// 0x00A8 (0x0110 - 0x0068)
class UHTNDecorator_TraceTest final : public UHTNDecorator
{
public:
	struct FBlackboardKeySelector                 TraceFrom;                                         // 0x0068(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         TraceFromZOffset;                                  // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TraceTo;                                           // 0x0098(0x0028)(Edit, NativeAccessSpecifierPublic)
	float                                         TraceToZOffset;                                    // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x00C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseComplexCollision : 1;                          // 0x00C5(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIgnoreSelf : 1;                                   // 0x00C5(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EEnvTraceShape                                TraceShape;                                        // 0x00C6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceExtentX;                                      // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceExtentY;                                      // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceExtentZ;                                      // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDrawDebugTrace                               DrawDebugType;                                     // 0x00D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DebugColor;                                        // 0x00D8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DebugHitColor;                                     // 0x00E8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugDrawTime;                                     // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsToIgnoreBuffer;                              // 0x0100(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNDecorator_TraceTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNDecorator_TraceTest")
	}
	static class UHTNDecorator_TraceTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNDecorator_TraceTest>();
	}
};
DUMPER7_ASSERTS_UHTNDecorator_TraceTest;

// Class HTN.HTNStandaloneNode
// 0x0038 (0x0098 - 0x0060)
class UHTNStandaloneNode : public UHTNNode
{
public:
	int32                                         MaxRecursionLimit;                                 // 0x0060(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHTNStandaloneNode*>             NextNodes;                                         // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UHTNDecorator*>                  Decorators;                                        // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UHTNService*>                    Services;                                          // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNStandaloneNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNStandaloneNode")
	}
	static class UHTNStandaloneNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNStandaloneNode>();
	}
};
DUMPER7_ASSERTS_UHTNStandaloneNode;

// Class HTN.HTNNode_TwoBranches
// 0x0008 (0x00A0 - 0x0098)
class UHTNNode_TwoBranches : public UHTNStandaloneNode
{
public:
	int32                                         NumPrimaryNodes;                                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_TwoBranches")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_TwoBranches")
	}
	static class UHTNNode_TwoBranches* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_TwoBranches>();
	}
};
DUMPER7_ASSERTS_UHTNNode_TwoBranches;

// Class HTN.HTNNode_AnyOrder
// 0x0000 (0x00A0 - 0x00A0)
class UHTNNode_AnyOrder final : public UHTNNode_TwoBranches
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_AnyOrder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_AnyOrder")
	}
	static class UHTNNode_AnyOrder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_AnyOrder>();
	}
};
DUMPER7_ASSERTS_UHTNNode_AnyOrder;

// Class HTN.HTNNode_If
// 0x0008 (0x00A8 - 0x00A0)
class UHTNNode_If final : public UHTNNode_TwoBranches
{
public:
	uint8                                         bCanConditionsInterruptTrueBranch : 1;             // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanConditionsInterruptFalseBranch : 1;            // 0x00A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_If")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_If")
	}
	static class UHTNNode_If* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_If>();
	}
};
DUMPER7_ASSERTS_UHTNNode_If;

// Class HTN.HTNNode_Parallel
// 0x0008 (0x00A8 - 0x00A0)
class UHTNNode_Parallel final : public UHTNNode_TwoBranches
{
public:
	uint8                                         bWaitForSecondaryBranchToComplete : 1;             // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLoopSecondaryBranchUntilPrimaryBranchCompletes : 1; // 0x00A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_Parallel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_Parallel")
	}
	static class UHTNNode_Parallel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_Parallel>();
	}
};
DUMPER7_ASSERTS_UHTNNode_Parallel;

// Class HTN.HTNNode_Scope
// 0x0000 (0x0098 - 0x0098)
class UHTNNode_Scope final : public UHTNStandaloneNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_Scope")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_Scope")
	}
	static class UHTNNode_Scope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_Scope>();
	}
};
DUMPER7_ASSERTS_UHTNNode_Scope;

// Class HTN.HTNNode_Sequence
// 0x0000 (0x00A0 - 0x00A0)
class UHTNNode_Sequence final : public UHTNNode_TwoBranches
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_Sequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_Sequence")
	}
	static class UHTNNode_Sequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_Sequence>();
	}
};
DUMPER7_ASSERTS_UHTNNode_Sequence;

// Class HTN.HTNNode_SubNetwork
// 0x0008 (0x00A0 - 0x0098)
class UHTNNode_SubNetwork final : public UHTNStandaloneNode
{
public:
	class UHTN*                                   HTN;                                               // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_SubNetwork")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_SubNetwork")
	}
	static class UHTNNode_SubNetwork* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_SubNetwork>();
	}
};
DUMPER7_ASSERTS_UHTNNode_SubNetwork;

// Class HTN.HTNNode_SubNetworkDynamic
// 0x0010 (0x00A8 - 0x0098)
class UHTNNode_SubNetworkDynamic final : public UHTNStandaloneNode
{
public:
	class UHTN*                                   DefaultHTN;                                        // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InjectTag;                                         // 0x00A0(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNNode_SubNetworkDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNNode_SubNetworkDynamic")
	}
	static class UHTNNode_SubNetworkDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNNode_SubNetworkDynamic>();
	}
};
DUMPER7_ASSERTS_UHTNNode_SubNetworkDynamic;

// Class HTN.HTNService
// 0x0010 (0x0070 - 0x0060)
class UHTNService : public UHTNNode
{
public:
	float                                         TickInterval;                                      // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TickIntervalRandomDeviation;                       // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNService")
	}
	static class UHTNService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNService>();
	}
};
DUMPER7_ASSERTS_UHTNService;

// Class HTN.HTNService_BlueprintBase
// 0x0020 (0x0090 - 0x0070)
class UHTNService_BlueprintBase final : public UHTNService
{
public:
	uint8                                         bShowPropertyDetails : 1;                          // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_71[0x1F];                                      // 0x0071(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveExecutionFinish(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn, EHTNNodeResult NodeResult); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveExecutionStart(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTick(class AActor* Owner, class AAIController* OwnerAsController, class APawn* ControlledPawn, float DeltaTime); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNService_BlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNService_BlueprintBase")
	}
	static class UHTNService_BlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNService_BlueprintBase>();
	}
};
DUMPER7_ASSERTS_UHTNService_BlueprintBase;

// Class HTN.HTNService_ReplanIfLocationChanges
// 0x0038 (0x00A8 - 0x0070)
class UHTNService_ReplanIfLocationChanges final : public UHTNService
{
public:
	float                                         Tolerance;                                         // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 BlackboardKey;                                     // 0x0078(0x0028)(Edit, NativeAccessSpecifierPublic)
	bool                                          bForceAbortPlan;                                   // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceRestartActivePlanning;                       // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNService_ReplanIfLocationChanges")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNService_ReplanIfLocationChanges")
	}
	static class UHTNService_ReplanIfLocationChanges* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNService_ReplanIfLocationChanges>();
	}
};
DUMPER7_ASSERTS_UHTNService_ReplanIfLocationChanges;

// Class HTN.HTNTask
// 0x0008 (0x00A0 - 0x0098)
class UHTNTask : public UHTNStandaloneNode
{
public:
	uint8                                         bShowTaskNameOnCurrentPlanVisualization : 1;       // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNTask")
	}
	static class UHTNTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNTask>();
	}
};
DUMPER7_ASSERTS_UHTNTask;

// Class HTN.HTNTask_BlackboardBase
// 0x0028 (0x00C8 - 0x00A0)
class UHTNTask_BlackboardBase : public UHTNTask
{
public:
	struct FBlackboardKeySelector                 BlackboardKey;                                     // 0x00A0(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNTask_BlackboardBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNTask_BlackboardBase")
	}
	static class UHTNTask_BlackboardBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNTask_BlackboardBase>();
	}
};
DUMPER7_ASSERTS_UHTNTask_BlackboardBase;

// Class HTN.HTNTask_BlueprintBase
// 0x0058 (0x00F8 - 0x00A0)
class UHTNTask_BlueprintBase final : public UHTNTask
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITask_MakeHTNPlan*                    OutPlanningTask;                                   // 0x00C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FIntervalCountdown                     TickInterval;                                      // 0x00D0(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bShowPropertyDetails : 1;                          // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_D9[0x1F];                                      // 0x00D9(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FinishAbort(); // (Final, Native, Protected, BlueprintCallable) // @ 0x14111E090
	void FinishExecute(bool bSuccess); // (Final, Native, Protected, BlueprintCallable) // @ 0x14111E0B0
	void ReceiveAbort(class AActor* Owner, class AAIController* OwnerController, class APawn* ControlledPawn); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveExecute(class AActor* Owner, class AAIController* OwnerController, class APawn* ControlledPawn); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveOnFinished(class AActor* Owner, class AAIController* OwnerController, class APawn* ControlledPawn, EHTNNodeResult Result); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	bool ReceiveRecheckPlan(class AActor* Owner, class AAIController* OwnerController, class APawn* ControlledPawn); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void ReceiveTick(class AActor* Owner, class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20

	bool IsTaskAborting() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111ED10
	bool IsTaskExecuting() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14111ED40
	void ReceiveCreatePlanSteps(class AActor* Owner, class AAIController* OwnerController, class APawn* ControlledPawn) const; // (Event, Protected, BlueprintEvent, Const) // @ 0x14B5B5E20
	void ReceiveDescribePlanStepToVisualLog(class AActor* Owner, class AAIController* OwnerController, class APawn* ControlledPawn, class FName VisLogCategoryName) const; // (Event, Protected, BlueprintEvent, Const) // @ 0x14B5B5E20
	void SubmitPlanStep(int32 Cost) const; // (Final, Native, Protected, BlueprintCallable, Const) // @ 0x14111F710

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNTask_BlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNTask_BlueprintBase")
	}
	static class UHTNTask_BlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNTask_BlueprintBase>();
	}
};
DUMPER7_ASSERTS_UHTNTask_BlueprintBase;

// Class HTN.HTNTask_ClearValue
// 0x0000 (0x00C8 - 0x00C8)
class UHTNTask_ClearValue final : public UHTNTask_BlackboardBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNTask_ClearValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNTask_ClearValue")
	}
	static class UHTNTask_ClearValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNTask_ClearValue>();
	}
};
DUMPER7_ASSERTS_UHTNTask_ClearValue;

// Class HTN.HTNTask_EQSQuery
// 0x0050 (0x0118 - 0x00C8)
class UHTNTask_EQSQuery final : public UHTNTask_BlackboardBase
{
public:
	struct FEQSParametrizedQueryExecutionRequestHTN EQSRequest;                                      // 0x00C8(0x0048)(Edit, NativeAccessSpecifierPrivate)
	int32                                         MaxNumCandidatePlans;                              // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNTask_EQSQuery")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNTask_EQSQuery")
	}
	static class UHTNTask_EQSQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNTask_EQSQuery>();
	}
};
DUMPER7_ASSERTS_UHTNTask_EQSQuery;

// Class HTN.HTNTask_MoveTo
// 0x0020 (0x00E8 - 0x00C8)
class UHTNTask_MoveTo final : public UHTNTask_BlackboardBase
{
public:
	float                                         AcceptableRadius;                                  // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObservedBlackboardValueTolerance;                  // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bObserveBlackboardValue : 1;                       // 0x00DC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowStrafe : 1;                                  // 0x00DC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowPartialPath : 1;                             // 0x00DC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTrackMovingGoal : 1;                              // 0x00DC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bProjectGoalLocation : 1;                          // 0x00DC(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReachTestIncludesAgentRadius : 1;                 // 0x00DC(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReachTestIncludesGoalRadius : 1;                  // 0x00DC(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_DC_7 : 1;                                   // 0x00DC(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         bTestPathDuringPlanning : 1;                       // 0x00DD(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUsePathCostInsteadOfLength : 1;                   // 0x00DD(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForcePlanTimeStringPulling : 1;                   // 0x00DD(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CostPerUnitPathLength;                             // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNTask_MoveTo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNTask_MoveTo")
	}
	static class UHTNTask_MoveTo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNTask_MoveTo>();
	}
};
DUMPER7_ASSERTS_UHTNTask_MoveTo;

// Class HTN.HTNTask_SetValue
// 0x0040 (0x0108 - 0x00C8)
class UHTNTask_SetValue final : public UHTNTask_BlackboardBase
{
public:
	struct FWorldstateSetValueContainer           Value;                                             // 0x00C8(0x0040)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HTNTask_SetValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HTNTask_SetValue")
	}
	static class UHTNTask_SetValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTNTask_SetValue>();
	}
};
DUMPER7_ASSERTS_UHTNTask_SetValue;

