#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HudFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameCore_structs.hpp"


namespace SDK
{

// Enum HudFramework.EHudShowType
// NumValues: 0x0004
enum class EHudShowType : uint8
{
	OnDemand                                 = 0,
	AutoShow                                 = 1,
	OnlyPreCreateController                  = 2,
	EHudShowType_MAX                         = 3,
};

// Enum HudFramework.EHudUpdateFrequency
// NumValues: 0x000A
enum class EHudUpdateFrequency : uint8
{
	NeverTick                                = 0,
	FPS1                                     = 1,
	FPS10                                    = 10,
	FPS20                                    = 20,
	FPS30                                    = 30,
	FPS40                                    = 40,
	FPS50                                    = 50,
	FPS60                                    = 60,
	EveryFrame                               = 255,
	EHudUpdateFrequency_MAX                  = 256,
};

// Enum HudFramework.EHudLayer
// NumValues: 0x000A
enum class EHudLayer : uint8
{
	None                                     = 0,
	ScreenEffect                             = 11,
	Mark                                     = 12,
	Common                                   = 13,
	Hint                                     = 14,
	Feedback                                 = 15,
	Touch                                    = 16,
	Popup                                    = 17,
	LargePopup                               = 18,
	EHudLayer_MAX                            = 19,
};

// ScriptStruct HudFramework.HudConfigRow
// 0x0038 (0x0048 - 0x0010)
struct FHudConfigRow final : public FDescRowBase
{
public:
	class FName                                   ViewName;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHudLayer                                     HudLayer;                                          // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSafeZone;                                         // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UBaseHudController>         ControllerClass;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         ViewSoftClassPath;                                 // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHudShowType                                  HudShowType;                                       // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHudUpdateFrequency                           UpdateFrequncy;                                    // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableTickWhenHide;                               // 0x0042(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShippingNoCreate;                                 // 0x0043(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHudConfigRow;

// ScriptStruct HudFramework.HudLRUConfig
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FHudLRUConfig final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHudLRUConfig;

// ScriptStruct HudFramework.HudLRUItem
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FHudLRUItem final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHudLRUItem;

// ScriptStruct HudFramework.HudDebugInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FHudDebugInfo final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHudDebugInfo;

}

