#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HudFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UITween_structs.hpp"
#include "UMG_classes.hpp"
#include "HudFramework_structs.hpp"


namespace SDK
{

// Class HudFramework.BaseHudController
// 0x0048 (0x0070 - 0x0028)
class UBaseHudController : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                HudOwner;                                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LocalFocusActor;                                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Show(); // (Final, Native, Private) // @ 0x1420124C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseHudController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseHudController")
	}
	static class UBaseHudController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseHudController>();
	}
};
DUMPER7_ASSERTS_UBaseHudController;

// Class HudFramework.BaseHudView
// 0x0078 (0x0368 - 0x02F0)
class UBaseHudView : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x8];                                      // 0x02F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIAnimationController                 AnimationController;                               // 0x02F8(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   FadeInAnimationName;                               // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   FadeOutAnimationName;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UWidgetAnimation*>               AllUMGAnimations;                                  // 0x0328(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bInFadeIn;                                         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInFadeOut;                                        // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       UMGFadeInAnimation;                                // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       UMGFadeOutAnimation;                               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 LocalFocusActor;                                   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x10];                                     // 0x0358(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToRoot(class UWidget* UIIns, int32 ZOrder, EHudLayer HudLayer); // (Native, Protected) // @ 0x142011F60
	void BP_OnDestroy(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnInit(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnPostHide(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_OnShow(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	TArray<class UWidgetAnimation*> GetAllAnimations(); // (Final, Native, Public) // @ 0x142012060
	class UWidgetAnimation* GetUMGFadeInAnim(); // (Final, Native, Private) // @ 0x142012140
	class UWidgetAnimation* GetUMGFadeOutAnim(); // (Final, Native, Private) // @ 0x142012170
	bool HasFadeInAnimation(); // (Final, Native, Private) // @ 0x1420121A0
	bool HasFadeOutAnimation(); // (Final, Native, Private) // @ 0x1420121D0
	void OnAnimationFinished_Implementation(const class UWidgetAnimation* Animation); // (Final, Native, Private) // @ 0x142012200
	void OnFadeInAnimationEnd(); // (Final, Native, Private) // @ 0x141FA50E0
	void OnFadeOutAnimationEnd(); // (Final, Native, Private) // @ 0x141FA5100
	bool PlayFadeInAnimation(); // (Final, Native, Private) // @ 0x142012370
	bool PlayFadeOutAnimation(); // (Final, Native, Private) // @ 0x1420123A0
	void RefreshFadeOutAnimation(); // (Final, Native, Private) // @ 0x1420123D0
	void StopFadeInAnimation(); // (Final, Native, Private) // @ 0x140EE3BE0
	void StopFadeOutAnimation(); // (Final, Native, Private) // @ 0x141FA5080

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseHudView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseHudView")
	}
	static class UBaseHudView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseHudView>();
	}
};
DUMPER7_ASSERTS_UBaseHudView;

// Class HudFramework.HudViewInterface
// 0x0000 (0x0000 - 0x0000)
class IHudViewInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HudViewInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HudViewInterface")
	}
	static class IHudViewInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHudViewInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHudViewInterface;

// Class HudFramework.HudEntity
// 0x00A0 (0x00C8 - 0x0028)
class UHudEntity final : public UObject
{
public:
	TMap<class FName, class UBaseHudController*>  HudControllerMap;                                  // 0x0028(0x0050)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x50];                                      // 0x0078(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HudEntity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HudEntity")
	}
	static class UHudEntity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudEntity>();
	}
};
DUMPER7_ASSERTS_UHudEntity;

// Class HudFramework.HudManager
// 0x00C0 (0x00E8 - 0x0028)
class UHudManager final : public UObject
{
public:
	struct FSoftObjectPath                        HudVisiableAssetPath;                              // 0x0028(0x0018)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           HudConfigNameArray;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UHudEntity*                             HudEntity;                                         // 0x0050(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x68];                                      // 0x0058(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudVisiableChecker*                    HudVisiableChecker;                                // 0x00C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x18];                                      // 0x00C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LocalFocusActor;                                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AddHudOrState(class FName Name_0); // (Final, Native, Public) // @ 0x142011EE0
	void OnAsyncLoadCompleted(const struct FSoftObjectPath& AssetPath); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x142012290
	void RemoveHudOrState(class FName Name_0, bool bDestroy); // (Final, Native, Public) // @ 0x1420123F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HudManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HudManager")
	}
	static class UHudManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudManager>();
	}
};
DUMPER7_ASSERTS_UHudManager;

// Class HudFramework.HudVisiableAsset
// 0x0010 (0x0038 - 0x0028)
class UHudVisiableAsset final : public UObject
{
public:
	TArray<class FName>                           ViewNameArray;                                     // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HudVisiableAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HudVisiableAsset")
	}
	static class UHudVisiableAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudVisiableAsset>();
	}
};
DUMPER7_ASSERTS_UHudVisiableAsset;

// Class HudFramework.HudVisiableChecker
// 0x0238 (0x0260 - 0x0028)
class UHudVisiableChecker final : public UObject
{
public:
	uint8                                         Pad_28[0x238];                                     // 0x0028(0x0238)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HudVisiableChecker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HudVisiableChecker")
	}
	static class UHudVisiableChecker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHudVisiableChecker>();
	}
};
DUMPER7_ASSERTS_UHudVisiableChecker;

}

