#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImGui

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Enum ImGui.EImGuiDPIScaleMethod
// NumValues: 0x0003
enum class EImGuiDPIScaleMethod : uint8
{
	ImGui                                    = 0,
	Slate                                    = 1,
	EImGuiDPIScaleMethod_MAX                 = 2,
};

// Enum ImGui.EImGuiCanvasSizeType
// NumValues: 0x0004
enum class EImGuiCanvasSizeType : uint8
{
	Custom                                   = 0,
	Desktop                                  = 1,
	Viewport                                 = 2,
	EImGuiCanvasSizeType_MAX                 = 3,
};

// ScriptStruct ImGui.ImGuiDPIScaleInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FImGuiDPIScaleInfo final
{
public:
	EImGuiDPIScaleMethod                          ScalingMethod;                                     // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                     DPICurve;                                          // 0x0008(0x00A0)(Edit, Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bScaleWithCurve;                                   // 0x00A8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FImGuiDPIScaleInfo;

// ScriptStruct ImGui.ImGuiCanvasSizeInfo
// 0x0010 (0x0010 - 0x0000)
struct FImGuiCanvasSizeInfo final
{
public:
	EImGuiCanvasSizeType                          SizeType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Width;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtendToViewport;                                 // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FImGuiCanvasSizeInfo;

// ScriptStruct ImGui.ImGuiKeyInfo
// 0x0020 (0x0020 - 0x0000)
struct FImGuiKeyInfo final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECheckBoxState                                Shift;                                             // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECheckBoxState                                Ctrl;                                              // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECheckBoxState                                Alt;                                               // 0x001A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECheckBoxState                                Cmd;                                               // 0x001B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FImGuiKeyInfo;

}

