#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ImGui

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ImGui_structs.hpp"


namespace SDK
{

// Class ImGui.ImGuiInputHandler
// 0x0028 (0x0050 - 0x0028)
class UImGuiInputHandler final : public UObject
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ImGuiInputHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ImGuiInputHandler")
	}
	static class UImGuiInputHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImGuiInputHandler>();
	}
};
DUMPER7_ASSERTS_UImGuiInputHandler;

// Class ImGui.ImGuiSettings
// 0x0100 (0x0128 - 0x0028)
class UImGuiSettings final : public UObject
{
public:
	struct FSoftClassPath                         ImGuiInputHandlerClass;                            // 0x0028(0x0018)(Edit, ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShareKeyboardInput;                               // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShareGamepadInput;                                // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShareMouseInput;                                  // 0x0042(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseSoftwareCursor;                                // 0x0043(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FImGuiKeyInfo                          ToggleInput;                                       // 0x0048(0x0020)(Edit, Config, Protected, NativeAccessSpecifierProtected)
	struct FImGuiCanvasSizeInfo                   CanvasSize;                                        // 0x0068(0x0010)(Edit, Config, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FImGuiDPIScaleInfo                     DpiScale;                                          // 0x0078(0x00B0)(Edit, Config, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ImGuiSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ImGuiSettings")
	}
	static class UImGuiSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImGuiSettings>();
	}
};
DUMPER7_ASSERTS_UImGuiSettings;

}

