#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Intro

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "DFMGameLoading_structs.hpp"


namespace SDK
{

// Class Intro.IntroGameMode
// 0x0070 (0x08E0 - 0x0870)
class AIntroGameMode final : public ADFMGameMode
{
public:
	class FString                                 IntroQuestDir;                                     // 0x0870(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntroQuestID;                                      // 0x0880(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_884[0x4];                                      // 0x0884(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        IntroQuestPath;                                    // 0x0888(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                IntroQStagePath;                                   // 0x08A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   DefaultPlayerStartTag;                             // 0x08B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         IntroPlayerStartArray;                             // 0x08B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class AIntroGameState*                        IntroGameState;                                    // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8D0[0x10];                                     // 0x08D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class APlayerStart* FindDefaultPlayerStart(); // (Final, Native, Protected) // @ 0x14AD3A8D0
	TArray<class APlayerStart*> FindIntroPlayerStart(class FName StartSpotTag); // (Final, Native, Public) // @ 0x14AD3A900
	class ADFMPlayerController* GetPlayerControler(int32 TeamID, int32 PlayerIndexInTeam); // (Final, Native, Public, BlueprintCallable) // @ 0x14AD3AA30
	void NewstartAllPlayer(); // (Final, Native, Public, BlueprintCallable) // @ 0x14AD3AAF0
	void NewstartPlayer(int32 PlayerIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x14AD3AB10
	void OnClientGameLoadingFinished(EFlowResult Result); // (Final, Native, Protected) // @ 0x14AD3AB90
	void OnQuestAsyncLoadComplete(class AGPQuest* Quest); // (Final, Native, Protected) // @ 0x14AD3AC10
	void RebornIntroPlayer(class ADFMPlayerController* PlayerController, bool ResetAlivePlayerPosition, bool RefillArmor); // (Final, Native, Public, BlueprintCallable) // @ 0x14AD3AC90
	void RebornPlayer(class AController* PlayerController, bool RefillArmor); // (Final, Native, Public) // @ 0x14AD3ADA0
	void SetCurrentStartSpot(class FName StartSpotName); // (Final, Native, Public, BlueprintCallable) // @ 0x14AD3AE70
	void SetPlayerVisiable(int32 PlayerIndex, bool bVisiblity); // (Final, Native, Public, BlueprintCallable) // @ 0x14AD3AEF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntroGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntroGameMode")
	}
	static class AIntroGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntroGameMode>();
	}
};
DUMPER7_ASSERTS_AIntroGameMode;

// Class Intro.IntroGameState
// 0x0000 (0x0E90 - 0x0E90)
class AIntroGameState final : public ADFMGameState
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntroGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntroGameState")
	}
	static class AIntroGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntroGameState>();
	}
};
DUMPER7_ASSERTS_AIntroGameState;

// Class Intro.IntroPlayerState
// 0x0010 (0x1408 - 0x13F8)
class AIntroPlayerState final : public ADFMPlayerState
{
public:
	class APlayerStart*                           PVEPlayerStart;                                    // 0x13F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlayerVisiable;                                  // 0x1400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1401[0x7];                                     // 0x1401(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetPlayerVisiable(); // (Final, Native, Public) // @ 0x14AD3B2F0
	void SetPlayerVisiable(bool bPlayerVisiable); // (Final, Native, Public) // @ 0x14AD3B310

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IntroPlayerState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IntroPlayerState")
	}
	static class AIntroPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntroPlayerState>();
	}
};
DUMPER7_ASSERTS_AIntroPlayerState;

}

