#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IrisWorld

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GPGameHud_classes.hpp"
#include "IrisWorld_structs.hpp"
#include "DFMGameHud_classes.hpp"
#include "GameCore_classes.hpp"
#include "Engine_classes.hpp"
#include "GPQuest_structs.hpp"
#include "GPQuest_classes.hpp"
#include "GPGlobalDefines_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameplay_classes.hpp"
#include "DFMGameLoading_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "DFMGlobalDefines_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class IrisWorld.BigMapExpiredQuestDetailView
// 0x0048 (0x0430 - 0x03E8)
class UBigMapExpiredQuestDetailView final : public UBaseUIView
{
public:
	class UTextBlock*                             QuestName;                                         // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             countdown;                                         // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             QuestDesTextBlock;                                 // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_400[0x30];                                     // 0x0400(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BigMapExpiredQuestDetailView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BigMapExpiredQuestDetailView")
	}
	static class UBigMapExpiredQuestDetailView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBigMapExpiredQuestDetailView>();
	}
};
DUMPER7_ASSERTS_UBigMapExpiredQuestDetailView;

// Class IrisWorld.BigMapIrisHUDView
// 0x00D0 (0x0B38 - 0x0A68)
class UBigMapIrisHUDView final : public UBigMapHUDView
{
public:
	class UBigMapIrisItem*                        CurSelectedItem;                                   // 0x0A68(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetSwitcher*                        SelectedStateSW;                                   // 0x0A70(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                        SelectedTypeSW;                                    // 0x0A78(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TargetDetailName;                                  // 0x0A80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TargetDetailDes;                                   // 0x0A88(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                ConformStrongholdBtn;                              // 0x0A90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBigMapQuestDetailView*                 QuestDetailView;                                   // 0x0A98(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBigMapExpiredQuestDetailView*          ExpiredQuestDetailView;                            // 0x0AA0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInSwitchAnim;                                     // 0x0AA8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA9[0x7];                                      // 0x0AA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           MapInfoWidget;                                     // 0x0AB0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UMapStrongholdHUDView>      StrongholdWidget;                                  // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC0[0x8];                                      // 0x0AC0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStrongholdRow>                 MapStrongholdArr;                                  // 0x0AC8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<int32, struct FIrisStartSpotRow>         StartSpotDict;                                     // 0x0AD8(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UMapMissionHUDView>         MissionWidget;                                     // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B30[0x8];                                      // 0x0B30(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnQuestItemClick(class FName Name_0); // (Final, Native, Protected) // @ 0x14ADA9200
	void OnStrongholdClick(class FName Name_0); // (Final, Native, Protected) // @ 0x14ADA96F0
	void OnStrongholdTeleportClick(); // (Final, Native, Protected) // @ 0x14ADA9770
	void PlaySwitchAnimationIris(bool bSwitchToFullScreen); // (Event, Protected, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BigMapIrisHUDView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BigMapIrisHUDView")
	}
	static class UBigMapIrisHUDView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBigMapIrisHUDView>();
	}
};
DUMPER7_ASSERTS_UBigMapIrisHUDView;

// Class IrisWorld.BigMapIrisItem
// 0x0010 (0x0468 - 0x0458)
class UBigMapIrisItem : public UMapItemHUDView
{
public:
	uint8                                         Pad_458[0x10];                                     // 0x0458(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BigMapIrisItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BigMapIrisItem")
	}
	static class UBigMapIrisItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBigMapIrisItem>();
	}
};
DUMPER7_ASSERTS_UBigMapIrisItem;

// Class IrisWorld.BigMapQuestDetailObjection
// 0x0020 (0x0408 - 0x03E8)
class UBigMapQuestDetailObjection final : public UBaseUIView
{
public:
	class UImage*                                 QuestItemType;                                     // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             QuestItemName;                                     // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProgressBar*                           ProgressBar;                                       // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             ProgressText;                                      // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BigMapQuestDetailObjection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BigMapQuestDetailObjection")
	}
	static class UBigMapQuestDetailObjection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBigMapQuestDetailObjection>();
	}
};
DUMPER7_ASSERTS_UBigMapQuestDetailObjection;

// Class IrisWorld.BigMapQuestDetailView
// 0x0070 (0x0458 - 0x03E8)
class UBigMapQuestDetailView final : public UBaseUIView
{
public:
	class UTextBlock*                             QuestName;                                         // 0x03E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             QuestType;                                         // 0x03F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollGridBox*                         QuestItemScrollGridBox;                            // 0x03F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollBox*                             QuestDesScrollBox;                                 // 0x0400(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             QuestDesTextBlock;                                 // 0x0408(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            TrackBtn;                                          // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                UnReceiveDes;                                      // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UBigMapQuestDetailObjection> BigMapQusetDetailWidget;                          // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_428[0x30];                                     // 0x0428(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetQuestItemCount(); // (Final, Native, Public) // @ 0x14ADA8D30
	void OnProcessItemWidget(int32 Position, class UWidget* ItemWidget); // (Final, Native, Public) // @ 0x14ADA9140
	void OnTrackBtnClick(); // (Final, Native, Protected) // @ 0x14ADA97B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BigMapQuestDetailView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BigMapQuestDetailView")
	}
	static class UBigMapQuestDetailView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBigMapQuestDetailView>();
	}
};
DUMPER7_ASSERTS_UBigMapQuestDetailView;

// Class IrisWorld.ComposableGameModeBase
// 0x0028 (0x0480 - 0x0458)
class AComposableGameModeBase : public AGameMode
{
public:
	TArray<TSubclassOf<class USubGameModeBase>>   SubGameModeClasses;                                // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class USubGameModeBase*                       PrimarySubGameMode;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USubGameModeBase*>               SecondarySubGameModes;                             // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ComposableGameModeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ComposableGameModeBase")
	}
	static class AComposableGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AComposableGameModeBase>();
	}
};
DUMPER7_ASSERTS_AComposableGameModeBase;

// Class IrisWorld.CountDownHUDBaseView
// 0x0040 (0x0430 - 0x03F0)
class UCountDownHUDBaseView final : public UCommonHUDView
{
public:
	class FText                                   Title;                                             // 0x03F0(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x0408(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainningTime;                                    // 0x040C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQA_CountdownType                             CountdownType;                                     // 0x0410(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FinalCountDownTime;                                // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EmergencyCountDownTime;                            // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SuperEmergencyCountDownTime;                       // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 Image_63;                                          // 0x0420(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_FadeIn(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_FadeOut(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_PlayCountAudio(bool Strong); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetRemainningTime(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetTitle(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void BP_StartFinalCountDown(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetRemainningTime(float InRemainningTime); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADA9F70
	void SetTitle(const class FText& Title_, EQA_CountdownType InCountdownType); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADA9FF0
	void SetTotalTime(float InTotalTime); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAA110
	void SetType(int32 TypeID); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CountDownHUDBaseView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CountDownHUDBaseView")
	}
	static class UCountDownHUDBaseView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCountDownHUDBaseView>();
	}
};
DUMPER7_ASSERTS_UCountDownHUDBaseView;

// Class IrisWorld.DeadBodyDrugSubSystem
// 0x0020 (0x0390 - 0x0370)
class ADeadBodyDrugSubSystem final : public ALevelSubsystem
{
public:
	float                                         SpawnRate;                                         // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ADeadBodyDrug>              SpawnDrugClass;                                    // 0x0378(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ADeadBodyDrug*>                  AmmoBoxArr;                                        // 0x0380(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnActiveRaidEntity(uint32 RaidEntityID); // (Final, Native, Protected) // @ 0x14ADA9040
	void OnAIPlayerDiedEvent(class AController* cpc, class AController* KillerController); // (Final, Native, Protected) // @ 0x14ADA8F80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DeadBodyDrugSubSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeadBodyDrugSubSystem")
	}
	static class ADeadBodyDrugSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeadBodyDrugSubSystem>();
	}
};
DUMPER7_ASSERTS_ADeadBodyDrugSubSystem;

// Class IrisWorld.IrisCharacter
// 0x0000 (0x34F0 - 0x34F0)
class AIrisCharacter final : public ADFMPlayerCharacter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisCharacter")
	}
	static class AIrisCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisCharacter>();
	}
};
DUMPER7_ASSERTS_AIrisCharacter;

// Class IrisWorld.IrisPlayerResurrectComponent
// 0x0000 (0x0140 - 0x0140)
class UIrisPlayerResurrectComponent final : public UDFMPlayerResurrectComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisPlayerResurrectComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisPlayerResurrectComponent")
	}
	static class UIrisPlayerResurrectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisPlayerResurrectComponent>();
	}
};
DUMPER7_ASSERTS_UIrisPlayerResurrectComponent;

// Class IrisWorld.IrisRaidDataComponent
// 0x0490 (0x0588 - 0x00F8)
class UIrisRaidDataComponent final : public UActorComponent
{
public:
	struct FRaidStateInfo                         RaidStateInfo;                                     // 0x00F8(0x0018)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	TArray<uint64>                                ConditionProps;                                    // 0x0110(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FRaidVoteInfo>                  RaidVoteInfos;                                     // 0x0120(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<uint64>                                ConfirmedPlayers;                                  // 0x0130(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FMissionSettlementData>         MissionSettlementDatas;                            // 0x0140(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<uint64>                                GiveUpVotePlayers;                                 // 0x0150(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	class UDataTable*                             IrisRaidDataTable;                                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             IrisRaidEntityDataTable;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             QuestDataTable;                                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             QuestTimeLimitTable;                               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             MissionLevelTable;                                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QuestStartupTimestamp;                             // 0x0190(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x3F4];                                    // 0x0194(0x03F4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 ClientGetQuestTimeLeft(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x14ADA8CC0
	void ClientQuestCountdown(); // (Final, Native, Protected) // @ 0x14ADA8CF0
	void InitIrisRaidData(); // (Final, Native, Public) // @ 0x14ADA8D90
	void MulticastLoadQuestLevel(const class FString& QLevelPath); // (Net, NetReliable, Native, Event, NetMulticast, Protected) // @ 0x1493205B0
	void MulticastUnLoadQuestLevel(const class FString& QLevelPath); // (Net, NetReliable, Native, Event, NetMulticast, Protected) // @ 0x14ADA8DB0
	void NotifyServerLoadQLevelComplete(); // (Net, NetReliable, Native, Event, Protected, NetServer) // @ 0x142A87700
	void NtfClientPlayRaidIntroCS(class FName CSTag); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x144ABF480
	void OnClientReadyToPlayNotify(uint64 PlayerId); // (Final, Native, Private) // @ 0x14ADA90C0
	void OnPostEndQuest(class AGPQuest* InQuest); // (Final, Native, Protected) // @ 0x140C98C70
	void OnPostEndStage(class AGPQuestStage* InStage); // (Final, Native, Protected) // @ 0x140C98C70
	void OnQLevelLoadComplete(); // (Final, Native, Protected) // @ 0x140C994B0
	void OnQuitGameInitiative(EMatchOverReason MatchOverReason, int64 PlayerUin); // (Final, Native, Protected) // @ 0x14945BE40
	void OnRaidIntroCSBegin(class AGPSequenceActor* SeqActor); // (Final, Native, Protected) // @ 0x14ADA9280
	void OnRaidIntroCSPlayEnd(class AGPSequenceActor* SeqActor); // (Final, Native, Protected) // @ 0x14ADA9300
	void OnRep_ConditionProps(); // (Final, Native, Protected) // @ 0x14ADA9380
	void OnRep_ConfirmedPlayers(); // (Final, Native, Protected) // @ 0x14ADA93A0
	void OnRep_MissionSettlementDatas(); // (Final, Native, Protected) // @ 0x14ADA93C0
	void OnRep_RaidGiveUpVoteInfo(); // (Final, Native, Protected) // @ 0x14ADA93E0
	void OnRep_RaidStateInfo(const struct FRaidStateInfo& LastRaidStateInfo); // (Final, Native, Protected) // @ 0x14ADA9400
	void OnRep_RaidVoteInfo(); // (Final, Native, Protected) // @ 0x14ADA94B0
	void OnReplayStage(class AGPQuestStage* InStage); // (Final, Native, Protected) // @ 0x140C98C70
	void OnStageStateChanged(class AGPQuestStage* InStage); // (Final, Native, Protected) // @ 0x140C98C70
	void OnTeamPurchaseRevive(); // (Final, Native, Protected) // @ 0x14ADA9790
	void ServerActivateQuest(int64 QuestID); // (Final, Native, Public) // @ 0x14ADA9920
	void ServerActivateRaidEntity(uint32 EntityID); // (Final, Native, Public) // @ 0x14ADA99A0
	void ServerAddConditionProp(uint64 ConditionProp, uint64 PlayerId); // (Final, Native, Public) // @ 0x14ADA9A20
	void ServerOnMissionSettlement(int32 RaidID, int32 QuestID, const TArray<int32>& ItemArray); // (Final, Native, Protected) // @ 0x14ADA9AE0
	void ServerOnRaidBuyCondition(uint64 PropId); // (Final, Native, Protected) // @ 0x14ADA9C70
	void ServerOnRaidLevelComplete(); // (Final, Native, Protected) // @ 0x14ADA9CF0
	void ServerRaidGiveUpVote(uint64 PlayerId, bool bGiveUp); // (Final, Native, Public) // @ 0x14ADA9D10
	void ServerRaidVote(int64 QuestID, uint64 PlayerId, bool bCancelVote); // (Final, Native, Public) // @ 0x14ADA9DE0
	void ServerStateComfirmed(uint64 PlayerId); // (Final, Native, Public) // @ 0x14ADA9EF0
	void SwitchRaidStage(ERaidStage NewStage); // (Final, Native, Public) // @ 0x14ADAA1B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisRaidDataComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisRaidDataComponent")
	}
	static class UIrisRaidDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisRaidDataComponent>();
	}
};
DUMPER7_ASSERTS_UIrisRaidDataComponent;

// Class IrisWorld.IrisRaidDataStatisticsComponent
// 0x0070 (0x0238 - 0x01C8)
class UIrisRaidDataStatisticsComponent final : public UDataStatisticsBaseComponent
{
public:
	class FText                                   MissionName;                                       // 0x01C8(0x0018)(Net, NativeAccessSpecifierPublic)
	struct FRaid1Info                             Raid1Info;                                         // 0x01E0(0x0028)(NativeAccessSpecifierPublic)
	struct FRaid2Info                             Raid2Info;                                         // 0x0208(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_214[0x24];                                     // 0x0214(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAIDeath(class AGPCharacterBase* CHARACTER, class AController* Killer, const class UDamageType* DamageType); // (Final, Native, Public) // @ 0x14ADA8E80
	void OnServerActiveRaidEntity(uint32 RaidEntityID); // (Final, Native, Public) // @ 0x14ADA94D0
	void OnServerRaidQuestEnded(int64 CurQuestID, ERaidStage CurStage, int32 TimeSpent); // (Final, Native, Public) // @ 0x14ADA9550

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisRaidDataStatisticsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisRaidDataStatisticsComponent")
	}
	static class UIrisRaidDataStatisticsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisRaidDataStatisticsComponent>();
	}
};
DUMPER7_ASSERTS_UIrisRaidDataStatisticsComponent;

// Class IrisWorld.IrisRaidEntranceView
// 0x0000 (0x0688 - 0x0688)
class UIrisRaidEntranceView final : public UDFMInteractorView_ItemBase
{
public:
	void EnterRaid(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADA8D10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisRaidEntranceView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisRaidEntranceView")
	}
	static class UIrisRaidEntranceView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisRaidEntranceView>();
	}
};
DUMPER7_ASSERTS_UIrisRaidEntranceView;

// Class IrisWorld.IrisSafeHouseGameMode
// 0x0000 (0x0480 - 0x0480)
class AIrisSafeHouseGameMode final : public AComposableGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisSafeHouseGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisSafeHouseGameMode")
	}
	static class AIrisSafeHouseGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisSafeHouseGameMode>();
	}
};
DUMPER7_ASSERTS_AIrisSafeHouseGameMode;

// Class IrisWorld.Stronghold
// 0x0068 (0x0090 - 0x0028)
class UStronghold final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EStrongholdState                              CurState;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class ADFMCharacter*>                    CharArray;                                         // 0x0040(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void ClearNPCs(bool bAll); // (Final, Native, Public) // @ 0x14ADA8C30
	uint32 GetShID(); // (Final, Native, Public) // @ 0x14ADA8D60
	void OnSpawnEnd(); // (Final, Native, Public) // @ 0x14ADA9650
	void OnStateChange(EStrongholdState ENewState); // (Final, Native, Public) // @ 0x14ADA9670
	void SpawnNPCs(); // (Final, Native, Public) // @ 0x14ADAA190

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Stronghold")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Stronghold")
	}
	static class UStronghold* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStronghold>();
	}
};
DUMPER7_ASSERTS_UStronghold;

// Class IrisWorld.StrongholdSpawnContainer
// 0x0010 (0x0380 - 0x0370)
class AStrongholdSpawnContainer final : public AActor
{
public:
	class AInventoryPickup_Container*             PickupContainer;                                   // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AInventoryPickup_Container* BP_AddSpawnContainer(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ResetSpawnContainer(const struct FItemID& ItemID, const TArray<struct FInventoryItemInfo>& BoxInnerItems); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14ADA97D0
	void Unspawn(); // (Final, Native, Public) // @ 0x14ADAA230

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StrongholdSpawnContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StrongholdSpawnContainer")
	}
	static class AStrongholdSpawnContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStrongholdSpawnContainer>();
	}
};
DUMPER7_ASSERTS_AStrongholdSpawnContainer;

// Class IrisWorld.IrisStrongholdComponent
// 0x00D0 (0x01C8 - 0x00F8)
class UIrisStrongholdComponent final : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x38];                                      // 0x00F8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStrongholdData>                StrongHoldArray;                                   // 0x0130(0x0010)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x88];                                     // 0x0140(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientTeleportToStronghold(const struct FVector& TargetLocation); // (Net, NetReliable, Native, Event, Public, HasDefaults, NetClient) // @ 0x14ADAD590
	void OnBeginMission(uint64 missionid, class AGPPlayerController* cpc); // (Final, Native, Public) // @ 0x14ADAE3E0
	void OnEnterStrongholdClient(uint32 StrongholdID); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x144A95A80
	void OnFinishMission(uint64 missionid, class AGPPlayerController* cpc); // (Final, Native, Public) // @ 0x14ADAE5C0
	void OnRep_StrongholdArray(); // (Final, Native, Public) // @ 0x14ADAE7E0
	void ReqTeleportToStronghold(uint32 StrongholdID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149464C50
	void RmStronghold(uint32 StrongholdID); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14939A9E0
	void ServerTeleportTo(const struct FVector& TargetLocation); // (Net, NetReliable, Native, Event, Public, NetServer, HasDefaults) // @ 0x144AC9510
	void TraceStronghold(uint32 StrongholdID, EStrongholdState EState); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x14AC843C0
	void UpdateState(uint32 StrongholdID, EStrongholdState EState); // (Net, NetReliable, Native, Event, Public, NetClient) // @ 0x144B336D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisStrongholdComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisStrongholdComponent")
	}
	static class UIrisStrongholdComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisStrongholdComponent>();
	}
};
DUMPER7_ASSERTS_UIrisStrongholdComponent;

// Class IrisWorld.IrisStrongholdSubsystem
// 0x00A8 (0x0418 - 0x0370)
class AIrisStrongholdSubsystem final : public ALevelSubsystem
{
public:
	TMap<uint32, class UStronghold*>              SHMap;                                             // 0x0370(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C0[0x58];                                     // 0x03C0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisStrongholdSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisStrongholdSubsystem")
	}
	static class AIrisStrongholdSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisStrongholdSubsystem>();
	}
};
DUMPER7_ASSERTS_AIrisStrongholdSubsystem;

// Class IrisWorld.IrisWorldCustomPlayerStateDataComponent
// 0x0010 (0x0108 - 0x00F8)
class UIrisWorldCustomPlayerStateDataComponent final : public UActorComponent
{
public:
	class AGPPlayerState*                         PlayerState;                                       // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndAlertTimestamp;                                 // 0x0100(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_EndAlertTimestamp(); // (Final, Native, Public) // @ 0x14ADAE780

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldCustomPlayerStateDataComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldCustomPlayerStateDataComponent")
	}
	static class UIrisWorldCustomPlayerStateDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisWorldCustomPlayerStateDataComponent>();
	}
};
DUMPER7_ASSERTS_UIrisWorldCustomPlayerStateDataComponent;

// Class IrisWorld.IrisWorldGameMode
// 0x0030 (0x08A0 - 0x0870)
class AIrisWorldGameMode final : public ADFMGameMode
{
public:
	TArray<class FName>                           AICreateCarryBodyContainTags;                      // 0x0870(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_880[0x20];                                     // 0x0880(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RebornPlayer(class AController* PlayerController, bool RefillArmor); // (Final, Native, Public) // @ 0x146C297B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldGameMode")
	}
	static class AIrisWorldGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisWorldGameMode>();
	}
};
DUMPER7_ASSERTS_AIrisWorldGameMode;

// Class IrisWorld.IrisWorldGameplayDelegates
// 0x00C8 (0x00F8 - 0x0030)
class UIrisWorldGameplayDelegates final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(float Value)>   IrisWorldTestdEvent;                               // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnIrisSafeHouseReady;                              // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<uint64>& GiveUpVotePlayers)> ClientOnRaidVoteGiveUpInfoChanged; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x98];                                      // 0x0060(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UIrisWorldGameplayDelegates* Get(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD9B0

	void NotifyIrisSafeHouseReady(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAE1E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldGameplayDelegates")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldGameplayDelegates")
	}
	static class UIrisWorldGameplayDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisWorldGameplayDelegates>();
	}
};
DUMPER7_ASSERTS_UIrisWorldGameplayDelegates;

// Class IrisWorld.IrisWorldGameplaySubsystem
// 0x0020 (0x0390 - 0x0370)
class AIrisWorldGameplaySubsystem final : public ALevelSubsystem
{
public:
	uint8                                         Pad_370[0x20];                                     // 0x0370(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientOnRaidIntroCSBegin(class AGPSequenceActor* SeqActor); // (Final, Native, Protected) // @ 0x14ADAD490
	void ClientOnRaidIntroCSPlayEnd(class AGPSequenceActor* SeqActor); // (Final, Native, Protected) // @ 0x140C98C70
	void ClientPlayRaidIntro(); // (Final, Native, Protected) // @ 0x140C994B0
	void NotifyClientReady(); // (Final, Native, Protected) // @ 0x14ADAE1C0
	void OnClientGameLoadingFinished(EFlowResult Result); // (Final, Native, Protected) // @ 0x141334EA0
	void OnClientSeamlessTravelBegin(bool bReconnect); // (Final, Native, Protected) // @ 0x14ADAE4A0
	void OnClientSeamlessTravelFinished(bool bReconnect); // (Final, Native, Protected) // @ 0x14ADAE530

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldGameplaySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldGameplaySubsystem")
	}
	static class AIrisWorldGameplaySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisWorldGameplaySubsystem>();
	}
};
DUMPER7_ASSERTS_AIrisWorldGameplaySubsystem;

// Class IrisWorld.IrisWorldGamePlayUtils
// 0x0000 (0x0028 - 0x0028)
class UIrisWorldGamePlayUtils final : public UObject
{
public:
	static void ActivateMission(class UWorld* WorldContext, int64 missionid); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD1E0
	static void DestroyTeamMateCharacter(class UWorld* WorldContext, class AActor* CharacterActor); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD6C0
	static bool EnterGunsmith(class UWorld* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD770
	static void EnterSafeHouse(class UWorld* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD7F0
	static void ExitGunsmith(class UWorld* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD860
	static void ExitSafeHouse(class UWorld* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD8D0
	static TArray<struct FSoftObjectPath> GetIrisRaidAllBgObjectPath(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADADB10
	static TArray<class FText> GetIrisRaidAllStageName(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADADC50
	static class FText GetIrisRaidName(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADADCF0
	static int32 GetIrisRaidStage(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADADDD0
	static void JoinTheNewHost(class UObject* WorldContext, const class FString& HostURL); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAE070
	static void OpenRaidHUD(class UObject* InWorldContext, int64 RaidID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14130A950
	static void OpenRaidPreviewHUD(class UObject* InWorldContext, int32 RaidID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAE800
	static void PlayerExitRaidGame(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAE8B0
	static void PlayerGiveUpRaidGame(class UObject* WorldContext, bool bGiveUp); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAE920
	static void PlayerUseResurrectCoin(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAE9E0
	static void ReplayRaidMission(class UObject* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAEA50
	static class AActor* SpawnSafeHouseBuilding(class UWorld* WorldContext, class UClass* BuildingClass, const class FString& PosTag); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAF1B0
	static class AActor* SpawnTeamMateCharacter(class UWorld* WorldContext); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAF340

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldGamePlayUtils")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldGamePlayUtils")
	}
	static class UIrisWorldGamePlayUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisWorldGamePlayUtils>();
	}
};
DUMPER7_ASSERTS_UIrisWorldGamePlayUtils;

// Class IrisWorld.IrisWorldGameplayBlueprintHelper
// 0x0000 (0x0028 - 0x0028)
class UIrisWorldGameplayBlueprintHelper final : public UBlueprintFunctionLibrary
{
public:
	static void ForceEndRedAlert(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAD940
	static class UDFMPlayerResurrectComponent* GetFirstPlayerResurrectCom(class UObject* WorldContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADADA60
	static void StartRedAlert(class UObject* WorldContextObject, float Timeout); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14ADAF3C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldGameplayBlueprintHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldGameplayBlueprintHelper")
	}
	static class UIrisWorldGameplayBlueprintHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisWorldGameplayBlueprintHelper>();
	}
};
DUMPER7_ASSERTS_UIrisWorldGameplayBlueprintHelper;

// Class IrisWorld.IrisWorldGameState
// 0x00D0 (0x0F60 - 0x0E90)
class AIrisWorldGameState : public ADFMGameState
{
public:
	uint64                                        TeamLeaderID;                                      // 0x0E90(0x0008)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FIrisResStateInfo> m_ResStates;                                       // 0x0E98(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint64                                        ResPlayerID;                                       // 0x0EE8(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint64>                                RaidMatchPlayerIDs;                                // 0x0EF0(0x0010)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsTeammateAllDied;                                 // 0x0F00(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F01[0x7];                                      // 0x0F01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurGameFlowState;                                  // 0x0F08(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameRuleType                                 CurGameRuleType;                                   // 0x0F18(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F19[0x7];                                      // 0x0F19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool IsInAllTeamDied)> ClientIrisWorldTeamAllDiedStatusChangedEvent; // 0x0F20(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USOLTimeLineComponnet*                  TimeLineEventComponent;                            // 0x0F30(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UIrisRaidDataStatisticsComponent*       IrisRaidDataStatisticsComponent;                   // 0x0F38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDFMContractManagerComponent*           ContractManagerComponent;                          // 0x0F40(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGPPrefGroupName                              PerfGroupName;                                     // 0x0F48(0x0001)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F49[0x17];                                     // 0x0F49(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool GetMuteFoliage(); // (Final, Native, Static, Public) // @ 0x14ADADE70
	static void SetMuteFoliage(bool bValue); // (Final, Native, Static, Public) // @ 0x14ADAF0B0

	void ClientReadyToPlayNotify(uint64 PlayerId); // (Final, Native, Public) // @ 0x14ADAD510
	class UDataStatisticsBaseComponent* GetDataStatisticsBaseComponent(); // (Final, Native, Public) // @ 0x14ADADA30
	EGameRuleType GetGameRuleType(); // (Native, Public) // @ 0x14ADADAE0
	class AIrisWorldPlayerState* GetPlayerStateByIndex(int32 PlayerIndex); // (Final, Native, Public) // @ 0x14ADADEA0
	bool IsInPVERaid(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADADFE0
	bool IsIrisTeamAllDie(); // (Final, Native, Public) // @ 0x14ADAE010
	void NotifyTeamMemberAllDead(const struct FTeamInfo& TeamInfo, class AGPCharacter* LastDiedCharacter, class AGPCharacter* KillerCharacter); // (Final, Native, Public) // @ 0x14ADAE200
	void OnRep_CurGameRuleType(EGameRuleType LastRuleType); // (Final, Native, Protected) // @ 0x14ADAE700
	void OnRep_GameFlowStageChanged(); // (Final, Native, Protected) // @ 0x140C994B0
	void OnRep_IsTeammateAllDied(); // (Native, Public) // @ 0x144A76B30
	void OnRep_PerfGroupName(); // (Final, Native, Protected) // @ 0x14ADAE7C0
	void RequestLeaderResState(uint64 ResPlayer); // (Final, Native, Public) // @ 0x140C98C70
	void ServerNotifyPlayerReborn(class AGPCharacterBase* GPCharacterBase); // (Final, Native, Public) // @ 0x14ADAEC60
	void SetGameplayPrefGroup(EGPPrefGroupName InPrefGroupName); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x14ADAF030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldGameState")
	}
	static class AIrisWorldGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisWorldGameState>();
	}
};
DUMPER7_ASSERTS_AIrisWorldGameState;

// Class IrisWorld.IrisWorldHUD
// 0x0060 (0x0790 - 0x0730)
class AIrisWorldHUD final : public ADFMHUD
{
public:
	class UDataTable*                             IrisWorldUIDataTable;                              // 0x0730(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              IrisWorldUIDataTableHDOverride;                    // 0x0738(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             RuleOnlyUIDataTable;                               // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 RuleOnlyLuaHudTableName;                           // 0x0768(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 RuleOnlyLuaBaseHudTableName;                       // 0x0778(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_788[0x8];                                      // 0x0788(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateQuestHudView(EDFMGamePlayMode DFMGamePlayMode); // (Final, Native, Protected) // @ 0x14ADAD620
	void OnQuestStageChanged(class FName QuestStageName); // (Final, Native, Protected) // @ 0x14ADAE680

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldHUD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldHUD")
	}
	static class AIrisWorldHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisWorldHUD>();
	}
};
DUMPER7_ASSERTS_AIrisWorldHUD;

// Class IrisWorld.IrisWorldPlayerSettlementComponent
// 0x0008 (0x0470 - 0x0468)
class UIrisWorldPlayerSettlementComponent final : public UBasePlayerSettlementComponent
{
public:
	class AIrisWorldRaidInfoActor*                RaidActor;                                         // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ServerCollectPlayerSettlementData(EMatchOverReason MatchOverReason); // (Final, Native, Public) // @ 0x14ADAEBE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldPlayerSettlementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldPlayerSettlementComponent")
	}
	static class UIrisWorldPlayerSettlementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIrisWorldPlayerSettlementComponent>();
	}
};
DUMPER7_ASSERTS_UIrisWorldPlayerSettlementComponent;

// Class IrisWorld.IrisWorldPlayerStart
// 0x0008 (0x03A8 - 0x03A0)
class AIrisWorldPlayerStart final : public APlayerStart
{
public:
	int32                                         StartSpotGroupID;                                  // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFloatStartSpot;                                   // 0x03A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnNavigationPlane;                                // 0x03A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A6[0x2];                                      // 0x03A6(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldPlayerStart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldPlayerStart")
	}
	static class AIrisWorldPlayerStart* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisWorldPlayerStart>();
	}
};
DUMPER7_ASSERTS_AIrisWorldPlayerStart;

// Class IrisWorld.IrisWorldPlayerState
// 0x0030 (0x1428 - 0x13F8)
class AIrisWorldPlayerState : public ADFMPlayerState
{
public:
	uint8                                         Pad_13F8[0x8];                                     // 0x13F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIrisCheckPoint                        IrisCheckPoint;                                    // 0x1400(0x0008)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class APlayerStart*                           PVEPlayerStart;                                    // 0x1408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeathCount;                                        // 0x1410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TaskCompleteCount;                                 // 0x1414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlayerVisiable;                                  // 0x1418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1419[0x3];                                     // 0x1419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Merit;                                             // 0x141C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bPendingLeaveDS;                                   // 0x1420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1421[0x7];                                     // 0x1421(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActiveCheckPoint(int32 SpotGroupID); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAD290
	void AddMerit(float AddValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAD310
	void BP_ServerActiveDiscovery(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAD3A0
	void BP_ServerActiveRaid(int32 EntityID); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAD3F0
	void DeactiveCheckPoint(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAD6A0
	float GetMerit(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADADE50
	bool GetPlayerVisiable(); // (Final, Native, Public) // @ 0x14ADADF30
	bool IfMeritEnoughToBuy(float NeedMerit); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADADF50
	bool IsTeamLeader(); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAE040
	void OnRep_MeritChanged(); // (Final, Native, Protected) // @ 0x14ADAE7A0
	bool Server_ConsumeMerit(float ConsumeValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADAEFA0
	bool Server_IsMeritEnough(float ConsumeValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14ADADF50
	void ServerActiveDiscovery(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144B52ED0
	void ServerActiveRaidEntity(uint32 EntityID); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14ADAEAC0
	void ServerAddConditionProp(uint64 PropId); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14ADAEB50
	void ServerConfirmPurchase(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144A04B10
	void ServerPendingLeaveDS(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x144A05F50
	void ServerRaidGiveUpVote(bool bGiveUp); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14ADAECE0
	void ServerRaidVote(int64 QuestID, bool bCancelVote); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14ADAED70
	void ServerReplayMission(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x149C56C50
	void ServerResetRaidDifficulty(uint8 NewDifficulty, bool bReplayRaid); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14ADAEE40
	void ServerSendRaidSettlementInfo(bool bSucceed); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x14ADAEF10
	void SetPlayerVisiable(bool bPlayerVisiable); // (Final, Native, Public) // @ 0x14ADAF130

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldPlayerState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldPlayerState")
	}
	static class AIrisWorldPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisWorldPlayerState>();
	}
};
DUMPER7_ASSERTS_AIrisWorldPlayerState;

// Class IrisWorld.IrisWorldRaidInfoActor
// 0x0008 (0x0378 - 0x0370)
class AIrisWorldRaidInfoActor final : public AActor
{
public:
	class UIrisRaidDataComponent*                 RaidDataCom;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class AIrisWorldRaidInfoActor* GetRaidInfo(class UObject* InWorldContext); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14ADB26E0

	int32 BPGetCurRaidEntityID(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x14ADB2650
	ERaidStage BPGetCurRaidStage(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x14ADB2680
	int32 BPGetRaidLevel(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x14ADB26B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("IrisWorldRaidInfoActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IrisWorldRaidInfoActor")
	}
	static class AIrisWorldRaidInfoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIrisWorldRaidInfoActor>();
	}
};
DUMPER7_ASSERTS_AIrisWorldRaidInfoActor;

// Class IrisWorld.MapMissionHUDView
// 0x0040 (0x04A8 - 0x0468)
class UMapMissionHUDView final : public UBigMapIrisItem
{
public:
	struct FPlayerMissionUIInfo                   MissionInfo;                                       // 0x0468(0x0020)(NoDestructor, NativeAccessSpecifierPublic)
	class UImage*                                 TargetIcon;                                        // 0x0488(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
