#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KantanChartsUMG

#include "Basic.hpp"

#include "KantanChartsUMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "KantanChartsSlate_structs.hpp"


namespace SDK
{

// Class KantanChartsUMG.KantanChart
// 0x0050 (0x01A0 - 0x0150)
class UKantanChart : public UWidget
{
public:
	struct FMargin                                Margins;                                           // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   ChartTitle;                                        // 0x0160(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMargin                                TitlePadding;                                      // 0x0178(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         UpdateTickRate;                                    // 0x0188(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18C[0x14];                                     // 0x018C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetChartTitle(const class FText& InTitle); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F173B0
	void SetChartTitlePadding(const struct FMargin& InPadding); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F17480
	void SetMargins(const struct FMargin& InMargins); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F179D0
	void SetUpdateTickRate(float InRate); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17F30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanChart")
	}
	static class UKantanChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanChart>();
	}
};
DUMPER7_ASSERTS_UKantanChart;

// Class KantanChartsUMG.KantanCategoryChart
// 0x0020 (0x01C0 - 0x01A0)
class UKantanCategoryChart : public UKantanChart
{
public:
	bool                                          bAutoPerCategoryStyles;                            // 0x01A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKantanCategoryStyleSet*                CategoryStyleSet;                                  // 0x01A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCategoryStyleManualMapping>    ManualStyleMappings;                               // 0x01B0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void AddCategoryStyleOverride(class FName CategoryId, const struct FLinearColor& Color); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x140F15970

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanCategoryChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanCategoryChart")
	}
	static class UKantanCategoryChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanCategoryChart>();
	}
};
DUMPER7_ASSERTS_UKantanCategoryChart;

// Class KantanChartsUMG.KantanBarChartBase
// 0x0198 (0x0358 - 0x01C0)
class UKantanBarChartBase : public UKantanCategoryChart
{
public:
	struct FKantanBarChartStyle                   WidgetStyle;                                       // 0x01C0(0x0138)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EKantanBarChartOrientation                    Orientation;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBarValue;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKantanBarLabelPosition                       LabelPosition;                                     // 0x0300(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BarToGapRatio;                                     // 0x0304(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKantanBarValueExtents                        ValueExtentsDisplay;                               // 0x0308(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCartesianAxisConfig                   ValueAxisCfg;                                      // 0x0310(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void SetBarToGapRatio(float InRatio); // (Final, Native, Public, BlueprintCallable) // @ 0x140F172B0
	void SetExtentsDisplay(EKantanBarValueExtents InExtents); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17750
	void SetLabelPosition(EKantanBarLabelPosition InPosition); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17850
	void SetMaxBarValue(float InMaxValue); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17B10
	void SetOrientation(EKantanBarChartOrientation InOrientation); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17B90
	void SetValueAxisConfig(const struct FCartesianAxisConfig& InCfg); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F180B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanBarChartBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanBarChartBase")
	}
	static class UKantanBarChartBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanBarChartBase>();
	}
};
DUMPER7_ASSERTS_UKantanBarChartBase;

// Class KantanChartsUMG.BarChart
// 0x0008 (0x0360 - 0x0358)
class UBarChart final : public UKantanBarChartBase
{
public:
	class UObject*                                DataSource;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool SetDatasource(class UObject* InDatasource); // (Final, Native, Public, BlueprintCallable) // @ 0x140F175A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BarChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BarChart")
	}
	static class UBarChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBarChart>();
	}
};
DUMPER7_ASSERTS_UBarChart;

// Class KantanChartsUMG.KantanCartesianChartBase
// 0x0218 (0x03B8 - 0x01A0)
class UKantanCartesianChartBase : public UKantanChart
{
public:
	struct FKantanCartesianChartStyle             WidgetStyle;                                       // 0x01A0(0x0130)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FKantanCartesianPlotScale              PlotScale;                                         // 0x02D0(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EKantanDataPointSize                          DataPointSize;                                     // 0x02F4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCartesianAxisConfig                   XAxisCfg;                                          // 0x02F8(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FCartesianAxisConfig                   YAxisCfg;                                          // 0x0340(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FMargin                                AxisTitlePadding;                                  // 0x0388(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UKantanSeriesStyleSet*                  SeriesStyleSet;                                    // 0x0398(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSeriesStyleManualMapping>      ManualStyleMappings;                               // 0x03A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAntiAlias;                                        // 0x03B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddSeriesStyleOverride(class FName SeriesId, class UKantanPointStyle* PointStyle, const struct FLinearColor& Color); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x140F15A40
	void ConfigureSeries(class FName ID, bool bDrawPoints, bool bDrawLines); // (Final, Native, Public, BlueprintCallable) // @ 0x140F16EB0
	void EnableSeries(class FName ID, bool bEnable); // (Final, Native, Public, BlueprintCallable) // @ 0x140F16FC0
	void SetAxisTitlePadding(const struct FMargin& InPadding); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F17090
	void SetDataPointSize(EKantanDataPointSize InSize); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17520
	void SetPlotScale(const struct FVector2D& InScale, const struct FVector2D& InFocalCoords); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140F17C10
	void SetPlotScaleByRange(const struct FCartesianAxisRange& InRangeX, const struct FCartesianAxisRange& InRangeY); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F17CE0
	void SetSeriesStyle(class FName ID, class FName StyleId); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17E70
	void SetXAxisConfig(const struct FCartesianAxisConfig& InCfg); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F181F0
	void SetYAxisConfig(const struct FCartesianAxisConfig& InCfg); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F18330

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanCartesianChartBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanCartesianChartBase")
	}
	static class UKantanCartesianChartBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanCartesianChartBase>();
	}
};
DUMPER7_ASSERTS_UKantanCartesianChartBase;

// Class KantanChartsUMG.KantanCartesianPlotBase
// 0x0000 (0x03B8 - 0x03B8)
class UKantanCartesianPlotBase : public UKantanCartesianChartBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanCartesianPlotBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanCartesianPlotBase")
	}
	static class UKantanCartesianPlotBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanCartesianPlotBase>();
	}
};
DUMPER7_ASSERTS_UKantanCartesianPlotBase;

// Class KantanChartsUMG.CartesianPlot
// 0x0008 (0x03C0 - 0x03B8)
class UCartesianPlot final : public UKantanCartesianPlotBase
{
public:
	class UObject*                                DataSource;                                        // 0x03B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool SetDatasource(class UObject* InDatasource); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17630

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CartesianPlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CartesianPlot")
	}
	static class UCartesianPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCartesianPlot>();
	}
};
DUMPER7_ASSERTS_UCartesianPlot;

// Class KantanChartsUMG.KantanChartLegend
// 0x00D0 (0x0220 - 0x0150)
class UKantanChartLegend final : public UWidget
{
public:
	struct FMargin                                Margins;                                           // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SeriesPadding;                                     // 0x0160(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Background;                                        // 0x0170(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         FontSize;                                          // 0x0200(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UKantanCartesianChartBase> Chart;                                           // 0x0204(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x14];                                     // 0x020C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBackground(const struct FSlateBrush& InBrush); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F17130
	void SetChart(class UKantanCartesianChartBase* InChart); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17330
	void SetFontSize(int32 InFontSize); // (Final, Native, Public, BlueprintCallable) // @ 0x140F177D0
	void SetMargins(const struct FMargin& InMargins); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F17A70
	void SetSeriesPadding(const struct FMargin& InPadding); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F17DD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanChartLegend")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanChartLegend")
	}
	static class UKantanChartLegend* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanChartLegend>();
	}
};
DUMPER7_ASSERTS_UKantanChartLegend;

// Class KantanChartsUMG.KantanTimeSeriesPlotBase
// 0x0030 (0x03E8 - 0x03B8)
class UKantanTimeSeriesPlotBase : public UKantanCartesianChartBase
{
public:
	bool                                          bUseFixedTimeRange;                                // 0x03B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisplayTimeRange;                                  // 0x03BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCartesianRangeBound                   LowerTimeBound;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FCartesianRangeBound                   UpperTimeBound;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FCartesianRangeBound                   LowerValueBound;                                   // 0x03D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FCartesianRangeBound                   UpperValueBound;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bExtendValueRangeToZero;                           // 0x03E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetLowerTimeBound(const struct FCartesianRangeBound& InLowerBound); // (Final, Native, Public, BlueprintCallable) // @ 0x140F178D0
	void SetLowerValueBound(const struct FCartesianRangeBound& InLowerBound); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17950
	void SetUpperTimeBound(const struct FCartesianRangeBound& InUpperBound); // (Final, Native, Public, BlueprintCallable) // @ 0x140F17FB0
	void SetUpperValueBound(const struct FCartesianRangeBound& InUpperBound); // (Final, Native, Public, BlueprintCallable) // @ 0x140F18030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanTimeSeriesPlotBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanTimeSeriesPlotBase")
	}
	static class UKantanTimeSeriesPlotBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanTimeSeriesPlotBase>();
	}
};
DUMPER7_ASSERTS_UKantanTimeSeriesPlotBase;

// Class KantanChartsUMG.SimpleBarChart
// 0x0018 (0x0370 - 0x0358)
class USimpleBarChart final : public UKantanBarChartBase
{
public:
	uint8                                         Pad_358[0x18];                                     // 0x0358(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_AddCategory(const class FText& Name_0, class FName* CatId); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F15B50
	void BP_AddCategoryWithId(class FName ID, const class FText& Name_0, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F15C90
	void BP_RemoveAllCategories(); // (Final, Native, Public, BlueprintCallable) // @ 0x140F16AD0
	void BP_RemoveCategory(class FName ID, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16B30
	void BP_UpdateCategoryValue(class FName ID, float Value, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16DA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleBarChart")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleBarChart")
	}
	static class USimpleBarChart* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleBarChart>();
	}
};
DUMPER7_ASSERTS_USimpleBarChart;

// Class KantanChartsUMG.SimpleCartesianPlot
// 0x0020 (0x03D8 - 0x03B8)
class USimpleCartesianPlot final : public UKantanCartesianPlotBase
{
public:
	uint8                                         Pad_3B8[0x20];                                     // 0x03B8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_AddDatapoint(class FName SeriesId, const struct FVector2D& Point, bool* bSuccess); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140F15E10
	void BP_AddSeries(class FName* SeriesId, const class FText& Name_0, bool bEnabled, bool bShowPoints, bool bShowLines); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16160
	void BP_AddSeriesWithId(bool* bSuccess, class FName ID, const class FText& Name_0, bool bEnabled, bool bShowPoints, bool bShowLines); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16560
	void BP_RemoveAllSeries(); // (Final, Native, Public, BlueprintCallable) // @ 0x140F16AF0
	void BP_RemoveSeries(class FName ID, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16C00

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleCartesianPlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleCartesianPlot")
	}
	static class USimpleCartesianPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleCartesianPlot>();
	}
};
DUMPER7_ASSERTS_USimpleCartesianPlot;

// Class KantanChartsUMG.SimpleTimeSeriesPlot
// 0x0020 (0x0408 - 0x03E8)
class USimpleTimeSeriesPlot final : public UKantanTimeSeriesPlotBase
{
public:
	uint8                                         Pad_3E8[0x20];                                     // 0x03E8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_AddDatapoint(class FName SeriesId, const struct FVector2D& Point, bool* bSuccess); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140F15F30
	void BP_AddDatapointNow(class FName SeriesId, float Value, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16050
	void BP_AddSeries(class FName* SeriesId, const class FText& Name_0, bool bEnabled, bool bShowPoints, bool bShowLines); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16360
	void BP_AddSeriesWithId(bool* bSuccess, class FName ID, const class FText& Name_0, bool bEnabled, bool bShowPoints, bool bShowLines); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F167A0
	void BP_ClearAllData(); // (Final, Native, Public, BlueprintCallable) // @ 0x140F169E0
	void BP_ClearSeriesData(class FName SeriesId, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16A00
	void BP_RemoveAllSeries(); // (Final, Native, Public, BlueprintCallable) // @ 0x140F16B10
	void BP_RemoveSeries(class FName ID, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140F16CD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleTimeSeriesPlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleTimeSeriesPlot")
	}
	static class USimpleTimeSeriesPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleTimeSeriesPlot>();
	}
};
DUMPER7_ASSERTS_USimpleTimeSeriesPlot;

// Class KantanChartsUMG.TimeSeriesPlot
// 0x0008 (0x03F0 - 0x03E8)
class UTimeSeriesPlot final : public UKantanTimeSeriesPlotBase
{
public:
	class UObject*                                DataSource;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	bool SetDatasource(class UObject* InDatasource); // (Final, Native, Public, BlueprintCallable) // @ 0x140F176C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TimeSeriesPlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TimeSeriesPlot")
	}
	static class UTimeSeriesPlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeSeriesPlot>();
	}
};
DUMPER7_ASSERTS_UTimeSeriesPlot;

}

