#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KantanChartsSlate

#include "Basic.hpp"

#include "KantanChartsSlate_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class KantanChartsSlate.KantanBarChartWidgetStyle
// 0x0138 (0x0168 - 0x0030)
class UKantanBarChartWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FKantanBarChartStyle                   ChartStyle;                                        // 0x0030(0x0138)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanBarChartWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanBarChartWidgetStyle")
	}
	static class UKantanBarChartWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanBarChartWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UKantanBarChartWidgetStyle;

// Class KantanChartsSlate.KantanCartesianChartWidgetStyle
// 0x0130 (0x0160 - 0x0030)
class UKantanCartesianChartWidgetStyle final : public USlateWidgetStyleContainerBase
{
public:
	struct FKantanCartesianChartStyle             ChartStyle;                                        // 0x0030(0x0130)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanCartesianChartWidgetStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanCartesianChartWidgetStyle")
	}
	static class UKantanCartesianChartWidgetStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanCartesianChartWidgetStyle>();
	}
};
DUMPER7_ASSERTS_UKantanCartesianChartWidgetStyle;

// Class KantanChartsSlate.KantanCategoryStyleSet
// 0x0010 (0x0040 - 0x0030)
class UKantanCategoryStyleSet final : public UDataAsset
{
public:
	TArray<struct FKantanCategoryStyle>           Styles;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanCategoryStyleSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanCategoryStyleSet")
	}
	static class UKantanCategoryStyleSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanCategoryStyleSet>();
	}
};
DUMPER7_ASSERTS_UKantanCategoryStyleSet;

// Class KantanChartsSlate.KantanPointStyle
// 0x0020 (0x0050 - 0x0030)
class UKantanPointStyle final : public UDataAsset
{
public:
	class UTexture2D*                             DataPointTexture;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              PointSizeTextureOffsets[0x3];                      // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanPointStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanPointStyle")
	}
	static class UKantanPointStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanPointStyle>();
	}
};
DUMPER7_ASSERTS_UKantanPointStyle;

// Class KantanChartsSlate.KantanSeriesStyleSet
// 0x0010 (0x0040 - 0x0030)
class UKantanSeriesStyleSet final : public UDataAsset
{
public:
	TArray<struct FKantanSeriesStyle>             Styles;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KantanSeriesStyleSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KantanSeriesStyleSet")
	}
	static class UKantanSeriesStyleSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKantanSeriesStyleSet>();
	}
};
DUMPER7_ASSERTS_UKantanSeriesStyleSet;

}

