#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KantanChartsSlate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum KantanChartsSlate.EChartAxisPosition
// NumValues: 0x0004
enum class EChartAxisPosition : uint8
{
	LeftBottom                               = 0,
	RightTop                                 = 1,
	Floating                                 = 2,
	EChartAxisPosition_MAX                   = 3,
};

// Enum KantanChartsSlate.EKantanDataPointSize
// NumValues: 0x0004
enum class EKantanDataPointSize : uint8
{
	Small                                    = 0,
	Medium                                   = 1,
	Large                                    = 2,
	EKantanDataPointSize_MAX                 = 3,
};

// Enum KantanChartsSlate.ECartesianRangeBoundType
// NumValues: 0x0004
enum class ECartesianRangeBoundType : uint8
{
	FixedValue                               = 0,
	FitToData                                = 1,
	FitToDataRounded                         = 2,
	ECartesianRangeBoundType_MAX             = 3,
};

// Enum KantanChartsSlate.ECartesianScalingType
// NumValues: 0x0003
enum class ECartesianScalingType : uint8
{
	FixedScale                               = 0,
	FixedRange                               = 1,
	ECartesianScalingType_MAX                = 2,
};

// Enum KantanChartsSlate.EKantanBarValueExtents
// NumValues: 0x0004
enum class EKantanBarValueExtents : uint8
{
	NoValueLines                             = 0,
	ZeroLineOnly                             = 1,
	ZeroAndMaxLines                          = 2,
	EKantanBarValueExtents_MAX               = 3,
};

// Enum KantanChartsSlate.EKantanBarLabelPosition
// NumValues: 0x0004
enum class EKantanBarLabelPosition : uint8
{
	NoLabels                                 = 0,
	Standard                                 = 1,
	Overlaid                                 = 2,
	EKantanBarLabelPosition_MAX              = 3,
};

// Enum KantanChartsSlate.EKantanBarChartOrientation
// NumValues: 0x0003
enum class EKantanBarChartOrientation : uint8
{
	Vertical                                 = 0,
	Horizontal                               = 1,
	EKantanBarChartOrientation_MAX           = 2,
};

// ScriptStruct KantanChartsSlate.CartesianAxisInstanceConfig
// 0x0004 (0x0004 - 0x0000)
struct FCartesianAxisInstanceConfig final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowTitle;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowMarkers;                                      // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowLabels;                                       // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCartesianAxisInstanceConfig;

// ScriptStruct KantanChartsSlate.CartesianAxisConfig
// 0x0048 (0x0048 - 0x0000)
struct FCartesianAxisConfig final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Unit;                                              // 0x0018(0x0018)(Edit, NativeAccessSpecifierPublic)
	float                                         MarkerSpacing;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxValueDigits;                                    // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCartesianAxisInstanceConfig           LeftBottomAxis;                                    // 0x0038(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCartesianAxisInstanceConfig           RightTopAxis;                                      // 0x003C(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCartesianAxisInstanceConfig           FloatingAxis;                                      // 0x0040(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCartesianAxisConfig;

// ScriptStruct KantanChartsSlate.KantanChartStyle
// 0x0120 (0x0128 - 0x0008)
struct FKantanChartStyle : public FSlateWidgetStyle
{
public:
	struct FSlateBrush                            Background;                                        // 0x0008(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChartLineColor;                                    // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChartLineThickness;                                // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         BaseFont;                                          // 0x00B0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TitleFontSize;                                     // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AxisDescriptionFontSize;                           // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AxisValueFontSize;                                 // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FontColor;                                         // 0x0114(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKantanChartStyle;

// ScriptStruct KantanChartsSlate.KantanBarChartStyle
// 0x0010 (0x0138 - 0x0128)
struct FKantanBarChartStyle final : public FKantanChartStyle
{
public:
	float                                         BarOpacity;                                        // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BarOutlineOpacity;                                 // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BarOutlineThickness;                               // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKantanBarChartStyle;

// ScriptStruct KantanChartsSlate.KantanCartesianChartStyle
// 0x0008 (0x0130 - 0x0128)
struct FKantanCartesianChartStyle final : public FKantanChartStyle
{
public:
	float                                         DataOpacity;                                       // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DataLineThickness;                                 // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKantanCartesianChartStyle;

// ScriptStruct KantanChartsSlate.CartesianRangeBound
// 0x0008 (0x0008 - 0x0000)
struct FCartesianRangeBound final
{
public:
	ECartesianRangeBoundType                      Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedBoundValue;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCartesianRangeBound;

// ScriptStruct KantanChartsSlate.CartesianAxisRange
// 0x0008 (0x0008 - 0x0000)
struct FCartesianAxisRange final
{
public:
	float                                         Min;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Max;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCartesianAxisRange;

// ScriptStruct KantanChartsSlate.KantanCartesianPlotScale
// 0x0024 (0x0024 - 0x0000)
struct FKantanCartesianPlotScale final
{
public:
	ECartesianScalingType                         Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Scale;                                             // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              FocalCoordinates;                                  // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCartesianAxisRange                    RangeX;                                            // 0x0014(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCartesianAxisRange                    RangeY;                                            // 0x001C(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKantanCartesianPlotScale;

// ScriptStruct KantanChartsSlate.KantanCategoryStyle
// 0x0018 (0x0018 - 0x0000)
struct FKantanCategoryStyle final
{
public:
	class FName                                   CategoryStyleId;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKantanCategoryStyle;

// ScriptStruct KantanChartsSlate.KantanSeriesStyle
// 0x0020 (0x0020 - 0x0000)
struct FKantanSeriesStyle final
{
public:
	class FName                                   StyleId;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKantanPointStyle*                      PointStyle;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKantanSeriesStyle;

}

