#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelInfinite

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_classes.hpp"
#include "LevelInfinite_structs.hpp"
#include "INTLCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class LevelInfinite.LIPanelBase
// 0x0070 (0x0360 - 0x02F0)
class ULIPanelBase final : public UUserWidget
{
public:
	TDelegate<void(const struct FGeometry& MyGeometry, float InDeltaTime)> OnTickDelegate;           // 0x02F0(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGeometry& InGeometry, const class FString& InKeyName)> OnKeyDownDelegate; // 0x0300(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGeometry& InGeometry, const class FString& InKeyName)> OnKeyUpDelegate; // 0x0310(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FFocusEvent& InFocusEvent)> OnAddedToFocusPathDelegate;              // 0x0320(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FFocusEvent& InFocusEvent)> OnRemovedFromFocusPathDelegate;          // 0x0330(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class UWidgetAnimation* Animation)> OnAnimationStartedDelegate;             // 0x0340(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class UWidgetAnimation* Animation)> OnAnimationFinishedDelegate;            // 0x0350(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetLIUIFocus(class UWidget* InWidgetToFocus); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D5610

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LIPanelBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LIPanelBase")
	}
	static class ULIPanelBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULIPanelBase>();
	}
};
DUMPER7_ASSERTS_ULIPanelBase;

// Class LevelInfinite.LevelInfiniteAPI
// 0x0000 (0x0028 - 0x0028)
class ULevelInfiniteAPI final : public UBlueprintFunctionLibrary
{
public:
	static void AutoLogin(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D4760
	static bool ClearGameNativeDirectory(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D4780
	static void CloseLI(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D47B0
	static bool FocusLIPassUI(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D47D0
	static void GetSocialFeatureStatus(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D4890
	static int32 Init(class UGameInstance* Instance, const class FString& Host, const struct FLIUserData& userData, bool isTest); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x1414D48B0
	static int32 InitLI(class UGameInstance* Instance, bool isTest, const class FString& AppVersion, const class FString& LangType); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D4AB0
	static int32 InitLIP(class UGameInstance* Instance, const class FString& AppVersion, const class FString& LangType); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D4C80
	static void LoginChannelWithLIPASS(EINTLLoginChannel Channel, const class FString& Permissions, const class FString& extraJson); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D4E10
	static void ModifyLogicSchemeType(ELILogicSchemeType LILogicSchemeType); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D4F90
	static bool OnBackPressed(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5000
	static void OpenAccountCenter(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5160
	static void OpenAccountCenterWithParams(struct FINTLDeleteAccountParams* Params_0); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x1414D5180
	static void OpenBindAccount(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5210
	static void OpenLoginPanel(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5230
	static void SetGamepadStatus(ELIGamepadStatus gamepadStatus); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D55A0
	static void SetLanguage(const class FString& Language); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5690
	static void SetUICustomScale(const float Scale); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5BA0
	static void SetUIRoot(class UCanvasPanel* uiRoot); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5C10
	static void SetUserData(const struct FLIUserData& userData); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x1414D5C80
	static void StartLIPASSLoginScheme(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5D80
	static void StopLIPASSLoginScheme(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1414D5DA0
	static void UpdateCountryList(const TArray<class FString>& allowList, const TArray<class FString>& blockList); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x1414D5DC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelInfiniteAPI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelInfiniteAPI")
	}
	static class ULevelInfiniteAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelInfiniteAPI>();
	}
};
DUMPER7_ASSERTS_ULevelInfiniteAPI;

// Class LevelInfinite.RadarChartWidget
// 0x0078 (0x01C8 - 0x0150)
class URadarChartWidget final : public UWidget
{
public:
	struct FVector2D                              offset;                                            // 0x0150(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x0158(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         radius;                                            // 0x015C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Segmentation;                                      // 0x0160(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SegmentationThickness;                             // 0x0164(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 SegmentationColor;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlateOutlineThickness;                             // 0x016C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 PlateOutlineColor;                                 // 0x0170(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 PlateColor;                                        // 0x0174(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ChartColor;                                        // 0x0178(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ChartOutlineColor;                                 // 0x017C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChartOutlineThickness;                             // 0x0180(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ChartValues;                                       // 0x0188(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             RadiusDelegate;                                    // 0x0198(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             SegmentationDelegate;                              // 0x01A8(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x10];                                     // 0x01B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetChartValue(uint8 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D4800
	void SetChartColor(const struct FColor& InColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1414D5250
	void SetChartOutlineColor(const struct FColor& InColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1414D52C0
	void SetChartOutlineThickness(float InThickness); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D5330
	void SetChartValue(uint8 Index_0, float InValue); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D53B0
	void SetChartValues(const TArray<float>& InValues); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D5470
	void SetOffset(const struct FVector2D& InOffset); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1414D5750
	void SetPlateColor(const struct FColor& InColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1414D57D0
	void SetPlateOutlineColor(const struct FColor& InColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1414D5840
	void SetPlateOutlineThickness(float InThickness); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D58B0
	void SetRadius(float InRadius); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D5930
	void SetRotation(float InRotation); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D59B0
	void SetSegmentation(uint8 InSegmentation); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D5A30
	void SetSegmentationColor(const struct FColor& InColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1414D5AB0
	void SetSegmentationThickness(float InThickness); // (Final, Native, Public, BlueprintCallable) // @ 0x1414D5B20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RadarChartWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadarChartWidget")
	}
	static class URadarChartWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadarChartWidget>();
	}
};
DUMPER7_ASSERTS_URadarChartWidget;

// Class LevelInfinite.LIButton
// 0x0298 (0x0730 - 0x0498)
class ULIButton final : public UButton
{
public:
	struct FButtonStyle                           LIButtonStyle;                                     // 0x0498(0x0298)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LIButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LIButton")
	}
	static class ULIButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULIButton>();
	}
};
DUMPER7_ASSERTS_ULIButton;

// Class LevelInfinite.LIHyperLinkTextBlockDecorator
// 0x0540 (0x0568 - 0x0028)
class ULIHyperLinkTextBlockDecorator final : public URichTextBlockDecorator
{
public:
	struct FHyperlinkStyle                        m_Style;                                           // 0x0028(0x0540)(Edit, NativeAccessSpecifierPublic)

public:
	void OnHyperLinkClick(const TMap<class FString, class FString>& MetaData); // (Native, Event, Public, HasOutParams, BlueprintEvent) // @ 0x1414D5030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LIHyperLinkTextBlockDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LIHyperLinkTextBlockDecorator")
	}
	static class ULIHyperLinkTextBlockDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULIHyperLinkTextBlockDecorator>();
	}
};
DUMPER7_ASSERTS_ULIHyperLinkTextBlockDecorator;

// Class LevelInfinite.LIListView
// 0x0008 (0x03B8 - 0x03B0)
class ULIListView final : public UListView
{
public:
	ESlateVisibility                              ScrollBarVisibility;                               // 0x03B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LIListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LIListView")
	}
	static class ULIListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULIListView>();
	}
};
DUMPER7_ASSERTS_ULIListView;

// Class LevelInfinite.LISubSystem
// 0x0000 (0x0028 - 0x0028)
class ULISubSystem final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LISubSystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LISubSystem")
	}
	static class ULISubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULISubSystem>();
	}
};
DUMPER7_ASSERTS_ULISubSystem;

}

