#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LF_Industrial_Floodlight_04

#include "Basic.hpp"

#include "LF_Lighting_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LF_Industrial_Floodlight_04.LF_Industrial_Floodlight_04_C
// 0x0000 (0x0870 - 0x0870)
class ALF_Industrial_Floodlight_04_C final : public ALF_Lighting_Master_C
{
public:
	uint8                                         Pad_862[0x2];                                      // 0x0862(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CullingDistance_0;                                 // 0x0864(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseFalloff;                                        // 0x0868(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_869[0x3];                                      // 0x0869(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallOffExponent;                                   // 0x086C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript(); // (Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LF_Industrial_Floodlight_04_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LF_Industrial_Floodlight_04_C")
	}
	static class ALF_Industrial_Floodlight_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALF_Industrial_Floodlight_04_C>();
	}
};
DUMPER7_ASSERTS_ALF_Industrial_Floodlight_04_C;

}

