#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LISlua425

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class LISlua425.INTLLatentDelegate
// 0x0008 (0x0030 - 0x0028)
class UINTLLatentDelegate final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLatentCallback(int32 threadRef); // (Final, Native, Public, BlueprintCallable) // @ 0x14DB3A9E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLatentDelegate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLatentDelegate")
	}
	static class UINTLLatentDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTLLatentDelegate>();
	}
};
DUMPER7_ASSERTS_UINTLLatentDelegate;

// Class LISlua425.INTLLuaActor
// 0x00B0 (0x0420 - 0x0370)
class AINTLLuaActor final : public AActor
{
public:
	uint8                                         Pad_370[0x90];                                     // 0x0370(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x0400(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x0410(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB38410

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaActor")
	}
	static class AINTLLuaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTLLuaActor>();
	}
};
DUMPER7_ASSERTS_AINTLLuaActor;

// Class LISlua425.INTLLuaPawn
// 0x00B0 (0x0480 - 0x03D0)
class AINTLLuaPawn final : public APawn
{
public:
	uint8                                         Pad_3D0[0x90];                                     // 0x03D0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB39090

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaPawn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaPawn")
	}
	static class AINTLLuaPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTLLuaPawn>();
	}
};
DUMPER7_ASSERTS_AINTLLuaPawn;

// Class LISlua425.INTLLuaCharacter
// 0x00B0 (0x0840 - 0x0790)
class AINTLLuaCharacter final : public ACHARACTER
{
public:
	uint8                                         Pad_788[0x90];                                     // 0x0788(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x0818(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x0828(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_838[0x8];                                      // 0x0838(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB38690

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaCharacter")
	}
	static class AINTLLuaCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTLLuaCharacter>();
	}
};
DUMPER7_ASSERTS_AINTLLuaCharacter;

// Class LISlua425.INTLLuaController
// 0x00B0 (0x0498 - 0x03E8)
class AINTLLuaController final : public AController
{
public:
	uint8                                         Pad_3E8[0x90];                                     // 0x03E8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x0478(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x0488(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB38910

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaController")
	}
	static class AINTLLuaController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTLLuaController>();
	}
};
DUMPER7_ASSERTS_AINTLLuaController;

// Class LISlua425.INTLLuaPlayerController
// 0x00B0 (0x0770 - 0x06C0)
class AINTLLuaPlayerController final : public APlayerController
{
public:
	uint8                                         Pad_6C0[0x90];                                     // 0x06C0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x0750(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x0760(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB39310

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaPlayerController")
	}
	static class AINTLLuaPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTLLuaPlayerController>();
	}
};
DUMPER7_ASSERTS_AINTLLuaPlayerController;

// Class LISlua425.INTLLuaActorComponent
// 0x00C0 (0x01B8 - 0x00F8)
class UINTLLuaActorComponent final : public UActorComponent
{
public:
	uint8                                         Pad_F8[0xA0];                                      // 0x00F8(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB39590

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaActorComponent")
	}
	static class UINTLLuaActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTLLuaActorComponent>();
	}
};
DUMPER7_ASSERTS_UINTLLuaActorComponent;

// Class LISlua425.INTLLuaGameModeBase
// 0x00B0 (0x04C0 - 0x0410)
class AINTLLuaGameModeBase final : public AGameModeBase
{
public:
	uint8                                         Pad_410[0x90];                                     // 0x0410(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x04A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x04B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB38B90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaGameModeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaGameModeBase")
	}
	static class AINTLLuaGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTLLuaGameModeBase>();
	}
};
DUMPER7_ASSERTS_AINTLLuaGameModeBase;

// Class LISlua425.INTLLuaHUD
// 0x00B0 (0x0510 - 0x0460)
class AINTLLuaHUD final : public AHUD
{
public:
	uint8                                         Pad_460[0x90];                                     // 0x0460(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x04F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x0500(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB38E10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaHUD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaHUD")
	}
	static class AINTLLuaHUD* GetDefaultObj()
	{
		return GetDefaultObjImpl<AINTLLuaHUD>();
	}
};
DUMPER7_ASSERTS_AINTLLuaHUD;

// Class LISlua425.LuaTableObjectInterfaceINTL
// 0x0000 (0x0000 - 0x0000)
class ILuaTableObjectInterfaceINTL final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LuaTableObjectInterfaceINTL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LuaTableObjectInterfaceINTL")
	}
	static class ILuaTableObjectInterfaceINTL* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILuaTableObjectInterfaceINTL>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ILuaTableObjectInterfaceINTL;

// Class LISlua425.INTLLuaBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UINTLLuaBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FINTLLuaBPVar CallToLua(class UObject* WorldContextObject, const class FString& FunctionName, const class FString& StateName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB39A90
	static struct FINTLLuaBPVar CallToLuaWithArgs(class UObject* WorldContextObject, const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args, const class FString& StateName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14DB39CE0
	static struct FINTLLuaBPVar CreateVarFromBool(bool Value); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB39FF0
	static struct FINTLLuaBPVar CreateVarFromInt(int32 Value); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A0A0
	static struct FINTLLuaBPVar CreateVarFromNumber(float Value); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A150
	static struct FINTLLuaBPVar CreateVarFromObject(class UObject* WorldContextObject, class UObject* Value); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A1F0
	static struct FINTLLuaBPVar CreateVarFromString(const class FString& Value); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A2E0
	static bool GetBoolFromVar(const struct FINTLLuaBPVar& Value, int32 Index_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A440
	static int32 GetIntFromVar(const struct FINTLLuaBPVar& Value, int32 Index_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A550
	static float GetNumberFromVar(const struct FINTLLuaBPVar& Value, int32 Index_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A660
	static class UObject* GetObjectFromVar(const struct FINTLLuaBPVar& Value, int32 Index_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A770
	static class FString GetStringFromVar(const struct FINTLLuaBPVar& Value, int32 Index_0); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14DB3A880

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaBlueprintLibrary")
	}
	static class UINTLLuaBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTLLuaBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UINTLLuaBlueprintLibrary;

// Class LISlua425.INTLLuaDelegate
// 0x0010 (0x0038 - 0x0028)
class UINTLLuaDelegate final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EventTrigger(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaDelegate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaDelegate")
	}
	static class UINTLLuaDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTLLuaDelegate>();
	}
};
DUMPER7_ASSERTS_UINTLLuaDelegate;

// Class LISlua425.INTLLuaUserWidget
// 0x00F8 (0x03E8 - 0x02F0)
class UINTLLuaUserWidget final : public UUserWidget
{
public:
	uint8                                         Pad_2F0[0x90];                                     // 0x02F0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LuaFilePath;                                       // 0x0380(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaStateName;                                      // 0x0390(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A0[0x48];                                     // 0x03A0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FINTLLuaBPVar CallLuaMember(const class FString& FunctionName, const TArray<struct FINTLLuaBPVar>& Args); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14DB39810

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("INTLLuaUserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"INTLLuaUserWidget")
	}
	static class UINTLLuaUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UINTLLuaUserWidget>();
	}
};
DUMPER7_ASSERTS_UINTLLuaUserWidget;

}

