#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_SamuelAbbas_219_AniBp

#include "Basic.hpp"

#include "PBDPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_SamuelAbbas_219_AniBp.M_SamuelAbbas_219_AniBp_C
// 0x0AD0 (0x0D40 - 0x0270)
class UM_SamuelAbbas_219_AniBp_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22FE84FE4D3893B626DB2A82EE03877E; // 0x0278(0x0060)()
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Chain                        AnimGraphNode_Chain_F543B8454ED38E6967AD449F87196F97; // 0x02E0(0x0810)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8F911C664A52FD4E0A200EBD2A6F9D16; // 0x0AF0(0x0060)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1268656848A408623480EB9E44AD4D41; // 0x0B50(0x0070)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_E7DB79D04AC0BC934B6D1F871CFF1F09; // 0x0BC0(0x0178)(ContainsInstancedReference)

public:
	void ExecuteUbergraph_M_SamuelAbbas_219_AniBp(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("M_SamuelAbbas_219_AniBp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"M_SamuelAbbas_219_AniBp_C")
	}
	static class UM_SamuelAbbas_219_AniBp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_SamuelAbbas_219_AniBp_C>();
	}
};
DUMPER7_ASSERTS_UM_SamuelAbbas_219_AniBp_C;

}

