#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaAssets

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MediaAssets_structs.hpp"
#include "AudioMixer_classes.hpp"


namespace SDK
{

// Class MediaAssets.MediaBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMediaBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void EnumerateAudioCaptureDevices(TArray<struct FMediaCaptureDevice>* OutDevices, int32 Filter); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14D7E8D40
	static void EnumerateVideoCaptureDevices(TArray<struct FMediaCaptureDevice>* OutDevices, int32 Filter); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14D7E8ED0
	static void EnumerateWebcamCaptureDevices(TArray<struct FMediaCaptureDevice>* OutDevices, int32 Filter); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14D7E9060

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaBlueprintFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaBlueprintFunctionLibrary")
	}
	static class UMediaBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaBlueprintFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMediaBlueprintFunctionLibrary;

// Class MediaAssets.MediaSource
// 0x0058 (0x0080 - 0x0028)
class UMediaSource : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMediaOptionBool(const class FName& Key, bool Value); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7EB830
	void SetMediaOptionFloat(const class FName& Key, float Value); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7EB900
	void SetMediaOptionInt64(const class FName& Key, int64 Value); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7EB9D0
	void SetMediaOptionString(const class FName& Key, const class FString& Value); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7EBAA0

	class FString GetUrl() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D625860
	bool Validate() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141FB5610

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaSource")
	}
	static class UMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaSource>();
	}
};
DUMPER7_ASSERTS_UMediaSource;

// Class MediaAssets.MediaPlayer
// 0x0110 (0x0138 - 0x0028)
class UMediaPlayer final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              OnEndReached;                                      // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMediaClosed;                                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& OpenedUrl)> OnMediaOpened;                    // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& FailedUrl)> OnMediaOpenFailed;                // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlaybackResumed;                                 // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlaybackSuspended;                               // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnSeekCompleted;                                   // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnTracksChanged;                                   // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FTimespan                              CacheAhead;                                        // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              CacheBehind;                                       // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              CacheBehindGame;                                   // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NativeAudioOut;                                    // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PlayOnOpen;                                        // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         Shuffle : 1;                                       // 0x00C4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Loop : 1;                                          // 0x00C4(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlaylist*                         Playlist;                                          // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PlaylistIndex;                                     // 0x00D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              TimeDelay;                                         // 0x00D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HorizontalFieldOfView;                             // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VerticalFieldOfView;                               // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               ViewRotation;                                      // 0x00E8(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F4[0x2C];                                      // 0x00F4(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  PlayerGUID;                                        // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanPlaySource(class UMediaSource* MediaSource); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E8BC0
	bool CanPlayUrl(const class FString& URL); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E8C50
	void Close(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E8D20
	bool Next(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EA900
	bool OpenFile(const class FString& FilePath); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EA950
	bool OpenPlaylist(class UMediaPlaylist* InPlaylist); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EAA20
	bool OpenPlaylistIndex(class UMediaPlaylist* InPlaylist, int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EAAC0
	bool OpenSource(class UMediaSource* MediaSource); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EAB80
	void OpenSourceLatent(const class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class UMediaSource* MediaSource, const struct FMediaPlayerOptions& Options, bool* bSuccess); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7EAC10
	bool OpenSourceWithOptions(class UMediaSource* MediaSource, const struct FMediaPlayerOptions& Options); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7EADF0
	bool OpenUrl(const class FString& URL); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EAEF0
	bool Pause(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EAFC0
	bool Play(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EAFF0
	bool Previous(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB020
	bool Reopen(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB170
	bool Rewind(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB260
	bool Seek(const struct FTimespan& Time); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14D7EB290
	bool SelectTrack(EMediaPlayerTrack TrackType, int32 TrackIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB330
	void SetBlockOnTime(const struct FTimespan& Time); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14D7EB3F0
	void SetDesiredPlayerName(class FName PlayerName); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB480
	bool SetLooping(bool Looping); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB7A0
	void SetMediaOptions(const class UMediaSource* Options); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EBBC0
	bool SetNativeVolume(float Volume); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EBD40
	bool SetRate(float Rate); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EBDD0
	void SetTimeDelay(const struct FTimespan& TimeDelay_0); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14D7EBFC0
	bool SetTrackFormat(EMediaPlayerTrack TrackType, int32 TrackIndex, int32 FormatIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EC040
	bool SetVideoTrackFrameRate(int32 TrackIndex, int32 FormatIndex, float FrameRate); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EC140
	bool SetViewField(float Horizontal, float Vertical, bool Absolute); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EC240
	bool SetViewRotation(const struct FRotator& Rotation, bool Absolute); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14D7EC350

	bool CanPause() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E8B90
	int32 GetAudioTrackChannels(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E92B0
	int32 GetAudioTrackSampleRate(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9370
	class FString GetAudioTrackType(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9430
	class FName GetDesiredPlayerName() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9540
	struct FTimespan GetDuration() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9580
	float GetHorizontalFieldOfView() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9620
	struct FTimespan GetLastAudioSampleProcessedTime() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9650
	struct FTimespan GetLastVideoSampleProcessedTime() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9690
	class FText GetMediaName() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E96D0
	int32 GetNumTrackFormats(EMediaPlayerTrack TrackType, int32 TrackIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9870
	int32 GetNumTracks(EMediaPlayerTrack TrackType) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9930
	class FName GetPlayerName() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E99C0
	class UMediaPlaylist* GetPlaylist() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9A00
	int32 GetPlaylistIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9A20
	float GetRate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9B80
	int32 GetSelectedTrack(EMediaPlayerTrack TrackType) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9BB0
	void GetSupportedRates(TArray<struct FFloatRange>* OutRates, bool Unthinned) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9D20
	struct FTimespan GetTime() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9E40
	struct FTimespan GetTimeDelay() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9E80
	class FText GetTrackDisplayName(EMediaPlayerTrack TrackType, int32 TrackIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9EC0
	int32 GetTrackFormat(EMediaPlayerTrack TrackType, int32 TrackIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9FE0
	class FString GetTrackLanguage(EMediaPlayerTrack TrackType, int32 TrackIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA0A0
	class FString GetUrl() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA1B0
	float GetVerticalFieldOfView() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA1F0
	float GetVideoTrackAspectRatio(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA220
	struct FIntPoint GetVideoTrackDimensions(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA2E0
	float GetVideoTrackFrameRate(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA3B0
	struct FFloatRange GetVideoTrackFrameRates(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA470
	class FString GetVideoTrackType(int32 TrackIndex, int32 FormatIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA540
	struct FRotator GetViewRotation() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA650
	bool HasError() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA690
	bool IsBuffering() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA780
	bool IsClosed() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA7B0
	bool IsConnecting() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA7E0
	bool IsLooping() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA810
	bool IsPaused() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA840
	bool IsPlaying() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA870
	bool IsPreparing() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA8A0
	bool IsReady() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EA8D0
	bool SupportsRate(float Rate, bool Unthinned) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EC430
	bool SupportsScrubbing() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EC500
	bool SupportsSeeking() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7EC530

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaPlayer")
	}
	static class UMediaPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlayer>();
	}
};
DUMPER7_ASSERTS_UMediaPlayer;

// Class MediaAssets.BaseMediaSource
// 0x0008 (0x0088 - 0x0080)
class UBaseMediaSource : public UMediaSource
{
public:
	class FName                                   PlayerName;                                        // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseMediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMediaSource")
	}
	static class UBaseMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMediaSource>();
	}
};
DUMPER7_ASSERTS_UBaseMediaSource;

// Class MediaAssets.FileMediaSource
// 0x0028 (0x00B0 - 0x0088)
class UFileMediaSource final : public UBaseMediaSource
{
public:
	class FString                                 FilePath;                                          // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PrecacheFile;                                      // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x17];                                      // 0x0099(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetFilePath(const class FString& Path); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB6E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FileMediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FileMediaSource")
	}
	static class UFileMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFileMediaSource>();
	}
};
DUMPER7_ASSERTS_UFileMediaSource;

// Class MediaAssets.MediaPlaylist
// 0x0010 (0x0038 - 0x0028)
class UMediaPlaylist final : public UObject
{
public:
	TArray<class UMediaSource*>                   Items;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	bool Add(class UMediaSource* MediaSource); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E8710
	bool AddFile(const class FString& FilePath); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E87A0
	bool AddUrl(const class FString& URL); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E8870
	class UMediaSource* Get(int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E91F0
	class UMediaSource* GetNext(int32* InOutIndex); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7E97D0
	class UMediaSource* GetPrevious(int32* InOutIndex); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7E9A40
	class UMediaSource* GetRandom(int32* OutIndex); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7E9AE0
	void Insert(class UMediaSource* MediaSource, int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EA6C0
	int32 Num(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EA930
	bool Remove(class UMediaSource* MediaSource); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB050
	bool RemoveAt(int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB0E0
	bool Replace(int32 Index_0, class UMediaSource* Replacement); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB1A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaPlaylist")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaPlaylist")
	}
	static class UMediaPlaylist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlaylist>();
	}
};
DUMPER7_ASSERTS_UMediaPlaylist;

// Class MediaAssets.MediaSoundComponent
// 0x0210 (0x08F0 - 0x06E0)
class UMediaSoundComponent final : public USynthComponent
{
public:
	EMediaSoundChannels                           Channels;                                          // 0x06E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DynamicRateAdjustment;                             // 0x06E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E5[0x3];                                      // 0x06E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RateAdjustmentFactor;                              // 0x06E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFloatRange                            RateAdjustmentRange;                               // 0x06EC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0700(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_708[0x1E8];                                    // 0x0708(0x01E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool BP_GetAttenuationSettingsToApply(struct FSoundAttenuationSettings* OutAttenuationSettings); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14D7E8940
	TArray<struct FMediaSoundComponentSpectralData> GetSpectralData(); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7E9C40
	void SetEnableEnvelopeFollowing(bool bInEnvelopeFollowing); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB500
	void SetEnableSpectralAnalysis(bool bInSpectralAnalysisEnabled); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB590
	void SetEnvelopeFollowingsettings(int32 AttackTimeMsec, int32 ReleaseTimeMsec); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EB620
	void SetMediaPlayer(class UMediaPlayer* NewMediaPlayer); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EBC40
	void SetSpectralAnalysisSettings(const TArray<float>& InFrequenciesToAnalyze, EMediaSoundComponentFFTSize InFFTSize); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EBE60

	float GetEnvelopeValue() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E95C0
	class UMediaPlayer* GetMediaPlayer() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9770

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaSoundComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaSoundComponent")
	}
	static class UMediaSoundComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaSoundComponent>();
	}
};
DUMPER7_ASSERTS_UMediaSoundComponent;

// Class MediaAssets.MediaTexture
// 0x00D0 (0x0200 - 0x0130)
class UMediaTexture final : public UTexture
{
public:
	ETextureAddress                               AddressX;                                          // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x0131(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoClear;                                         // 0x0132(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_133[0x1];                                      // 0x0133(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ClearColor;                                        // 0x0134(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0148(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0xB0];                                     // 0x0150(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMediaPlayer(class UMediaPlayer* NewMediaPlayer); // (Final, Native, Public, BlueprintCallable) // @ 0x14D7EBCC0

	float GetAspectRatio() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E9280
	int32 GetHeight() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E95F0
	class UMediaPlayer* GetMediaPlayer() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14D7E97A0
	int32 GetWidth() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7E0FB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaTexture")
	}
	static class UMediaTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaTexture>();
	}
};
DUMPER7_ASSERTS_UMediaTexture;

// Class MediaAssets.PlatformMediaSource
// 0x0008 (0x0088 - 0x0080)
class UPlatformMediaSource final : public UMediaSource
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlatformMediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlatformMediaSource")
	}
	static class UPlatformMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlatformMediaSource>();
	}
};
DUMPER7_ASSERTS_UPlatformMediaSource;

// Class MediaAssets.StreamMediaSource
// 0x0010 (0x0098 - 0x0088)
class UStreamMediaSource final : public UBaseMediaSource
{
public:
	class FString                                 StreamUrl;                                         // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StreamMediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StreamMediaSource")
	}
	static class UStreamMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamMediaSource>();
	}
};
DUMPER7_ASSERTS_UStreamMediaSource;

// Class MediaAssets.TimeSynchronizableMediaSource
// 0x0010 (0x0098 - 0x0088)
class UTimeSynchronizableMediaSource final : public UBaseMediaSource
{
public:
	bool                                          bUseTimeSynchronization;                           // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FrameDelay;                                        // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TimeDelay;                                         // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TimeSynchronizableMediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TimeSynchronizableMediaSource")
	}
	static class UTimeSynchronizableMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeSynchronizableMediaSource>();
	}
};
DUMPER7_ASSERTS_UTimeSynchronizableMediaSource;

}

