#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MessageTags

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MessageTags_structs.hpp"


namespace SDK
{

// Class MessageTags.BlueprintMessageTagLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintMessageTagLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddMessageTag(struct FMessageTagContainer& TagContainer, const struct FMessageTag& Tag); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CD5720
	static void AppendMessageTagContainers(struct FMessageTagContainer& InOutTagContainer, const struct FMessageTagContainer& InTagContainer); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CD5870
	static void BreakMessageTagContainer(const struct FMessageTagContainer& MessageTagContainer, TArray<struct FMessageTag>* MessageTags); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD5A50
	static bool DoesContainerMatchTagQuery(const struct FMessageTagContainer& TagContainer, const struct FMessageTagQuery& TagQuery); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD5BF0
	static bool DoesTagAssetInterfaceHaveTag(TScriptInterface<class IMessageTagAssetInterface> TagContainerInterface, const struct FMessageTag& Tag); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD5D70
	static bool EqualEqual_MessageTag(const struct FMessageTag& A, const struct FMessageTag& B); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD5E50
	static bool EqualEqual_MessageTagContainer(const struct FMessageTagContainer& A, const struct FMessageTagContainer& B); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD5F10
	static void GetAllActorsOfClassMatchingTagQuery(class UObject* WorldContextObject, TSubclassOf<class AActor> ActorClass, const struct FMessageTagQuery& MessageTagQuery, TArray<class AActor*>* OutActors); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CD60F0
	static class FString GetDebugStringFromMessageTag(const struct FMessageTag& MessageTag); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD62B0
	static class FString GetDebugStringFromMessageTagContainer(const struct FMessageTagContainer& TagContainer); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD6380
	static int32 GetNumMessageTagsInContainer(const struct FMessageTagContainer& TagContainer); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD64E0
	static class FName GetTagName(const struct FMessageTag& MessageTag); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD6700
	static bool HasAllMatchingMessageTags(TScriptInterface<class IMessageTagAssetInterface> TagContainerInterface, const struct FMessageTagContainer& OtherContainer); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD68C0
	static bool HasAllTags(const struct FMessageTagContainer& TagContainer, const struct FMessageTagContainer& OtherContainer, bool bExactMatch); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD6A30
	static bool HasAnyTags(const struct FMessageTagContainer& TagContainer, const struct FMessageTagContainer& OtherContainer, bool bExactMatch); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD6D70
	static bool HasTag(const struct FMessageTagContainer& TagContainer, const struct FMessageTag& Tag, bool bExactMatch); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD7030
	static bool IsMessageTagValid(const struct FMessageTag& MessageTag); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD71C0
	static bool IsTagQueryEmpty(const struct FMessageTagQuery& TagQuery); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD7240
	static struct FMessageTag MakeLiteralMessageTag(const struct FMessageTag& Value); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD72E0
	static struct FMessageTagContainer MakeLiteralMessageTagContainer(const struct FMessageTagContainer& Value); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD7370
	static struct FMessageTagContainer MakeMessageTagContainerFromArray(const TArray<struct FMessageTag>& MessageTags); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD7510
	static struct FMessageTagContainer MakeMessageTagContainerFromTag(const struct FMessageTag& SingleTag); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD7660
	static struct FMessageTagQuery MakeMessageTagQuery(const struct FMessageTagQuery& TagQuery); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD7770
	static bool MatchesAnyTags(const struct FMessageTag& TagOne, const struct FMessageTagContainer& OtherContainer, bool bExactMatch); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD7830
	static bool MatchesTag(const struct FMessageTag& TagOne, const struct FMessageTag& TagTwo, bool bExactMatch); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD79C0
	static bool NotEqual_MessageTag(const struct FMessageTag& A, const struct FMessageTag& B); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD7AB0
	static bool NotEqual_MessageTagContainer(const struct FMessageTagContainer& A, const struct FMessageTagContainer& B); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x140CD7B70
	static bool NotEqual_TagContainerTagContainer(const struct FMessageTagContainer& A, const class FString& B); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD7D50
	static bool NotEqual_TagTag(const struct FMessageTag& A, const class FString& B); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x140CD7F40
	static bool RemoveMessageTag(struct FMessageTagContainer& TagContainer, const struct FMessageTag& Tag); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140CD80A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlueprintMessageTagLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlueprintMessageTagLibrary")
	}
	static class UBlueprintMessageTagLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintMessageTagLibrary>();
	}
};
DUMPER7_ASSERTS_UBlueprintMessageTagLibrary;

// Class MessageTags.MessageTagAssetInterface
// 0x0000 (0x0000 - 0x0000)
class IMessageTagAssetInterface final
{
public:
	void GetOwnedMessageTags(struct FMessageTagContainer* TagContainer) const; // (Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140CD65F0
	bool HasAllMatchingMessageTags(const struct FMessageTagContainer& TagContainer) const; // (Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140CD67A0
	bool HasAnyMatchingMessageTags(const struct FMessageTagContainer& TagContainer) const; // (Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140CD6C50
	bool HasMatchingMessageTag(const struct FMessageTag& TagToCheck) const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140CD6F90

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MessageTagAssetInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MessageTagAssetInterface")
	}
	static class IMessageTagAssetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMessageTagAssetInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMessageTagAssetInterface;

// Class MessageTags.EditableMessageTagQuery
// 0x0070 (0x0098 - 0x0028)
class UEditableMessageTagQuery final : public UObject
{
public:
	class FString                                 UserDescription;                                   // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UEditableMessageTagQueryExpression*     RootExpression;                                    // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMessageTagQuery                       TagQueryExportText_Helper;                         // 0x0050(0x0048)(NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQuery")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQuery")
	}
	static class UEditableMessageTagQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQuery>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQuery;

// Class MessageTags.EditableMessageTagQueryExpression
// 0x0000 (0x0028 - 0x0028)
class UEditableMessageTagQueryExpression : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQueryExpression")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQueryExpression")
	}
	static class UEditableMessageTagQueryExpression* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQueryExpression>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQueryExpression;

// Class MessageTags.EditableMessageTagQueryExpression_AnyTagsMatch
// 0x0020 (0x0048 - 0x0028)
class UEditableMessageTagQueryExpression_AnyTagsMatch final : public UEditableMessageTagQueryExpression
{
public:
	struct FMessageTagContainer                   Tags;                                              // 0x0028(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQueryExpression_AnyTagsMatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQueryExpression_AnyTagsMatch")
	}
	static class UEditableMessageTagQueryExpression_AnyTagsMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQueryExpression_AnyTagsMatch>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQueryExpression_AnyTagsMatch;

// Class MessageTags.EditableMessageTagQueryExpression_AllTagsMatch
// 0x0020 (0x0048 - 0x0028)
class UEditableMessageTagQueryExpression_AllTagsMatch final : public UEditableMessageTagQueryExpression
{
public:
	struct FMessageTagContainer                   Tags;                                              // 0x0028(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQueryExpression_AllTagsMatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQueryExpression_AllTagsMatch")
	}
	static class UEditableMessageTagQueryExpression_AllTagsMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQueryExpression_AllTagsMatch>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQueryExpression_AllTagsMatch;

// Class MessageTags.EditableMessageTagQueryExpression_NoTagsMatch
// 0x0020 (0x0048 - 0x0028)
class UEditableMessageTagQueryExpression_NoTagsMatch final : public UEditableMessageTagQueryExpression
{
public:
	struct FMessageTagContainer                   Tags;                                              // 0x0028(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQueryExpression_NoTagsMatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQueryExpression_NoTagsMatch")
	}
	static class UEditableMessageTagQueryExpression_NoTagsMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQueryExpression_NoTagsMatch>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQueryExpression_NoTagsMatch;

// Class MessageTags.EditableMessageTagQueryExpression_AnyExprMatch
// 0x0010 (0x0038 - 0x0028)
class UEditableMessageTagQueryExpression_AnyExprMatch final : public UEditableMessageTagQueryExpression
{
public:
	TArray<class UEditableMessageTagQueryExpression*> Expressions;                                   // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQueryExpression_AnyExprMatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQueryExpression_AnyExprMatch")
	}
	static class UEditableMessageTagQueryExpression_AnyExprMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQueryExpression_AnyExprMatch>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQueryExpression_AnyExprMatch;

// Class MessageTags.EditableMessageTagQueryExpression_AllExprMatch
// 0x0010 (0x0038 - 0x0028)
class UEditableMessageTagQueryExpression_AllExprMatch final : public UEditableMessageTagQueryExpression
{
public:
	TArray<class UEditableMessageTagQueryExpression*> Expressions;                                   // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQueryExpression_AllExprMatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQueryExpression_AllExprMatch")
	}
	static class UEditableMessageTagQueryExpression_AllExprMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQueryExpression_AllExprMatch>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQueryExpression_AllExprMatch;

// Class MessageTags.EditableMessageTagQueryExpression_NoExprMatch
// 0x0010 (0x0038 - 0x0028)
class UEditableMessageTagQueryExpression_NoExprMatch final : public UEditableMessageTagQueryExpression
{
public:
	TArray<class UEditableMessageTagQueryExpression*> Expressions;                                   // 0x0028(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditableMessageTagQueryExpression_NoExprMatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditableMessageTagQueryExpression_NoExprMatch")
	}
	static class UEditableMessageTagQueryExpression_NoExprMatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditableMessageTagQueryExpression_NoExprMatch>();
	}
};
DUMPER7_ASSERTS_UEditableMessageTagQueryExpression_NoExprMatch;

// Class MessageTags.MessageTagsManager
// 0x0188 (0x01B0 - 0x0028)
class UMessageTagsManager final : public UObject
{
public:
	uint8                                         Pad_28[0x98];                                      // 0x0028(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMessageTagSource>              TagSources;                                        // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D0[0x80];                                      // 0x00D0(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UDataTable*>                     MessageTagTables;                                  // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x50];                                     // 0x0160(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MessageTagsManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MessageTagsManager")
	}
	static class UMessageTagsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMessageTagsManager>();
	}
};
DUMPER7_ASSERTS_UMessageTagsManager;

// Class MessageTags.MessageTagsList
// 0x0020 (0x0048 - 0x0028)
class UMessageTagsList : public UObject
{
public:
	class FString                                 ConfigFileName;                                    // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMessageTagTableRow>            MessageTagList;                                    // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MessageTagsList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MessageTagsList")
	}
	static class UMessageTagsList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMessageTagsList>();
	}
};
DUMPER7_ASSERTS_UMessageTagsList;

// Class MessageTags.RestrictedMessageTagsList
// 0x0020 (0x0048 - 0x0028)
class URestrictedMessageTagsList final : public UObject
{
public:
	class FString                                 ConfigFileName;                                    // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRestrictedMessageTagTableRow>  RestrictedMessageTagList;                          // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RestrictedMessageTagsList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RestrictedMessageTagsList")
	}
	static class URestrictedMessageTagsList* GetDefaultObj()
	{
		return GetDefaultObjImpl<URestrictedMessageTagsList>();
	}
};
DUMPER7_ASSERTS_URestrictedMessageTagsList;

// Class MessageTags.MessageTagsSettings
// 0x0070 (0x00B8 - 0x0048)
class UMessageTagsSettings final : public UMessageTagsList
{
public:
	bool                                          ImportTagsFromConfig;                              // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WarnOnInvalidTags;                                 // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FastReplication;                                   // 0x004A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InvalidTagCharacters;                              // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMessageTagCategoryRemap>       CategoryRemapping;                                 // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                MessageTagTableList;                               // 0x0070(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FMessageTagRedirect>            MessageTagRedirects;                               // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           CommonlyReplicatedTags;                            // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         NumBitsForContainerSize;                           // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetIndexFirstBitSegment;                           // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRestrictedMessageCfg>          RestrictedConfigFiles;                             // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MessageTagsSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MessageTagsSettings")
	}
	static class UMessageTagsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMessageTagsSettings>();
	}
};
DUMPER7_ASSERTS_UMessageTagsSettings;

// Class MessageTags.MessageTagsDeveloperSettings
// 0x0010 (0x0038 - 0x0028)
class UMessageTagsDeveloperSettings final : public UObject
{
public:
	class FString                                 DeveloperConfigName;                               // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MessageTagsDeveloperSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MessageTagsDeveloperSettings")
	}
	static class UMessageTagsDeveloperSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMessageTagsDeveloperSettings>();
	}
};
DUMPER7_ASSERTS_UMessageTagsDeveloperSettings;

}

