#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaStatistics

#include "Basic.hpp"

#include "MetaStatistics_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MetaStatistics.MTStatisticsMonitor
// 0x0390 (0x03B8 - 0x0028)
class UMTStatisticsMonitor final : public UObject
{
public:
	TMulticastInlineDelegate<void(const class FString& InCallName, const struct FMTCallRecord& Record, class UMTStatisticsMonitor* StatisticsMonitor)> OnCollectOneCallTrace; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	bool                                          bShowAlertMonitorMessage;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAlertTriggerMessage;                          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMTAlertRecord>                 FrameDurationAlertRecords;                         // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMTAlertRecord>                 MTCallDurationAlertRecords;                        // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMTAlertRecord>                 DorianDurationAlertRecords;                        // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMTAlertRecord>                 MTCallAvgDurationAlertRecords;                     // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMTAlertRecord>                 DorianAvgDurationAlertRecords;                     // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Int1;                                              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Int2;                                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Int3;                                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Double1;                                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Double2;                                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 String1;                                           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 String2;                                           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    DataMap1;                                          // 0x00D0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    DataMap2;                                          // 0x0120(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    DataMap3;                                          // 0x0170(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            DataMap4;                                          // 0x01C0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            DataMap5;                                          // 0x0210(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, double>                   DataMap6;                                          // 0x0260(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, double>                   DataMap7;                                          // 0x02B0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 DataArray1;                                        // 0x0300(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 DataArray2;                                        // 0x0310(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 DataArray3;                                        // 0x0320(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         DataArray4;                                        // 0x0330(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         DataArray5;                                        // 0x0340(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                DataArray6;                                        // 0x0350(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                DataArray7;                                        // 0x0360(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	double                                        CurrentFrameDorianCallDuration;                    // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CurrentFrameMTCallDuration;                        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        CurrentFrameNumber;                                // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        CurrentFrameDorianCallCount;                       // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        CurrentFrameMTCallCount;                           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        TotalDorianCallCount;                              // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        TotalMTCallCount;                                  // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TotalDorianCallDuration;                           // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TotalMTCallDuration;                               // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UMTStatisticsMonitor* Get(); // (Final, Native, Static, Public) // @ 0x14B0CB270
	static void NewFrameReset(uint64 FrameNumber); // (Final, Native, Static, Public) // @ 0x14B0CCA90
	static void ResetData(); // (Final, Native, Static, Public) // @ 0x14B0CD000

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MTStatisticsMonitor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MTStatisticsMonitor")
	}
	static class UMTStatisticsMonitor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTStatisticsMonitor>();
	}
};
DUMPER7_ASSERTS_UMTStatisticsMonitor;

// Class MetaStatistics.MTStatisticsHelper
// 0x0000 (0x0028 - 0x0028)
class UMTStatisticsHelper final : public UBlueprintFunctionLibrary
{
public:
	static void AnalyzeStatData(); // (Final, Native, Static, Public) // @ 0x14B0CB230
	static void CleanStatData(); // (Final, Native, Static, Public) // @ 0x14B0CB250
	static TArray<class FString> GetActivatedModules(); // (Final, Native, Static, Public) // @ 0x14B0CB2A0
	static TArray<class FString> GetActivatedStubs(); // (Final, Native, Static, Public) // @ 0x14B0CB370
	static TArray<class FString> GetActivatedStubsInModule(const class FString& ModuleName); // (Final, Native, Static, Public) // @ 0x14B0CB440
	static TArray<struct FMTCallRecord> GetAllCallRecords(); // (Final, Native, Static, Public) // @ 0x14B0CB5F0
	static double GetAvgCallInterval(const class FString& InCallName); // (Final, Native, Static, Public) // @ 0x14B0CB640
	static double GetAvgDorianCallInterval(const class FString& InDorianName); // (Final, Native, Static, Public) // @ 0x14B0CB700
	static class FString GetBoundDorianFunc(const class FString& ModuleName, const class FString& FuncName); // (Final, Native, Static, Public) // @ 0x14B0CB7C0
	static class FString GetBoundDorianFuncV2(const class FString& Token); // (Final, Native, Static, Public) // @ 0x14B0CB9E0
	static double GetCallAvgDurationMS(const class FString& InCallName); // (Final, Native, Static, Public) // @ 0x14B0CBB50
	static uint64 GetCallCount(const class FString& InCallName); // (Final, Native, Static, Public) // @ 0x14B0CBC10
	static TArray<struct FMTCallRecord> GetCallRecords(const class FString& InCallName); // (Final, Native, Static, Public) // @ 0x14B0CBFD0
	static class FString GetCallRecordStatStr(const class FString& InCallName, bool bShowDetail); // (Final, Native, Static, Public) // @ 0x14B0CBCD0
	static class FString GetCallRecordStr(const struct FMTCallRecord& Record, bool bShowDetail); // (Final, Native, Static, Public, HasOutParams) // @ 0x14B0CBE20
	static struct FMTCallTrace GetCallTrace(const class FString& InCallName); // (Final, Native, Static, Public) // @ 0x14B0CC0B0
	static double GetDorianAvgDurationMS(const class FString& InDorianName); // (Final, Native, Static, Public) // @ 0x14B0CC1E0
	static uint64 GetDorianCallCount(const class FString& InDorianName); // (Final, Native, Static, Public) // @ 0x14B0CC2A0
	static TArray<struct FMTCallRecord> GetDorianCallRecords(const class FString& InDorianFuncName); // (Final, Native, Static, Public) // @ 0x14B0CC360
	static class FString GetDorianFuncCallStatStr(const class FString& InDorianFuncName, bool bShowDetail); // (Final, Native, Static, Public) // @ 0x14B0CC440
	static class FString GetDorianFunctionBindingInfo(); // (Final, Native, Static, Public) // @ 0x14B0CC590
	static struct FMTDorianTrace GetDorianTrace(const class FString& InDorianName); // (Final, Native, Static, Public) // @ 0x14B0CC610
	static struct FMTCallRecord GetSingleCallRecord(const class FString& InCallName, const uint64& InID); // (Final, Native, Static, Public, HasOutParams) // @ 0x14B0CC880
	static bool IsEnabledStat(); // (Final, Native, Static, Public) // @ 0x14B0CCA60
	static void PrintAllCallRecord(bool bShowDetail); // (Final, Native, Static, Public) // @ 0x14B0CCB40
	static void PrintAllCallRecordStatByCall(bool bShowDetail); // (Final, Native, Static, Public) // @ 0x14B0CCBC0
	static void PrintAllDorianFuncCallStat(bool bShowDetail); // (Final, Native, Static, Public) // @ 0x14B0CCC40
	static void PrintCallRecordStat(const class FString& InCallName, bool bShowDetail); // (Final, Native, Static, Public) // @ 0x14B0CCCC0
	static void PrintDorianFuncCallStat(const class FString& InDorianFuncName, bool bShowDetail); // (Final, Native, Static, Public) // @ 0x14B0CCE60
	static void SetEnabledStat(bool Value); // (Final, Native, Static, Public) // @ 0x14B0CD0C0
	static bool SetInTimeMonitorEnabled(bool bEnable); // (Final, Native, Static, Public) // @ 0x14B0CD140

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MTStatisticsHelper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MTStatisticsHelper")
	}
	static class UMTStatisticsHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTStatisticsHelper>();
	}
};
DUMPER7_ASSERTS_UMTStatisticsHelper;

}

