#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaExtra

#include "Basic.hpp"

#include "MetaExtra_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MetaExtra.MTTestUObject1
// 0x0020 (0x0048 - 0x0028)
class UMTTestUObject1 : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ID;                                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MTTestUObject1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MTTestUObject1")
	}
	static class UMTTestUObject1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTTestUObject1>();
	}
};
DUMPER7_ASSERTS_UMTTestUObject1;

// Class MetaExtra.MTTestUObject2
// 0x0008 (0x0050 - 0x0048)
class UMTTestUObject2 final : public UMTTestUObject1
{
public:
	EMTTestEnum1                                  Evaluation;                                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MTTestUObject2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MTTestUObject2")
	}
	static class UMTTestUObject2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTTestUObject2>();
	}
};
DUMPER7_ASSERTS_UMTTestUObject2;

// Class MetaExtra.MTTestUObject3
// 0x0018 (0x0040 - 0x0028)
class UMTTestUObject3 final : public UObject
{
public:
	class FString                                 Nation;                                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ZipCode;                                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MTTestUObject3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MTTestUObject3")
	}
	static class UMTTestUObject3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTTestUObject3>();
	}
};
DUMPER7_ASSERTS_UMTTestUObject3;

// Class MetaExtra.MTIOTestData3
// 0x03B8 (0x03E0 - 0x0028)
class UMTIOTestData3 final : public UObject
{
public:
	int8                                          IntVal0;                                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x1];                                       // 0x0029(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         IntVal1;                                           // 0x002A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntVal2;                                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         IntVal3;                                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         IntVal4;                                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x1];                                       // 0x0039(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        IntVal5;                                           // 0x003A(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        IntVal6;                                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        IntVal7;                                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolVal0;                                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolVal1;                                          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BoolVal2 : 1;                                      // 0x004A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BoolVal3 : 1;                                      // 0x004A(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatVal0;                                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FloatVal1;                                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vec0;                                              // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Vec1;                                              // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Vec2;                                              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  Quat;                                              // 0x0080(0x0010)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Trans;                                             // 0x0090(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatrix                                Mat;                                               // 0x00D0(0x0040)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               Rot;                                               // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       BoxSphereBounds;                                   // 0x011C(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FOrientedBox                           OrientedBox;                                       // 0x0138(0x003C)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRay                                   Ray;                                               // 0x0174(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSphere                                Sphere;                                            // 0x018C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCapsuleShape                          CapsuleShape;                                      // 0x019C(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlane                                 Plane;                                             // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 IntArray;                                          // 0x01D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        UObjArray;                                         // 0x01E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UMTTestUObject1>>    UObjSubClassArray;                                 // 0x01F0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<int64, int64>                            IntMap;                                            // 0x0200(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, class UObject*>                   UObjMap;                                           // 0x0250(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<int64, TSubclassOf<class UMTTestUObject1>> UObjSubClassMap;                                 // 0x02A0(0x0050)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSet<int64>                                   IntSet;                                            // 0x02F0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<class UObject*>                          UObjSet;                                           // 0x0340(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<TSubclassOf<class UMTTestUObject1>>      UObjSubClassSet;                                   // 0x0390(0x0050)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static void CombinedTest(); // (Final, Native, Static, Public) // @ 0x14B07CFC0
	static void PrintInfo(); // (Final, Native, Static, Public) // @ 0x14B07D070

	void Init(); // (Final, Native, Public) // @ 0x14B07D050
	void TriggerContainerPassTest(); // (Final, Native, Public) // @ 0x14B07D090

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MTIOTestData3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MTIOTestData3")
	}
	static class UMTIOTestData3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMTIOTestData3>();
	}
};
DUMPER7_ASSERTS_UMTIOTestData3;

}

