#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModularWeaponAnimationBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ZZAnimationLib_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ModularWeaponAnimationBP.ModularWeaponAnimationBP_C
// 0x1C30 (0x2850 - 0x0C20)
class UModularWeaponAnimationBP_C final : public UGPModularWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9B14AA264D921CBBA36F1FB305450077; // 0x0C28(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E8E24BD7401A054F40E015A7B54D4A87; // 0x0D08(0x0100)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11BF7AE24556283896E001B55C91DE73; // 0x0E08(0x0060)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_AFFD03D642CD1EE9C382A694E847AF92; // 0x0E68(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F233D8A24043347F623CB990DBC27CEC; // 0x0EC8(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_598B34AE4E80204D86C9A587A8EFAF19; // 0x0FC8(0x0068)()
	struct FAnimNode_ModifyMultBone               AnimGraphNode_ModifyMultBone_E6B156B74799E8ACC8F600B901C5B1DA; // 0x1030(0x0198)()
	struct FAnimNode_PartCopyBone                 AnimGraphNode_PartCopyBone_7F51E49747E202F49AE51EBCEB4F4F8A; // 0x11C8(0x0088)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_FCF989384B52B86D3CDDDB86A7BC34C4; // 0x1250(0x0110)()
	struct FAnimNode_PartAnimPlayer               AnimGraphNode_PartAnimPlayer_60E7CF8544ABEF9794C0A5A2150983C6; // 0x1360(0x01E8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_D36CBB1646CAB116FAF63B9429671848; // 0x1548(0x0070)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9D70DE4543177470F245C29DF631AFCA; // 0x15B8(0x0068)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D4A86B2C4D57AB84798BA99C3998AB57; // 0x1620(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D0C7E96948AC625B94E6F9A7B825A0DC; // 0x1688(0x0100)()
	struct FAnimNode_PartAnimPlayer               AnimGraphNode_PartAnimPlayer_91257E8C401B603E2D0293A81DF2B9EF; // 0x1788(0x01E8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_047990354111722FCA6E8D8E20464AEA; // 0x1970(0x0050)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_624023AE4E8EB466EF59C3A1D7AEE4D5; // 0x19C0(0x0060)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1228A8AB49E032AEECC9E09DBCFA2CD3; // 0x1A20(0x0160)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_A7E4B291483DD39B57FBF19A7784587C; // 0x1B80(0x0060)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_992DC27E4ABAF792A013D793B7CBE560; // 0x1BE0(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7F79D4FB4E0ED8DD071B90BB26FD3221; // 0x1CF0(0x0068)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_593772884FACA09676FC8C8FCC3A6223; // 0x1D58(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A2407F564F36DC64979A158669511EE5; // 0x1E58(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D93F11294770703BD467FDADCD7B4892; // 0x1EC0(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C93F327D42F909059F25EAA2163079C0; // 0x1FD0(0x0068)()
	uint8                                         Pad_2038[0x8];                                     // 0x2038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Parabola                     AnimGraphNode_Parabola_C7DF41024CA22B15E5FB8EA9C2F01901; // 0x2040(0x0190)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C0D032ED4CCE6AF22F344897BCBF2533; // 0x21D0(0x0060)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3392C0874997BE2F152B829086642F5C; // 0x2230(0x0060)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_A777F99C466C4597FF1B48A611976A92; // 0x2290(0x00E0)()
	struct FAnimNode_PartApplyAdditive            AnimGraphNode_PartApplyAdditive_BA5B0AF44A9E55EA99A4D8AAB28883A8; // 0x2370(0x01A0)()
	struct FAnimNode_PartApplyAdditive            AnimGraphNode_PartApplyAdditive_0A676B3B456F107C9A2BA1AD95C79153; // 0x2510(0x01A0)()
	struct FAnimNode_PartApplyAdditive            AnimGraphNode_PartApplyAdditive_FC504378476845AF612B64952905F673; // 0x26B0(0x01A0)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_ModularWeaponAnimationBP(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ModularWeaponAnimationBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ModularWeaponAnimationBP_C")
	}
	static class UModularWeaponAnimationBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModularWeaponAnimationBP_C>();
	}
};
DUMPER7_ASSERTS_UModularWeaponAnimationBP_C;

}

