#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieScene

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Class MovieScene.MovieSceneSignedObject
// 0x0028 (0x0050 - 0x0028)
class UMovieSceneSignedObject : public UObject
{
public:
	struct FGuid                                  Signature;                                         // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSignedObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSignedObject")
	}
	static class UMovieSceneSignedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSignedObject>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSignedObject;

// Class MovieScene.MovieSceneSection
// 0x00A0 (0x00F0 - 0x0050)
class UMovieSceneSection : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneSectionEvalOptions          EvalOptions;                                       // 0x0050(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEasingSettings              Easing;                                            // 0x0058(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMovieSceneFrameRange                  SectionRange;                                      // 0x00A0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FFrameNumber                           PreRollFrames;                                     // 0x00B0(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameNumber                           PostRollFrames;                                    // 0x00B4(0x0004)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         RowIndex;                                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         OverlapPriority;                                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsActive : 1;                                     // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bIsLocked : 1;                                     // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x00C4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndTime;                                           // 0x00C8(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PrerollTime;                                       // 0x00CC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PostrollTime;                                      // 0x00D0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIsInfinite : 1;                                   // 0x00D4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSupportsInfiniteRange;                            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FOptionalMovieSceneBlendType           BlendType;                                         // 0x00D9(0x0002)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_DB[0x15];                                      // 0x00DB(0x0015)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBlendType(EMovieSceneBlendType InBlendType); // (RequiredAPI, Native, Public, BlueprintCallable) // @ 0x14C5A6B30
	void SetCompletionMode(EMovieSceneCompletionMode InCompletionMode); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A6BB0
	void SetIsActive(bool bInIsActive); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A6C30
	void SetIsLocked(bool bInIsLocked); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A6CC0
	void SetOverlapPriority(int32 NewPriority); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A6D50
	void SetPostRollFrames(int32 InPostRollFrames); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A6DD0
	void SetPreRollFrames(int32 InPreRollFrames); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A6E60
	void SetRowIndex(int32 NewRowIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A6EF0

	struct FOptionalMovieSceneBlendType GetBlendType() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6960
	EMovieSceneCompletionMode GetCompletionMode() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6990
	int32 GetOverlapPriority() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A69B0
	int32 GetPostRollFrames() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6A70
	int32 GetPreRollFrames() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6A90
	int32 GetRowIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6AB0
	bool IsActive() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6AD0
	bool IsLocked() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6B00

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSection")
	}
	static class UMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSection;

// Class MovieScene.MovieScenePrespawnObjectState
// 0x0008 (0x0030 - 0x0028)
class UMovieScenePrespawnObjectState : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScenePrespawnObjectState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScenePrespawnObjectState")
	}
	static class UMovieScenePrespawnObjectState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePrespawnObjectState>();
	}
};
DUMPER7_ASSERTS_UMovieScenePrespawnObjectState;

// Class MovieScene.MovieSceneTrack
// 0x0008 (0x0058 - 0x0050)
class UMovieSceneTrack : public UMovieSceneSignedObject
{
public:
	struct FMovieSceneTrackEvalOptions            EvalOptions;                                       // 0x0050(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x1];                                       // 0x0054(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEvalDisabled;                                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTrack")
	}
	static class UMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTrack;

// Class MovieScene.MovieSceneNameableTrack
// 0x0000 (0x0058 - 0x0058)
class UMovieSceneNameableTrack : public UMovieSceneTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNameableTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNameableTrack")
	}
	static class UMovieSceneNameableTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNameableTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNameableTrack;

// Class MovieScene.MovieSceneSubTrack
// 0x0028 (0x0080 - 0x0058)
class UMovieSceneSubTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0058(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bActiveInEditorOnly;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CustomGroupName;                                   // 0x0070(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSubTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSubTrack")
	}
	static class UMovieSceneSubTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSubTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSubTrack;

// Class MovieScene.MovieSceneSequence
// 0x0370 (0x03C0 - 0x0050)
class UMovieSceneSequence : public UMovieSceneSignedObject
{
public:
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneEvaluationTemplate          PrecompiledEvaluationTemplate;                     // 0x0070(0x02F0)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	EMovieSceneCompletionMode                     DefaultCompletionMode;                             // 0x0360(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParentContextsAreSignificant;                     // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPlayableDirectly;                                 // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_363[0x5D];                                     // 0x0363(0x005D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FGuid CreatePossessable(class UObject* ObjectToPossess); // (Native, Public, HasDefaults) // @ 0x14C5A6670
	struct FGuid CreateSpawnable(class UObject* ObjectToSpawn); // (Native, Public, HasDefaults) // @ 0x14C5A6710
	void UnbindInvalidObjects(const struct FGuid& ObjectId, class UObject* Context); // (Native, Public, HasOutParams, HasDefaults) // @ 0x14C5A6F70
	void UnbindObjects(const struct FGuid& ObjectId, const TArray<class UObject*>& InObjects, class UObject* Context); // (Native, Public, HasOutParams, HasDefaults) // @ 0x14C5A7060
	void UnbindPossessableObjects(const struct FGuid& ObjectId); // (Native, Public, HasOutParams, HasDefaults) // @ 0x14C5A71D0

	bool AllowsSpawnableObjects() const; // (Native, Public, Const) // @ 0x140EE16A0
	bool CanRebindPossessable(const struct FMovieScenePossessable& InPossessable) const; // (Native, Public, HasOutParams, Const) // @ 0x14C5A6530
	struct FMovieSceneObjectBindingID FindBindingByTag(class FName InBindingName) const; // (Final, RequiredAPI, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A67B0
	const TArray<struct FMovieSceneObjectBindingID> FindBindingsByTag(class FName InBindingName) const; // (Final, RequiredAPI, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A6860
	class UMovieScene* GetMovieScene() const; // (Native, Public, Const) // @ 0x149C72600
	class UObject* GetParentObject(class UObject* Object) const; // (Native, Public, Const) // @ 0x14C5A69D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSequence")
	}
	static class UMovieSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequence>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSequence;

// Class MovieScene.MovieSceneSubSection
// 0x0070 (0x0160 - 0x00F0)
class UMovieSceneSubSection : public UMovieSceneSection
{
public:
	struct FMovieSceneSectionParameters           Parameters;                                        // 0x00F0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StartOffset;                                       // 0x0108(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         TimeScale;                                         // 0x010C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PrerollTime_MovieSceneSubSection;                  // 0x0110(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneSequence*                    SubSequence;                                       // 0x0118(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TLazyObjectPtr<class AActor>                  ActorToRecord;                                     // 0x0120(0x001C)(Edit, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetSequenceName;                                // 0x0140(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDirectoryPath                         TargetPathToRecordTo;                              // 0x0150(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void SetSequence(class UMovieSceneSequence* Sequence); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AAF30

	class UMovieSceneSequence* GetSequence() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5AA090

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSubSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSubSection")
	}
	static class UMovieSceneSubSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSubSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSubSection;

// Class MovieScene.MovieSceneSequencePlayer
// 0x0A10 (0x0A38 - 0x0028)
class UMovieSceneSequencePlayer : public UObject
{
public:
	uint8                                         Pad_28[0x4B8];                                     // 0x0028(0x04B8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPlay;                                            // 0x04E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPlayReverse;                                     // 0x04F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnStop;                                            // 0x0500(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPause;                                           // 0x0510(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0520(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EMovieScenePlayerStatus                       Status;                                            // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bReversePlayback : 1;                              // 0x0534(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieSceneSequence*                    Sequence;                                          // 0x0538(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFrameNumber                           StartTime;                                         // 0x0540(0x0004)(Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DurationFrames;                                    // 0x0544(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrentNumLoops;                                   // 0x0548(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54C[0x14];                                     // 0x054C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    PlaybackSettings;                                  // 0x0560(0x0014)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance;                           // 0x0578(0x03F8)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_970[0x68];                                     // 0x0970(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequenceReplProperties      NetSyncProps;                                      // 0x09D8(0x0010)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TScriptInterface<class IMovieScenePlaybackClient> PlaybackClient;                                // 0x09E8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_9F8[0x40];                                     // 0x09F8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangePlaybackDirection(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A9850
	void GetAllBoundObjects(TArray<class UObject*>* OutObjects); // (Final, Native, Public, HasOutParams) // @ 0x14C5A9940
	TArray<class UObject*> GetBoundObjects(const struct FMovieSceneObjectBindingID& ObjectBinding); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A9A10
	bool GetDisableCameraCuts(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A9BB0
	class UMovieScene* GetMovieScene(); // (Native, Public) // @ 0x14C5A9D30
	TArray<struct FMovieSceneObjectBindingID> GetObjectBindings(class UObject* InObject); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5A9D70
	void GoToEndAndStop(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA110
	void Initialize(class UMovieSceneSequence* InSequence, const struct FMovieSceneSequencePlaybackSettings& InSettings); // (Final, Native, Public, HasOutParams) // @ 0x14C5AA130
	void JumpToFrame(const struct FFrameTime& NewPosition); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA2B0
	bool JumpToMarkedFrame(const class FString& InLabel); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA330
	void JumpToPosition(float NewPlaybackPosition); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA400
	void JumpToSeconds(float TimeInSeconds); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA480
	void Pause(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA500
	void Play(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA520
	void PlayInternal(); // (Final, Native, Protected) // @ 0x14C5AA540
	void PlayLooping(int32 NumLoops); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA560
	void PlayReverse(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA5E0
	void PlayToFrame(const struct FFrameTime& NewPosition); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA600
	bool PlayToMarkedFrame(const class FString& InLabel); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA680
	void PlayToSeconds(float TimeInSeconds); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA750
	void RPC_ExplicitServerUpdateEvent(EUpdatePositionMethod Method, const struct FFrameTime& RelevantTime); // (Final, Net, NetReliable, Native, Event, NetMulticast, Private) // @ 0x14C5AA7D0
	void RPC_OnStopEvent(const struct FFrameTime& StoppedTime); // (Final, Net, NetReliable, Native, Event, NetMulticast, Private) // @ 0x14101B420
	void Scrub(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA8A0
	void ScrubToFrame(const struct FFrameTime& NewPosition); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA8C0
	bool ScrubToMarkedFrame(const class FString& InLabel); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA940
	void ScrubToSeconds(float TimeInSeconds); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AA400
	void SetDisableCameraCuts(bool bInDisableCameraCuts); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AAA10
	void SetFrameRange(int32 StartFrame, int32 Duration); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AAAA0
	void SetFrameRate(const struct FFrameRate& FrameRate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AAB60
	void SetPlaybackClient(TScriptInterface<class IMovieScenePlaybackClient> InPlaybackClient); // (Final, Native, Public) // @ 0x14C5AAD00
	void SetPlaybackPosition(float NewPlaybackPosition); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AADA0
	void SetPlaybackRange(const float NewStartTime, const float NewEndTime); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AAE70
	void SetPlayPosition(uint32 InFrameTime); // (Native, Public) // @ 0x14C5AABF0
	void SetPlayRate(float PlayRate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AAC80
	void SetTimeRange(float StartTime_0, float Duration); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AAFB0
	void Stop(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AB100
	void StopAtCurrentTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C5AB120
	void StopInternal(const struct FFrameTime& TimeToResetTo); // (Final, Native, Protected) // @ 0x14C5AB140
	void Update(const float DeltaSeconds); // (Final, Native, Public) // @ 0x14C5AB1C0
	void UpdateMovieSceneInstanceOuter(); // (Native, Public) // @ 0x140D2F400
	void UpdateTimeCursorPosition(const struct FFrameTime& NewPosition, EUpdatePositionMethod Method); // (Final, Native, Protected) // @ 0x14C5AB240

	int32 FindMarkedFrameByLabel(const class FString& InLabel) const; // (Final, Native, Protected, Const) // @ 0x14C5A9870
	struct FQualifiedFrameTime GetCurrentTime() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9B70
	struct FQualifiedFrameTime GetDuration() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9BE0
	struct FQualifiedFrameTime GetEndTime() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9C20
	int32 GetFrameDuration() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9C70
	struct FFrameRate GetFrameRate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9CA0
	struct FFrameTime GetLastValidTime() const; // (Final, Native, Protected, Const) // @ 0x14C5A9CC0
	float GetLength() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9D00
	float GetPlaybackEnd() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9ED0
	float GetPlaybackPosition() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9F30
	float GetPlaybackStart() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9FF0
	class UWorld* GetPlaybackWorld() const; // (Final, Native, Protected, Const) // @ 0x14C5AA040
	float GetPlayRate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5A9EA0
	class UMovieSceneSequence* GetSequence() const; // (Final, Native, Public, Const) // @ 0x14C5AA070
	struct FQualifiedFrameTime GetStartTime() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5AA0C0
	bool IsPaused() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5AA220
	bool IsPlaying() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5AA250
	bool IsReversed() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C5AA280
	bool ShouldStopOrLoop(const struct FFrameTime& NewPosition) const; // (Final, Native, Protected, Const) // @ 0x14C5AB070

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneSequencePlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneSequencePlayer")
	}
	static class UMovieSceneSequencePlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequencePlayer>();
	}
};
DUMPER7_ASSERTS_UMovieSceneSequencePlayer;

// Class MovieScene.MovieScenePlaybackClient
// 0x0000 (0x0000 - 0x0000)
class IMovieScenePlaybackClient final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScenePlaybackClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScenePlaybackClient")
	}
	static class IMovieScenePlaybackClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieScenePlaybackClient>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieScenePlaybackClient;

// Class MovieScene.MovieScene
// 0x00E8 (0x0138 - 0x0050)
class UMovieScene final : public UMovieSceneSignedObject
{
public:
	TArray<struct FMovieSceneSpawnable>           Spawnables;                                        // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieScenePossessable>         Possessables;                                      // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMovieSceneBinding>             ObjectBindings;                                    // 0x0070(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FMovieSceneObjectBindingIDs> BindingGroups;                             // 0x0080(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               MasterTracks;                                      // 0x00D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UMovieSceneSubTrack*                    RuntimeSubTrack;                                   // 0x00E0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieSceneTrack*                       CameraCutTrack;                                    // 0x00E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  SelectionRange;                                    // 0x00F0(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FMovieSceneFrameRange                  PlaybackRange;                                     // 0x0100(0x0010)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FFrameRate                             TickResolution;                                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFrameRate                             DisplayRate;                                       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMovieSceneEvaluationType                     EvaluationType;                                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EUpdateClockSource                            ClockSource;                                       // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMovieSceneMarkedFrame>         MarkedFrames;                                      // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieScene")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieScene")
	}
	static class UMovieScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScene>();
	}
};
DUMPER7_ASSERTS_UMovieScene;

// Class MovieScene.MovieSceneBindingOverrides
// 0x0068 (0x0090 - 0x0028)
class UMovieSceneBindingOverrides final : public UObject
{
public:
	TArray<struct FMovieSceneBindingOverrideData> BindingData;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x58];                                      // 0x0038(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBindingOverrides")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBindingOverrides")
	}
	static class UMovieSceneBindingOverrides* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingOverrides>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBindingOverrides;

// Class MovieScene.MovieSceneBindingOwnerInterface
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneBindingOwnerInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBindingOwnerInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBindingOwnerInterface")
	}
	static class IMovieSceneBindingOwnerInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneBindingOwnerInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneBindingOwnerInterface;

// Class MovieScene.MovieSceneBuiltInEasingFunction
// 0x0010 (0x0038 - 0x0028)
class UMovieSceneBuiltInEasingFunction final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EMovieSceneBuiltInEasing                      Type;                                              // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneBuiltInEasingFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneBuiltInEasingFunction")
	}
	static class UMovieSceneBuiltInEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBuiltInEasingFunction>();
	}
};
DUMPER7_ASSERTS_UMovieSceneBuiltInEasingFunction;

// Class MovieScene.MovieSceneEasingExternalCurve
// 0x0010 (0x0038 - 0x0028)
class UMovieSceneEasingExternalCurve final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEasingExternalCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEasingExternalCurve")
	}
	static class UMovieSceneEasingExternalCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEasingExternalCurve>();
	}
};
DUMPER7_ASSERTS_UMovieSceneEasingExternalCurve;

// Class MovieScene.MovieSceneEasingFunction
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneEasingFunction final
{
public:
	float OnEvaluate(float Interp) const; // (Event, Protected, BlueprintCallable, BlueprintEvent, BlueprintPure, Const) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneEasingFunction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneEasingFunction")
	}
	static class IMovieSceneEasingFunction* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneEasingFunction>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneEasingFunction;

// Class MovieScene.MovieSceneFolder
// 0x0048 (0x0070 - 0x0028)
class UMovieSceneFolder final : public UObject
{
public:
	class FName                                   FolderName;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneFolder*>              ChildFolders;                                      // 0x0030(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UMovieSceneTrack*>               ChildMasterTracks;                                 // 0x0040(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class FString>                         ChildObjectBindingStrings;                         // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneFolder")
	}
	static class UMovieSceneFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFolder>();
	}
};
DUMPER7_ASSERTS_UMovieSceneFolder;

// Class MovieScene.MovieSceneKeyProxy
// 0x0000 (0x0000 - 0x0000)
class IMovieSceneKeyProxy final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneKeyProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneKeyProxy")
	}
	static class IMovieSceneKeyProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieSceneKeyProxy>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMovieSceneKeyProxy;

// Class MovieScene.TestMovieSceneTrack
// 0x0018 (0x0070 - 0x0058)
class UTestMovieSceneTrack final : public UMovieSceneTrack
{
public:
	bool                                          bHighPassFilter;                                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             SectionArray;                                      // 0x0060(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneTrack")
	}
	static class UTestMovieSceneTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneTrack>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneTrack;

// Class MovieScene.TestMovieSceneSection
// 0x0000 (0x00F0 - 0x00F0)
class UTestMovieSceneSection final : public UMovieSceneSection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneSection")
	}
	static class UTestMovieSceneSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneSection>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneSection;

// Class MovieScene.TestMovieSceneSequence
// 0x0008 (0x03C8 - 0x03C0)
class UTestMovieSceneSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestMovieSceneSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestMovieSceneSequence")
	}
	static class UTestMovieSceneSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestMovieSceneSequence>();
	}
};
DUMPER7_ASSERTS_UTestMovieSceneSequence;

}

