#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenWorldWaterDataStreaming

#include "Basic.hpp"

#include "OpenWorldWaterDataStreaming_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OpenWorldStreaming_classes.hpp"


namespace SDK
{

// Class OpenWorldWaterDataStreaming.OpenWorldWaterInteractiveWaterComponent
// 0x00B0 (0x0300 - 0x0250)
class UOpenWorldWaterInteractiveWaterComponent : public USceneComponent
{
public:
	float                                         Duration;                                          // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        InteractiveProducer;                               // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveThreshold;                                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableInteractiveStrengthDepthDecay;              // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractiveBaseStrength;                           // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractiveDepthDecayRate;                         // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractiveStrength;                               // 0x0270(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSampleWaterData;                            // 0x0274(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SampleInterval;                                    // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWaterSurfaceRangeCheck;                     // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractiveBelowWaterHeightOffset;                 // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InteractiveAboveWaterHeightOffset;                 // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosestPointValid;                              // 0x0288(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ClosestPointOfWater;                               // 0x028C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsWaterDataValid;                                 // 0x0294(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenWorldSampledWaterData             WaterData;                                         // 0x0298(0x0024)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, DuplicateTransient, NonTransactional, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnComponentUpdate;                                 // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnParticleUpdate;                                  // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*               ParticleComponent;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PrevWorldLocation;                                 // 0x02E8(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0xC];                                      // 0x02F4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterInteractiveWaterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterInteractiveWaterComponent")
	}
	static class UOpenWorldWaterInteractiveWaterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldWaterInteractiveWaterComponent>();
	}
};
DUMPER7_ASSERTS_UOpenWorldWaterInteractiveWaterComponent;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterBody
// 0x00E8 (0x0458 - 0x0370)
class AOpenWorldWaterBody final : public AActor
{
public:
	class UMaterialInterface*                     WaterMaterial;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               WaterMID;                                          // 0x0378(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, TextExportTransient, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutWaterScreenEffectName;                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UnderWaterScreenEffectName;                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UnderWaterBubblesName;                             // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UnderWaterFallingBubblesName;                      // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOpenWorldWaterVolumeSettings          Settings;                                          // 0x03A0(0x00A4)(Edit, BlueprintVisible, Interp, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TLazyObjectPtr<class AOpenWorldWaterBodyExclusionVolume>> ExclusionVolumes;               // 0x0448(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	TArray<class AOpenWorldWaterBodyExclusionVolume*> GetExclusionVolumes() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14160ECB0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterBody")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterBody")
	}
	static class AOpenWorldWaterBody* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldWaterBody>();
	}
};
DUMPER7_ASSERTS_AOpenWorldWaterBody;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterBodyGenerator
// 0x0000 (0x0028 - 0x0028)
class UOpenWorldWaterBodyGenerator final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterBodyGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterBodyGenerator")
	}
	static class UOpenWorldWaterBodyGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldWaterBodyGenerator>();
	}
};
DUMPER7_ASSERTS_UOpenWorldWaterBodyGenerator;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterBodyExclusionVolume
// 0x0000 (0x03B8 - 0x03B8)
class AOpenWorldWaterBodyExclusionVolume final : public APhysicsVolume
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterBodyExclusionVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterBodyExclusionVolume")
	}
	static class AOpenWorldWaterBodyExclusionVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldWaterBodyExclusionVolume>();
	}
};
DUMPER7_ASSERTS_AOpenWorldWaterBodyExclusionVolume;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterDataAsset
// 0x00A8 (0x00D0 - 0x0028)
class UOpenWorldWaterDataAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         MinX;                                              // 0x0058(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         MaxX;                                              // 0x005A(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         Spacing;                                           // 0x005C(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0060(0x0030)(Edit, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0090(0x001C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x24];                                      // 0x00AC(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterDataAsset")
	}
	static class UOpenWorldWaterDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldWaterDataAsset>();
	}
};
DUMPER7_ASSERTS_UOpenWorldWaterDataAsset;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterDataComponent
// 0x0010 (0x05A0 - 0x0590)
class UOpenWorldWaterDataComponent final : public UPrimitiveComponent
{
public:
	class UOpenWorldWaterDataAsset*               WaterDataAsset;                                    // 0x0588(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_590[0x10];                                     // 0x0590(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterDataComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterDataComponent")
	}
	static class UOpenWorldWaterDataComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldWaterDataComponent>();
	}
};
DUMPER7_ASSERTS_UOpenWorldWaterDataComponent;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterDataNewAsset
// 0x0058 (0x0080 - 0x0028)
class UOpenWorldWaterDataNewAsset final : public UObject
{
public:
	int16                                         NumOfX;                                            // 0x0028(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         NumOfY;                                            // 0x002A(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              AssetSize;                                         // 0x002C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Origin;                                            // 0x0034(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         X;                                                 // 0x003C(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         Y;                                                 // 0x003E(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SectionOrigin;                                     // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Spacing;                                           // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWaterPointNew>                 WaterPoints;                                       // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       WaterBounds;                                       // 0x0060(0x001C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WaterHeightBase;                                   // 0x007C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterDataNewAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterDataNewAsset")
	}
	static class UOpenWorldWaterDataNewAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldWaterDataNewAsset>();
	}
};
DUMPER7_ASSERTS_UOpenWorldWaterDataNewAsset;

// Class OpenWorldWaterDataStreaming.WaterDataAssetsStreamer
// 0x0150 (0x0790 - 0x0640)
class AWaterDataAssetsStreamer final : public AAssetsStreamer
{
public:
	class UWorld*                                 OwnerWorld;                                        // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_648[0x30];                                     // 0x0648(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class UOpenWorldWaterDataAsset*> AssetDataMap;                               // 0x0678(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FWaterDataNewAssetIndexTable           WaterDataNewAssetIndexTable;                       // 0x06C8(0x0030)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_6F8[0x88];                                     // 0x06F8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Spacing;                                           // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_784[0xC];                                      // 0x0784(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterDataAssetsStreamer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterDataAssetsStreamer")
	}
	static class AWaterDataAssetsStreamer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterDataAssetsStreamer>();
	}
};
DUMPER7_ASSERTS_AWaterDataAssetsStreamer;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterInteractiveWaterManager
// 0x01B8 (0x0528 - 0x0370)
class AOpenWorldWaterInteractiveWaterManager final : public AActor
{
public:
	TMap<class FName, class UParticleSystem*>     ParticleSystemCacheMap;                            // 0x0370(0x0050)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 InteractiveRenderTarget;                           // 0x03C0(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 SimulationCurrentRenderTarget;                     // 0x03C8(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 SimulationPreviousRenderTarget;                    // 0x03D0(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 SimulationPrePreviousRenderTarget;                 // 0x03D8(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 NormalRenderTarget;                                // 0x03E0(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UOpenWorldWaterInteractiveWaterComponent*> InteractiveWaterComponents;              // 0x03F0(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UOpenWorldWaterInteractiveWaterComponent*> ActiveInteractiveComponents;             // 0x0400(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UOpenWorldWaterInteractiveWaterComponent*> MarkForFreeInteractiveComponents;        // 0x0410(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UParticleSystemComponent*>       WaterParticleSystemComponents;                     // 0x0420(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UParticleSystemComponent*>       UnusedParticleComponents;                          // 0x0430(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UParticleSystemComponent*>       ActiveParticleComponents;                          // 0x0440(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UParticleSystemComponent*>       DrawedParticleComponents;                          // 0x0450(0x0010)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class UParticleSystemComponent*, class UOpenWorldWaterInteractiveWaterComponent*> ParticleIndexToInteractiveComponentMap; // 0x0460(0x0050)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, DuplicateTransient, NonTransactional, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4B0[0x11];                                     // 0x04B0(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInteractiveWaterEnabled;                        // 0x04C1(0x0001)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C2[0x2];                                      // 0x04C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PrevMainPlayerLocation;                            // 0x04C4(0x000C)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D0[0x4];                                      // 0x04D0(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsClosestPointValid;                              // 0x04D4(0x0001)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ClosestPointOfWaterFromMainPlayer;                 // 0x04D8(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsWaterDataValid;                                 // 0x04E0(0x0001)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenWorldSampledWaterData             MainViewerWaterData;                               // 0x04E4(0x0024)(Edit, Transient, EditConst, DuplicateTransient, NonTransactional, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_508[0x4];                                      // 0x0508(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExitingInteractiveWaterUpdateTimer;                // 0x050C(0x0004)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_510[0x10];                                     // 0x0510(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UOpenWorldWaterSubsystem> WaterSubsystem;                                   // 0x0520(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	int32 GetCaptureRangeBaseWidth(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160E800
	float GetCaptureRangeFactor(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160E860
	int32 GetCaptureRangeWidth(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160E8C0
	class UTextureRenderTarget2D* GetInteractiveRenderTarget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F100
	int32 GetInteractiveRenderTargetWidth(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F160
	int32 GetNormalRenderTargetWidth(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F630
	class UTextureRenderTarget2D* GetSimulationCurrentRenderTarget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F690
	float GetSimulationDampening(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F6F0
	class UTextureRenderTarget2D* GetSimulationPrePreviousRenderTarget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F750
	class UTextureRenderTarget2D* GetSimulationPreviousRenderTarget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F7B0
	int32 GetSimulationRenderTargetWidth(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F810
	float GetSimulationTravelSpeed(); // (Final, Native, Public, BlueprintCallable) // @ 0x14160F870

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterInteractiveWaterManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterInteractiveWaterManager")
	}
	static class AOpenWorldWaterInteractiveWaterManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldWaterInteractiveWaterManager>();
	}
};
DUMPER7_ASSERTS_AOpenWorldWaterInteractiveWaterManager;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterSubsystem
// 0x01F8 (0x0228 - 0x0030)
class UOpenWorldWaterSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              WaterInteractiveRenderTargetChangedEvent;          // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              WaterInteractiveEnableChangedEvent;                // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AWaterDataAssetsStreamer*               WaterDataAssetsStreamer;                           // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AOpenWorldWaterWaveGenerator*           WaterWaveGenerator;                                // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x40];                                      // 0x0080(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class AOpenWorldWaterInteractiveWaterManager* InteractiveWaterManager;                           // 0x00C0(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UOpenWorldWaterInteractiveWaterComponent*> InteractiveWaterComponents;              // 0x00C8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x28];                                      // 0x00D8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsClosestPointValid;                              // 0x0100(0x0001)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ClosestPointOfWaterFromMainView;                   // 0x0104(0x000C)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x68];                                     // 0x0110(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsMainViewCloseToWater;                           // 0x0178(0x0001)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenWorldWaterVolumeSettings          MainViewWaterVolumeSettings;                       // 0x017C(0x00A4)(Edit, Transient, EditConst, DuplicateTransient, NonTransactional, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bIsFogValid;                                       // 0x0220(0x0001)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsWaveValid;                                      // 0x0221(0x0001)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOpenWorldWaterInteractiveWaterComponent* AllocateInteractiveWaterComponent(class UObject* ContextObject, class AActor* InActor); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14160E270
	static bool FindClosestPointOfWater(class UObject* ContextObject, const struct FVector& WorldLocation, struct FVector* ClosestPoint); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14160E3B0
	static void FreeInteractiveWaterComponent(class UObject* ContextObject, class UOpenWorldWaterInteractiveWaterComponent* InInteractiveWaterComponent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14160E6C0
	static bool GetClosestDistanceToWater(class UObject* ContextObject, const struct FVector& WorldLocation, float* ClosestDistance); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14160E920
	static class UOpenWorldWaterSubsystem* GetCurrentWaterSubsystem(const class UWorld* World); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14160EBE0
	static bool GetInteractiveRTWidth(class UObject* ContextObject, int32* InteractiveRTWidth, int32* SimulationRTWidth, int32* NormalRTWidth); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14160ED30
	static bool GetInteractiveSimulationParam(class UObject* ContextObject, float* SimulationTravelSpeed, float* SimulationDampening); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x14160F1C0
	static bool GetInteractiveWaterEnabled(class UObject* ContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14160F490
	static class AOpenWorldWaterInteractiveWaterManager* GetInteractiveWaterManager(class UObject* ContextObject); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14160F560
	static bool SampleWaterData(class UObject* ContextObject, const struct FVector& WorldLocation, struct FOpenWorldSampledWaterData* SampledData, const struct FOpenWorldSampledWaterParameter& Parameter); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14160F8D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterSubsystem")
	}
	static class UOpenWorldWaterSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldWaterSubsystem>();
	}
};
DUMPER7_ASSERTS_UOpenWorldWaterSubsystem;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterVolume
// 0x0110 (0x04C8 - 0x03B8)
class AOpenWorldWaterVolume final : public APhysicsVolume
{
public:
	class FName                                   WaterMeshTag;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AStaticMeshActor*>               WaterMeshActors;                                   // 0x03C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FOpenWorldWaterVolumeSettings          Settings;                                          // 0x03D0(0x00A4)(Edit, BlueprintVisible, Interp, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableDynamicWater;                               // 0x0474(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_475[0x3];                                      // 0x0475(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DynamicWaterHeightOffsetRange;                     // 0x0478(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicWaterHeightOffset;                          // 0x0480(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OldDynamicWaterHeightOffset;                       // 0x0484(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumePriority;                                    // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendRadius;                                       // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendWeight;                                       // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnabled : 1;                                      // 0x0494(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUnbound : 1;                                      // 0x0494(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OutWaterScreenEffectName;                          // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UnderWaterScreenEffectName;                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UnderWaterBubblesName;                             // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   UnderWaterFallingBubblesName;                      // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOpenWorldWaterSubsystem*               WaterSubsystem;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C0[0x8];                                      // 0x04C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDynamicWaterHeight(float NewHeight); // (Final, Native, Public, BlueprintCallable) // @ 0x14160FC90
	void SetDynamicWaterHeightOffset(float NewDynamicWaterHeightOffset); // (Final, Native, Public, BlueprintCallable) // @ 0x14160FD70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterVolume")
	}
	static class AOpenWorldWaterVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldWaterVolume>();
	}
};
DUMPER7_ASSERTS_AOpenWorldWaterVolume;

// Class OpenWorldWaterDataStreaming.OpenWorldWaterWaveGenerator
// 0x0180 (0x04F0 - 0x0370)
class AOpenWorldWaterWaveGenerator final : public AActor
{
public:
	uint8                                         Pad_370[0x30];                                     // 0x0370(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialParameterCollection*           MaterialParameterCollection;                       // 0x03A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsGeneratingWaterData;                            // 0x03A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GerstnerAmplitudeMin;                              // 0x03AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerAmplitudeMax;                              // 0x03B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerLengthMin;                                 // 0x03B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerLengthMax;                                 // 0x03B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerSteepnessMin;                              // 0x03BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerSteepnessMax;                              // 0x03C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerDistribution;                              // 0x03C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         GerstnerWaves;                                     // 0x03C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         GerstnerSeed;                                      // 0x03CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerWindYaw;                                   // 0x03D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerTileSoftness;                              // 0x03D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerSpread;                                    // 0x03D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerBigWaveSpeed;                              // 0x03DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         GerstnerMediumWaveSpeed;                           // 0x03E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           WaterLineColor;                                    // 0x03E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WaterHeightOffset;                                 // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                    BillboardComp;                                     // 0x03F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UArrowComponent*                        ArrowComp;                                         // 0x0400(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextRenderComponent*                   TextRenderComp;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Wind;                                              // 0x0410(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FWaterWaveData                         PrevWaterVolumeWaveData;                           // 0x041C(0x0064)(NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_480[0x68];                                     // 0x0480(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UOpenWorldWaterSubsystem*               WaterSubsystem;                                    // 0x04E8(0x0008)(Edit, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ForBlueprintDebugging(); // (Final, Native, Protected, BlueprintCallable) // @ 0x14160E660

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldWaterWaveGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldWaterWaveGenerator")
	}
	static class AOpenWorldWaterWaveGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldWaterWaveGenerator>();
	}
};
DUMPER7_ASSERTS_AOpenWorldWaterWaveGenerator;

}

