#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenWorldPhysicsStreaming

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OpenWorldPhysicsStreaming_structs.hpp"


namespace SDK
{

// Class OpenWorldPhysicsStreaming.PhysXSerialComponent
// 0x00F0 (0x06F0 - 0x0600)
class UPhysXSerialComponent final : public UPhysicsAsyncComponent
{
public:
	TArray<struct FPhysXSerialActor>              SerialActors;                                      // 0x05F8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FPhysXSerialBodyInstance>       SerialBodyInstances;                               // 0x0608(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FDateTime                              Timestamp;                                         // 0x0618(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bDestructible : 1;                                 // 0x0620(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_621[0xCF];                                     // 0x0621(0x00CF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXSerialComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXSerialComponent")
	}
	static class UPhysXSerialComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysXSerialComponent>();
	}
};
DUMPER7_ASSERTS_UPhysXSerialComponent;

// Class OpenWorldPhysicsStreaming.PhysXDrawingSettings
// 0x0180 (0x01B8 - 0x0038)
class UPhysXDrawingSettings final : public UDeveloperSettings
{
public:
	bool                                          bFreeze;                                           // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMessage;                                          // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMainCharacter;                                    // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSolidTrigger;                                     // 0x003B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoubleSided;                                      // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Opacity;                                           // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         offset;                                            // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullingScreenSize;                                 // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarClippingDistance;                               // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTranslucentExtent;                              // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTriggerExtent;                                  // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaticInterval;                                    // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SceneMessageInterval;                              // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SelectionInterval;                                 // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MessageSize;                                       // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MarginX;                                           // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MarginY;                                           // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Mode;                                              // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PhysicsAsyncMode;                                  // 0x0074(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Color;                                             // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ElementLimit;                                      // 0x007C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Inclusion;                                         // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Exclusion;                                         // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TracingChannel;                                    // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HiddenChannel;                                     // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Selection;                                         // 0x0090(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectionColor;                                    // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectionSize;                                     // 0x0098(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResolve;                                          // 0x009C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResolveOpacity;                                    // 0x00A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResolveSize;                                       // 0x00A4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Net;                                               // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetDistance;                                       // 0x00AC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetPackets;                                        // 0x00B0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetColor;                                          // 0x00B4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetMode;                                           // 0x00B8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetOpacity;                                        // 0x00BC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetOffset;                                         // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOffline;                                          // 0x00C4(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         IgnoreComponentWildcards;                          // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         EnableDrawingCommands;                             // 0x00D8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         DisableDrawingCommands;                            // 0x00E8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         ShowOthersCommands;                                // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         HideOthersCommands;                                // 0x0108(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         EnableDiffCommands;                                // 0x0118(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         DisableDiffCommands;                               // 0x0128(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               OpaqueMaterialPath;                                // 0x0138(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               TranslucentMaterialPath;                           // 0x0160(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterial>               UnlitMaterialPath;                                 // 0x0188(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DecorationCollisionProfleName;                     // 0x01B0(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXDrawingSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXDrawingSettings")
	}
	static class UPhysXDrawingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysXDrawingSettings>();
	}
};
DUMPER7_ASSERTS_UPhysXDrawingSettings;

// Class OpenWorldPhysicsStreaming.PhysXDrawingComponent
// 0x0050 (0x05E0 - 0x0590)
class UPhysXDrawingComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_588[0x58];                                     // 0x0588(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXDrawingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXDrawingComponent")
	}
	static class UPhysXDrawingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysXDrawingComponent>();
	}
};
DUMPER7_ASSERTS_UPhysXDrawingComponent;

// Class OpenWorldPhysicsStreaming.PhysXDrawingBase
// 0x0228 (0x0598 - 0x0370)
class APhysXDrawingBase : public AActor
{
public:
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysXDrawingComponent*                 StaticDrawingComponent;                            // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysXDrawingComponent*                 DynamicDrawingComponent;                           // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_388[0x210];                                    // 0x0388(0x0210)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXDrawingBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXDrawingBase")
	}
	static class APhysXDrawingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhysXDrawingBase>();
	}
};
DUMPER7_ASSERTS_APhysXDrawingBase;

// Class OpenWorldPhysicsStreaming.PhysXDrawingNet
// 0x0170 (0x0708 - 0x0598)
class APhysXDrawingNet : public APhysXDrawingBase
{
public:
	class UPhysXDrawingComponent*                 NetDrawingComponent;                               // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A0[0x168];                                    // 0x05A0(0x0168)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientReceivePacket(const TArray<uint8>& PacketData, int32 NumPackets); // (Net, NetReliable, Native, Event, Protected, NetClient) // @ 0x14158BD70
	void ServerCreatePackets(const struct FVector& Position, float Distance); // (Net, NetReliable, Native, Event, Protected, NetServer, HasDefaults) // @ 0x14158BE80
	void ServerDestroy(); // (Net, NetReliable, Native, Event, Public, NetServer) // @ 0x140FFF7F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXDrawingNet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXDrawingNet")
	}
	static class APhysXDrawingNet* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhysXDrawingNet>();
	}
};
DUMPER7_ASSERTS_APhysXDrawingNet;

// Class OpenWorldPhysicsStreaming.PhysXDrawing
// 0x0000 (0x0708 - 0x0708)
class APhysXDrawing final : public APhysXDrawingNet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXDrawing")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXDrawing")
	}
	static class APhysXDrawing* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhysXDrawing>();
	}
};
DUMPER7_ASSERTS_APhysXDrawing;

// Class OpenWorldPhysicsStreaming.PhysXSerialBlendMask
// 0x0040 (0x0068 - 0x0028)
class UPhysXSerialBlendMask final : public UObject
{
public:
	uint8                                         UVChannel;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressX;                                          // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              TextureSize;                                       // 0x002C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 TextureData;                                       // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   SourceInfo;                                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Timestamp;                                         // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPhysicalMaterial*>              Materials;                                         // 0x0058(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXSerialBlendMask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXSerialBlendMask")
	}
	static class UPhysXSerialBlendMask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysXSerialBlendMask>();
	}
};
DUMPER7_ASSERTS_UPhysXSerialBlendMask;

// Class OpenWorldPhysicsStreaming.PhysXSerialBodySetup
// 0x0110 (0x0138 - 0x0028)
class UPhysXSerialBodySetup final : public UObject
{
public:
	class FName                                   SourceInfo;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Timestamp;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKAggregateGeom                        AggGeom;                                           // 0x0038(0x0058)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FIntPoint>                      ConvexMeshToMirrored;                              // 0x0090(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FIntPoint>                      GeomToShape;                                       // 0x00A0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<uint8>                                 FilterDataBytes;                                   // 0x00B0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class UPhysicalMaterial*>              Materials;                                         // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class UPhysXSerialBlendMask*>          BlendMasks;                                        // 0x00D0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<uint8>                                 FaceMaterialIndices;                               // 0x00E0(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         bIsHeightField : 1;                                // 0x00F0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F1[0x47];                                      // 0x00F1(0x0047)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXSerialBodySetup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXSerialBodySetup")
	}
	static class UPhysXSerialBodySetup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysXSerialBodySetup>();
	}
};
DUMPER7_ASSERTS_UPhysXSerialBodySetup;

// Class OpenWorldPhysicsStreaming.PhysXSceneProxyActor
// 0x0000 (0x0370 - 0x0370)
class APhysXSceneProxyActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXSceneProxyActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXSceneProxyActor")
	}
	static class APhysXSceneProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhysXSceneProxyActor>();
	}
};
DUMPER7_ASSERTS_APhysXSceneProxyActor;

// Class OpenWorldPhysicsStreaming.PhysXProxyScheduler
// 0x0040 (0x0070 - 0x0030)
class UPhysXProxyScheduler final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXProxyScheduler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXProxyScheduler")
	}
	static class UPhysXProxyScheduler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysXProxyScheduler>();
	}
};
DUMPER7_ASSERTS_UPhysXProxyScheduler;

// Class OpenWorldPhysicsStreaming.PhysXProxySettings
// 0x0010 (0x0048 - 0x0038)
class UPhysXProxySettings final : public UDeveloperSettings
{
public:
	bool                                          bDisableBlendMask;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableScheduler;                                 // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPruningStructure;                                 // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SchedulerStep;                                     // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SchedulerTimeLimit;                                // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SchedulerInterval;                                 // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PhysXProxySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PhysXProxySettings")
	}
	static class UPhysXProxySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysXProxySettings>();
	}
};
DUMPER7_ASSERTS_UPhysXProxySettings;

}

