#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenWorldStreaming

#include "Basic.hpp"

#include "OpenWorldPhysicsStreaming_structs.hpp"
#include "OpenWorldStreaming_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "OpenWorldRuntime_classes.hpp"


namespace SDK
{

// Class OpenWorldStreaming.OpenWorldFilterSettings
// 0x0068 (0x00F0 - 0x0088)
class UOpenWorldFilterSettings : public UOpenWorldSettings
{
public:
	bool                                          bEnableMapping;                                    // 0x0088(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableDefaultFilter;                             // 0x0089(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DisabledParentFilterMaps;                          // 0x0090(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	TArray<struct FWorldTileFilter>               EditorTileFilters;                                 // 0x00A0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	TArray<struct FWorldTileFilter>               RuntimeTileFilters;                                // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	TArray<struct FWorldTileFilter>               DynamicTileFilters;                                // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExclusionWildcards;                                // 0x00D0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         LayersDistanceAdjustedScale;                       // 0x00E0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldFilterSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldFilterSettings")
	}
	static class UOpenWorldFilterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldFilterSettings>();
	}
};
DUMPER7_ASSERTS_UOpenWorldFilterSettings;

// Class OpenWorldStreaming.OpenWorldFilterSettings~Brakkesh_Level23
// 0x0000 (0x00F0 - 0x00F0)
class UOpenWorldFilterSettings_Brakkesh_Level23 final : public UOpenWorldFilterSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldFilterSettings~Brakkesh_Level23")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldFilterSettings~Brakkesh_Level23")
	}
	static class UOpenWorldFilterSettings_Brakkesh_Level23* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldFilterSettings_Brakkesh_Level23>();
	}
};
DUMPER7_ASSERTS_UOpenWorldFilterSettings_Brakkesh_Level23;

// Class OpenWorldStreaming.FoliageMaskActor
// 0x0010 (0x0380 - 0x0370)
class AFoliageMaskActor final : public AActor
{
public:
	class UBoxComponent*                          BoxComponent;                                      // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMaskGrass;                                        // 0x0378(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMaskTree;                                         // 0x0379(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FoliageMaskActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FoliageMaskActor")
	}
	static class AFoliageMaskActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFoliageMaskActor>();
	}
};
DUMPER7_ASSERTS_AFoliageMaskActor;

// Class OpenWorldStreaming.CookedTileSettings
// 0x0008 (0x0090 - 0x0088)
class UCookedTileSettings : public UOpenWorldSettings
{
public:
	int32                                         NumTiles;                                          // 0x0088(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings")
	}
	static class UCookedTileSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings;

// Class OpenWorldStreaming.CookedTileSettings~Cracked_TacticalConquest
// 0x0000 (0x0090 - 0x0090)
class UCookedTileSettings_Cracked_TacticalConquest final : public UCookedTileSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings~Cracked_TacticalConquest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings~Cracked_TacticalConquest")
	}
	static class UCookedTileSettings_Cracked_TacticalConquest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings_Cracked_TacticalConquest>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings_Cracked_TacticalConquest;

// Class OpenWorldStreaming.AssetsStreamer
// 0x02D0 (0x0640 - 0x0370)
class alignas(0x10) AAssetsStreamer : public AActor
{
public:
	TArray<struct FBoundedAssetPath>              Assets;                                            // 0x0370(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 AssetPathTemplate;                                 // 0x0380(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SubAssetPathTemplates;                             // 0x0390(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TSet<struct FIntVector>                       SubAssetIDs;                                       // 0x03A0(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F0[0x20];                                     // 0x03F0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UObject*>                          LoadedAssets;                                      // 0x0410(0x0050)(Edit, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_460[0x1E0];                                    // 0x0460(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AssetsStreamer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AssetsStreamer")
	}
	static class AAssetsStreamer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAssetsStreamer>();
	}
};
DUMPER7_ASSERTS_AAssetsStreamer;

// Class OpenWorldStreaming.StreamingLayer
// 0x0000 (0x0028 - 0x0028)
class UStreamingLayer : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StreamingLayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StreamingLayer")
	}
	static class UStreamingLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingLayer>();
	}
};
DUMPER7_ASSERTS_UStreamingLayer;

// Class OpenWorldStreaming.StreamingLayerHLOD
// 0x0000 (0x0028 - 0x0028)
class UStreamingLayerHLOD final : public UStreamingLayer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StreamingLayerHLOD")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StreamingLayerHLOD")
	}
	static class UStreamingLayerHLOD* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingLayerHLOD>();
	}
};
DUMPER7_ASSERTS_UStreamingLayerHLOD;

// Class OpenWorldStreaming.OpenWorldFilterSettings~SpaceCenter_Level22
// 0x0000 (0x00F0 - 0x00F0)
class UOpenWorldFilterSettings_SpaceCenter_Level22 final : public UOpenWorldFilterSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldFilterSettings~SpaceCenter_Level22")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldFilterSettings~SpaceCenter_Level22")
	}
	static class UOpenWorldFilterSettings_SpaceCenter_Level22* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldFilterSettings_SpaceCenter_Level22>();
	}
};
DUMPER7_ASSERTS_UOpenWorldFilterSettings_SpaceCenter_Level22;

// Class OpenWorldStreaming.OpenWorldComposition
// 0x08A8 (0x0910 - 0x0068)
class UOpenWorldComposition : public UWorldComposition
{
public:
	class FName                                   MainWorld;                                         // 0x0068(0x0008)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             SecondaryWorlds;                                   // 0x0070(0x0050)(Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class FName>                           Stages;                                            // 0x00C0(0x0010)(Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TMap<class FName, class FString>              DisabledLayers;                                    // 0x00D0(0x0050)(Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TSet<class FString>                           DisabledLevelWildcards;                            // 0x0120(0x0050)(Edit, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	struct FOpenWorldStreamingContext             Context;                                           // 0x0170(0x0140)(Edit, Transient, NativeAccessSpecifierPublic)
	struct FOpenWorldStreamingCollection          Collection;                                        // 0x02B0(0x03F0)(Edit, Transient, NativeAccessSpecifierPublic)
	float                                         GlobalStreamingScale;                              // 0x06A0(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      StreamingScales;                                   // 0x06A8(0x0050)(Edit, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UOpenWorldStreamingLayer*> Layers;                                       // 0x06F8(0x0050)(Edit, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<struct FOpenWorldStreamingLayerDesc>   StagedLayers;                                      // 0x0748(0x0010)(Edit, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_758[0x1B8];                                    // 0x0758(0x01B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeViewTarget(class AActor* ViewTarget); // (Final, Native, Public, BlueprintCallable) // @ 0x1417A08E0
	void ClearStages(); // (Final, Native, Public, BlueprintCallable) // @ 0x1417A0960
	bool EnterStage(class FName StageName); // (Final, Native, Public, BlueprintCallable) // @ 0x1417A0980
	bool ExitStage(class FName StageName); // (Final, Native, Public, BlueprintCallable) // @ 0x1417A0A10
	void FlushStreaming(EOpenWorldStreamingFlushFlags Flags_0, EOpenWorldStreamingImportance Importance, const TArray<struct FVector>& AbsolutePositions); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1417A0AA0
	void FlushViewTarget(); // (Final, Native, Public, BlueprintCallable) // @ 0x1417A0BF0
	void ForceSetViewTargetTransform(const struct FVector& Position, const struct FRotator& Rotator); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x1417A0C10
	void RecoverViewTarget(bool bFlush); // (Final, Native, Public, BlueprintCallable) // @ 0x1417A0CF0
	void ResetViewTarget(); // (Final, Native, Public, BlueprintCallable) // @ 0x1417A0D80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldComposition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldComposition")
	}
	static class UOpenWorldComposition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldComposition>();
	}
};
DUMPER7_ASSERTS_UOpenWorldComposition;

// Class OpenWorldStreaming.StreamingLayerVolume
// 0x0000 (0x0028 - 0x0028)
class UStreamingLayerVolume final : public UStreamingLayer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StreamingLayerVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StreamingLayerVolume")
	}
	static class UStreamingLayerVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingLayerVolume>();
	}
};
DUMPER7_ASSERTS_UStreamingLayerVolume;

// Class OpenWorldStreaming.CustomWorldComposition
// 0x0210 (0x0B20 - 0x0910)
class UCustomWorldComposition final : public UOpenWorldComposition
{
public:
	uint8                                         Pad_910[0xD8];                                     // 0x0910(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPhysicsLoadingCompleted;                          // 0x09E8(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9E9[0x3];                                      // 0x09E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             PercentageProgresses;                              // 0x09EC(0x000C)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOpenWorldProfilerConfig> ProfilerConfig;                                   // 0x09F8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipCookSubLevel;                                 // 0x0A20(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A21[0x7];                                      // 0x0A21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           LinuxClientWhiteList;                              // 0x0A28(0x0010)(Edit, ZeroConstructor, Config, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FDSMapAreaSettings>             DSMapAreaSettings;                                 // 0x0A38(0x0010)(Edit, ZeroConstructor, Config, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A48[0xD8];                                     // 0x0A48(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddStreamingScene(const TArray<class FName>& InExtraScanningMaps); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179B190
	void ClearStreamingScene(); // (Final, Native, Public, BlueprintCallable) // @ 0x14179B340
	void DisableWorldCompositionStreamingAfterComplete(int32 Percentage); // (Final, Native, Public, BlueprintCallable) // @ 0x14179B360
	void FindLevels(const class FString& InLevelKeyword, TArray<class FString>* OutFoundLevelPackageNames); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179B520
	void FlushLevelStreaming(); // (Final, Native, Public, BlueprintCallable) // @ 0x14179B6C0
	void FocusPlayerLocation(const struct FVector& InAbsoluteLocation); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14179B6E0
	void FocusPlayerLocations(const TArray<struct FVector>& InAbsoluteLocations); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179B770
	void ForceRefresh(); // (Final, Native, Public, BlueprintCallable) // @ 0x14179B840
	void ForceReloadLevel(const class FString& InLevelName); // (Final, Native, Public, BlueprintCallable) // @ 0x14179B860
	void FreezeStreamingLayers(const TArray<class FString>& InLayerWildcards, bool bFreeze); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179B920
	TArray<class FString> GetAllRuntimeLevels(); // (Final, Native, Public, BlueprintCallable) // @ 0x14179BBF0
	int32 GetLoadedLevelNum(); // (Final, Native, Public, BlueprintCallable) // @ 0x14179BD40
	void LoadLevel(const class FString& InLevelPackageName); // (Final, Native, Public, BlueprintCallable) // @ 0x14179BFB0
	void LoadLevels(const TArray<class FString>& InLevelPackageNames, const TDelegate<void()>& callback); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179C070
	void OverrideLayerParameter(const class FString& LayerName, const class FString& Parameter); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C200
	void PlayerZoomingOff(float InDelayTime); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C340
	void PlayerZoomingOn(float InFOV, float InDelayTime, float InZoomRate); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C3C0
	void ReleasePlayerLocation(); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C4F0
	void RemoveStreamingScene(const TArray<class FName>& InExtraScanningMaps); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179C510
	void RequestLevelStreaming(const class FString& InLevelPackageName, bool bShouldBeLoaded, bool bShouldBeVisible, bool bShouldBlock, bool bImmediately); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C5E0
	void RestoreLayerParameter(const class FString& LayerName); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C7B0
	void SetDisableBeginPlay(bool bDisable); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C890
	void SetIgnoreStreamgintLayers(const class FString& InLayersMsg); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C920
	void SetWorldCompositionStreamingEnable(bool bInEnable); // (Final, Native, Public, BlueprintCallable) // @ 0x14179C9E0
	void StatsEvent(); // (Final, Native, Public) // @ 0x14179CA70
	void UnloadLevel(const class FString& InLevelPackageName); // (Final, Native, Public, BlueprintCallable) // @ 0x14179CA90
	void UnloadLevels(const TArray<class FString>& InLevelPackageNames, const TDelegate<void()>& callback); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179CB50
	bool UseStreamingSettings(class FName MapName, const TArray<class FName>& InExtraScanningMaps); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14179CCE0

	class FString FindLandscapeTransitionWorld() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179B4A0
	TArray<class FString> GetAllLayerNames(bool bInNeedCheckClient, bool bInNeedCheckServer) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179BA90
	class FString GetIngnoreLayerMsgs() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179BCC0
	class FString GetUnloadLevelMsgs() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179BD70
	bool IsLevelExist(const class FString& InLevelName) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179BDF0
	bool IsLoadingCompleted(EOpenWorldStreamingImportance Importance) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179BEC0
	bool IsPhysicsLoadingCompleted() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179BF50
	bool IsWorldCompositionStreamingEnabled() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14179BF80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomWorldComposition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomWorldComposition")
	}
	static class UCustomWorldComposition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomWorldComposition>();
	}
};
DUMPER7_ASSERTS_UCustomWorldComposition;

// Class OpenWorldStreaming.SVTRenderAreaActor
// 0x0008 (0x0378 - 0x0370)
class ASVTRenderAreaActor final : public AActor
{
public:
	class UBoxComponent*                          BoxComponent;                                      // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SVTRenderAreaActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SVTRenderAreaActor")
	}
	static class ASVTRenderAreaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASVTRenderAreaActor>();
	}
};
DUMPER7_ASSERTS_ASVTRenderAreaActor;

// Class OpenWorldStreaming.OpenWorldFilterSettings~Gibraltar_UIMaps
// 0x0000 (0x00F0 - 0x00F0)
class UOpenWorldFilterSettings_Gibraltar_UIMaps final : public UOpenWorldFilterSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldFilterSettings~Gibraltar_UIMaps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldFilterSettings~Gibraltar_UIMaps")
	}
	static class UOpenWorldFilterSettings_Gibraltar_UIMaps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldFilterSettings_Gibraltar_UIMaps>();
	}
};
DUMPER7_ASSERTS_UOpenWorldFilterSettings_Gibraltar_UIMaps;

// Class OpenWorldStreaming.CookedTileSettings~Cracked_CaptureTheFlag
// 0x0000 (0x0090 - 0x0090)
class UCookedTileSettings_Cracked_CaptureTheFlag final : public UCookedTileSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings~Cracked_CaptureTheFlag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings~Cracked_CaptureTheFlag")
	}
	static class UCookedTileSettings_Cracked_CaptureTheFlag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings_Cracked_CaptureTheFlag>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings_Cracked_CaptureTheFlag;

// Class OpenWorldStreaming.EditorRuntimeConfig
// 0x00C0 (0x00E8 - 0x0028)
class UEditorRuntimeConfig final : public UObject
{
public:
	bool                                          bPlayFromHere;                                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x57];                                      // 0x0029(0x0057)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FEditorLevelFolderInfo> AllFolders;                                   // 0x0080(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EditorRuntimeConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EditorRuntimeConfig")
	}
	static class UEditorRuntimeConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEditorRuntimeConfig>();
	}
};
DUMPER7_ASSERTS_UEditorRuntimeConfig;

// Class OpenWorldStreaming.FoliageHISMActor
// 0x0020 (0x0390 - 0x0370)
class AFoliageHISMActor final : public AActor
{
public:
	class USceneComponent*                        HISMRootComponent;                                 // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x0378(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> ChildHISMComps;                         // 0x0380(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FoliageHISMActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FoliageHISMActor")
	}
	static class AFoliageHISMActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFoliageHISMActor>();
	}
};
DUMPER7_ASSERTS_AFoliageHISMActor;

// Class OpenWorldStreaming.FreezeRebasingVolume
// 0x0000 (0x03A8 - 0x03A8)
class AFreezeRebasingVolume final : public AVolume
{
public:
	void BeginOverlap(class AActor* ThisActor, class AActor* OtherActor); // (Final, Native, Public) // @ 0x14179B260
	void EndOverlap(class AActor* ThisActor, class AActor* OtherActor); // (Final, Native, Public) // @ 0x14179B3E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FreezeRebasingVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FreezeRebasingVolume")
	}
	static class AFreezeRebasingVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFreezeRebasingVolume>();
	}
};
DUMPER7_ASSERTS_AFreezeRebasingVolume;

// Class OpenWorldStreaming.CookedTileSettings~Cracked_Siege
// 0x0000 (0x0090 - 0x0090)
class UCookedTileSettings_Cracked_Siege final : public UCookedTileSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings~Cracked_Siege")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings~Cracked_Siege")
	}
	static class UCookedTileSettings_Cracked_Siege* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings_Cracked_Siege>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings_Cracked_Siege;

// Class OpenWorldStreaming.FreezeRebasingManager
// 0x0020 (0x0050 - 0x0030)
class UFreezeRebasingManager final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FreezeRebasingManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FreezeRebasingManager")
	}
	static class UFreezeRebasingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFreezeRebasingManager>();
	}
};
DUMPER7_ASSERTS_UFreezeRebasingManager;

// Class OpenWorldStreaming.CookedTileSettings~SpaceCenter_Long3
// 0x0000 (0x0090 - 0x0090)
class UCookedTileSettings_SpaceCenter_Long3 final : public UCookedTileSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings~SpaceCenter_Long3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings~SpaceCenter_Long3")
	}
	static class UCookedTileSettings_SpaceCenter_Long3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings_SpaceCenter_Long3>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings_SpaceCenter_Long3;

// Class OpenWorldStreaming.GamePlayAreaBuildConfigGroup
// 0x0010 (0x0038 - 0x0028)
class UGamePlayAreaBuildConfigGroup final : public UObject
{
public:
	TArray<struct FGamePlayAreaBuildConfig>       GamePlayAreaTypeConfigs;                           // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GamePlayAreaBuildConfigGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GamePlayAreaBuildConfigGroup")
	}
	static class UGamePlayAreaBuildConfigGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamePlayAreaBuildConfigGroup>();
	}
};
DUMPER7_ASSERTS_UGamePlayAreaBuildConfigGroup;

// Class OpenWorldStreaming.OpenWorldStreamingSettings
// 0x0240 (0x02C8 - 0x0088)
class UOpenWorldStreamingSettings : public UOpenWorldSettings
{
public:
	int32                                         DefaultStreamingLevel;                             // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStreamingLevelInfo>            LevelIndexInfo;                                    // 0x0090(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TMap<int32, class FString>                    LevelIndexValidationFolder;                        // 0x00A0(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         NecessaryPriority;                                 // 0x00F0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MajorPriority;                                     // 0x00F4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StreamingSwitches;                                 // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStreamingLayerSwitch>          StreamingLayerSwitches;                            // 0x0108(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStreamingLayerDesc>            DefaultStreamingGroups;                            // 0x0118(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStreamingLayerDesc>            OverrideStreamingGroups;                           // 0x0128(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           PhysicsGroups;                                     // 0x0138(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FMapBroadphaseSettings>         MapBroadphaseSettings;                             // 0x0148(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bEnableBroadphaseMBPClient;                        // 0x0158(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableBroadphaseMBPServer;                        // 0x0159(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MBPOuterMultipler;                                 // 0x015C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MBPGridSize;                                       // 0x0160(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSpecialStreamingUpdateDistGroup> SpecialStreamingUpdateDistGroups;                // 0x0168(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bIgnoreZoomFrustum;                                // 0x0178(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 VisibleZoomRate;                                   // 0x0180(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         HLODInvisibleFarthestDistance;                     // 0x0190(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LODClampDistance;                                  // 0x0194(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOpenWorldStreamingLayerDesc>   DefaultStreamingLayers;                            // 0x0198(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FOpenWorldStreamingLayerDesc>   OverrideStreamingLayers;                           // 0x01A8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           SecondaryWorlds;                                   // 0x01B8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Config, NativeAccessSpecifierPublic)
	bool                                          bCanDisableSimulation;                             // 0x01C8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsesGameplayAreaOrigin;                           // 0x01C9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         BatchPrefixes;                                     // 0x01D0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         LevelPVSIngoreLayers;                              // 0x01E0(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PhyscsProxyLayerMapping;                           // 0x01F0(0x0050)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FString>                         Partition3DMaps;                                   // 0x0240(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                          bZStreaming;                                       // 0x0250(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOpenWorldStreamingStageLayerSetting> Stages;                                      // 0x0258(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FOpenWorldStreamingStageSetting> StageSettings;                                    // 0x0268(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         LandscapeSwitchWildcards;                          // 0x0278(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         OverrideSceneGM;                                   // 0x0288(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         FlushStreamingCVars;                               // 0x0298(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCustomDisableLayerSetting>     CustomDisableLayers;                               // 0x02A8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x10];                                     // 0x02B8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldStreamingSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldStreamingSettings")
	}
	static class UOpenWorldStreamingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldStreamingSettings>();
	}
};
DUMPER7_ASSERTS_UOpenWorldStreamingSettings;

// Class OpenWorldStreaming.OpenWorldStreamingSettings~Shafted
// 0x0000 (0x02C8 - 0x02C8)
class UOpenWorldStreamingSettings_Shafted final : public UOpenWorldStreamingSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldStreamingSettings~Shafted")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldStreamingSettings~Shafted")
	}
	static class UOpenWorldStreamingSettings_Shafted* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldStreamingSettings_Shafted>();
	}
};
DUMPER7_ASSERTS_UOpenWorldStreamingSettings_Shafted;

// Class OpenWorldStreaming.GamePlayAreaRuntimeConfig
// 0x0010 (0x0038 - 0x0028)
class UGamePlayAreaRuntimeConfig final : public UObject
{
public:
	TArray<struct FGamePlayAreaInfo>              GamePlayAreaInfos;                                 // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GamePlayAreaRuntimeConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GamePlayAreaRuntimeConfig")
	}
	static class UGamePlayAreaRuntimeConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGamePlayAreaRuntimeConfig>();
	}
};
DUMPER7_ASSERTS_UGamePlayAreaRuntimeConfig;

// Class OpenWorldStreaming.GamePlayValidAreaActor
// 0x0008 (0x0378 - 0x0370)
class AGamePlayValidAreaActor final : public AActor
{
public:
	class UBoxComponent*                          BoxComponent;                                      // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SaveAllToConfig() const; // (Final, Native, Public, Const) // @ 0x14179C870

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GamePlayValidAreaActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GamePlayValidAreaActor")
	}
	static class AGamePlayValidAreaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGamePlayValidAreaActor>();
	}
};
DUMPER7_ASSERTS_AGamePlayValidAreaActor;

// Class OpenWorldStreaming.OpenWorldProfileAreaActor
// 0x0058 (0x03C8 - 0x0370)
class AOpenWorldProfileAreaActor final : public AActor
{
public:
	class FString                                 ProfileAreaName;                                   // 0x0370(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         RequestLevels;                                     // 0x0380(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bOverAllArea;                                      // 0x0390(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Space;                                             // 0x0394(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpenWorldProfilerSampleMethod                SampleMethod;                                      // 0x0398(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          BoxComponent;                                      // 0x03A0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         SubProfileAreaNames;                               // 0x03A8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FBox>                           SubProfileAreaBounds;                              // 0x03B8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldProfileAreaActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldProfileAreaActor")
	}
	static class AOpenWorldProfileAreaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldProfileAreaActor>();
	}
};
DUMPER7_ASSERTS_AOpenWorldProfileAreaActor;

// Class OpenWorldStreaming.OpenWorldProfileMaskAreaActor
// 0x0008 (0x0378 - 0x0370)
class AOpenWorldProfileMaskAreaActor final : public AActor
{
public:
	class UBoxComponent*                          BoxComponent;                                      // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldProfileMaskAreaActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldProfileMaskAreaActor")
	}
	static class AOpenWorldProfileMaskAreaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldProfileMaskAreaActor>();
	}
};
DUMPER7_ASSERTS_AOpenWorldProfileMaskAreaActor;

// Class OpenWorldStreaming.OpenWorldStreamingSettings~Forrest_WithFire
// 0x0000 (0x02C8 - 0x02C8)
class UOpenWorldStreamingSettings_Forrest_WithFire final : public UOpenWorldStreamingSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldStreamingSettings~Forrest_WithFire")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldStreamingSettings~Forrest_WithFire")
	}
	static class UOpenWorldStreamingSettings_Forrest_WithFire* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldStreamingSettings_Forrest_WithFire>();
	}
};
DUMPER7_ASSERTS_UOpenWorldStreamingSettings_Forrest_WithFire;

// Class OpenWorldStreaming.OpenWorldPSOProfileAreaActor
// 0x0028 (0x0398 - 0x0370)
class AOpenWorldPSOProfileAreaActor final : public AActor
{
public:
	float                                         Space;                                             // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroupSpace;                                        // 0x0374(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfileAreaName;                                   // 0x0378(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpenWorldProfilerSampleMethod                SampleMethod;                                      // 0x0388(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          BoxComponent;                                      // 0x0390(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldPSOProfileAreaActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldPSOProfileAreaActor")
	}
	static class AOpenWorldPSOProfileAreaActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldPSOProfileAreaActor>();
	}
};
DUMPER7_ASSERTS_AOpenWorldPSOProfileAreaActor;

// Class OpenWorldStreaming.OpenWorldSceneProfileSplineChildComponent
// 0x0010 (0x0260 - 0x0250)
class UOpenWorldSceneProfileSplineChildComponent final : public USceneComponent
{
public:
	float                                         StepRatio;                                         // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0xC];                                      // 0x0254(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldSceneProfileSplineChildComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldSceneProfileSplineChildComponent")
	}
	static class UOpenWorldSceneProfileSplineChildComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldSceneProfileSplineChildComponent>();
	}
};
DUMPER7_ASSERTS_UOpenWorldSceneProfileSplineChildComponent;

// Class OpenWorldStreaming.OpenWorldFilterSettings~Forrest_Level23
// 0x0000 (0x00F0 - 0x00F0)
class UOpenWorldFilterSettings_Forrest_Level23 final : public UOpenWorldFilterSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldFilterSettings~Forrest_Level23")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldFilterSettings~Forrest_Level23")
	}
	static class UOpenWorldFilterSettings_Forrest_Level23* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldFilterSettings_Forrest_Level23>();
	}
};
DUMPER7_ASSERTS_UOpenWorldFilterSettings_Forrest_Level23;

// Class OpenWorldStreaming.OpenWorldProfileAreaHydrantActor
// 0x0008 (0x0378 - 0x0370)
class AOpenWorldProfileAreaHydrantActor final : public AActor
{
public:
	class UBoxComponent*                          BoxComponent;                                      // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldProfileAreaHydrantActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldProfileAreaHydrantActor")
	}
	static class AOpenWorldProfileAreaHydrantActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldProfileAreaHydrantActor>();
	}
};
DUMPER7_ASSERTS_AOpenWorldProfileAreaHydrantActor;

// Class OpenWorldStreaming.GeneralLevelVolume
// 0x0030 (0x03D8 - 0x03A8)
class AGeneralLevelVolume final : public AVolume
{
public:
	TArray<class AGeneralLevelVolume*>            OutVolumes;                                        // 0x03A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AGeneralLevelVolume*>            InVolumes;                                         // 0x03B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 PackageName;                                       // 0x03C8(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BreakConnection(); // (Final, Native, Protected) // @ 0x140C994B0
	void ClearDebugLine(); // (Final, Native, Protected) // @ 0x14179B320
	void LinkConnection(); // (Final, Native, Protected) // @ 0x140C994B0
	void ReCreateDebugLine(); // (Final, Native, Protected) // @ 0x14179C4D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeneralLevelVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeneralLevelVolume")
	}
	static class AGeneralLevelVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGeneralLevelVolume>();
	}
};
DUMPER7_ASSERTS_AGeneralLevelVolume;

// Class OpenWorldStreaming.OpenWorldFilterSettings~Shafted_UIMaps
// 0x0000 (0x00F0 - 0x00F0)
class UOpenWorldFilterSettings_Shafted_UIMaps final : public UOpenWorldFilterSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldFilterSettings~Shafted_UIMaps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldFilterSettings~Shafted_UIMaps")
	}
	static class UOpenWorldFilterSettings_Shafted_UIMaps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldFilterSettings_Shafted_UIMaps>();
	}
};
DUMPER7_ASSERTS_UOpenWorldFilterSettings_Shafted_UIMaps;

// Class OpenWorldStreaming.GrassMapActor
// 0x0038 (0x03A8 - 0x0370)
class AGrassMapActor final : public AActor
{
public:
	uint8                                         Pad_370[0x38];                                     // 0x0370(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GrassMapActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GrassMapActor")
	}
	static class AGrassMapActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrassMapActor>();
	}
};
DUMPER7_ASSERTS_AGrassMapActor;

// Class OpenWorldStreaming.HISMMergeActor
// 0x0150 (0x04C0 - 0x0370)
class AHISMMergeActor final : public AActor
{
public:
	class USceneComponent*                        HISMMergeRootComponent;                            // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentHISMID;                                     // 0x0378(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint32, TWeakObjectPtr<class UHierarchicalInstancedStaticMeshComponent>> ChildHISMComps;    // 0x0380(0x0050)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<int32, struct FCacheHISMGroupDataInfo>   MapCacheDatas;                                     // 0x03D0(0x0050)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TMap<class FName, int32>                      InstanceStartCullDistances;                        // 0x0420(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FName, int32>                      InstanceEndCullDistances;                          // 0x0470(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HISMMergeActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HISMMergeActor")
	}
	static class AHISMMergeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHISMMergeActor>();
	}
};
DUMPER7_ASSERTS_AHISMMergeActor;

// Class OpenWorldStreaming.CookedTileSettings~Crest_In
// 0x0000 (0x0090 - 0x0090)
class UCookedTileSettings_Crest_In final : public UCookedTileSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings~Crest_In")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings~Crest_In")
	}
	static class UCookedTileSettings_Crest_In* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings_Crest_In>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings_Crest_In;

// Class OpenWorldStreaming.LandscapeCollisionAsset
// 0x0028 (0x0050 - 0x0028)
class ULandscapeCollisionAsset final : public UObject
{
public:
	TArray<struct FPhysXSerialBodyInstance>       SerialBodyInstances;                               // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0038(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Timestamp;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeCollisionAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeCollisionAsset")
	}
	static class ULandscapeCollisionAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeCollisionAsset>();
	}
};
DUMPER7_ASSERTS_ULandscapeCollisionAsset;

// Class OpenWorldStreaming.CookedTileSettings~Tide_Level2
// 0x0000 (0x0090 - 0x0090)
class UCookedTileSettings_Tide_Level2 final : public UCookedTileSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings~Tide_Level2")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings~Tide_Level2")
	}
	static class UCookedTileSettings_Tide_Level2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings_Tide_Level2>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings_Tide_Level2;

// Class OpenWorldStreaming.LandscapeCollisionAssetsStreamer
// 0x0130 (0x0770 - 0x0640)
class ALandscapeCollisionAssetsStreamer final : public AAssetsStreamer
{
public:
	TMap<class FName, class UPhysXSerialComponent*> CollisionComponents;                             // 0x0640(0x0050)(Edit, ExportObject, ZeroConstructor, Transient, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_690[0x60];                                     // 0x0690(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLandscapeOcclusionMaskData            OcclusionMaskData;                                 // 0x06F0(0x0078)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_768[0x8];                                      // 0x0768(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeCollisionAssetsStreamer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeCollisionAssetsStreamer")
	}
	static class ALandscapeCollisionAssetsStreamer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeCollisionAssetsStreamer>();
	}
};
DUMPER7_ASSERTS_ALandscapeCollisionAssetsStreamer;

// Class OpenWorldStreaming.LandscapeFoliageHierarchicalInstancedComponent
// 0x0000 (0x0B20 - 0x0B20)
class ULandscapeFoliageHierarchicalInstancedComponent final : public UHierarchicalInstancedStaticMeshComponent
{
public:
	bool                                          CookQuadTree;                                      // 0x0B18(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CookLossyInstanceData;                             // 0x0B19(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1A[0x6];                                      // 0x0B1A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LandscapeFoliageHierarchicalInstancedComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LandscapeFoliageHierarchicalInstancedComponent")
	}
	static class ULandscapeFoliageHierarchicalInstancedComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeFoliageHierarchicalInstancedComponent>();
	}
};
DUMPER7_ASSERTS_ULandscapeFoliageHierarchicalInstancedComponent;

// Class OpenWorldStreaming.CookedTileSettings~Dam_Iris_Level1
// 0x0000 (0x0090 - 0x0090)
class UCookedTileSettings_Dam_Iris_Level1 final : public UCookedTileSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CookedTileSettings~Dam_Iris_Level1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CookedTileSettings~Dam_Iris_Level1")
	}
	static class UCookedTileSettings_Dam_Iris_Level1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCookedTileSettings_Dam_Iris_Level1>();
	}
};
DUMPER7_ASSERTS_UCookedTileSettings_Dam_Iris_Level1;

// Class OpenWorldStreaming.LandscapeSimpleCollisionActor
// 0x01B0 (0x0520 - 0x0370)
class ALandscapeSimpleCollisionActor final : public AActor
{
public:
	class USceneComponent*                        SimplePhysicsRootComponent;                        // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                      DefaultPhysMaterial;                               // 0x0378(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBodyInstance                          BodyInstance;                                      // 0x0380(0x0120)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         CollisionMipLevel;                                 // 0x04A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimpleCollisionMipLevel;                           // 0x04A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimpleCollisionMipNum;                             // 0x04A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionMeregCount;                               // 0x04AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
