#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenWorldSceneAutommation

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "OpenWorldSceneAutommation_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OpenWorldSceneAutommation.OpenWorldSceneAutommationFlowComponent
// 0x0070 (0x02C0 - 0x0250)
class UOpenWorldSceneAutommationFlowComponent final : public USceneComponent
{
public:
	float                                         PlayerSpeed;                                       // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerHigh;                                        // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 POIName;                                           // 0x0258(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOpenWorldSceneAutomationFlowRuntimeSection> RuntimeSections;                      // 0x0268(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x28];                                     // 0x0278(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CacheWorld;                                        // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x18];                                     // 0x02A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldSceneAutommationFlowComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldSceneAutommationFlowComponent")
	}
	static class UOpenWorldSceneAutommationFlowComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldSceneAutommationFlowComponent>();
	}
};
DUMPER7_ASSERTS_UOpenWorldSceneAutommationFlowComponent;

// Class OpenWorldSceneAutommation.OpenWorldSceneProfileCollector
// 0x0020 (0x0390 - 0x0370)
class AOpenWorldSceneProfileCollector final : public AActor
{
public:
	uint8                                         Pad_370[0x20];                                     // 0x0370(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldSceneProfileCollector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldSceneProfileCollector")
	}
	static class AOpenWorldSceneProfileCollector* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldSceneProfileCollector>();
	}
};
DUMPER7_ASSERTS_AOpenWorldSceneProfileCollector;

// Class OpenWorldSceneAutommation.OpenWorldSceneAutommationFlow
// 0x0018 (0x0388 - 0x0370)
class AOpenWorldSceneAutommationFlow final : public AActor
{
public:
	class UOpenWorldSceneAutommationFlowComponent* FlowComponent;                                    // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 OpenWorldSceneAutommationFlowName;                 // 0x0378(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InitAutomationData(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldSceneAutommationFlow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldSceneAutommationFlow")
	}
	static class AOpenWorldSceneAutommationFlow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOpenWorldSceneAutommationFlow>();
	}
};
DUMPER7_ASSERTS_AOpenWorldSceneAutommationFlow;

// Class OpenWorldSceneAutommation.OpenWorldSceneAutommationMethod
// 0x0008 (0x0030 - 0x0028)
class UOpenWorldSceneAutommationMethod final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetCurentPlayerLocation(); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1417D71C0
	struct FRotator GetCurentPlayerRotation(); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1417D7200
	void OnAutomationMethodBegin(); // (Native, Event, Public, BlueprintEvent) // @ 0x140CA7190
	bool OnAutomationMethodExcute(float ExcuteTime); // (Native, Event, Public, BlueprintEvent) // @ 0x1417D7240
	void UpdatePlayerLocaiton(const struct FVector& InPlayerLocation, const struct FRotator& InPlayerRotator); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x1417D72B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpenWorldSceneAutommationMethod")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpenWorldSceneAutommationMethod")
	}
	static class UOpenWorldSceneAutommationMethod* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpenWorldSceneAutommationMethod>();
	}
};
DUMPER7_ASSERTS_UOpenWorldSceneAutommationMethod;

}

