#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenWorldStreaming

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum OpenWorldStreaming.EInstanceAreaTyep
// NumValues: 0x0004
enum class EInstanceAreaTyep : uint8
{
	AABB                                     = 0,
	OBB                                      = 1,
	CYLINDRICAL                              = 2,
	EInstanceAreaTyep_MAX                    = 3,
};

// Enum OpenWorldStreaming.EOpenWorldProfilerSampleMethod
// NumValues: 0x0004
enum class EOpenWorldProfilerSampleMethod : uint8
{
	NavMesh                                  = 0,
	Collision                                = 1,
	NavMesh_Hydrant                          = 2,
	EOpenWorldProfilerSampleMethod_MAX       = 3,
};

// Enum OpenWorldStreaming.EOpenWorldRescanState
// NumValues: 0x0005
enum class EOpenWorldRescanState : uint8
{
	None                                     = 0,
	Once                                     = 1,
	Twice                                    = 2,
	Num                                      = 3,
	EOpenWorldRescanState_MAX                = 4,
};

// Enum OpenWorldStreaming.EOpenWorldStreamingFlushFlags
// NumValues: 0x0007
enum class EOpenWorldStreamingFlushFlags : uint8
{
	None                                     = 0,
	Load                                     = 1,
	Unload                                   = 2,
	Block                                    = 4,
	Purge                                    = 8,
	Tradeoff                                 = 15,
	EOpenWorldStreamingFlushFlags_MAX        = 16,
};

// Enum OpenWorldStreaming.EOpenWorldHeartbeatFlags
// NumValues: 0x0019
enum class EOpenWorldHeartbeatFlags : uint32
{
	Freeze                                   = 1,
	Dirty                                    = 2,
	Focus                                    = 4,
	Stages                                   = 8,
	Seamless                                 = 16,
	Subworlds                                = 32,
	RequestInitialize                        = 64,
	RequestRescan                            = 128,
	AsyncRescan                              = 256,
	Necessary                                = 512,
	Major                                    = 1024,
	General                                  = 2048,
	Physics                                  = 4096,
	SinglePlayer                             = 8192,
	LocalPlayer                              = 16384,
	PlayerController                         = 32768,
	PlayerPawn                               = 65536,
	PendingLevels                            = 131072,
	MarkingLevels                            = 262144,
	MarkedLevels                             = 524288,
	PendingVisibility                        = 1048576,
	PendingInvisibility                      = 2097152,
	AsyncLoading                             = 4194304,
	EnergySaving                             = 8388608,
	EOpenWorldHeartbeatFlags_MAX             = 8388609,
};

// Enum OpenWorldStreaming.EOpenWorldStreamingImportance
// NumValues: 0x0007
enum class EOpenWorldStreamingImportance : uint8
{
	Necessary                                = 0,
	Major                                    = 1,
	General                                  = 2,
	Num                                      = 3,
	All                                      = 2,
	None                                     = 3,
	EOpenWorldStreamingImportance_MAX        = 4,
};

// Enum OpenWorldStreaming.EOpenWorldFilterType
// NumValues: 0x0003
enum class EOpenWorldFilterType : uint8
{
	Runtime                                  = 0,
	Editor                                   = 1,
	EOpenWorldFilterType_MAX                 = 2,
};

// ScriptStruct OpenWorldStreaming.EditorLevelLoadMethod
// 0x0018 (0x0018 - 0x0000)
struct FEditorLevelLoadMethod final
{
public:
	TSubclassOf<class UStreamingLayer>            LayerClass;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LayerParameter;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEditorLevelLoadMethod;

// ScriptStruct OpenWorldStreaming.WorldTileFolderExtra
// 0x0020 (0x0020 - 0x0000)
struct FWorldTileFolderExtra final
{
public:
	class FName                                   Folder;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Layer;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExclusionWildcards;                                // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldTileFolderExtra;

// ScriptStruct OpenWorldStreaming.OpenWorldFoliageTypeRawData
// 0x0028 (0x0028 - 0x0000)
struct FOpenWorldFoliageTypeRawData final
{
public:
	struct FSoftObjectPath                        MeshType;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                OverrideMaterials;                                 // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldFoliageTypeRawData;

// ScriptStruct OpenWorldStreaming.DSMapAreaSettings
// 0x0024 (0x0024 - 0x0000)
struct FDSMapAreaSettings final
{
public:
	class FName                                   MapName;                                           // 0x0000(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   MapBound;                                          // 0x0008(0x001C)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDSMapAreaSettings;

// ScriptStruct OpenWorldStreaming.EditorLevelInfo
// 0x0028 (0x0028 - 0x0000)
struct FEditorLevelInfo final
{
public:
	class FString                                 LevelPath;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RealLevelPath;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadLevel;                                        // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEditorLevelInfo;

// ScriptStruct OpenWorldStreaming.EditorLevelFolderInfo
// 0x0048 (0x0048 - 0x0000)
struct FEditorLevelFolderInfo final
{
public:
	class FString                                 FolderPath;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRootFolder;                                     // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoadAllLevels;                                    // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClientDefaultLoad;                                // 0x0012(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditorLevelLoadMethod                 LoadMethod;                                        // 0x0018(0x0018)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FEditorLevelInfo>               ChildrenLevels;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsExpand;                                         // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEditorLevelFolderInfo;

// ScriptStruct OpenWorldStreaming.MapGridKeyInfo
// 0x0010 (0x0010 - 0x0000)
struct FMapGridKeyInfo final
{
public:
	TArray<struct FIntPoint>                      GridKeyInfos;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMapGridKeyInfo;

// ScriptStruct OpenWorldStreaming.GamePlayAreaIndexInfo
// 0x0050 (0x0050 - 0x0000)
struct FGamePlayAreaIndexInfo final
{
public:
	TMap<class FString, struct FMapGridKeyInfo>   AreaMeshTypes;                                     // 0x0000(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamePlayAreaIndexInfo;

// ScriptStruct OpenWorldStreaming.GamePlayMeshInstanceInfo
// 0x0034 (0x0034 - 0x0000)
struct FGamePlayMeshInstanceInfo final
{
public:
	struct FVector                                InstanceCenter;                                    // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InstanceRotation;                                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                InstanceScale;                                     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InstanceZOffset;                                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InstanceSize;                                      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamePlayMeshInstanceInfo;

// ScriptStruct OpenWorldStreaming.GridMeshInstances
// 0x0010 (0x0010 - 0x0000)
struct FGridMeshInstances final
{
public:
	TArray<struct FGamePlayMeshInstanceInfo>      MeshInstances;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridMeshInstances;

// ScriptStruct OpenWorldStreaming.GamePlayAreaInfo
// 0x0058 (0x0058 - 0x0000)
struct FGamePlayAreaInfo final
{
public:
	EInstanceAreaTyep                             InstanceAreaType;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FIntPoint, struct FGridMeshInstances> GridMeshInstances;                             // 0x0008(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamePlayAreaInfo;

// ScriptStruct OpenWorldStreaming.GamePlayAreaTypeInfo
// 0x001C (0x001C - 0x0000)
struct FGamePlayAreaTypeInfo final
{
public:
	EInstanceAreaTyep                             InstanceAreaType;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CenterOffset;                                      // 0x0004(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DefineSize;                                        // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamePlayAreaTypeInfo;

// ScriptStruct OpenWorldStreaming.GamePlayAreaBuildConfig
// 0x0020 (0x0020 - 0x0000)
struct FGamePlayAreaBuildConfig final
{
public:
	class FString                                 ConfigName;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGamePlayAreaTypeInfo>          GamePlayAreaTypeInfos;                             // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGamePlayAreaBuildConfig;

// ScriptStruct OpenWorldStreaming.CacheHISMDataInfo
// 0x000C (0x000C - 0x0000)
struct FCacheHISMDataInfo final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BeginInstanceID;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndInstanceID;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCacheHISMDataInfo;

// ScriptStruct OpenWorldStreaming.CacheHISMGroupDataInfo
// 0x0018 (0x0018 - 0x0000)
struct FCacheHISMGroupDataInfo final
{
public:
	int32                                         TargetHISMID;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCacheHISMDataInfo>             Infos;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCacheHISMGroupDataInfo;

// ScriptStruct OpenWorldStreaming.LandscapeOcclusionMaskData
// 0x0078 (0x0078 - 0x0000)
struct FLandscapeOcclusionMaskData final
{
public:
	struct FBoxSphereBounds                       Bounds;                                            // 0x0000(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         CellSizeXY;                                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SizeX;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SizeY;                                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MipBlockSize;                                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MipSizeX;                                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MipSizeY;                                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  SerializedRawData;                                 // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLandscapeOcclusionMaskData;

// ScriptStruct OpenWorldStreaming.LandscapeBlockSimpleCollision
// 0x0028 (0x0028 - 0x0000)
struct FLandscapeBlockSimpleCollision final
{
public:
	struct FIntPoint                              BlockIndex;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LandscapeCenter;                                   // 0x0008(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULandscapeSimpleCollisionComponent*> SimpleCollisionComponents;                     // 0x0018(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLandscapeBlockSimpleCollision;

// ScriptStruct OpenWorldStreaming.OnlySimpleCollisionParams
// 0x0028 (0x0028 - 0x0000)
struct FOnlySimpleCollisionParams final
{
public:
	int32                                         CurrCollisionMipLevel;                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TotalCollisionMipNum;                              // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int32>                                 SimpleCollisionMipSizeQuads;                       // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 CollisionMipScale;                                 // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FOnlySimpleCollisionParams;

// ScriptStruct OpenWorldStreaming.CompositedCollisionParams
// 0x000C (0x000C - 0x0000)
struct FCompositedCollisionParams final
{
public:
	int32                                         CollisionSizeQuads;                                // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SimpleCollisionSizeQuads;                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CollisionScale;                                    // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCompositedCollisionParams;

// ScriptStruct OpenWorldStreaming.LandscapeSimpleCollisionSection
// 0x0048 (0x0048 - 0x0000)
struct FLandscapeSimpleCollisionSection final
{
public:
	bool                                          bIsClient;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumSubsections;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubsectionSizeQuads;                               // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentSizeQuads;                                // 0x000C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SectionSize;                                       // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EditorVisiableDistance;                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              SectionID;                                         // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LandscapeCenter;                                   // 0x0020(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SectionLocation;                                   // 0x002C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULandscapeSimpleCollisionData*>  SectionData;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLandscapeSimpleCollisionSection;

// ScriptStruct OpenWorldStreaming.CollisionDataAssetPaths
// 0x0018 (0x0018 - 0x0000)
struct FCollisionDataAssetPaths final
{
public:
	struct FIntPoint                              SectionID;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class ULandscapeSimpleCollisionData>> AssetPaths;                          // 0x0008(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCollisionDataAssetPaths;

// ScriptStruct OpenWorldStreaming.OpenWorldStreamingCollection
// 0x03F0 (0x03F0 - 0x0000)
struct FOpenWorldStreamingCollection final
{
public:
	EOpenWorldStreamingImportance                 ShowingImportance;                                 // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              AssetProgress;                                     // 0x0004(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UOpenWorldStreamingLevel*>         MarkingLevels;                                     // 0x0010(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         MarkedLevels;                                      // 0x0060(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         DelayMarkedLevels;                                 // 0x00B0(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         ShownLevels;                                       // 0x0100(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         HiddenLevels;                                      // 0x0150(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         ShowingLevels;                                     // 0x01A0(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         HidingLevels;                                      // 0x01F0(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         PendingLevels;                                     // 0x0240(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         ProgressLevels;                                    // 0x0290(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TSet<class UOpenWorldStreamingLevel*>         LODLevels;                                         // 0x02E0(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UOpenWorldStreamingLevel*> RegisteredLevels;                             // 0x0330(0x0050)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	float                                         PendingStartSeconds;                               // 0x0380(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x6C];                                     // 0x0384(0x006C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOpenWorldStreamingCollection;

// ScriptStruct OpenWorldStreaming.OpenWorldStreamingZoom
// 0x0090 (0x0090 - 0x0000)
struct FOpenWorldStreamingZoom final
{
public:
	float                                         FOV;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelaySeconds;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZoomRate;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ViewRotation;                                      // 0x000C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntPoint                              Viewport;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMatrix                                ViewProjection;                                    // 0x0020(0x0040)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBox2D                                 FrustumBounds;                                     // 0x0060(0x0014)(Edit, ZeroConstructor, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FBox                                   FrustumBounds3D;                                   // 0x0074(0x001C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldStreamingZoom;

// ScriptStruct OpenWorldStreaming.OpenWorldStreamingContext
// 0x0140 (0x0140 - 0x0000)
struct FOpenWorldStreamingContext final
{
public:
	bool                                          bFrozen;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDirty;                                            // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HidingDelaySeconds;                                // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StreamingUpdateDistSquared;                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowingImportance;                                // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Quality;                                           // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Switch;                                            // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        FocusPositions;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenWorldStreamingZoom                Zoom;                                              // 0x0040(0x0090)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LastUpdateSeconds;                                 // 0x00D0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ViewLocation;                                      // 0x00D4(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  ViewTarget;                                        // 0x00E0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  OverrideViewTarget;                                // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ForcedPosition;                                    // 0x00F0(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ForcedRotator;                                     // 0x00FC(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bForcedViewTargetTransform;                        // 0x0108(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushUnloadedLevels;                              // 0x0109(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 RequestedGlobalStreamingScales;                    // 0x0110(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 RequestedStreamingScales;                          // 0x0120(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           RequestedStreamingScaleMaps;                       // 0x0130(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FOpenWorldStreamingContext;

// ScriptStruct OpenWorldStreaming.StagedConsoleVariable
// 0x0020 (0x0020 - 0x0000)
struct FStagedConsoleVariable final
{
public:
	class FString                                 ConsoleVariableName;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Values;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStagedConsoleVariable;

// ScriptStruct OpenWorldStreaming.StagedConsoleCommands
// 0x0018 (0x0018 - 0x0000)
struct FStagedConsoleCommands final
{
public:
	int32                                         QualityLevel;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Commands;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStagedConsoleCommands;

// ScriptStruct OpenWorldStreaming.OpenWorldStreamingLayerDesc
// 0x0040 (0x0040 - 0x0000)
struct FOpenWorldStreamingLayerDesc final
{
public:
	TSoftClassPtr<class UClass>                   Class;                                             // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Properties;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldStreamingLayerDesc;

// ScriptStruct OpenWorldStreaming.OpenWorldFoliageTypeScalabilityRowBase
// 0x0140 (0x0148 - 0x0008)
struct FOpenWorldFoliageTypeScalabilityRowBase final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UFoliageType>            FoliageMesh;                                       // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFoliageType>            Level1;                                            // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFoliageType>            Level2;                                            // 0x0058(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFoliageType>            Level3;                                            // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFoliageType>            Level4;                                            // 0x00A8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFoliageType>            Level5;                                            // 0x00D0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFoliageType>            Level6;                                            // 0x00F8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Help;                                              // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale1;                                            // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale2;                                            // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale3;                                            // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale4;                                            // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale5;                                            // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale6;                                            // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldFoliageTypeScalabilityRowBase;

// ScriptStruct OpenWorldStreaming.OpenWorldFoliageScalabilityRowBase
// 0x0140 (0x0148 - 0x0008)
struct FOpenWorldFoliageScalabilityRowBase final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UStaticMesh>             FoliageMesh;                                       // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Level1;                                            // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Level2;                                            // 0x0058(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Level3;                                            // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Level4;                                            // 0x00A8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Level5;                                            // 0x00D0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UStaticMesh>             Level6;                                            // 0x00F8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Help;                                              // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale1;                                            // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale2;                                            // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale3;                                            // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale4;                                            // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale5;                                            // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale6;                                            // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldFoliageScalabilityRowBase;

// ScriptStruct OpenWorldStreaming.LocalFallbackConfig
// 0x0020 (0x0020 - 0x0000)
struct FLocalFallbackConfig final
{
public:
	int32                                         Key;                                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        Path;                                              // 0x0008(0x0018)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalFallbackConfig;

// ScriptStruct OpenWorldStreaming.GameModeProfileMetricSettings
// 0x0068 (0x0068 - 0x0000)
struct FGameModeProfileMetricSettings final
{
public:
	TArray<class FString>                         maps;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              GameModeProfileMetricSettingsDataTable;            // 0x0010(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              GameModeProfileMetricSettingsHDDataTable;          // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMP;                                             // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameModeProfileMetricSettings;

// ScriptStruct OpenWorldStreaming.GameModeProfileMetricRowBase
// 0x0038 (0x0040 - 0x0008)
struct FGameModeProfileMetricRowBase final : public FTableRowBase
{
public:
	class FString                                 MetricName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DesName;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedUpload;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReferenceValues_VeryHigh;                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReferenceValues_High;                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReferenceValues_Medium;                            // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReferenceValues_Low;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReferenceValues_VeryLow;                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameModeProfileMetricRowBase;

// ScriptStruct OpenWorldStreaming.OpenWorldProfileCustomSamplePos
// 0x0018 (0x0018 - 0x0000)
struct FOpenWorldProfileCustomSamplePos final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldProfileCustomSamplePos;

// ScriptStruct OpenWorldStreaming.OpenWorldExecCmdInfo
// 0x0018 (0x0018 - 0x0000)
struct FOpenWorldExecCmdInfo final
{
public:
	int32                                         QualityLevel;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CmdMsgs;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldExecCmdInfo;

// ScriptStruct OpenWorldStreaming.OpenWorldProfileArea
// 0x0080 (0x0080 - 0x0000)
struct FOpenWorldProfileArea final
{
public:
	class FString                                 ProfileAreaName;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox2D                                 Bounds;                                            // 0x0010(0x0014)(Edit, ZeroConstructor, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ProfilePointNum;                                   // 0x0024(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProfileHydrantPointNum;                            // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverAllArea;                                      // 0x002C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         SubProfileAreaNames;                               // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         RequestLevels;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ProfileLevelPositions;                             // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ProfileHydrantPositions;                           // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     DumpRenderDetailPositions;                         // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldProfileArea;

// ScriptStruct OpenWorldStreaming.StreamingLevelOctData
// 0x0028 (0x0028 - 0x0000)
struct FStreamingLevelOctData final
{
public:
	struct FBoxSphereBounds                       Bounds;                                            // 0x0000(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOpenWorldStreamingLevel*               Level;                                             // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStreamingLevelOctData;

// ScriptStruct OpenWorldStreaming.OpenWorldStreamingLODDistance
// 0x000C (0x000C - 0x0000)
struct FOpenWorldStreamingLODDistance final
{
public:
	int32                                         LOD0;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LOD1;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Bias;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenWorldStreamingLODDistance;

// ScriptStruct OpenWorldStreaming.SourceInstance
// 0x0030 (0x0030 - 0x0000)
struct FSourceInstance final
{
public:
	TSoftObjectPtr<class UObject>                 Source;                                            // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipBuild;                                        // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSourceInstance;

// ScriptStruct OpenWorldStreaming.BoundedAssetPath
// 0x0028 (0x0028 - 0x0000)
struct FBoundedAssetPath final
{
public:
	struct FBoxSphereBounds                       Bounds;                                            // 0x0000(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntVector                             ID;                                                // 0x001C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoundedAssetPath;

// ScriptStruct OpenWorldStreaming.LayerParamsGroup
// 0x0018 (0x0018 - 0x0000)
struct FLayerParamsGroup final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LayerParameter;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLayerParamsGroup;

// ScriptStruct OpenWorldStreaming.StreamingLayerDesc
// 0x0048 (0x0048 - 0x0000)
struct FStreamingLayerDesc final
{
public:
	class FName                                   GroupName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerPriority;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLayerParamsGroup>              LayerParameters;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bClient;                                           // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClientDefaultLoad;                                // 0x0021(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotifyServer;                                     // 0x0022(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDynamicLoading;                                   // 0x0023(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServer;                                           // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerDefaultLoad;                                // 0x0025(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UStreamingLayer>            LayerClass;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStreamingLayerDesc;

// ScriptStruct OpenWorldStreaming.StreamingLayerSwitch
// 0x0018 (0x0018 - 0x0000)
struct FStreamingLayerSwitch final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Layers;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStreamingLayerSwitch;

// ScriptStruct OpenWorldStreaming.StreamingConfigOverrideValues
// 0x0018 (0x0018 - 0x0000)
struct FStreamingConfigOverrideValues final
{
public:
	class FString                                 Parameter;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StreamingPriority;                                 // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStreamingConfigOverrideValues;

// ScriptStruct OpenWorldStreaming.StreamingConfigOverride
// 0x0010 (0x0010 - 0x0000)
struct FStreamingConfigOverride final
{
public:
	TArray<struct FStreamingConfigOverrideValues> LevelOfConfigs;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStreamingConfigOverride;

// ScriptStruct OpenWorldStreaming.CustomDisableLayerSetting
// 0x0020 (0x0020 - 0x0000)
struct FCustomDisableLayerSetting final
{
public:
	class FString                                 CVarInfo;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           DisableLayerNames;                                 // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCustomDisableLayerSetting;

// ScriptStruct OpenWorldStreaming.StreamingLevelInfo
// 0x0020 (0x0020 - 0x0000)
struct FStreamingLevelInfo final
{
public:
