#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Paper2D

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Paper2D_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Paper2D.MaterialExpressionSpriteTextureSampler
// 0x0020 (0x0118 - 0x00F8)
class UMaterialExpressionSpriteTextureSampler final : public UMaterialExpressionTextureSampleParameter2D
{
public:
	bool                                          bSampleAdditionalTextures;                         // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AdditionalSlotIndex;                               // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   SlotDisplayName;                                   // 0x0100(0x0018)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionSpriteTextureSampler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionSpriteTextureSampler")
	}
	static class UMaterialExpressionSpriteTextureSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionSpriteTextureSampler>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionSpriteTextureSampler;

// Class Paper2D.PaperCharacter
// 0x0000 (0x0790 - 0x0790)
class APaperCharacter final : public ACHARACTER
{
public:
	class UPaperFlipbookComponent*                Sprite;                                            // 0x0788(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperCharacter")
	}
	static class APaperCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaperCharacter>();
	}
};
DUMPER7_ASSERTS_APaperCharacter;

// Class Paper2D.PaperFlipbook
// 0x0028 (0x0050 - 0x0028)
class UPaperFlipbook final : public UObject
{
public:
	float                                         FramesPerSecond;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPaperFlipbookKeyFrame>         KeyFrames;                                         // 0x0030(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultMaterial;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFlipbookCollisionMode                        CollisionSource;                                   // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetKeyFrameIndexAtTime(float Time, bool bClampToEnds) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514530
	int32 GetNumFrames() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1415147E0
	int32 GetNumKeyFrames() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514810
	class UPaperSprite* GetSpriteAtFrame(int32 FrameIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1415148C0
	class UPaperSprite* GetSpriteAtTime(float Time, bool bClampToEnds) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514950
	float GetTotalDuration() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141515170
	bool IsValidKeyFrameIndex(int32 Index_0) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141515230

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperFlipbook")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperFlipbook")
	}
	static class UPaperFlipbook* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperFlipbook>();
	}
};
DUMPER7_ASSERTS_UPaperFlipbook;

// Class Paper2D.PaperFlipbookActor
// 0x0008 (0x0378 - 0x0370)
class APaperFlipbookActor final : public AActor
{
public:
	class UPaperFlipbookComponent*                RenderComponent;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperFlipbookActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperFlipbookActor")
	}
	static class APaperFlipbookActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaperFlipbookActor>();
	}
};
DUMPER7_ASSERTS_APaperFlipbookActor;

// Class Paper2D.PaperFlipbookComponent
// 0x0040 (0x0740 - 0x0700)
class UPaperFlipbookComponent final : public UMeshComponent
{
public:
	class UPaperFlipbook*                         SourceFlipbook;                                    // 0x06F8(0x0008)(Edit, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     Material;                                          // 0x0700(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PlayRate;                                          // 0x0708(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bLooping : 1;                                      // 0x070C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bReversePlayback : 1;                              // 0x070C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPlaying : 1;                                      // 0x070C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_70D[0x3];                                      // 0x070D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AccumulatedTime;                                   // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CachedFrameIndex;                                  // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           SpriteColor;                                       // 0x0718(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBodySetup*                             CachedBodySetup;                                   // 0x0728(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnFinishedPlaying;                                 // 0x0730(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	class UPaperFlipbook* GetFlipbook(); // (Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1415142E0
	void OnRep_SourceFlipbook(class UPaperFlipbook* OldFlipbook); // (Final, Native, Protected) // @ 0x141515630
	void Play(); // (Final, Native, Public, BlueprintCallable) // @ 0x1415156E0
	void PlayFromStart(); // (Final, Native, Public, BlueprintCallable) // @ 0x141515700
	void Reverse(); // (Final, Native, Public, BlueprintCallable) // @ 0x1415158A0
	void ReverseFromEnd(); // (Final, Native, Public, BlueprintCallable) // @ 0x1415158C0
	bool SetFlipbook(class UPaperFlipbook* NewFlipbook); // (Native, Public, BlueprintCallable) // @ 0x1415159B0
	void SetLooping(bool bNewLooping); // (Final, Native, Public, BlueprintCallable) // @ 0x141515D40
	void SetNewTime(float NewTime); // (Final, Native, Public, BlueprintCallable) // @ 0x141515DD0
	void SetPlaybackPosition(float NewPosition, bool bFireEvents); // (Final, Native, Public, BlueprintCallable) // @ 0x141515ED0
	void SetPlaybackPositionInFrames(int32 NewFramePosition, bool bFireEvents); // (Final, Native, Public, BlueprintCallable) // @ 0x141515FA0
	void SetPlayRate(float NewRate); // (Final, Native, Public, BlueprintCallable) // @ 0x141515E50
	void SetSpriteColor(const struct FLinearColor& NewColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x141516060
	void Stop(); // (Final, Native, Public, BlueprintCallable) // @ 0x141516450

	float GetFlipbookFramerate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514310
	float GetFlipbookLength() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514340
	int32 GetFlipbookLengthInFrames() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514370
	float GetPlaybackPosition() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514860
	int32 GetPlaybackPositionInFrames() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514890
	float GetPlayRate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514830
	bool IsLooping() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1415151A0
	bool IsPlaying() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1415151D0
	bool IsReversing() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141515200

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperFlipbookComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperFlipbookComponent")
	}
	static class UPaperFlipbookComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperFlipbookComponent>();
	}
};
DUMPER7_ASSERTS_UPaperFlipbookComponent;

// Class Paper2D.PaperGroupedSpriteActor
// 0x0008 (0x0378 - 0x0370)
class APaperGroupedSpriteActor final : public AActor
{
public:
	class UPaperGroupedSpriteComponent*           RenderComponent;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperGroupedSpriteActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperGroupedSpriteActor")
	}
	static class APaperGroupedSpriteActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaperGroupedSpriteActor>();
	}
};
DUMPER7_ASSERTS_APaperGroupedSpriteActor;

// Class Paper2D.PaperGroupedSpriteComponent
// 0x0030 (0x0730 - 0x0700)
class UPaperGroupedSpriteComponent final : public UMeshComponent
{
public:
	TArray<class UMaterialInterface*>             InstanceMaterials;                                 // 0x06F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSpriteInstanceData>            PerInstanceSpriteData;                             // 0x0708(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_718[0x18];                                     // 0x0718(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddInstance(const struct FTransform& Transform, class UPaperSprite* Sprite, bool bWorldSpace, const struct FLinearColor& Color); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141513D00
	void ClearInstances(); // (Native, Public, BlueprintCallable) // @ 0x141514110
	bool RemoveInstance(int32 InstanceIndex); // (Native, Public, BlueprintCallable) // @ 0x141515740
	void SortInstancesAlongAxis(const struct FVector& WorldSpaceSortAxis); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1415163C0
	bool UpdateInstanceColor(int32 InstanceIndex, const struct FLinearColor& NewInstanceColor, bool bMarkRenderStateDirty); // (Native, Public, HasDefaults, BlueprintCallable) // @ 0x141516470
	bool UpdateInstanceTransform(int32 InstanceIndex, const struct FTransform& NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // (Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141516580

	int32 GetInstanceCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1415143A0
	bool GetInstanceTransform(int32 InstanceIndex, struct FTransform* OutInstanceTransform, bool bWorldSpace) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x1415143D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperGroupedSpriteComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperGroupedSpriteComponent")
	}
	static class UPaperGroupedSpriteComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperGroupedSpriteComponent>();
	}
};
DUMPER7_ASSERTS_UPaperGroupedSpriteComponent;

// Class Paper2D.PaperRuntimeSettings
// 0x0008 (0x0030 - 0x0028)
class UPaperRuntimeSettings final : public UObject
{
public:
	bool                                          bEnableSpriteAtlasGroups;                          // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTerrainSplineEditing;                       // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResizeSpriteDataToMatchTextures;                  // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperRuntimeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperRuntimeSettings")
	}
	static class UPaperRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperRuntimeSettings>();
	}
};
DUMPER7_ASSERTS_UPaperRuntimeSettings;

// Class Paper2D.PaperSprite
// 0x0088 (0x00B0 - 0x0028)
class UPaperSprite final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture*>                       AdditionalSourceTextures;                          // 0x0038(0x0010)(Edit, ZeroConstructor, AssetRegistrySearchable, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              BakedSourceUV;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              BakedSourceDimension;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             BakedSourceTexture;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     DefaultMaterial;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     AlternateMaterial;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FPaperSpriteSocket>             Sockets;                                           // 0x0078(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	ESpriteCollisionMode                          SpriteCollisionDomain;                             // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PixelsPerUnrealUnit;                               // 0x008C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBodySetup*                             BodySetup;                                         // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCanBeAddToCluster : 1;                            // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AlternateMaterialSplitIndex;                       // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       BakedRenderData;                                   // 0x00A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperSprite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperSprite")
	}
	static class UPaperSprite* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSprite>();
	}
};
DUMPER7_ASSERTS_UPaperSprite;

// Class Paper2D.PaperSpriteActor
// 0x0008 (0x0378 - 0x0370)
class APaperSpriteActor final : public AActor
{
public:
	class UPaperSpriteComponent*                  RenderComponent;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperSpriteActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperSpriteActor")
	}
	static class APaperSpriteActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaperSpriteActor>();
	}
};
DUMPER7_ASSERTS_APaperSpriteActor;

// Class Paper2D.PaperSpriteAtlas
// 0x0000 (0x0028 - 0x0028)
class UPaperSpriteAtlas final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperSpriteAtlas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperSpriteAtlas")
	}
	static class UPaperSpriteAtlas* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSpriteAtlas>();
	}
};
DUMPER7_ASSERTS_UPaperSpriteAtlas;

// Class Paper2D.PaperSpriteBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UPaperSpriteBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FSlateBrush MakeBrushFromSprite(class UPaperSprite* Sprite, int32 Width, int32 Height); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x1415152D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperSpriteBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperSpriteBlueprintLibrary")
	}
	static class UPaperSpriteBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSpriteBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UPaperSpriteBlueprintLibrary;

// Class Paper2D.PaperSpriteComponent
// 0x0020 (0x0720 - 0x0700)
class UPaperSpriteComponent final : public UMeshComponent
{
public:
	class UPaperSprite*                           SourceSprite;                                      // 0x06F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     MaterialOverride;                                  // 0x0700(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           SpriteColor;                                       // 0x0708(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPaperSprite* GetSprite(); // (Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1415142E0
	bool SetSprite(class UPaperSprite* NewSprite); // (Native, Public, BlueprintCallable) // @ 0x1415159B0
	void SetSpriteColor(const struct FLinearColor& NewColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1415160E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperSpriteComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperSpriteComponent")
	}
	static class UPaperSpriteComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperSpriteComponent>();
	}
};
DUMPER7_ASSERTS_UPaperSpriteComponent;

// Class Paper2D.PaperTerrainActor
// 0x0018 (0x0388 - 0x0370)
class APaperTerrainActor final : public AActor
{
public:
	class USceneComponent*                        DummyRoot;                                         // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperTerrainSplineComponent*           SplineComponent;                                   // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperTerrainComponent*                 RenderComponent;                                   // 0x0380(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTerrainActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTerrainActor")
	}
	static class APaperTerrainActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaperTerrainActor>();
	}
};
DUMPER7_ASSERTS_APaperTerrainActor;

// Class Paper2D.PaperTerrainComponent
// 0x0050 (0x05E0 - 0x0590)
class UPaperTerrainComponent final : public UPrimitiveComponent
{
public:
	class UPaperTerrainMaterial*                  TerrainMaterial;                                   // 0x0588(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosedSpline;                                     // 0x0590(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFilledSpline;                                     // 0x0591(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperTerrainSplineComponent*           AssociatedSpline;                                  // 0x0598(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RandomSeed;                                        // 0x05A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SegmentOverlapAmount;                              // 0x05A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TerrainColor;                                      // 0x05A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ReparamStepsPerSegment;                            // 0x05B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpriteCollisionMode                          SpriteCollisionDomain;                             // 0x05BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CollisionThickness;                                // 0x05C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBodySetup*                             CachedBodySetup;                                   // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D0[0x10];                                     // 0x05D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTerrainColor(const struct FLinearColor& NewColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x141516160

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTerrainComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTerrainComponent")
	}
	static class UPaperTerrainComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperTerrainComponent>();
	}
};
DUMPER7_ASSERTS_UPaperTerrainComponent;

// Class Paper2D.PaperTerrainMaterial
// 0x0018 (0x0048 - 0x0030)
class UPaperTerrainMaterial final : public UDataAsset
{
public:
	TArray<struct FPaperTerrainMaterialRule>      Rules;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UPaperSprite*                           InteriorFill;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTerrainMaterial")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTerrainMaterial")
	}
	static class UPaperTerrainMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperTerrainMaterial>();
	}
};
DUMPER7_ASSERTS_UPaperTerrainMaterial;

// Class Paper2D.PaperTerrainSplineComponent
// 0x0010 (0x0690 - 0x0680)
class UPaperTerrainSplineComponent final : public USplineComponent
{
public:
	uint8                                         Pad_678[0x18];                                     // 0x0678(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTerrainSplineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTerrainSplineComponent")
	}
	static class UPaperTerrainSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperTerrainSplineComponent>();
	}
};
DUMPER7_ASSERTS_UPaperTerrainSplineComponent;

// Class Paper2D.PaperTileLayer
// 0x0070 (0x0098 - 0x0028)
class UPaperTileLayer final : public UObject
{
public:
	class FText                                   LayerName;                                         // 0x0028(0x0018)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         LayerWidth;                                        // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         LayerHeight;                                       // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bHiddenInGame : 1;                                 // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bLayerCollides : 1;                                // 0x0048(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bOverrideCollisionThickness : 1;                   // 0x0048(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bOverrideCollisionOffset : 1;                      // 0x0048(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CollisionThicknessOverride;                        // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CollisionOffsetOverride;                           // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           LayerColor;                                        // 0x0054(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AllocatedWidth;                                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AllocatedHeight;                                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPaperTileInfo>                 AllocatedCells;                                    // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UPaperTileSet*                          TileSet;                                           // 0x0080(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int32>                                 AllocatedGrid;                                     // 0x0088(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTileLayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTileLayer")
	}
	static class UPaperTileLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperTileLayer>();
	}
};
DUMPER7_ASSERTS_UPaperTileLayer;

// Class Paper2D.PaperTileMap
// 0x0080 (0x00A8 - 0x0028)
class UPaperTileMap final : public UObject
{
public:
	int32                                         MapWidth;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MapHeight;                                         // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TileWidth;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TileHeight;                                        // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PixelsPerUnrealUnit;                               // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SeparationPerTileX;                                // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SeparationPerTileY;                                // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SeparationPerLayer;                                // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UPaperTileSet>           SelectedTileSet;                                   // 0x0048(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPaperTileLayer*>                TileLayers;                                        // 0x0078(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         CollisionThickness;                                // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpriteCollisionMode                          SpriteCollisionDomain;                             // 0x008C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETileMapProjectionMode                        ProjectionMode;                                    // 0x008D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HexSideLength;                                     // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBodySetup*                             BodySetup;                                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerNameIndex;                                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTileMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTileMap")
	}
	static class UPaperTileMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperTileMap>();
	}
};
DUMPER7_ASSERTS_UPaperTileMap;

// Class Paper2D.PaperTileMapActor
// 0x0008 (0x0378 - 0x0370)
class APaperTileMapActor final : public AActor
{
public:
	class UPaperTileMapComponent*                 RenderComponent;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTileMapActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTileMapActor")
	}
	static class APaperTileMapActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APaperTileMapActor>();
	}
};
DUMPER7_ASSERTS_APaperTileMapActor;

// Class Paper2D.PaperTileMapComponent
// 0x0050 (0x0750 - 0x0700)
class UPaperTileMapComponent final : public UMeshComponent
{
public:
	int32                                         MapWidth;                                          // 0x06F8(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MapHeight;                                         // 0x06FC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TileWidth;                                         // 0x0700(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TileHeight;                                        // 0x0704(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPaperTileSet*                          DefaultLayerTileSet;                               // 0x0708(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     Material;                                          // 0x0710(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPaperTileLayer*>                TileLayers;                                        // 0x0718(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	struct FLinearColor                           TileMapColor;                                      // 0x0728(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         UseSingleLayerIndex;                               // 0x0738(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseSingleLayer;                                   // 0x073C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_73D[0x3];                                      // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperTileMap*                          TileMap;                                           // 0x0740(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_748[0x8];                                      // 0x0748(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPaperTileLayer* AddNewLayer(); // (Final, Native, Public, BlueprintCallable) // @ 0x141513EC0
	void CreateNewTileMap(int32 MapWidth_0, int32 MapHeight_0, int32 TileWidth_0, int32 TileHeight_0, float PixelsPerUnrealUnit, bool bCreateLayer); // (Final, Native, Public, BlueprintCallable) // @ 0x141514130
	void GetMapSize(int32* MapWidth_0, int32* MapHeight_0, int32* NumLayers); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1415146A0
	void MakeTileMapEditable(); // (Final, Native, Public, BlueprintCallable) // @ 0x141515610
	void RebuildCollision(); // (Final, Native, Public, BlueprintCallable) // @ 0x141515720
	void ResizeMap(int32 NewWidthInTiles, int32 NewHeightInTiles); // (Final, Native, Public, BlueprintCallable) // @ 0x1415157E0
	void SetDefaultCollisionThickness(float Thickness, bool bRebuildCollision); // (Final, Native, Public, BlueprintCallable) // @ 0x1415158E0
	void SetLayerCollision(int32 Layer, bool bHasCollision, bool bOverrideThickness, float CustomThickness, bool bOverrideOffset, float CustomOffset, bool bRebuildCollision); // (Final, Native, Public, BlueprintCallable) // @ 0x141515A50
	void SetLayerColor(const struct FLinearColor& NewColor, int32 Layer); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x141515C70
	void SetTile(int32 X, int32 Y, int32 Layer, const struct FPaperTileInfo& NewValue); // (Final, Native, Public, BlueprintCallable) // @ 0x1415161E0
	bool SetTileMap(class UPaperTileMap* NewTileMap); // (Native, Public, BlueprintCallable) // @ 0x1415159B0
	void SetTileMapColor(const struct FLinearColor& NewColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x141516340

	struct FLinearColor GetLayerColor(int32 Layer) const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x141514600
	struct FPaperTileInfo GetTile(int32 X, int32 Y, int32 Layer) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141514A20
	struct FVector GetTileCenterPosition(int32 TileX, int32 TileY, int32 LayerIndex, bool bWorldSpace) const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x141514B30
	struct FVector GetTileCornerPosition(int32 TileX, int32 TileY, int32 LayerIndex, bool bWorldSpace) const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x141514C90
	struct FLinearColor GetTileMapColor() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x141514DF0
	void GetTilePolygon(int32 TileX, int32 TileY, TArray<struct FVector>* Points, int32 LayerIndex, bool bWorldSpace) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x141514E30
	bool OwnsTileMap() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1415156B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTileMapComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTileMapComponent")
	}
	static class UPaperTileMapComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperTileMapComponent>();
	}
};
DUMPER7_ASSERTS_UPaperTileMapComponent;

// Class Paper2D.PaperTileSet
// 0x0080 (0x00A8 - 0x0028)
class UPaperTileSet final : public UObject
{
public:
	struct FIntPoint                              TileSize;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             TileSheet;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UTexture*>                       AdditionalSourceTextures;                          // 0x0038(0x0010)(Edit, ZeroConstructor, AssetRegistrySearchable, NativeAccessSpecifierPrivate)
	struct FIntMargin                             BorderMargin;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPrivate)
	struct FIntPoint                              PerTileSpacing;                                    // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntPoint                              DrawingOffset;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         WidthInTiles;                                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         HeightInTiles;                                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AllocatedWidth;                                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         AllocatedHeight;                                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FPaperTileMetadata>             PerTileData;                                       // 0x0078(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FPaperTileSetTerrain>           Terrains;                                          // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         TileWidth;                                         // 0x0098(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TileHeight;                                        // 0x009C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Margin;                                            // 0x00A0(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Spacing;                                           // 0x00A4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PaperTileSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PaperTileSet")
	}
	static class UPaperTileSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPaperTileSet>();
	}
};
DUMPER7_ASSERTS_UPaperTileSet;

// Class Paper2D.TileMapBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UTileMapBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void BreakTile(const struct FPaperTileInfo& Tile, int32* TileIndex, class UPaperTileSet** TileSet, bool* bFlipH, bool* bFlipV, bool* bFlipD); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141513EF0
