#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBDPhysics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// Enum PBDPhysics.EChainSAPGridNumMode
// NumValues: 0x0005
enum class EChainSAPGridNumMode : uint8
{
	None                                     = 0,
	Grid8                                    = 1,
	Grid12                                   = 2,
	Grid16                                   = 3,
	EChainSAPGridNumMode_MAX                 = 4,
};

// Enum PBDPhysics.EChainCollisionMode
// NumValues: 0x0004
enum class EChainCollisionMode : uint8
{
	None                                     = 0,
	Discrete                                 = 1,
	CCD                                      = 2,
	EChainCollisionMode_MAX                  = 3,
};

// Enum PBDPhysics.ELengthConstraintMode
// NumValues: 0x0004
enum class ELengthConstraintMode : uint8
{
	SimpleClamp                              = 0,
	LengthConstraint                         = 1,
	Custom                                   = 2,
	ELengthConstraintMode_MAX                = 3,
};

// Enum PBDPhysics.EWindType
// NumValues: 0x0004
enum class EWindType : uint8
{
	Wind_TriangleWave                        = 0,
	Wind_SinWave                             = 1,
	Wind_Custom                              = 2,
	Wind_MAX                                 = 3,
};

// ScriptStruct PBDPhysics.ConstraintInfoBase
// 0x0010 (0x0010 - 0x0000)
struct FConstraintInfoBase
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Stiffness;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            StrengthCurve;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConstraintInfoBase;

// ScriptStruct PBDPhysics.ChainVirtualParticleData
// 0x0010 (0x0010 - 0x0000)
struct FChainVirtualParticleData final
{
public:
	struct FVector                                Axis;                                              // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChainVirtualParticleData;

// ScriptStruct PBDPhysics.ChainVirtualParticleInfo
// 0x0018 (0x0018 - 0x0000)
struct FChainVirtualParticleInfo final
{
public:
	int32                                         VirtualParticleBetweenBone;                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChainVirtualParticleData>      VirtualParticleAttach;                             // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChainVirtualParticleInfo;

// ScriptStruct PBDPhysics.ChainBones
// 0x0068 (0x0068 - 0x0000)
struct FChainBones final
{
public:
	struct FBoneReference                         ChainHeadBone;                                     // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 ChainEndBones;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 CustomChainBones;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         DampScale;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RadiusScale;                                       // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindScale;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DummyBoneLocation;                                 // 0x003C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChainVirtualParticleInfo              VirtualParticleInfo;                               // 0x0048(0x0018)(Edit, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FChainBones;

// ScriptStruct PBDPhysics.ChainVirtualParticleConnectInfo
// 0x0020 (0x0020 - 0x0000)
struct FChainVirtualParticleConnectInfo final
{
public:
	int32                                         ChainBoneRootIndex1;                               // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChainBoneRootIndex2;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualParticleBetweenBone;                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RadiusScale;                                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ExcludeConnectIndex;                               // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChainVirtualParticleConnectInfo;

// ScriptStruct PBDPhysics.CollisionInfoBase
// 0x0010 (0x0010 - 0x0000)
struct FCollisionInfoBase
{
public:
	struct FVector                                TranslationOffset;                                 // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCollisionInfoBase;

// ScriptStruct PBDPhysics.PlaneCollisionInfoBase
// 0x0010 (0x0020 - 0x0010)
struct FPlaneCollisionInfoBase : public FCollisionInfoBase
{
public:
	struct FAxis                                  LocalNormal;                                       // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlaneCollisionInfoBase;

// ScriptStruct PBDPhysics.PlaneCollisionInfo
// 0x0020 (0x0040 - 0x0020)
struct FPlaneCollisionInfo final : public FPlaneCollisionInfoBase
{
public:
	struct FBoneReference                         AttachedBone;                                      // 0x0020(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 IgnoredBones;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPlaneCollisionInfo;

// ScriptStruct PBDPhysics.ExternalFixedLocation
// 0x0014 (0x0014 - 0x0000)
struct FExternalFixedLocation final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FixedLocation;                                     // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExternalFixedLocation;

// ScriptStruct PBDPhysics.PoseSphereConstraintInfo
// 0x0008 (0x0018 - 0x0010)
struct FPoseSphereConstraintInfo final : public FConstraintInfoBase
{
public:
	float                                         radius;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPoseSphereConstraintInfo;

// ScriptStruct PBDPhysics.AngleConstraintInfo
// 0x0010 (0x0020 - 0x0010)
struct FAngleConstraintInfo final : public FConstraintInfoBase
{
public:
	float                                         AngleLimit;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConstraintAxisWeight;                              // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxis                                         ConstraintAxis;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAngleConstraintInfo;

// ScriptStruct PBDPhysics.EulerAngleConstraintInfo
// 0x0010 (0x0020 - 0x0010)
struct FEulerAngleConstraintInfo final : public FConstraintInfoBase
{
public:
	struct FRotator                               EulerAngleLimit;                                   // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEulerAngleConstraintInfo;

// ScriptStruct PBDPhysics.BonePair
// 0x0020 (0x0020 - 0x0000)
struct FBonePair final
{
public:
	struct FBoneReference                         FirstBone;                                         // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         SecondBone;                                        // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBonePair;

// ScriptStruct PBDPhysics.ShearConstraintInfo
// 0x0018 (0x0028 - 0x0010)
struct FShearConstraintInfo final : public FConstraintInfoBase
{
public:
	bool                                          bShearLoopConstraint;                              // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBonePair>                      ShearBonePairs;                                    // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShearConstraintInfo;

// ScriptStruct PBDPhysics.ParticleExternalRadialForceInfo
// 0x0030 (0x0030 - 0x0000)
struct FParticleExternalRadialForceInfo final
{
public:
	TArray<struct FVector>                        ForceCentersWS;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ForceStrength;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ForceRadius;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FParticleExternalRadialForceInfo;

// ScriptStruct PBDPhysics.SphereCollisionInfoBase
// 0x0004 (0x0014 - 0x0010)
struct FSphereCollisionInfoBase : public FCollisionInfoBase
{
public:
	float                                         radius;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSphereCollisionInfoBase;

// ScriptStruct PBDPhysics.SphereCollisionInfo
// 0x0024 (0x0038 - 0x0014)
struct FSphereCollisionInfo final : public FSphereCollisionInfoBase
{
public:
	struct FBoneReference                         AttachedBone;                                      // 0x0014(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoneReference>                 IgnoredBones;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSphereCollisionInfo;

// ScriptStruct PBDPhysics.CapsuleCollisionBonePair
// 0x0020 (0x0020 - 0x0000)
struct FCapsuleCollisionBonePair final
{
public:
	struct FBoneReference                         FirstBone;                                         // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         SecondBone;                                        // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCapsuleCollisionBonePair;

// ScriptStruct PBDPhysics.CapsuleCollisionInfoBase
// 0x0020 (0x0030 - 0x0010)
struct FCapsuleCollisionInfoBase : public FCollisionInfoBase
{
public:
	float                                         radius;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDiffRadius;                                 // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius1;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HalfHeight;                                        // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAxis                                  LocalAxis;                                         // 0x0020(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCapsuleCollisionInfoBase;

// ScriptStruct PBDPhysics.CapsuleCollisionInfo
// 0x0040 (0x0070 - 0x0030)
struct FCapsuleCollisionInfo final : public FCapsuleCollisionInfoBase
{
public:
	struct FCapsuleCollisionBonePair              PairBone;                                          // 0x0030(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         AttachedBone;                                      // 0x0050(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 IgnoredBones;                                      // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCapsuleCollisionInfo;

// ScriptStruct PBDPhysics.BoxCollisionInfoBase
// 0x000C (0x001C - 0x0010)
struct FBoxCollisionInfoBase : public FCollisionInfoBase
{
public:
	struct FVector                                BoxExtend;                                         // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoxCollisionInfoBase;

// ScriptStruct PBDPhysics.BoxCollisionInfo
// 0x0024 (0x0040 - 0x001C)
struct FBoxCollisionInfo final : public FBoxCollisionInfoBase
{
public:
	struct FBoneReference                         AttachedBone;                                      // 0x001C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoneReference>                 IgnoredBones;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBoxCollisionInfo;

// ScriptStruct PBDPhysics.OuterCapsuleCollisionInfo
// 0x0030 (0x0060 - 0x0030)
struct FOuterCapsuleCollisionInfo final : public FCapsuleCollisionInfoBase
{
public:
	class FName                                   Key;                                               // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationWS;                                        // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RotationWS;                                        // 0x0050(0x0010)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOuterCapsuleCollisionInfo;

// ScriptStruct PBDPhysics.OuterCapsuleCollisionInfos
// 0x0018 (0x0018 - 0x0000)
struct FOuterCapsuleCollisionInfos final
{
public:
	bool                                          bTriggerChange;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOuterCapsuleCollisionInfo>     OuterCapsuleCollisionInfos;                        // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOuterCapsuleCollisionInfos;

// ScriptStruct PBDPhysics.ParticlePhyAttrOverride
// 0x0018 (0x0018 - 0x0000)
struct FParticlePhyAttrOverride final
{
public:
	class FName                                   ParticleRelatedBoneName;                           // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideDampingValue;                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DampingValue;                                      // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideParticleRadiusValue;                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ParticleRadiusValue;                               // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FParticlePhyAttrOverride;

// ScriptStruct PBDPhysics.LengthConstraintPhyAttrOverride
// 0x001C (0x001C - 0x0000)
struct FLengthConstraintPhyAttrOverride final
{
public:
	class FName                                   ParentParticleRelatedBoneName;                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildParticleRelatedBoneName;                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideStiffnessValue;                            // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Stiffness;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ParentDominate;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLengthConstraintPhyAttrOverride;

// ScriptStruct PBDPhysics.LocalConstraintPhyAttrOverride
// 0x001C (0x001C - 0x0000)
struct FLocalConstraintPhyAttrOverride final
{
public:
	class FName                                   ParentParticleRelatedBoneName;                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChildParticleRelatedBoneName;                      // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideStiffnessValue;                            // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Stiffness;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ParentDominate;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLocalConstraintPhyAttrOverride;

// ScriptStruct PBDPhysics.GlobalConstraintPhyAttrOverride
// 0x0010 (0x0010 - 0x0000)
struct FGlobalConstraintPhyAttrOverride final
{
public:
	class FName                                   ChildParticleRelatedBoneName;                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideStiffnessValue;                            // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Stiffness;                                         // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGlobalConstraintPhyAttrOverride;

// ScriptStruct PBDPhysics.AnimNode_Chain
// 0x0708 (0x0810 - 0x0108)
struct FAnimNode_Chain final : public FAnimNode_SkeletalControlBase
{
public:
	bool                                          bToggleReset;                                      // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldRootFixed;                                  // 0x0109(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FChainBones>                    ChainBones;                                        // 0x0110(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoneReference>                 ChainFixedBones;                                   // 0x0120(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FChainVirtualParticleConnectInfo> VirtualParticleConnectInfo;                      // 0x0130(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FExternalFixedLocation>         ExternalFixedBoneLocations;                        // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUpdatePhysicsSettingsRuntime;                     // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetFrameRate;                                   // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GravityAcceleration;                               // 0x0158(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampFrameRateScaleWhenLargeThanTargetFrame;        // 0x0164(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EliminatePhantomVelocityScale;                     // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damp;                                              // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHighFPSOpt;                                 // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHighFPSOptVelocityInterp;                   // 0x0171(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VelocityInterpSpeed;                               // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RadiusSize;                                        // 0x0178(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxIntegrateVelocity;                              // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ParticleDampingCoefficientCurve;                   // 0x0180(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ParticleRadiusCurve;                               // 0x0188(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ComponentFrameRateScaleWhenLargeThanTargetFrame;   // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0xC];                                      // 0x0194(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OffsetTransform;                                   // 0x01A0(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseCustomComponentTransform;                      // 0x01D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D1[0xF];                                      // 0x01D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CustomComponentTransform;                          // 0x01E0(0x0030)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableComponentZOffset;                           // 0x0210(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ComponentMaxMoveValue;                             // 0x0214(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ComponentMoveInfluence;                            // 0x0218(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ComponentRotateInfluence;                          // 0x0224(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOriginRotation;                                // 0x0228(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SphapeConstraintFrameRateScaleWhenLargeThanTargetFrame; // 0x022C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPoseSphereConstraintInfo              PoseSphereConstraintInfo;                          // 0x0230(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAngleConstraintInfo                   PoseAngleConstraintInfo;                           // 0x0248(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FEulerAngleConstraintInfo              PoseEulerAngleConstraintInfo;                      // 0x0268(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FConstraintInfoBase                    LocalShapeConstraintInfo;                          // 0x0288(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FConstraintInfoBase                    GlobalShapeConstraintInfo;                         // 0x0298(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ELengthConstraintMode                         LengthConstraintMode;                              // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ChainLengthNeverChange;                            // 0x02A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LengthConstraintIteration;                         // 0x02AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FConstraintInfoBase                    StretchInfo;                                       // 0x02B0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FConstraintInfoBase                    BendInfo;                                          // 0x02C0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FShearConstraintInfo                   ShearInfo;                                         // 0x02D0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FConstraintInfoBase                    LRAInfo;                                           // 0x02F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEvaluateWindFromWindDirectionSource;              // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WindFromWindDirectionSourceScale;                  // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              WindFromWindDirectionSourceScaleRandRange;         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindScale;                                         // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WindDataIndex;                                     // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindDataIndexChangeSpeed;                          // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPBDChainWindConfig*                    WindDataConfig;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FParticleExternalRadialForceInfo       ExternalRadialForce;                               // 0x0330(0x0030)(Edit, NativeAccessSpecifierPublic)
	EChainCollisionMode                           CollisionType;                                     // 0x0360(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CollisionFriction;                                 // 0x0364(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionStrength;                                 // 0x0368(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChainSAPGridNumMode                          CollisionSAPGrid;                                  // 0x036C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CollisionSAPBoundsUpdateInterval;                  // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSphereCollisionInfo>           Spheres;                                           // 0x0378(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCapsuleCollisionInfo>          Capsules;                                          // 0x0388(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FBoxCollisionInfo>              Boxes;                                             // 0x0398(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPlaneCollisionInfo>            Planes;                                            // 0x03A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FOuterCapsuleCollisionInfos            OuterCapsuleCollisionInfos;                        // 0x03B8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class UPBDChainCollisionData*                 ConfigCollisionData;                               // 0x03D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDebugRuntimeDraw;                           // 0x03D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugLengthConstraintDrawSize;                     // 0x03DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLocalShapeConstraintDrawSize;                 // 0x03E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParticlePhyAttrOverride>       OverrideParticlePhysInfo;                          // 0x03E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLengthConstraintPhyAttrOverride> OverrideLengthConstraintPhysInfo;                // 0x03F8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLocalConstraintPhyAttrOverride> OverrideLocalConstraintPhysInfo;                  // 0x0408(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGlobalConstraintPhyAttrOverride> OverrideGlobalConstraintPhysInfo;                // 0x0418(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          NeedUpdateWhenMeshNotVisible;                      // 0x0428(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ChildSkeletonMeshContainName;                      // 0x042C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSubsteps;                                       // 0x0434(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPhysicsDeltaTime;                               // 0x0438(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxSimulateFrameRate;                              // 0x043C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExponentialScaleWhenLessThanOne;                   // 0x0440(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ForceLODLevel;                                     // 0x0444(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EChainCollisionMode>                   CollisionModeByLOD;                                // 0x0448(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bResetOnBecomingRelevant;                          // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_459[0x3B7];                                    // 0x0459(0x03B7)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNode_Chain;

// ScriptStruct PBDPhysics.ChainWindTurbulenceData
// 0x001C (0x001C - 0x0000)
struct FChainWindTurbulenceData final
{
public:
	float                                         Intensity1;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intensity2;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Frequency1;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Frequency2;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TBDir;                                             // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChainWindTurbulenceData;

// ScriptStruct PBDPhysics.CollisionBase
// 0x00F0 (0x00F0 - 0x0000)
struct alignas(0x10) FCollisionBase
{
public:
	uint8                                         Pad_0[0xF0];                                       // 0x0000(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCollisionBase;

// ScriptStruct PBDPhysics.BoxCollision
// 0x0060 (0x0150 - 0x00F0)
struct FBoxCollision final : public FCollisionBase
{
public:
	uint8                                         Pad_F0[0x60];                                      // 0x00F0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBoxCollision;

// ScriptStruct PBDPhysics.PlaneCollision
// 0x0010 (0x0100 - 0x00F0)
struct FPlaneCollision final : public FCollisionBase
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPlaneCollision;

// ScriptStruct PBDPhysics.CapsuleCollision
// 0x0150 (0x0240 - 0x00F0)
struct FCapsuleCollision final : public FCollisionBase
{
public:
	uint8                                         Pad_F0[0x150];                                     // 0x00F0(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCapsuleCollision;

// ScriptStruct PBDPhysics.CapsuleCollisionPreCache
// 0x0090 (0x0090 - 0x0000)
struct alignas(0x10) FCapsuleCollisionPreCache final
{
public:
	uint8                                         Pad_0[0x90];                                       // 0x0000(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCapsuleCollisionPreCache;

// ScriptStruct PBDPhysics.SphereCollision
// 0x0010 (0x0100 - 0x00F0)
struct FSphereCollision final : public FCollisionBase
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSphereCollision;

// ScriptStruct PBDPhysics.PredictCollisionContact
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FPredictCollisionContact final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPredictCollisionContact;

// ScriptStruct PBDPhysics.OutSideBoxCollisionInfo
// 0x0010 (0x002C - 0x001C)
struct FOutSideBoxCollisionInfo final : public FBoxCollisionInfoBase
{
public:
	class FName                                   AttachedBoneName;                                  // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachedSkeletalMeshName;                          // 0x0024(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutSideBoxCollisionInfo;

// ScriptStruct PBDPhysics.OutsidePlaneCollisionInfo
// 0x0010 (0x0030 - 0x0020)
struct FOutsidePlaneCollisionInfo final : public FPlaneCollisionInfoBase
{
public:
	class FName                                   AttachedBoneName;                                  // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachedSkeletalMeshName;                          // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutsidePlaneCollisionInfo;

// ScriptStruct PBDPhysics.OutsideCapsuleCollisionInfo
// 0x0020 (0x0050 - 0x0030)
struct FOutsideCapsuleCollisionInfo final : public FCapsuleCollisionInfoBase
{
public:
	class FName                                   AttachedBoneName;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachedPairBoneFirstName;                         // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachedPairBoneSecondName;                        // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachedSkeletalMeshName;                          // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutsideCapsuleCollisionInfo;

// ScriptStruct PBDPhysics.OutSideSphereCollisionInfo
// 0x0010 (0x0024 - 0x0014)
struct FOutSideSphereCollisionInfo final : public FSphereCollisionInfoBase
{
public:
	class FName                                   AttachedBoneName;                                  // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachedSkeletalMeshName;                          // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOutSideSphereCollisionInfo;

}

