#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerfGear

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum PerfGear.EPerfGearQualityLevel
// NumValues: 0x000D
enum class EPerfGearQualityLevel : uint8
{
	EQuality_VeryLow                         = 0,
	EQuality_Low                             = 1,
	EQuality_Medium                          = 2,
	EQuality_High                            = 3,
	EQuality_VeryHigh                        = 4,
	EQuality_TotalNum                        = 5,
	EQuality_Custom90                        = 6,
	EQuality_Custom120                       = 7,
	EQuality_Custom144                       = 8,
	EQuality_CustomQuality1                  = 9,
	EQuality_Custom165                       = 10,
	EQuality_CustomTotal                     = 11,
	EQuality_MAX                             = 12,
};

// Enum PerfGear.ELowFpsOP
// NumValues: 0x0003
enum class ELowFpsOP : uint8
{
	EHighToLow                               = 0,
	ELowToHigh                               = 1,
	ELowFpsOP_MAX                            = 2,
};

// Enum PerfGear.EFXQualityLevel
// NumValues: 0x0006
enum class EFXQualityLevel : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Middle                                   = 2,
	High                                     = 3,
	Num                                      = 4,
	EFXQualityLevel_MAX                      = 5,
};

// Enum PerfGear.EPerfGearRHIType
// NumValues: 0x0005
enum class EPerfGearRHIType : uint8
{
	Unknow                                   = 0,
	Metal                                    = 3,
	Vulkan                                   = 4,
	OpenGLES                                 = 5,
	EPerfGearRHIType_MAX                     = 6,
};

// Enum PerfGear.EPerfGearCompareType
// NumValues: 0x0007
enum class EPerfGearCompareType : uint8
{
	EQUAL                                    = 0,
	NOT_EQUAL                                = 1,
	LESS                                     = 2,
	GREATER                                  = 3,
	LESS_OR_EQUALTO                          = 4,
	GREATER_OR_EQUALTO                       = 5,
	EPerfGearCompareType_MAX                 = 6,
};

// Enum PerfGear.EPerfGearLogicType
// NumValues: 0x0003
enum class EPerfGearLogicType : uint8
{
	LOGICTYPE_OR                             = 0,
	LOGICTYPE_AND                            = 1,
	LOGICTYPE_MAX                            = 2,
};

// Enum PerfGear.EPerfGearInternalLevel
// NumValues: 0x000D
enum class EPerfGearInternalLevel : uint8
{
	ELevel1                                  = 0,
	ELevel2                                  = 1,
	ELevel3                                  = 2,
	ELevel4                                  = 3,
	ELevel5                                  = 4,
	ELevel6                                  = 5,
	ELevel_TotalNum                          = 6,
	ELevelCustom90                           = 7,
	ELevelCustom120                          = 8,
	ELevelCustom144                          = 9,
	ELevelCustom165                          = 10,
	ELevel_CustomTotal                       = 11,
	EPerfGearInternalLevel_MAX               = 12,
};

// Enum PerfGear.ESwitchStatus
// NumValues: 0x0003
enum class ESwitchStatus : uint8
{
	ESwitchStatus_OFF                        = 0,
	ESwitchStatus_ON                         = 1,
	ESwitchStatus_MAX                        = 2,
};

// Enum PerfGear.EModeSwitchType
// NumValues: 0x0003
enum class EModeSwitchType : uint8
{
	ESwitchOffCustom                         = 0,
	ESwitchOverride                          = 1,
	EModeSwitchType_MAX                      = 2,
};

// Enum PerfGear.ERHIType
// NumValues: 0x0007
enum class ERHIType : uint8
{
	Unknown                                  = 0,
	D3D11                                    = 1,
	D3D12                                    = 2,
	Metal                                    = 3,
	Vulkan                                   = 4,
	OpenGLES                                 = 5,
	ERHIType_MAX                             = 6,
};

// Enum PerfGear.ELowFpsType
// NumValues: 0x0007
enum class ELowFpsType : uint8
{
	EUI                                      = 0,
	ECUTSCENE                                = 1,
	EIMPENDINGDEATH                          = 2,
	EDEATH                                   = 3,
	ERedeploy                                = 4,
	ESetting                                 = 5,
	ELowFpsType_MAX                          = 6,
};

// Enum PerfGear.EBlackVarType
// NumValues: 0x0003
enum class EBlackVarType : uint8
{
	EBV_ALLLEVEL                             = 0,
	EBV_SUBLEVEL                             = 1,
	EBV_MAX                                  = 2,
};

// Enum PerfGear.EBlackVarPriority
// NumValues: 0x0003
enum class EBlackVarPriority : uint8
{
	EBLACK_HIGHEST                           = 0,
	EBLACK_UNDER_SWITCH                      = 1,
	EBLACK_MAX                               = 2,
};

// Enum PerfGear.ELowMemoryFeatureExecuteFlag
// NumValues: 0x0003
enum class ELowMemoryFeatureExecuteFlag : uint8
{
	OVERRIDE                                 = 0,
	NEW                                      = 1,
	ELowMemoryFeatureExecuteFlag_MAX         = 2,
};

// Enum PerfGear.EOpenHarmonyPadSizeType
// NumValues: 0x0004
enum class EOpenHarmonyPadSizeType : uint8
{
	PADSIZE_SMALL                            = 0,
	PADSIZE_MID                              = 1,
	PADSIZE_BIG                              = 2,
	PADSIZE_MAX                              = 3,
};

// Enum PerfGear.EAndroidPadSizeType
// NumValues: 0x0004
enum class EAndroidPadSizeType : uint8
{
	PADSIZE_SMALL                            = 0,
	PADSIZE_MID                              = 1,
	PADSIZE_BIG                              = 2,
	PADSIZE_MAX                              = 3,
};

// Enum PerfGear.EDeviceMemoryType
// NumValues: 0x0005
enum class EDeviceMemoryType : uint8
{
	MEMORY_NORMAL                            = 0,
	MEMORY_LOW                               = 1,
	MEMORY_VERYLOW                           = 2,
	MEMORY_UNKNOWN                           = 3,
	MEMORY_MAX                               = 4,
};

// Enum PerfGear.EQaulityFpsStatus
// NumValues: 0x0004
enum class EQaulityFpsStatus : uint8
{
	ENABLE                                   = 0,
	DISABLE                                  = 1,
	UNSUPPORT                                = 2,
	EQaulityFpsStatus_MAX                    = 3,
};

// ScriptStruct PerfGear.PerfGearVersion
// 0x000C (0x000C - 0x0000)
struct FPerfGearVersion final
{
public:
	int32                                         MajorVersion;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinorVersion;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PatchVersion;                                      // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearVersion;

// ScriptStruct PerfGear.PerfGearCompareVersion
// 0x0010 (0x0010 - 0x0000)
struct FPerfGearCompareVersion final
{
public:
	EPerfGearLogicType                            LogcType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearCompareType                          CompareType;                                       // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPerfGearVersion                       Version;                                           // 0x0004(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearCompareVersion;

// ScriptStruct PerfGear.FXInstanceParams
// 0x0020 (0x0020 - 0x0000)
struct FFXInstanceParams final
{
public:
	TArray<struct FParticleSysParam>              ParticleParams;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EPSCPoolMethod                                PoolingMethod;                                     // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideLod;                                      // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TranslucencySortPriority;                          // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EParticleSystemLODMethod                      LODMethod;                                         // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFXInstanceParams;

// ScriptStruct PerfGear.FXInstance
// 0x0048 (0x0048 - 0x0000)
struct FFXInstance final
{
public:
	TSoftObjectPtr<class UParticleSystem>         Template;                                          // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFXInstanceParams                      InstanceParams;                                    // 0x0028(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFXInstance;

// ScriptStruct PerfGear.EffectTODDataRow
// 0x0028 (0x0030 - 0x0008)
struct FEffectTODDataRow final : public FTableRowBase
{
public:
	class FString                                 WeatherDesc;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WeatherType;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TODIDs;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEffectTODDataRow;

// ScriptStruct PerfGear.PerfGearCompareMemory
// 0x0008 (0x0008 - 0x0000)
struct FPerfGearCompareMemory final
{
public:
	EPerfGearLogicType                            LogcType;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearCompareType                          CompareType;                                       // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MemoryInGB;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearCompareMemory;

// ScriptStruct PerfGear.PerfGearConsoleCommand
// 0x0020 (0x0020 - 0x0000)
struct FPerfGearConsoleCommand final
{
public:
	class FString                                 ConsoleName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConsoleValue;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearConsoleCommand;

// ScriptStruct PerfGear.PerfGearConsoleItem
// 0x0080 (0x0080 - 0x0000)
struct FPerfGearConsoleItem final
{
public:
	class FString                                 ConsoleItemName;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UltraLowValue;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LowValue;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MidValue;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HighValue;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UltraHighValue;                                    // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SuperValue;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ModeNames;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearConsoleItem;

// ScriptStruct PerfGear.IOSPerfGearBlackListStructure
// 0x0050 (0x0058 - 0x0008)
struct FIOSPerfGearBlackListStructure final : public FTableRowBase
{
public:
	class FString                                 DeviceName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearCompareVersion>        CompareVersions;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearCompareMemory>         CompareMemory;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearConsoleCommand>        ConsoleList;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearConsoleItem>           PerfgearConsoleItems;                              // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FIOSPerfGearBlackListStructure;

// ScriptStruct PerfGear.OpenHarmonyPerfGearBlackListStructure
// 0x0078 (0x0080 - 0x0008)
struct FOpenHarmonyPerfGearBlackListStructure final : public FTableRowBase
{
public:
	class FString                                 GPUName;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearRHIType                              RHIType;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPerfGearCompareVersion>        CompareVersions;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearCompareMemory>         CompareMemory;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearCompareVersion>        CompareDriverVersions;                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearConsoleCommand>        ConsoleList;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearConsoleItem>           PerfgearConsoleItems;                              // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenHarmonyPerfGearBlackListStructure;

// ScriptStruct PerfGear.AndroidPerfGearBlackListStructure
// 0x0078 (0x0080 - 0x0008)
struct FAndroidPerfGearBlackListStructure final : public FTableRowBase
{
public:
	class FString                                 GPUName;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearRHIType                              RHIType;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPerfGearCompareVersion>        CompareVersions;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearCompareMemory>         CompareMemory;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearCompareVersion>        CompareDriverVersions;                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearConsoleCommand>        ConsoleList;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearConsoleItem>           PerfgearConsoleItems;                              // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAndroidPerfGearBlackListStructure;

// ScriptStruct PerfGear.PerfGearDefaultQualityAndFPS
// 0x0002 (0x0002 - 0x0000)
struct FPerfGearDefaultQualityAndFPS final
{
public:
	EPerfGearQualityLevel                         DefaultQualityLevel;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         DefaultFPSLevel;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearDefaultQualityAndFPS;

// ScriptStruct PerfGear.PerfGearDefaultQualityAndFPSStructure
// 0x0028 (0x0030 - 0x0008)
struct FPerfGearDefaultQualityAndFPSStructure final : public FTableRowBase
{
public:
	struct FPerfGearDefaultQualityAndFPS          DefaultQualityAndFPS;                              // 0x0008(0x0002)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DeviceNames;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         GPUNames;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearDefaultQualityAndFPSStructure;

// ScriptStruct PerfGear.PerfGearFeatureData
// 0x00C0 (0x00C0 - 0x0000)
struct FPerfGearFeatureData final
{
public:
	int32                                         DefaultQualityLevel;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultFPSLevel;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxQualityLevel;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SuperQualityFPS;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityVeryHighFPS;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityHighFPS;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityMediumFPS;                                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityLowFPS;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityVeryLowFPS;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MSAACount;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BackBufferResoution;                               // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualitySuperResolution;                            // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityVeryHighResolution;                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityHighResolution;                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityMediumResolution;                           // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityLowResolution;                              // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityVeryLowResolution;                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualitySuperFSR;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityVeryHighFSR;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityHighFSR;                                    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityMediumpFSR;                                 // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityLowFSR;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QualityVeryLowFSR;                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VRSDrawcall;                                       // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VRSMask;                                           // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VRRM;                                              // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LowMemoryDeviceType;                               // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            DeviceConsoleList;                                 // 0x0070(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearFeatureData;

// ScriptStruct PerfGear.PerfGearIOSDeviceFeatureStructure
// 0x00E0 (0x00E8 - 0x0008)
struct FPerfGearIOSDeviceFeatureStructure final : public FTableRowBase
{
public:
	class FString                                 DeviceName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IOSVersion;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerfGearFeatureData                   FeatureData;                                       // 0x0028(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearIOSDeviceFeatureStructure;

// ScriptStruct PerfGear.OpenHarmonyGPUFeatureStructure
// 0x0100 (0x0108 - 0x0008)
struct FOpenHarmonyGPUFeatureStructure final : public FTableRowBase
{
public:
	class FString                                 GPUName;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VendorName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyVersionName;                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerfGearFeatureData                   FeatureData;                                       // 0x0048(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenHarmonyGPUFeatureStructure;

// ScriptStruct PerfGear.PerfGearOpenHarmonyDeviceFeatureStructure
// 0x00F0 (0x00F8 - 0x0008)
struct FPerfGearOpenHarmonyDeviceFeatureStructure final : public FTableRowBase
{
public:
	class FString                                 DeviceName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VendorName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OpenHarmonyVersion;                                // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerfGearFeatureData                   FeatureData;                                       // 0x0038(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearOpenHarmonyDeviceFeatureStructure;

// ScriptStruct PerfGear.AndroidGPUFeatureStructure
// 0x0100 (0x0108 - 0x0008)
struct FAndroidGPUFeatureStructure final : public FTableRowBase
{
public:
	class FString                                 GPUName;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VendorName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceName;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AndroidVersionName;                                // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerfGearFeatureData                   FeatureData;                                       // 0x0048(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAndroidGPUFeatureStructure;

// ScriptStruct PerfGear.PerfGearAndroidDeviceFeatureStructure
// 0x00F0 (0x00F8 - 0x0008)
struct FPerfGearAndroidDeviceFeatureStructure final : public FTableRowBase
{
public:
	class FString                                 DeviceName;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VendorName;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AndroidVersion;                                    // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerfGearFeatureData                   FeatureData;                                       // 0x0038(0x00C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearAndroidDeviceFeatureStructure;

// ScriptStruct PerfGear.PerfGearExternalMapWithGroup
// 0x0030 (0x0030 - 0x0000)
struct FPerfGearExternalMapWithGroup final
{
public:
	class FString                                 ParamGroup;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConsoleName;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearExternalMapWithGroup;

// ScriptStruct PerfGear.PerfGearExternalStructure
// 0x0078 (0x0080 - 0x0008)
struct FPerfGearExternalStructure final : public FTableRowBase
{
public:
	int32                                         ExternalLevel;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            ExternalMaps;                                      // 0x0010(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPerfGearExternalMapWithGroup>  ExternalMapsWithGroup;                             // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Help;                                              // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearExternalStructure;

// ScriptStruct PerfGear.FakeQualityLevelSetting
// 0x0014 (0x0014 - 0x0000)
struct FFakeQualityLevelSetting final
{
public:
	int32                                         FakeQualityUlturalLow;                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FakeQualityVeryLow;                                // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FakeQualityMedium;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FakeQualityHigh;                                   // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FakeQualityVeryHigh;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFakeQualityLevelSetting;

// ScriptStruct PerfGear.ModeSwitchItem
// 0x0030 (0x0030 - 0x0000)
struct FModeSwitchItem final
{
public:
	EModeSwitchType                               SwitchType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchStatus                                 DefaultSwitchStatus;                               // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultOffSwitchValue;                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         CustomValue;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FModeSwitchItem;

// ScriptStruct PerfGear.PerfGearStructure
// 0x00F0 (0x00F8 - 0x0008)
struct FPerfGearStructure final : public FTableRowBase
{
public:
	class FString                                 ParamGroup;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ConsoleName;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level1;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level2;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level3;                                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level4;                                            // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level5;                                            // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level6;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEditOnly;                                         // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPIEOnly;                                          // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRuntimeOnly;                                      // 0x008A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         MinLevel;                                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FModeSwitchItem>   SwitchMap;                                         // 0x0098(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Help;                                              // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearStructure;

// ScriptStruct PerfGear.PSClampSetting
// 0x0003 (0x0003 - 0x0000)
struct FPSClampSetting final
{
public:
	EPerfGearQualityLevel                         QualityLevel;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         OriFPSLevel;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         OverrideFPSLevel;                                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPSClampSetting;

// ScriptStruct PerfGear.LowMemoryFeatureRow
// 0x0038 (0x0040 - 0x0008)
struct FLowMemoryFeatureRow final : public FTableRowBase
{
public:
	class FString                                 ConsoleName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LowValue;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NormalValue;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELowMemoryFeatureExecuteFlag                  ExecuteFlag;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLowMemoryFeatureRow;

// ScriptStruct PerfGear.DeviceFeatureItem
// 0x0070 (0x0070 - 0x0000)
struct FDeviceFeatureItem final
{
public:
	class FString                                 ConsoleName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UltraLowValue;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LowValue;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MediumValue;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HighValue;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VeryHighValue;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SuperValue;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDeviceFeatureItem;

// ScriptStruct PerfGear.PerfGearMemoryFeatureRow
// 0x0018 (0x0020 - 0x0008)
struct FPerfGearMemoryFeatureRow final : public FTableRowBase
{
public:
	EDeviceMemoryType                             MemoryType;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxQualityLevel;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDeviceFeatureItem>             MemoryFeatureItems;                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearMemoryFeatureRow;

// ScriptStruct PerfGear.DeviceLevelFeatureStruct
// 0x0088 (0x0088 - 0x0000)
struct FDeviceLevelFeatureStruct final
{
public:
	int32                                         BackBufferResolution;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinLobbyQualityLevel;                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDeviceFeatureItem                     SceneColorResolutionItem;                          // 0x0008(0x0070)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FDeviceFeatureItem>             FeatureItems;                                      // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDeviceLevelFeatureStruct;

// ScriptStruct PerfGear.PerfGearDeviceLevelFeature
// 0x0090 (0x0098 - 0x0008)
struct FPerfGearDeviceLevelFeature final : public FTableRowBase
{
public:
	int32                                         DeviceLevel;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDeviceLevelFeatureStruct              DeviceLevelFeature;                                // 0x0010(0x0088)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPerfGearDeviceLevelFeature;

// ScriptStruct PerfGear.FpsConfig
// 0x0009 (0x0009 - 0x0000)
struct FFpsConfig final
{
public:
	EQaulityFpsStatus                             VeryLow;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             Low;                                               // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             Mid;                                               // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             High;                                              // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             VeryHigh;                                          // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             Status90;                                          // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             Status120;                                         // 0x0006(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             Status144;                                         // 0x0007(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQaulityFpsStatus                             Status165;                                         // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFpsConfig;

// ScriptStruct PerfGear.QualityFpsSetting
// 0x0031 (0x0031 - 0x0000)
struct FQualityFpsSetting final
{
public:
	struct FFpsConfig                             QualityVeryLow;                                    // 0x0000(0x0009)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFpsConfig                             QualityLow;                                        // 0x0009(0x0009)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFpsConfig                             QualityMid;                                        // 0x0012(0x0009)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFpsConfig                             QualityHigh;                                       // 0x001B(0x0009)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FFpsConfig                             QualityVeryHigh;                                   // 0x0024(0x0009)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         DefaultQualityLevel;                               // 0x002D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         DefaultFPSLevel;                                   // 0x002E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         InnerTestQualityLevel;                             // 0x002F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPerfGearQualityLevel                         InnerTestFPSLevel;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQualityFpsSetting;

// ScriptStruct PerfGear.OpenHarmonyPadResolutionConfig
// 0x001C (0x001C - 0x0000)
struct FOpenHarmonyPadResolutionConfig final
{
public:
	int32                                         BackBuffer;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UltraLowResolution;                                // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LowResolution;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MidResolution;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HighResolution;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UltraHighResolution;                               // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SuperResolution;                                   // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOpenHarmonyPadResolutionConfig;

// ScriptStruct PerfGear.GPMOpenHarmonyPadSizeConfig
// 0x008C (0x008C - 0x0000)
struct FGPMOpenHarmonyPadSizeConfig final
{
public:
	struct FOpenHarmonyPadResolutionConfig        Level1Config;                                      // 0x0000(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FOpenHarmonyPadResolutionConfig        Level2Config;                                      // 0x001C(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FOpenHarmonyPadResolutionConfig        Level3Config;                                      // 0x0038(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FOpenHarmonyPadResolutionConfig        Level4Config;                                      // 0x0054(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FOpenHarmonyPadResolutionConfig        Level5Config;                                      // 0x0070(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPMOpenHarmonyPadSizeConfig;

// ScriptStruct PerfGear.AndroidPadResolutionConfig
// 0x001C (0x001C - 0x0000)
struct FAndroidPadResolutionConfig final
{
public:
	int32                                         BackBuffer;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UltraLowResolution;                                // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LowResolution;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MidResolution;                                     // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HighResolution;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UltraHighResolution;                               // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SuperResolution;                                   // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAndroidPadResolutionConfig;

// ScriptStruct PerfGear.GPMAndroidPadSizeConfig
// 0x008C (0x008C - 0x0000)
struct FGPMAndroidPadSizeConfig final
{
public:
	struct FAndroidPadResolutionConfig            Level1Config;                                      // 0x0000(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAndroidPadResolutionConfig            Level2Config;                                      // 0x001C(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAndroidPadResolutionConfig            Level3Config;                                      // 0x0038(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAndroidPadResolutionConfig            Level4Config;                                      // 0x0054(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAndroidPadResolutionConfig            Level5Config;                                      // 0x0070(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGPMAndroidPadSizeConfig;

// ScriptStruct PerfGear.PGPlatformInfoMsg
// 0x0068 (0x0068 - 0x0000)
struct FPGPlatformInfoMsg final
{
public:
	class FString                                 EngineVer;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameVer;                                           // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OsMajorVer;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OsSubVer;                                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CPUBrand;                                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GPUBrand;                                          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MemoryTotal;                                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPGPlatformInfoMsg;

}

