#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PhysXVehicles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysXVehicles_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class PhysXVehicles.WheeledVehicleMovementComponent
// 0x0160 (0x02E0 - 0x0180)
class UWheeledVehicleMovementComponent : public UPawnMovementComponent
{
public:
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bDeprecatedSpringOffsetMode : 1;                   // 0x0188(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReverseAsBrake : 1;                               // 0x0188(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseRVOAvoidance : 1;                              // 0x0188(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRawHandbrakeInput : 1;                            // 0x0188(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRawGearUpInput : 1;                               // 0x0188(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRawGearDownInput : 1;                             // 0x0188(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_188_6 : 2;                                  // 0x0188(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bWasAvoidanceUpdated : 1;                          // 0x018C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_18D[0x7];                                      // 0x018D(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Mass;                                              // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWheelSetup>                    WheelSetups;                                       // 0x0198(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         DragCoefficient;                                   // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChassisWidth;                                      // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChassisHeight;                                     // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DragArea;                                          // 0x01B4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EstimatedMaxEngineSpeed;                           // 0x01B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxEngineRPM;                                      // 0x01BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugDragMagnitude;                                // 0x01C0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InertiaTensorScale;                                // 0x01C4(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinNormalizedTireLoad;                             // 0x01D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinNormalizedTireLoadFiltered;                     // 0x01D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxNormalizedTireLoad;                             // 0x01D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxNormalizedTireLoadFiltered;                     // 0x01DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThresholdLongitudinalSpeed;                        // 0x01E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LowForwardSpeedSubStepCount;                       // 0x01E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HighForwardSpeedSubStepCount;                      // 0x01E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVehicleWheel*>                  Wheels;                                            // 0x01F0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DuplicateTransient, NativeAccessSpecifierPublic)
	uint8                                         Pad_200[0x18];                                     // 0x0200(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RVOAvoidanceRadius;                                // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RVOAvoidanceHeight;                                // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AvoidanceConsiderationRadius;                      // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RVOSteeringStep;                                   // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RVOThrottleStep;                                   // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AvoidanceUID;                                      // 0x022C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNavAvoidanceMask                      AvoidanceGroup;                                    // 0x0230(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNavAvoidanceMask                      GroupsToAvoid;                                     // 0x0234(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNavAvoidanceMask                      GroupsToIgnore;                                    // 0x0238(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         AvoidanceWeight;                                   // 0x023C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PendingLaunchVelocity;                             // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FReplicatedVehicleState                ReplicatedState;                                   // 0x024C(0x001C)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_268[0x4];                                      // 0x0268(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RawSteeringInput;                                  // 0x026C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RawThrottleInput;                                  // 0x0270(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RawBrakeInput;                                     // 0x0274(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SteeringInput;                                     // 0x0278(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ThrottleInput;                                     // 0x027C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrakeInput;                                        // 0x0280(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HandbrakeInput;                                    // 0x0284(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         IdleBrakeInput;                                    // 0x0288(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StopThreshold;                                     // 0x028C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WrongDirectionThreshold;                           // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVehicleInputRate                      ThrottleInputRate;                                 // 0x0294(0x0008)(Edit, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRate                      BrakeInputRate;                                    // 0x029C(0x0008)(Edit, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRate                      HandbrakeInputRate;                                // 0x02A4(0x0008)(Edit, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	struct FVehicleInputRate                      SteeringInputRate;                                 // 0x02AC(0x0008)(Edit, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B4[0x24];                                     // 0x02B4(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            OverrideController;                                // 0x02D8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ServerUpdateState(float InSteeringInput, float InThrottleInput, float InBrakeInput, float InHandbrakeInput, int32 CurrentGear, const struct FRigidBodyState& ClientRBState); // (Net, Native, Event, Protected, NetServer, NetValidate) // @ 0x1429E0710
	void SetAvoidanceEnabled(bool bEnable); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0990
	void SetAvoidanceGroup(int32 GroupFlags); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0A20
	void SetAvoidanceGroupMask(const struct FNavAvoidanceMask& GroupMask); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1429E0AA0
	void SetBrakeInput(float Brake); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0B30
	void SetGearDown(bool bNewGearDown); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0D50
	void SetGearUp(bool bNewGearUp); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0DE0
	void SetGroupsToAvoid(int32 GroupFlags); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0E70
	void SetGroupsToAvoidMask(const struct FNavAvoidanceMask& GroupMask); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1429E0EF0
	void SetGroupsToIgnore(int32 GroupFlags); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0F80
	void SetGroupsToIgnoreMask(const struct FNavAvoidanceMask& GroupMask); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1429E1000
	void SetHandbrakeInput(bool bNewHandbrake); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E1090
	void SetSteeringInput(float Steering); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E11F0
	void SetTargetGear(int32 GearNum, bool bImmediate); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E1270
	void SetThrottleInput(float Throttle); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E1330
	void SetUseAutoGears(bool bUseAuto); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E13B0

	int32 GetCurrentGear() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E04D0
	float GetEngineMaxRotationSpeed() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E0500
	float GetEngineRotationSpeed() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E0530
	float GetForwardSpeed() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E0560
	int32 GetTargetGear() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E0650
	bool GetUseAutoGears() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E0680

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WheeledVehicleMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WheeledVehicleMovementComponent")
	}
	static class UWheeledVehicleMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWheeledVehicleMovementComponent>();
	}
};
DUMPER7_ASSERTS_UWheeledVehicleMovementComponent;

// Class PhysXVehicles.HoverVehicleMovementComponent
// 0x0018 (0x02F8 - 0x02E0)
class UHoverVehicleMovementComponent final : public UWheeledVehicleMovementComponent
{
public:
	float                                         ForwardForce;                                      // 0x02E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RightTorque;                                       // 0x02E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedUpScale;                                      // 0x02E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2EC[0xC];                                      // 0x02EC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoverVehicleMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoverVehicleMovementComponent")
	}
	static class UHoverVehicleMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoverVehicleMovementComponent>();
	}
};
DUMPER7_ASSERTS_UHoverVehicleMovementComponent;

// Class PhysXVehicles.SimpleWheeledVehicleMovementComponent
// 0x0000 (0x02E0 - 0x02E0)
class USimpleWheeledVehicleMovementComponent final : public UWheeledVehicleMovementComponent
{
public:
	void SetBrakeTorque(float BrakeTorque, int32 WheelIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0BB0
	void SetDriveTorque(float DriveTorque, int32 WheelIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E0C80
	void SetSteerAngle(float SteerAngle, int32 WheelIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E1120

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleWheeledVehicleMovementComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleWheeledVehicleMovementComponent")
	}
	static class USimpleWheeledVehicleMovementComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleWheeledVehicleMovementComponent>();
	}
};
DUMPER7_ASSERTS_USimpleWheeledVehicleMovementComponent;

// Class PhysXVehicles.TireConfig
// 0x0020 (0x0050 - 0x0030)
class UTireConfig final : public UDataAsset
{
public:
	float                                         FrictionScale;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTireConfigMaterialFriction>    TireFrictionScales;                                // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TireConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TireConfig")
	}
	static class UTireConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTireConfig>();
	}
};
DUMPER7_ASSERTS_UTireConfig;

// Class PhysXVehicles.VehicleAnimInstance
// 0x07D0 (0x0A40 - 0x0270)
#pragma pack(push, 0x1)
class alignas(0x10) UVehicleAnimInstance : public UAnimInstance
{
public:
	uint8                                         Pad_270[0x7C0];                                    // 0x0270(0x07C0)(Fixing Size After Last Property [ Dumper-7 ])
	class UWheeledVehicleMovementComponent*       WheeledVehicleMovementComponent;                   // 0x0A30(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class AWheeledVehicle* GetVehicle(); // (Final, Native, Public, BlueprintCallable) // @ 0x1429E06B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VehicleAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VehicleAnimInstance")
	}
	static class UVehicleAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleAnimInstance>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UVehicleAnimInstance;

// Class PhysXVehicles.VehicleSettings
// 0x0030 (0x0068 - 0x0038)
class UVehicleSettings final : public UDeveloperSettings
{
public:
	EVehicleSuspensionQuery                       SuspensionQueryType;                               // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NonBlockingSweepHitNum;                            // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalSmoothRatio;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalSmoothAngle;                                 // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PointRejectAngle;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalRejectAngle;                                 // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HitPosDotForAdjust;                                // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NormalDotForAdjust;                                // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleTickFrequence;                              // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleTickFrequenceHD;                            // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseOverlapCache;                                 // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SuspLimitErrorRatio;                               // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VehicleSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VehicleSettings")
	}
	static class UVehicleSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleSettings>();
	}
};
DUMPER7_ASSERTS_UVehicleSettings;

// Class PhysXVehicles.VehicleWheel
// 0x0540 (0x0568 - 0x0028)
class UVehicleWheel final : public UObject
{
public:
	class UStaticMesh*                            CollisionMesh;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDontCreateShape;                                  // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAdjustCollisionSize;                          // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                offset;                                            // 0x0034(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShapeRadius;                                       // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShapeWidth;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mass;                                              // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DampingRate;                                       // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteerAngle;                                        // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectedByHandbrake;                              // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTireType*                              TireType;                                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTireConfig*                            TireConfig;                                        // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LatStiffMaxLoad;                                   // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LatStiffValue;                                     // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LongStiffValue;                                    // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     FrictionVsSlipGraph;                               // 0x0078(0x00A0)(Edit, NativeAccessSpecifierPublic)
	float                                         SuspensionForceOffset;                             // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionMaxRaise;                                // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionMaxDrop;                                 // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionNaturalFrequency;                        // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionDampingRatio;                            // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionNaturalFrequencyLerpValue;               // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspensionDampingRatioLerpValue;                   // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     SuspensionLengthNaturalFrequencyCurve;             // 0x0138(0x00A0)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     SuspensionLengthDampingRatioCurve;                 // 0x01D8(0x00A0)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     SuspensionVelocityNaturalFrequencyCurve;           // 0x0278(0x00A0)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     SuspensionVelocityDampingRatioCurve;               // 0x0318(0x00A0)(Edit, NativeAccessSpecifierPublic)
	float                                         SuspensionSteerthreshold;                          // 0x03B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     SuspensionSteerNaturalFrequencyCurve;              // 0x03C0(0x00A0)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     SuspensionSteerDampingRatioCurve;                  // 0x0460(0x00A0)(Edit, NativeAccessSpecifierPublic)
	EWheelSweepType                               SweepType;                                         // 0x0500(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxBrakeTorque;                                    // 0x0504(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHandBrakeTorque;                                // 0x0508(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWheeledVehicleMovementComponent*       VehicleSim;                                        // 0x0510(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WheelIndex;                                        // 0x0518(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLongSlip;                                     // 0x051C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLatSlip;                                      // 0x0520(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugNormalizedTireLoad;                           // 0x0524(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_528[0x4];                                      // 0x0528(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DebugWheelTorque;                                  // 0x052C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLongForce;                                    // 0x0530(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DebugLatForce;                                     // 0x0534(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0538(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OldLocation;                                       // 0x0544(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0550(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55C[0xC];                                      // 0x055C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetRotationAngle() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E0590
	float GetSteerAngle() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E05C0
	float GetSuspensionOffset() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E05F0
	float GetSuspensionSpringForce() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E0620
	bool IsInAir() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1429E06E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VehicleWheel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VehicleWheel")
	}
	static class UVehicleWheel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleWheel>();
	}
};
DUMPER7_ASSERTS_UVehicleWheel;

// Class PhysXVehicles.WheeledVehicle
// 0x0010 (0x03E0 - 0x03D0)
class AWheeledVehicle final : public APawn
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWheeledVehicleMovementComponent*       VehicleMovement;                                   // 0x03D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WheeledVehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WheeledVehicle")
	}
	static class AWheeledVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWheeledVehicle>();
	}
};
DUMPER7_ASSERTS_AWheeledVehicle;

// Class PhysXVehicles.WheeledVehicleMovementComponent4W
// 0x01B0 (0x0490 - 0x02E0)
class UWheeledVehicleMovementComponent4W : public UWheeledVehicleMovementComponent
{
public:
	struct FVehicleEngineData                     EngineSetup;                                       // 0x02E0(0x00B8)(Edit, NativeAccessSpecifierPublic)
	struct FVehicleDifferential4WData             DifferentialSetup;                                 // 0x0398(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         AckermannAccuracy;                                 // 0x03B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVehicleTransmissionData               TransmissionSetup;                                 // 0x03B8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     SteeringCurve;                                     // 0x03F0(0x00A0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WheeledVehicleMovementComponent4W")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WheeledVehicleMovementComponent4W")
	}
	static class UWheeledVehicleMovementComponent4W* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWheeledVehicleMovementComponent4W>();
	}
};
DUMPER7_ASSERTS_UWheeledVehicleMovementComponent4W;

// Class PhysXVehicles.VehicleMovementParams
// 0x01C8 (0x01F0 - 0x0028)
class UVehicleMovementParams final : public UObject
{
public:
	bool                                          bModifyEngineSetup;                                // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleEngineData                     EngineSetup;                                       // 0x0030(0x00B8)(Edit, NativeAccessSpecifierPublic)
	bool                                          bModifyDifferentialSetup;                          // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleDifferential4WData             DifferentialSetup;                                 // 0x00EC(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bModifyTransmissionSetup;                          // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleTransmissionData               TransmissionSetup;                                 // 0x0110(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bModifySteeringCurve;                              // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     SteeringCurve;                                     // 0x0150(0x00A0)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VehicleMovementParams")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VehicleMovementParams")
	}
	static class UVehicleMovementParams* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleMovementParams>();
	}
};
DUMPER7_ASSERTS_UVehicleMovementParams;

}

