#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PixUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "PixUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class PixUI.PixUIViewPortWidget
// 0x0038 (0x0328 - 0x02F0)
class UPixUIViewPortWidget final : public UUserWidget
{
public:
	TDelegate<void(const class FString& URL, const class FString& Name, const class FString& Features, const bool Replace)> PixUIWidgetOpenDelegate; // 0x02F0(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& ConfirmMessage)> PixUIWidgetConfirmDelegate;                 // 0x0300(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Tip, const class FString& DefaultContent)> PixUIWidgetPromptDelegate; // 0x0310(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x8];                                      // 0x0320(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePage(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E050
	void ClosePxView(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E090
	class UPixUIWidget* GetPixUIWidget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E240
	int32 LoadPageFromData(TArray<uint8>& arrayData, const class FString& strRootPath); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259E850
	int32 LoadPageFromGameAssetPath(const class FString& strAssetPath); // (Final, Native, Public, BlueprintCallable) // @ 0x14259EB30
	int32 LoadPageFromUrl(const class FString& strUrl); // (Final, Native, Public, BlueprintCallable) // @ 0x14259ECD0
	int32 LoadPxViewFromData(TArray<uint8>& arrayData, const class FString& strRootPath); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259EE70
	int32 LoadPxViewFromGameAssetPath(const class FString& strAssetPath); // (Final, Native, Public, BlueprintCallable) // @ 0x14259EFE0
	int32 LoadPxViewFromUrl(const class FString& strUrl); // (Final, Native, Public, BlueprintCallable) // @ 0x14259F0B0
	bool OnPixUIConfirmDelegate(const class FString& strConfirmMsg); // (Final, Native, Public) // @ 0x14259FC40
	int32 OnPixUIOpenDelegate(const class FString& strUrl, const class FString& strName, const class FString& strFeatures, const bool bReplace); // (Final, Native, Public) // @ 0x14259FD10
	class FString OnPixUIPromptDelegate(const class FString& strTip, const class FString& strDefault); // (Final, Native, Public) // @ 0x14259FF00
	void OnPixUITransformDelegate(const EPxWidgetTransformType EPxWidgetTransformType, const int32 nParam1, const int32 nParam2); // (Final, Native, Public) // @ 0x1425A0090
	int32 PostPxMessage(const class FString& strMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A04A0
	void PostPxViewMessage(const class FString& strMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0640
	class FString SendPxMessage(const class FString& strMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0700

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIViewPortWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIViewPortWidget")
	}
	static class UPixUIViewPortWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixUIViewPortWidget>();
	}
};
DUMPER7_ASSERTS_UPixUIViewPortWidget;

// Class PixUI.PixUIBrushWrapper
// 0x0010 (0x0038 - 0x0028)
class UPixUIBrushWrapper : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIBrushWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIBrushWrapper")
	}
	static class UPixUIBrushWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixUIBrushWrapper>();
	}
};
DUMPER7_ASSERTS_UPixUIBrushWrapper;

// Class PixUI.PixUIBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UPixUIBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void PixUI_AddSystemFont(const class FString& strFontName, const class FString& strFontPath); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142594A20
	static bool PixUI_BeDebugInfoOpen(const EPxDebugInfo EPxDebugInfo); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142594B50
	static bool PixUI_BePublicCapabilityOpen(const EPxPublicCapability EPxDebugInfo); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142594BD0
	static bool PixUI_CallPixUIAssetGC(const int32 nViewId); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142594C50
	static void PixUI_ClearCacheFile(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142594CD0
	static class UPixUIWidget* PixUI_CreateAddToCanvas(class UCanvasPanel* p_ParentCanvas, const struct FAnchors& Anchors, const struct FMargin& Margin); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142594CF0
	static class UPixUIWidget* PixUI_CreateAddToCanvasEx(class UCanvasPanel* pParentCanvas); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142594E30
	static class UPixUIScriptVM* PixUI_CreateScriptVM(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142594EB0
	static class UPixUIViewPortWidget* PixUI_CreateViewPortAddToCanvas(class UCanvasPanel* pParentCanvas, const struct FAnchors& Anchors, const struct FMargin& Margin); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142594EE0
	static class UPixUIViewPortWidget* PixUI_CreateViewPortAddToCanvasEx(class UCanvasPanel* pParentCanvas); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595020
	static class UPixUIViewPortWidget* PixUI_CreateViewPortWidget(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425950A0
	static class UPixUIWidget* PixUI_CreateWidget(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425950D0
	static void PixUI_DebugInfoSwitch(const EPxDebugInfo EPxDebugInfo, const bool bOpen); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595100
	static class UPixUIWidget* PixUI_FindByWindowID(const int32 nWindowID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425951C0
	static float PixUI_GetAsyncBpCallWaitOutTime(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595240
	static bool PixUI_GetAsyncMode(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595270
	static void PixUI_GetCachePath(class FString* strOutCachePath); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x1425952A0
	static int32 PixUI_GetCoreLibCount(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595360
	static int32 PixUI_GetCoreLibVersionTagByIndex(const int32 nIndex); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595390
	static int32 PixUI_GetCoreTickDuration(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595410
	static void PixUI_GetDefaultFont(class FString* strFontName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142595440
	static void PixUI_GetDefaultFontSize(int32* nOutFontSize); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142595500
	static bool PixUI_GetDrawEffectNoPixelSnapping(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595580
	static ETextureFilter PixUI_GetDynamicTextureFilter(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425955B0
	static EPxDynamicTextureUpdateMode PixUI_GetDynamicTextureUpdateMode(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425955E0
	static bool PixUI_GetExtBpCallSupportThrowException(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595610
	static class FString PixUI_GetFontNameByIndex(const int32 nIndex); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595640
	static bool PixUI_GetFontPath(const class FString& strFontName, class FString* strOutFontPath); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142595710
	static class FString PixUI_GetFontPathByIndex(const int32 nIndex); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595860
	static class FString PixUI_GetFontTypeFaceName(const class FString& strFontName, const EPxFontFaceType ePxFontTypeFace); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595930
	static bool PixUI_GetGradientBrushCallFlushCommands(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595A80
	static int32 PixUI_GetJsGCThreshold(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595AB0
	static bool PixUI_GetMatAsyncLoad(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595AE0
	static class FString PixUI_GetMatBasePath(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595B10
	static class FString PixUI_GetMatRootPath(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595B90
	static float PixUI_GetPixUIMaxDynamicTextureGCRate(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595C10
	static int32 PixUI_GetPixUIMaxDynamicTextureGCSize(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595C40
	static int32 PixUI_GetPixUIMaxDynamicTextureTotalSize(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595C70
	static int32 PixUI_GetPixUIMaxLayerId(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595CA0
	static class UPixUIWidget* PixUI_GetPixUIWidgetByID(const int32 nPxWidgetID); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595CD0
	static class UObject* PixUI_GetPixUIWidgetSlotObject(const int32 nPxWidgetID, const class FString& strSlotTagId); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595D50
	static int32 PixUI_GetPxLibDefaultVersionTag(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595E50
	static bool PixUI_GetSupportEngineFont(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595E80
	static void PixUI_GetSupportPxLibVersionTagArray(TArray<int32>& arraySupportPxLibVersionTag); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142595EB0
	static float PixUI_GetTickIntervalSec(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595F70
	static int32 PixUI_GetTotalFontCount(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595FA0
	static class UObject* PixUI_GetWindowSlotObject(const int32 nWindowID, const class FString& strTagId); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142595FD0
	static bool PixUI_IsAutoTick(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425960D0
	static bool PixUI_IsDynamicFixFontSize(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596100
	static bool PixUI_IsMobileUseTouchEvent(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596130
	static bool PixUI_IsOsBit32(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142483770
	static bool PixUI_IsOsBit64(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1411D27B0
	static bool PixUI_IsRHIShaderDX(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596160
	static bool PixUI_IsRHIShaderMetal(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596190
	static bool PixUI_IsRHIShaderOpenGL(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425961C0
	static bool PixUI_IsRHIShaderOpenGLES2(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142483770
	static bool PixUI_IsRHIShaderVulkan(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425961F0
	static bool PixUI_IsStartUp(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596220
	static bool PixUI_IsSupportTextShape(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596250
	static class FString PixUI_Platform(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596280
	static int32 PixUI_PlatformCode(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14148E1D0
	static class FString PixUI_PlatformOSVersion(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596300
	static float PixUI_PlatformOSVersionCode(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596380
	static void PixUI_PrintProfilerInfo(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140DA94D0
	static void PixUI_PublicCapabilitySwitch(const EPxPublicCapability EPxDebugInfo, const bool bOpen); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425963B0
	static void PixUI_RemoveSystemFont(const class FString& strFontName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425964D0
	static int32 PixUI_RHIShaderLevel(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596470
	static int32 PixUI_RHIShaderPlatform(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425964A0
	static void PixUI_SetAsyncBpCallWaitOutTime(const float fTimeOutSecond); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596580
	static void PixUI_SetAsyncMode(const bool beRunAsyncMode); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425965F0
	static void PixUI_SetAutoTick(const bool bAutoTick); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596670
	static bool PixUI_SetCoreLibValidByTag(const int32 nVersionTag, const bool bValid); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425966F0
	static void PixUI_SetCoreTickDuration(const int32 nDurationCount); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425967B0
	static void PixUI_SetDefaultFont(const class FString& strFontName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596820
	static void PixUI_SetDefaultFontSize(const int32 nFontSize); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425968D0
	static void PixUI_SetDrawEffectNoPixelSnapping(const bool bNoPixelSnapping); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596940
	static void PixUI_SetDynamicFixFontSize(const bool bOpenDynamicFix); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425969C0
	static void PixUI_SetDynamicTextureFilter(const ETextureFilter eTextureFilter); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596A40
	static void PixUI_SetDynamicTextureUpdateMode(const EPxDynamicTextureUpdateMode eUpdateMode); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596AB0
	static void PixUI_SetExtBpCallSupportThrowException(const bool bSupportThrowException); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596B20
	static void PixUI_SetExternalInterface(TScriptInterface<class IPixUIExternalInterface> scriptInterfaceExternal); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596BA0
	static void PixUI_SetFontTypeFaceName(const class FString& strFontName, const EPxFontFaceType ePxFontTypeFace, const class FString& strFontTypeFaceName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596C30
	static void PixUI_SetGradientBrushCallFlushCommands(const bool beGradientBrushCallFlushCommands); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596DA0
	static void PixUI_SetJsGCThreshold(const int32 nGCThreshold); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596E20
	static void PixUI_SetMatAsyncLoad(const bool bMatAsyncLoad); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596E90
	static void PixUI_SetMatBasePath(const class FString& strMatBasePath); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596F10
	static void PixUI_SetMatRootPath(const class FString& strMatRootPath); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142596FC0
	static void PixUI_SetMobileUseTouchEvent(const bool bUseTouchEvent); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597070
	static void PixUI_SetPixUIMaxDynamicTextureGCRate(const float fMaxGCRate); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425970F0
	static void PixUI_SetPixUIMaxDynamicTextureGCSize(const int32 nMaxDynamicTextureGCSize); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597160
	static void PixUI_SetPixUIMaxDynamicTextureTotalSize(const int32 nMaxDynamicTextureTotalSize); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425971D0
	static void PixUI_SetPixUIMaxLayerId(const int32 nMaxLayerId); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597240
	static void PixUI_SetPxLibDefaultVersionTag(int32 nNewPxLibVersionTag); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425972B0
	static void PixUI_SetSecretKey(const class FString& strSecretKey); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597320
	static void PixUI_SetSupportEngineFont(const bool bSupportEngineFont); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425973D0
	static void PixUI_SetSupportTextShape(const bool beSupportTextShape); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597450
	static void PixUI_SetTickIntervalSec(const float fTickIntervalSec); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425974D0
	static bool PixUI_Shutdown(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597540
	static bool PixUI_Startup(const class FString& strCachePathForWrite); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597570
	static bool PixUI_StartupEx(const class FString& strCachePathForWrite, const bool bSupportAsyncModel); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597630
	static void PixUI_Tick(float fDeltaTime); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142597730
	static class FString PixUI_Version(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1425977A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIBPLibrary")
	}
	static class UPixUIBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixUIBPLibrary>();
	}
};
DUMPER7_ASSERTS_UPixUIBPLibrary;

// Class PixUI.PixUIExternalInterface
// 0x0000 (0x0000 - 0x0000)
class IPixUIExternalInterface final
{
public:
	bool OnFileCanLoad(const class FString& strFilePath); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool OnFileLoad(const class FString& strFilePath, const TDelegate<void(const TArray<uint8>& fileData)>& callDelegate); // (Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	class UPixUIBrushWrapper* OnSlateBrushLoad(const class FString& strBrushPath); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	class UWidget* OnWidgetLoad(const class FString& strWidgetPath, const class FString& strWidgetTag); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIExternalInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIExternalInterface")
	}
	static class IPixUIExternalInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPixUIExternalInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IPixUIExternalInterface;

// Class PixUI.PixUIInput
// 0x0038 (0x0060 - 0x0028)
class UPixUIInput final : public UObject
{
public:
	TDelegate<void(EPxKeyboardTypes KeyboardType, const class FString& defaultText, const class FString& HintText, const int32 selectionStart, const int32 selectionEnd, const struct FBox2D& box2dTextBound)> DelegateActivateInput; // 0x0028(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             DelegateDeactivateInput;                           // 0x0038(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPixUIInput* Get(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14259A120
	static void OnInputText(const class FString& strInsert, const bool bEndInput, const bool bLostFocus, const bool bReplace); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14259B4A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIInput")
	}
	static class UPixUIInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixUIInput>();
	}
};
DUMPER7_ASSERTS_UPixUIInput;

// Class PixUI.PixUIRenderTarget
// 0x0140 (0x0168 - 0x0028)
class UPixUIRenderTarget final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              DelegateOnCreate;                                  // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnClose;                                   // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnDestroy;                                 // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& URL, const int32 ErrorCode)> DelegateOnLoaded; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnScriptStateInit;                         // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnScriptStateDone;                         // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const int32 ErrorCode, const class FString& MessageError)> DelegateOnInternalError; // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& URL, const class FString& Name, const class FString& Features, const bool Replace)> DelegateOnExternalOpen; // 0x0098(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnExternalClose;                           // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Message)> DelegateOnMessage;                  // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& AlertMessage)> DelegateOnAlert;               // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& ConfirmMessage)> DelegateOnConfirm;                          // 0x00D8(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Tip, const class FString& DefaultContent)> DelegateOnPrompt; // 0x00E8(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnAppForeground;                           // 0x00F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnAppBackground;                           // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         pxLibVersionTag;                                   // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4C];                                     // 0x011C(0x004C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePage(); // (Final, Native, Public, BlueprintCallable) // @ 0x142599570
	int32 Create(const int32 nWidth, const int32 nHeight, const float fScale, const bool bAsyncModel, const bool bCoreLibAsyncModel, const bool bGammaSpace, const bool bAntiAliasing); // (Final, Native, Public, BlueprintCallable) // @ 0x142599620
	void DestroyPage(); // (Final, Native, Public, BlueprintCallable) // @ 0x142599AE0
	class FString GetCoreLibVersion(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A150
	class UTextureRenderTarget2D* GetRenderTarget2D(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A280
	int32 GetRenderTarget2DHeight(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A2B0
	int32 GetRenderTarget2DWidth(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A2E0
	void HistoryGo(const int32 nStep); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A740
	bool IsPxViewValid(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A7C0
	int32 LoadPageFromData(TArray<uint8>& arrayData, const class FString& strBasePath); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259A850
	int32 LoadPageFromGameAssetPath(const class FString& strAssetPath); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A9C0
	int32 LoadPageFromUrl(const class FString& strUrl); // (Final, Native, Public, BlueprintCallable) // @ 0x14259AA90
	void OnExternalGamepadAnalogEvent(const struct FAnalogInputEvent& AnalogInputEvent, const EPxKeyEventType EEventType); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259AC70
	void OnExternalGamepadEvent(const struct FKeyEvent& KeyEvent, const EPxKeyEventType EEventType); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259ADD0
	void OnExternalKeyBoardEvent(const struct FKeyEvent& KeyEvent, const EPxKeyEventType EEventType); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259AF20
	void OnExternalMouseEvent(const struct FVector2D& v2dPosMouse, const struct FVector2D& v2dOffsetWheel, const EPxMouseType eMouseType, const EPxKeyEventType uEvent); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14259B070
	void OnExternalTextInput(const class FString& strNewInput, const bool beEndInput, const bool beLostFocus, const bool beReplace); // (Final, Native, Public, BlueprintCallable) // @ 0x14259B1E0
	void OnExternalTouchEvent(const struct FVector2D& v2dPosTouch, const int32 nPointerIndex, const EPxTouchType ETouchType); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14259B390
	int32 PostPxMessage(const class FString& strMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x14259B620
	void ReScale(const float fScale); // (Final, Native, Public, BlueprintCallable) // @ 0x14259B800
	void ReSize(const int32 nNewWidth, const int32 nNewHeight); // (Final, Native, Public, BlueprintCallable) // @ 0x14259B880
	class FString SendPxMessage(const class FString& strMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x14259B940
	void SetBeDelayCallMessage(const bool bDelayMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BBC0
	void SetBeSupportEventCallNested(const bool bSupportEventCallNested); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BCE0
	void SetExternalRenderTarget2D(class UTextureRenderTarget2D* pTextureRenderTarget); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BE00
	void SetTickIntervalSec(const float fTickIntervalSec); // (Final, Native, Public, BlueprintCallable) // @ 0x14259C3B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIRenderTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIRenderTarget")
	}
	static class UPixUIRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixUIRenderTarget>();
	}
};
DUMPER7_ASSERTS_UPixUIRenderTarget;

// Class PixUI.PixUIScriptVM
// 0x00E8 (0x0110 - 0x0028)
class UPixUIScriptVM final : public UObject
{
public:
	TMulticastInlineDelegate<void()>              DelegateOnCreate;                                  // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnClose;                                   // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnDestroy;                                 // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& URL, const int32 ErrorCode)> DelegateOnLoaded; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnScriptStateInit;                         // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnScriptStateDone;                         // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const int32 ErrorCode, const class FString& MessageError)> DelegateOnInternalError; // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& URL, const class FString& Name, const class FString& Features, const bool Replace)> DelegateOnExternalOpen; // 0x0098(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnExternalClose;                           // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Message)> DelegateOnMessage;                  // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnAppForeground;                           // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnAppBackground;                           // 0x00D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         pxLibVersionTag;                                   // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x24];                                      // 0x00EC(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 CloseVM(const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x142599590
	int32 Create(const bool bAsyncMode, const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x142599830
	int32 CreateEx(const bool bAsyncMode, const bool bCoreLibAsyncMode, const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x142599900
	void CreateScriptGlobal(const class FString& strName); // (Final, Native, Public, BlueprintCallable) // @ 0x142599A20
	int32 DestroyVM(const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x142599B00
	int32 DoBuffer(const TArray<uint8>& arrayData, const class FString& strBasePath, const class FString& strName, const class FString& strModuleName, const int32 nWaitMS); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x142599B90
	int32 DoBufferByAssetPath(const class FString& strAssetPath, const class FString& strName, const class FString& strModuleName, const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x142599E20
	int32 DoFile(const class FString& strFilePath, const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A010
	class FString GetCoreLibVersion(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A1D0
	int32 GetPxVMId(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A250
	bool GetScriptGlobalBoolean(const class FString& strName, const class FString& StrKey); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A310
	float GetScriptGlobalNumber(const class FString& strName, const class FString& StrKey); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A460
	class FString GetScriptGlobalString(const class FString& strName, const class FString& StrKey); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A5B0
	bool IsPxVmValid(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A7F0
	bool IsValid(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259A820
	int32 LoadURL(const class FString& strUrl, const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x14259AB60
	int32 PostPxMessage(const class FString& strMessage, const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x14259B6F0
	class FString SendPxMessage(const class FString& strMessage, const int32 nWaitMS); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BA60
	void SetBeDelayCallMessage(const bool bDelayMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BC50
	void SetBeSupportEventCallNested(const bool bSupportEventCallNested); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BD70
	void SetJsGCThreshold(const int32 nGCThreshold); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BE80
	void SetScriptGlobalBoolean(const class FString& strName, const class FString& StrKey, const bool bValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14259BF00
	void SetScriptGlobalNumber(const class FString& strName, const class FString& StrKey, const float fValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14259C080
	void SetScriptGlobalString(const class FString& strName, const class FString& StrKey, const class FString& strValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14259C200
	void SetTickIntervalSec(const float fTickIntervalSec); // (Final, Native, Public, BlueprintCallable) // @ 0x14259C430

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIScriptVM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIScriptVM")
	}
	static class UPixUIScriptVM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixUIScriptVM>();
	}
};
DUMPER7_ASSERTS_UPixUIScriptVM;

// Class PixUI.PixUIWidget
// 0x0218 (0x03E8 - 0x01D0)
class UPixUIWidget final : public UCanvasPanel
{
public:
	uint8                                         Pad_1D0[0x8];                                      // 0x01D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              DelegateOnCreate;                                  // 0x01D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnClose;                                   // 0x01E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnDestroy;                                 // 0x01F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& URL, const int32 ErrorCode)> DelegateOnLoaded; // 0x0208(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnScriptStateInit;                         // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnScriptStateDone;                         // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const int32 ErrorCode, const class FString& MessageError)> DelegateOnInternalError; // 0x0238(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& URL, const class FString& Name, const class FString& Features, const bool Replace)> DelegateOnExternalOpen; // 0x0248(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnExternalClose;                           // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& Message)> DelegateOnMessage;                  // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& AlertMessage)> DelegateOnAlert;               // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& ConfirmMessage)> DelegateOnConfirm;                          // 0x0288(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Tip, const class FString& DefaultContent)> DelegateOnPrompt; // 0x0298(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EPxWidgetTransformType ePxTransformType, int32 Param1, int32 Param2)> DelegateOnTransform; // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnAppForeground;                           // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              DelegateOnAppBackground;                           // 0x02C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void(const bool InBeKeyDown, const struct FGeometry& InGeometry, const struct FKeyEvent& InKeyEvent, const struct FAnalogInputEvent& InAnalogInputEvent)> DelegateHookKeyEvent; // 0x02D8(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         pxLibVersionTag;                                   // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAsync;                                          // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCoreLibAsync;                                   // 0x02ED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsForcePaint;                                     // 0x02EE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLazyReleaseMode;                                // 0x02EF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPxWidgetBatchType                            BatchType;                                         // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TextDefaultUrl;                                    // 0x02F8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bIsStateNodeMode;                                  // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRHIRender;                                      // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRHIRenderAntiAliasing;                          // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPxSlotTopHit;                                     // 0x0313(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRetainMode;                                     // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNoPixelSnapping;                                  // 0x0315(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_316[0xD2];                                     // 0x0316(0x00D2)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePage(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E070
	void CreateScriptGlobal(const class FString& strName); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E0B0
	void DestroyPage(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E170
	class FString GetCoreLibVersion(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E190
	class UWidget* GetCtrlWidget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E210
	int32 GetPxWinId(); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E270
	bool GetScriptGlobalBoolean(const class FString& strName, const class FString& StrKey); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E2A0
	float GetScriptGlobalNumber(const class FString& strName, const class FString& StrKey); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E3F0
	class FString GetScriptGlobalString(const class FString& strName, const class FString& StrKey); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E540
	class UObject* GetSlotObjectByTagId(const class FString& strSlotTagId); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E6D0
	void HistoryGo(const int32 nStep); // (Final, Native, Public, BlueprintCallable) // @ 0x14259E7A0
	int32 LoadPageFromData(TArray<uint8>& arrayData, const class FString& strBasePath); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259E9C0
	int32 LoadPageFromGameAssetPath(const class FString& strAssetPath); // (Final, Native, Public, BlueprintCallable) // @ 0x14259EC00
	int32 LoadPageFromUrl(const class FString& strUrl); // (Final, Native, Public, BlueprintCallable) // @ 0x14259EDA0
	void OnExternalGamepadAnalogEvent(const struct FAnalogInputEvent& AnalogInputEvent, const EPxKeyEventType EEventType); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259F340
	void OnExternalGamepadEvent(const struct FKeyEvent& KeyEvent, const EPxKeyEventType EEventType); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259F4A0
	void OnExternalKeyBoardEvent(const struct FKeyEvent& KeyEvent, const EPxKeyEventType EEventType); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14259F5F0
	void OnExternalMouseEvent(const struct FVector2D& v2dPosMouse, const struct FVector2D& v2dOffsetWheel, const EPxMouseType eMouseType, const EPxKeyEventType uEvent); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14259F740
	void OnExternalTextInput(const class FString& strNewInput, const bool beEndInput, const bool beLostFocus, const bool beReplace); // (Final, Native, Public, BlueprintCallable) // @ 0x14259F8B0
	void OnExternalTouchEvent(const struct FVector2D& v2dPosTouch, const int32 nPointerIndex, const EPxTouchType ETouchType); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x14259FA60
	int32 OpenPageFromData(TArray<uint8>& arrayData, const class FString& strBasePath); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1425A0190
	int32 OpenPageFromGameAssetPath(const class FString& strAssetPath); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0300
	int32 OpenPageFromUrl(const class FString& strUrl); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A03D0
	int32 PostPxMessage(const class FString& strMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0570
	class FString SendPxMessage(const class FString& strMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0820
	void SetAutoTransform(const bool bAutoTransform); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0940
	void SetBackgroundBlur(const float fBlurStrength); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A09D0
	void SetBeDelayCallMessage(const bool bDelayMessage); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0A50
	void SetBeSupportEventCallNested(const bool bSupportEventCallNested); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0AE0
	void SetJsGCThreshold(const int32 nGCThreshold); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0B70
	void SetScriptGlobalBoolean(const class FString& strName, const class FString& StrKey, const bool bValue); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0BF0
	void SetScriptGlobalNumber(const class FString& strName, const class FString& StrKey, const float fValue); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0D70
	void SetScriptGlobalString(const class FString& strName, const class FString& StrKey, const class FString& strValue); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A0EF0
	void SetTickIntervalSec(const float fTickIntervalSec); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A10A0
	void SetTickMode(const EPxTickMode eTickMode); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A1120
	void ShowAllDrawBatch(); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A11A0
	void ShowAllDrawItem(); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A11C0
	void ShowNextDrawBatch(); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A11E0
	void ShowNextDrawItem(); // (Final, Native, Public, BlueprintCallable) // @ 0x1425A1200

	bool IsPxViewValid() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14259E820

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PixUIWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PixUIWidget")
	}
	static class UPixUIWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPixUIWidget>();
	}
};
DUMPER7_ASSERTS_UPixUIWidget;

// Class PixUI.PxCustomDelegate
// 0x0060 (0x0088 - 0x0028)
class UPxCustomDelegate final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPxCustomDelegate* MakeCustomDelegate(const class FString& strCustomDelegateName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14259F180

	void OnPxCustomDelegate(); // (Final, Native, Public) // @ 0x140C994B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PxCustomDelegate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PxCustomDelegate")
	}
	static class UPxCustomDelegate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPxCustomDelegate>();
	}
};
DUMPER7_ASSERTS_UPxCustomDelegate;

// Class PixUI.PxCustomInterfaceDyImp
// 0x00A8 (0x00D0 - 0x0028)
class UPxCustomInterfaceDyImp final : public UObject
{
public:
	uint8                                         Pad_28[0xA8];                                      // 0x0028(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UPxCustomInterfaceDyImp* MakeCustomInterface(const class FString& strCustomInterfaceName, class UClass* pOverrideBaseClass); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14259F240

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PxCustomInterfaceDyImp")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PxCustomInterfaceDyImp")
	}
	static class UPxCustomInterfaceDyImp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPxCustomInterfaceDyImp>();
	}
};
DUMPER7_ASSERTS_UPxCustomInterfaceDyImp;

// Class PixUI.PxFileLoad
// 0x0068 (0x0090 - 0x0028)
class UPxFileLoad final : public UObject
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnFileLoad(const TArray<uint8>& arrayFileData); // (Final, Native, Public, HasOutParams) // @ 0x14259FB70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PxFileLoad")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PxFileLoad")
	}
	static class UPxFileLoad* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPxFileLoad>();
	}
};
DUMPER7_ASSERTS_UPxFileLoad;

// Class PixUI.PxSubLayerWidget
// 0x02B0 (0x0400 - 0x0150)
class UPxSubLayerWidget : public UWidget
{
public:
	uint8                                         Pad_150[0x2B0];                                    // 0x0150(0x02B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PxSubLayerWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PxSubLayerWidget")
	}
	static class UPxSubLayerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPxSubLayerWidget>();
	}
};
DUMPER7_ASSERTS_UPxSubLayerWidget;

// Class PixUI.PxSubCtrlWidget
// 0x0010 (0x0410 - 0x0400)
class UPxSubCtrlWidget final : public UPxSubLayerWidget
{
public:
	uint8                                         Pad_400[0x10];                                     // 0x0400(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PxSubCtrlWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PxSubCtrlWidget")
	}
	static class UPxSubCtrlWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPxSubCtrlWidget>();
	}
};
DUMPER7_ASSERTS_UPxSubCtrlWidget;

// Class PixUI.PxSubNodeWidget
// 0x02B0 (0x0400 - 0x0150)
class UPxSubNodeWidget final : public UWidget
{
public:
	uint8                                         Pad_150[0x2B0];                                    // 0x0150(0x02B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PxSubNodeWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PxSubNodeWidget")
	}
	static class UPxSubNodeWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPxSubNodeWidget>();
	}
};
DUMPER7_ASSERTS_UPxSubNodeWidget;

}

