#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_IK_3P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GPGameplay_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Player_IK_3P.Player_IK_3P_C
// 0x0930 (0x1350 - 0x0A20)
class UPlayer_IK_3P_C final : public UGPAnimInstance_PlayerIK
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_7A773AC34459AEC6B783B59275A0444F; // 0x0A28(0x0070)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2BFD2F3A409B9E212AC6B7BD9B4A3088; // 0x0A98(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E4F942824AC630B370269B929CA6D188; // 0x0BF8(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D801E69442D153FCB5DEB38E98832B42; // 0x0D58(0x0060)()
	uint8                                         Pad_DB8[0x8];                                      // 0x0DB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_DD94BD4E47723AACE5C6D3BE75DE62CC; // 0x0DC0(0x0220)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1FE9ADF74FFBE3353C174F9DD349D473; // 0x0FE0(0x0220)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_FE40BF3448E2E51328F077A7F47656D7; // 0x1200(0x0060)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_87B59CA1444C2A2385D9A0A23C8574F6; // 0x1260(0x00B0)()
	struct FVector                                Right_Foot_IK_Location;                            // 0x1310(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Right_Foot_IK_Rotation;                            // 0x131C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Right_Foot_IK_Modify_Alpha;                        // 0x1328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Left_Foot_IK_Rotation;                             // 0x132C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Left_Foot_IK_Location;                             // 0x1338(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Left_Foot_IK_Modify_Alpha;                         // 0x1344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstUpdate;                                       // 0x1348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0); // (HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Handle_Foot_Look(class FName FootLockCurveName, class FName IK_Foot_Bone_Name, float& Foot_IK_Modify_Alpha, struct FVector& Foot_IK_Location, struct FRotator& Foot_IK_Rotation); // (Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BlueprintInitializeAnimation(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BlueprintUpdateAnimation(float DeltaTimeX); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_Player_IK_3P(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Player_IK_3P_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Player_IK_3P_C")
	}
	static class UPlayer_IK_3P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayer_IK_3P_C>();
	}
};
DUMPER7_ASSERTS_UPlayer_IK_3P_C;

}

