#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrefabricatorRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PrefabricatorRuntime_structs.hpp"


namespace SDK
{

// Class PrefabricatorRuntime.PrefabActor
// 0x0020 (0x0390 - 0x0370)
class APrefabActor : public AActor
{
public:
	class UPrefabComponent*                       PrefabComponent;                                   // 0x0370(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  LastUpdateID;                                      // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x0388(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class AActor*> GetChildActorsByClass(TSubclassOf<class AActor> ActorClass); // (Final, Native, Public, BlueprintCallable) // @ 0x142619750
	TArray<class AActor*> GetChildActorsByComponent(TSubclassOf<class UActorComponent> ComponentClass); // (Final, Native, Public, BlueprintCallable) // @ 0x142619830
	TArray<class UActorComponent*> GetChildComponentsByComponent(TSubclassOf<class UActorComponent> ComponentClass); // (Final, Native, Public, BlueprintCallable) // @ 0x142619910
	class UPrefabricatorAsset* GetPrefabAsset(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x142619A40
	bool IsPrefabOutdated(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x142619A70
	void LoadPrefab(); // (Final, Native, Public, BlueprintCallable) // @ 0x142619AA0
	void RandomizeSeed(const struct FRandomStream& InRandom, bool bRecursive); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x142619C00
	void SavePrefab(); // (Final, Native, Public, BlueprintCallable) // @ 0x142619CD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabActor")
	}
	static class APrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabActor>();
	}
};
DUMPER7_ASSERTS_APrefabActor;

// Class PrefabricatorRuntime.ReplicablePrefabActor
// 0x0000 (0x0390 - 0x0390)
class AReplicablePrefabActor final : public APrefabActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplicablePrefabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplicablePrefabActor")
	}
	static class AReplicablePrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReplicablePrefabActor>();
	}
};
DUMPER7_ASSERTS_AReplicablePrefabActor;

// Class PrefabricatorRuntime.PrefabComponent
// 0x0030 (0x0280 - 0x0250)
class UPrefabComponent final : public USceneComponent
{
public:
	TSoftObjectPtr<class UPrefabricatorAssetInterface> PrefabAssetInterface;                         // 0x0250(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabComponent")
	}
	static class UPrefabComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabComponent>();
	}
};
DUMPER7_ASSERTS_UPrefabComponent;

// Class PrefabricatorRuntime.PrefabRandomizer
// 0x0038 (0x03A8 - 0x0370)
class APrefabRandomizer final : public AActor
{
public:
	bool                                          bRandomizeOnBeginPlay;                             // 0x0370(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SeedOffset;                                        // 0x0374(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBuildTimePerFrame;                              // 0x0378(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRandomizationComplete;                           // 0x0380(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0x18];                                     // 0x0390(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Randomize(int32 InSeed); // (Final, Native, Public, BlueprintCallable) // @ 0x142619AC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabRandomizer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabRandomizer")
	}
	static class APrefabRandomizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabRandomizer>();
	}
};
DUMPER7_ASSERTS_APrefabRandomizer;

// Class PrefabricatorRuntime.PrefabricatorProperty
// 0x0030 (0x0058 - 0x0028)
class UPrefabricatorProperty final : public UObject
{
public:
	class FString                                 PropertyName;                                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExportedValue;                                     // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPrefabricatorPropertyAssetMapping> AssetSoftReferenceMappings;                    // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorProperty")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorProperty")
	}
	static class UPrefabricatorProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorProperty>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorProperty;

// Class PrefabricatorRuntime.PrefabricatorEventListener
// 0x0000 (0x0028 - 0x0028)
class UPrefabricatorEventListener final : public UObject
{
public:
	void PostSpawn(class APrefabActor* Prefab); // (Native, Event, Public, BlueprintEvent) // @ 0x14101B420

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorEventListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorEventListener")
	}
	static class UPrefabricatorEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorEventListener>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorEventListener;

// Class PrefabricatorRuntime.PrefabricatorAssetInterface
// 0x0010 (0x0038 - 0x0028)
class UPrefabricatorAssetInterface : public UObject
{
public:
	TSubclassOf<class UPrefabricatorEventListener> EventListener;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplicates;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorAssetInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorAssetInterface")
	}
	static class UPrefabricatorAssetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAssetInterface>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorAssetInterface;

// Class PrefabricatorRuntime.PrefabricatorAsset
// 0x0038 (0x0070 - 0x0038)
class UPrefabricatorAsset final : public UPrefabricatorAssetInterface
{
public:
	TArray<struct FPrefabricatorActorData>        ActorData;                                         // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EComponentMobility                            PrefabMobility;                                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  LastUpdateID;                                      // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UThumbnailInfo*                         ThumbnailInfo;                                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorAsset")
	}
	static class UPrefabricatorAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAsset>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorAsset;

// Class PrefabricatorRuntime.PrefabricatorAssetCollection
// 0x0018 (0x0050 - 0x0038)
class UPrefabricatorAssetCollection final : public UPrefabricatorAssetInterface
{
public:
	TArray<struct FPrefabricatorAssetCollectionItem> Prefabs;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorAssetCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorAssetCollection")
	}
	static class UPrefabricatorAssetCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAssetCollection>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorAssetCollection;

// Class PrefabricatorRuntime.PrefabricatorAssetUserData
// 0x0018 (0x0040 - 0x0028)
class UPrefabricatorAssetUserData final : public UAssetUserData
{
public:
	TWeakObjectPtr<class APrefabActor>            PrefabActor;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ItemID;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorAssetUserData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorAssetUserData")
	}
	static class UPrefabricatorAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAssetUserData>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorAssetUserData;

// Class PrefabricatorRuntime.PrefabricatorBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UPrefabricatorBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetAllAttachedActors(class AActor* Prefab, TArray<class AActor*>* AttachedActors); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142619650
	static void RandomizePrefab(class APrefabActor* PrefabActor, const struct FRandomStream& InRandom); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x142619B40
	static class APrefabActor* SpawnPrefab(const class UObject* WorldContextObject, class UPrefabricatorAssetInterface* Prefab, const struct FTransform& Transform, int32 Seed); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x142619CF0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorBlueprintLibrary")
	}
	static class UPrefabricatorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorBlueprintLibrary;

// Class PrefabricatorRuntime.PrefabricatorSettings
// 0x0008 (0x0040 - 0x0038)
class UPrefabricatorSettings final : public UDeveloperSettings
{
public:
	EPrefabricatorPivotPosition                   PivotPosition;                                     // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowDynamicUpdate;                               // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAssetThumbnails;                              // 0x003A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabricatorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabricatorSettings")
	}
	static class UPrefabricatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorSettings>();
	}
};
DUMPER7_ASSERTS_UPrefabricatorSettings;

// Class PrefabricatorRuntime.PrefabSeedLinkerComponent
// 0x0000 (0x0250 - 0x0250)
class UPrefabSeedLinkerComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabSeedLinkerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabSeedLinkerComponent")
	}
	static class UPrefabSeedLinkerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabSeedLinkerComponent>();
	}
};
DUMPER7_ASSERTS_UPrefabSeedLinkerComponent;

// Class PrefabricatorRuntime.PrefabSeedLinker
// 0x0018 (0x0388 - 0x0370)
class APrefabSeedLinker final : public AActor
{
public:
	TArray<TWeakObjectPtr<class APrefabActor>>    LinkedActors;                                      // 0x0370(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UPrefabSeedLinkerComponent*             SeedLinkerComponent;                               // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PrefabSeedLinker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PrefabSeedLinker")
	}
	static class APrefabSeedLinker* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabSeedLinker>();
	}
};
DUMPER7_ASSERTS_APrefabSeedLinker;

}

