#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyReplication

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "PropertyReplication_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class PropertyReplication.PropertyReplicationConnection
// 0x0000 (0x1DE8 - 0x1DE8)
class UPropertyReplicationConnection : public UIpConnection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationConnection")
	}
	static class UPropertyReplicationConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyReplicationConnection>();
	}
};
DUMPER7_ASSERTS_UPropertyReplicationConnection;

// Class PropertyReplication.PropertyReplicationPackageMapClient
// 0x0078 (0x0470 - 0x03F8)
class UPropertyReplicationPackageMapClient : public UPackageMapClient
{
public:
	uint8                                         Pad_3F8[0x78];                                     // 0x03F8(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationPackageMapClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationPackageMapClient")
	}
	static class UPropertyReplicationPackageMapClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyReplicationPackageMapClient>();
	}
};
DUMPER7_ASSERTS_UPropertyReplicationPackageMapClient;

// Class PropertyReplication.PropertyReplicationSettings
// 0x0018 (0x0050 - 0x0038)
class UPropertyReplicationSettings final : public UDeveloperSettings
{
public:
	TArray<TSoftClassPtr<class UClass>>           ReplicationActorClasses;                           // 0x0038(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         AOICellSize;                                       // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationSettings")
	}
	static class UPropertyReplicationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyReplicationSettings>();
	}
};
DUMPER7_ASSERTS_UPropertyReplicationSettings;

// Class PropertyReplication.PropertyReplicationSubsystem
// 0x0020 (0x0050 - 0x0030)
class UPropertyReplicationSubsystem final : public UWorldSubsystem
{
public:
	TArray<class APropertyReplicationActor*>      ReplicationActors;                                 // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationSubsystem")
	}
	static class UPropertyReplicationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyReplicationSubsystem>();
	}
};
DUMPER7_ASSERTS_UPropertyReplicationSubsystem;

// Class PropertyReplication.PropertyReplicationActor
// 0x0010 (0x0380 - 0x0370)
class APropertyReplicationActor : public AActor
{
public:
	uint8                                         Pad_370[0xC];                                      // 0x0370(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableFastNetFrame;                               // 0x037C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37D[0x3];                                      // 0x037D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationActor")
	}
	static class APropertyReplicationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APropertyReplicationActor>();
	}
};
DUMPER7_ASSERTS_APropertyReplicationActor;

// Class PropertyReplication.PropertyReplicationComponent
// 0x01E0 (0x02D8 - 0x00F8)
class UPropertyReplicationComponent final : public UActorComponent
{
public:
	struct FPropertyReplicationContainer          Container;                                         // 0x00F8(0x00E0)(Net, Transient, RepNotify, NativeAccessSpecifierPublic)
	struct FPropertyReplicationContainer          ContainerReplay;                                   // 0x01D8(0x00E0)(Net, RepNotify, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    InterfaceClass;                                    // 0x02C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReplicationPeriod;                                 // 0x02C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPropertyReplicationCullingMethod             CullingMethod;                                     // 0x02CC(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CullingDistance;                                   // 0x02D0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MulticastReliable(class UObject* Object, const TArray<uint8>& Data, int32 NumBits); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x142638B70
	void MulticastUnreliable(class UObject* Object, const TArray<uint8>& Data, int32 NumBits); // (Net, Native, Event, NetMulticast, Public) // @ 0x142638CB0
	void OnRep_Container(); // (Final, Native, Public) // @ 0x142638DF0
	void OnRep_ContainerReplay(); // (Final, Native, Public) // @ 0x142638E10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationComponent")
	}
	static class UPropertyReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyReplicationComponent>();
	}
};
DUMPER7_ASSERTS_UPropertyReplicationComponent;

// Class PropertyReplication.PropertyReplicationTestObject
// 0x0060 (0x0088 - 0x0028)
class UPropertyReplicationTestObject final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DummyInt;                                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x14];                                      // 0x0074(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MulticasReliable(int32 I); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x142638A50
	void MulticasUnreliable(int32 I); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x142638AE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationTestObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationTestObject")
	}
	static class UPropertyReplicationTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyReplicationTestObject>();
	}
};
DUMPER7_ASSERTS_UPropertyReplicationTestObject;

// Class PropertyReplication.PropertyReplicationTestActor
// 0x0C20 (0x0F90 - 0x0370)
class APropertyReplicationTestActor final : public AActor
{
public:
	class UPropertyReplicationTestObject*         Objects[0x80];                                     // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPropertyReplicationComponent*          PropertyReplicationComponent;                      // 0x0770(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_778[0x800];                                    // 0x0778(0x0800)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0F78(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F80[0x10];                                     // 0x0F80(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationTestActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationTestActor")
	}
	static class APropertyReplicationTestActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APropertyReplicationTestActor>();
	}
};
DUMPER7_ASSERTS_APropertyReplicationTestActor;

// Class PropertyReplication.PropertyReplicationInterface
// 0x0000 (0x0000 - 0x0000)
class IPropertyReplicationInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyReplicationInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyReplicationInterface")
	}
	static class IPropertyReplicationInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPropertyReplicationInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IPropertyReplicationInterface;

}

