#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReplayTool

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct ReplayTool.ReportRelatedFiles
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FReportRelatedFiles final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FReportRelatedFiles;

// ScriptStruct ReplayTool.ShotcutInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FShotcutInfo final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShotcutInfo;

// ScriptStruct ReplayTool.MemoryReport
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FMemoryReport final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMemoryReport;

// ScriptStruct ReplayTool.TextureMemoryInfo
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FTextureMemoryInfo final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTextureMemoryInfo;

// ScriptStruct ReplayTool.ObjMemoryInfo
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FObjMemoryInfo final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FObjMemoryInfo;

// ScriptStruct ReplayTool.PerformanceInfo
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x04) FPerformanceInfo final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPerformanceInfo;

// ScriptStruct ReplayTool.HistoryInfo
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FHistoryInfo final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHistoryInfo;

// ScriptStruct ReplayTool.S_ReplayInfo
// 0x0030 (0x0030 - 0x0000)
struct FS_ReplayInfo final
{
public:
	class FString                                 ReplayName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FriendlyName;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Timestamp;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LengthInMS;                                        // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValid;                                          // 0x002C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FS_ReplayInfo;

}

