#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ResourcesMemoryAnaly

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct ResourcesMemoryAnaly.MemoryStatistInfo
// 0x0020 (0x0020 - 0x0000)
struct FMemoryStatistInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           StatNames;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMemoryStatistInfo;

// ScriptStruct ResourcesMemoryAnaly.StatisticalInfo
// 0x0040 (0x0040 - 0x0000)
struct FStatisticalInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         FunctionFilterName;                                // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ResPathFilterName;                                 // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ResTypeFilter;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStatisticalInfo;

}

