#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichTextPlugin

#include "Basic.hpp"

#include "RichTextPlugin_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class RichTextPlugin.RichTextBlockExtenderDecorator
// 0x08B0 (0x08D8 - 0x0028)
class URichTextBlockExtenderDecorator : public URichTextBlockDecorator
{
public:
	TMulticastInlineDelegate<void(const struct FRichTextMetadata& InMetadata)> OnClicked;            // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              RichTextHyperlinkStyleSet;                         // 0x0038(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             RichTextHyperlinkStyleSetCache;                    // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              RichTextImageSet;                                  // 0x0068(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              RichTextImageSet_PlayStation;                      // 0x0090(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             RichTextImageSetCache;                             // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>              RichTextAnimationSet;                              // 0x00C0(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             RichTextAnimationSetCache;                         // 0x00E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AnimationDefaultUpdateRate;                        // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F4[0x7E4];                                     // 0x00F4(0x07E4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FText OnGetTips(const TMap<class FString, class FString>& InMetadata); // (Event, Protected, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnRichTextClicked(const TMap<class FString, class FString>& InMetadata); // (Event, Protected, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichTextBlockExtenderDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichTextBlockExtenderDecorator")
	}
	static class URichTextBlockExtenderDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextBlockExtenderDecorator>();
	}
};
DUMPER7_ASSERTS_URichTextBlockExtenderDecorator;

// Class RichTextPlugin.TextExtenderDecorator
// 0x02D0 (0x02F8 - 0x0028)
class UTextExtenderDecorator : public URichTextBlockDecorator
{
public:
	TSoftObjectPtr<class UDataTable>              ExtendTextStyleSet;                                // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                             ExtendTextStyleSetCache;                           // 0x0050(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x2A0];                                     // 0x0058(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TextExtenderDecorator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TextExtenderDecorator")
	}
	static class UTextExtenderDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextExtenderDecorator>();
	}
};
DUMPER7_ASSERTS_UTextExtenderDecorator;

}

