#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RichTextPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct RichTextPlugin.RichTextMetadata
// 0x0050 (0x0050 - 0x0000)
struct FRichTextMetadata final
{
public:
	TMap<class FString, class FString>            MetaData;                                          // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRichTextMetadata;

// ScriptStruct RichTextPlugin.RichTextAnimationRow
// 0x0010 (0x0018 - 0x0008)
struct FRichTextAnimationRow final : public FTableRowBase
{
public:
	TArray<struct FSlateBrush>                    AnimationBrush;                                    // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRichTextAnimationRow;

// ScriptStruct RichTextPlugin.RichTextHyperlinkRow
// 0x0540 (0x0548 - 0x0008)
struct FRichTextHyperlinkRow final : public FTableRowBase
{
public:
	struct FHyperlinkStyle                        HyperlinkStyle;                                    // 0x0008(0x0540)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRichTextHyperlinkRow;

// ScriptStruct RichTextPlugin.ToolTipStyle
// 0x00F8 (0x0100 - 0x0008)
struct FToolTipStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0008(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TextMargin;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BorderImage;                                       // 0x0070(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FToolTipStyle;

}

