#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RoadRuntime

#include "Basic.hpp"

#include "RoadRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class RoadRuntime.CrossActor
// 0x0030 (0x03B0 - 0x0380)
class ACrossActor final : public AStaticMeshActor
{
public:
	class FString                                 UniqueKey;                                         // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCrossActorManager>             SideActors;                                        // 0x0390(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCrossMeshManager>              SideMeshes;                                        // 0x03A0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	void DestroySideObjects(); // (Final, Native, Public) // @ 0x142748E20
	void PushSideActor(TSubclassOf<class AActor> InPrototype, const struct FVector& ActorRelativeLocation, const struct FRotator& ActorRelativeRotation, int32 SocketIndex, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x142748E60
	void PushSideMesh(class UStaticMesh* InPrototype, const struct FVector& MeshRelativeLocation, const struct FRotator& MeshRelativeRotation, int32 SocketIndex, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x1427492A0
	void UpdateSideActor(TSubclassOf<class AActor> InPrototype, const struct FVector& ActorRelativeLocation, const struct FRotator& ActorRelativeRotation, int32 SocketIndex, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x142749820
	void UpdateSideMesh(class UStaticMesh* InPrototype, const struct FVector& MeshRelativeLocation, const struct FRotator& MeshRelativeRotation, int32 SocketIndex, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x142749C60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CrossActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CrossActor")
	}
	static class ACrossActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACrossActor>();
	}
};
DUMPER7_ASSERTS_ACrossActor;

// Class RoadRuntime.RoadActor
// 0x0078 (0x03E8 - 0x0370)
class ARoadActor final : public AActor
{
public:
	ESplineMeshAxis                               SplineMeshAxis;                                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalOffset;                                       // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ARoadActor*                             Father;                                            // 0x0380(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UniqueKey;                                         // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       Spline;                                            // 0x0398(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Segmentation;                                      // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StepGeneration;                                    // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         size;                                              // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            RoadMesh;                                          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineMeshComponent*>           RoadMeshesComp;                                    // 0x03B8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FSideActorManager>              SideActors;                                        // 0x03C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FSideMeshManager>               SideMeshes;                                        // 0x03D8(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static float ApproxLength(const struct FInterpCurveVector& SplineInfo, const float Start, const float End, const int32 ApproxSections); // (Final, Native, Static, Public, HasOutParams) // @ 0x142748C80

	void AddSplineMesh(int32 MeshIndex); // (Final, Native, Public) // @ 0x142748C00
	void ClearSplineMeshes(); // (Final, Native, Public) // @ 0x142748E00
	void DestroySideObjects(); // (Final, Native, Public) // @ 0x142748E40
	void PushSideActor(TSubclassOf<class AActor> InPrototype, const struct FVector& ActorRelativeLocation, const struct FRotator& ActorRelativeRotation, int32 SocketIndex, int32 InShift, int32 InSpacing, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x142749040
	void PushSideMesh(class UStaticMesh* InPrototype, const struct FVector& MeshRelativeLocation, const struct FRotator& MeshRelativeRotation, int32 SocketIndex, int32 InShift, int32 InSpacing, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x142749480
	void UpdateSegment(int32 SegmentIndex, class USplineComponent* SplineComponent, class UStaticMesh* StaticMesh, ESplineMeshAxis inAxis); // (Final, Native, Public) // @ 0x1427496E0
	void UpdateSideActor(TSubclassOf<class AActor> InPrototype, const struct FVector& ActorRelativeLocation, const struct FRotator& ActorRelativeRotation, int32 SocketIndex, int32 InShift, int32 InSpacing, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x142749A00
	void UpdateSideMeshes(class UStaticMesh* InPrototype, const struct FVector& MeshRelativeLocation, const struct FRotator& MeshRelativeRotation, int32 SocketIndex, int32 InShift, int32 InSpacing, bool IsEnable, bool IsNormalized); // (Final, Native, Public, HasDefaults) // @ 0x142749E40
	void UpdateSplineMesh(int32 MeshIndex); // (Final, Native, Public) // @ 0x14274A0A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoadActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoadActor")
	}
	static class ARoadActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoadActor>();
	}
};
DUMPER7_ASSERTS_ARoadActor;

}

