#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeIcon

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct RuntimeIcon.AtlasRectangleContainer
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FAtlasRectangleContainer final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAtlasRectangleContainer;

// ScriptStruct RuntimeIcon.AtlasPackingAlgorithm
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FAtlasPackingAlgorithm final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAtlasPackingAlgorithm;

// ScriptStruct RuntimeIcon.AtlasRectangleData
// 0x001C (0x001C - 0x0000)
struct alignas(0x04) FAtlasRectangleData final
{
public:
	uint8                                         Pad_0[0x1C];                                       // 0x0000(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAtlasRectangleData;

// ScriptStruct RuntimeIcon.RTIConfigParam
// 0x0014 (0x0014 - 0x0000)
struct FRTIConfigParam final
{
public:
	float                                         IconScale;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrontendMaxNum;                                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrontendAtlasSize;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IngameMaxNum;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IngameAtlasSize;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRTIConfigParam;

}

