#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "RuntimeIcon_structs.hpp"


namespace SDK
{

// Class RuntimeIcon.RuntimeTile
// 0x0058 (0x0080 - 0x0028)
class URuntimeTile final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        TileKey;                                           // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartUV;                                           // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SizeUV;                                            // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URuntimeAtlas*                          RuntimeAtlas;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              RectangleDataStart;                                // 0x0058(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              RawSize;                                           // 0x0060(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TWeakObjectPtr<class UObject>>         RefWeakObjects;                                    // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bHigh;                                             // 0x0078(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransToLinear;                                    // 0x0079(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMergeTile;                                      // 0x007A(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStaticIconDownsampled;                          // 0x007B(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStaticIcon;                                     // 0x007C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RuntimeTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RuntimeTile")
	}
	static class URuntimeTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeTile>();
	}
};
DUMPER7_ASSERTS_URuntimeTile;

// Class RuntimeIcon.RuntimeAtlas
// 0x0098 (0x00C0 - 0x0028)
class URuntimeAtlas final : public UObject
{
public:
	class UTextureRenderTarget2D*                 AtlasRenderTarget2D;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x40];                                      // 0x0030(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint64, class URuntimeTile*>             AllTilesMap;                                       // 0x0070(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RuntimeAtlas")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RuntimeAtlas")
	}
	static class URuntimeAtlas* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeAtlas>();
	}
};
DUMPER7_ASSERTS_URuntimeAtlas;

// Class RuntimeIcon.RuntimeIconManager
// 0x00E8 (0x0110 - 0x0028)
class URuntimeIconManager final : public UObject
{
public:
	struct FRTIConfigParam                        RTIConfigParam;                                    // 0x0028(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URuntimeAtlas*>                  AllRuntimeAtlasList_Merge;                         // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class URuntimeTile>>    AllWeakTileList_Merge;                             // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<uint64, TWeakObjectPtr<class URuntimeTile>> AllWeakTileMap_DontMerge;                       // 0x0060(0x0050)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B0[0x60];                                      // 0x00B0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAllAtlas(); // (Final, Native, Public) // @ 0x1427626A0

	bool IsFrontend() const; // (Final, Native, Public, Const) // @ 0x1427626C0
	bool IsInGame() const; // (Final, Native, Public, Const) // @ 0x1427626F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RuntimeIconManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RuntimeIconManager")
	}
	static class URuntimeIconManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<URuntimeIconManager>();
	}
};
DUMPER7_ASSERTS_URuntimeIconManager;

}

