#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SafeHouse

#include "Basic.hpp"

#include "GameCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SafeHouse.DepartmentTitleState
// NumValues: 0x0004
enum class EDepartmentTitleState : uint8
{
	None                                     = 0,
	Hide                                     = 1,
	Show                                     = 2,
	DepartmentTitleState_MAX                 = 3,
};

// Enum SafeHouse.IconState
// NumValues: 0x0005
enum class SafeHouse::EIconState : uint8
{
	None                                     = 0,
	Hide                                     = 1,
	ShowIcon                                 = 2,
	ShowName                                 = 3,
	IconState_MAX                            = 4,
};

// Enum SafeHouse.NPCIconState
// NumValues: 0x0004
enum class ENPCIconState : uint8
{
	None                                     = 0,
	Hide                                     = 1,
	ShowName                                 = 2,
	NPCIconState_MAX                         = 3,
};

// Enum SafeHouse.SafeHouseDepartmentType
// NumValues: 0x0007
enum class ESafeHouseDepartmentType : uint8
{
	None                                     = 0,
	RD                                       = 1,
	Combat                                   = 2,
	Med                                      = 3,
	TE                                       = 4,
	Tactical                                 = 5,
	SafeHouseDepartmentType_MAX              = 6,
};

// Enum SafeHouse.SafeHouseNPCType
// NumValues: 0x0006
enum class ESafeHouseNPCType : uint8
{
	None                                     = 0,
	CommonNPC                                = 1,
	Insurance                                = 2,
	Merchant                                 = 3,
	Scavenger                                = 4,
	SafeHouseNPCType_MAX                     = 5,
};

// Enum SafeHouse.SafeHouseInteractiveType
// NumValues: 0x0005
enum class ESafeHouseInteractiveType : uint8
{
	None                                     = 0,
	OpenUI                                   = 1,
	PlayDialogue                             = 2,
	CallFunction                             = 3,
	SafeHouseInteractiveType_MAX             = 4,
};

// ScriptStruct SafeHouse.NPCUIInfo
// 0x0010 (0x0010 - 0x0000)
struct FNPCUIInfo final
{
public:
	TWeakObjectPtr<class UIrisSafeHouseInteractorNPCIcon> UI;                                        // 0x0000(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USHInteractorNPCComponent> NPCCmp;                                          // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNPCUIInfo;

// ScriptStruct SafeHouse.BuildingUIInfo
// 0x0008 (0x0008 - 0x0000)
struct FBuildingUIInfo final
{
public:
	TWeakObjectPtr<class ASafeHouseBuildingProxy> BuildingIns;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBuildingUIInfo;

// ScriptStruct SafeHouse.SafeHouseAreaInfoRow
// 0x0088 (0x0098 - 0x0010)
struct FSafeHouseAreaInfoRow final : public FDescRowBase
{
public:
	int32                                         AreaId;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AreaName;                                          // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         MaxLevel;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Levels_1;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UnlockCondition_1;                                 // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Levels_2;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UnlockCondition_2;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Levels_3;                                          // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UnlockCondition_3;                                 // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSafeHouseAreaInfoRow;

// ScriptStruct SafeHouse.SafeHouseBuildingCondition
// 0x0008 (0x0008 - 0x0000)
struct FSafeHouseBuildingCondition final
{
public:
	int32                                         BuildingId;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuildingLevel;                                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSafeHouseBuildingCondition;

// ScriptStruct SafeHouse.SafeHouseAreaLevelRow
// 0x0040 (0x0050 - 0x0010)
struct FSafeHouseAreaLevelRow final : public FDescRowBase
{
public:
	class FText                                   AreaName;                                          // 0x0010(0x0018)(Edit, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Levels;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSafeHouseBuildingCondition>    Conditions;                                        // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSafeHouseAreaLevelRow;

// ScriptStruct SafeHouse.SavedTrans
// 0x0030 (0x0030 - 0x0000)
struct FSavedTrans final
{
public:
	struct FQuat                                  Rotation;                                          // 0x0000(0x0010)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                translation;                                       // 0x0010(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale3D;                                           // 0x001C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSavedTrans;

// ScriptStruct SafeHouse.RangeTargetConfig
// 0x0040 (0x0040 - 0x0000)
struct FRangeTargetConfig final
{
public:
	class ADFMRangeTargetCharacter*               RangeTarget;                                       // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 RangeTargetParent;                                 // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGPSplinePath*                          RefSplinePath;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMelee;                                            // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartDistance;                                     // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistance;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultDistance;                                   // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HealthLvl;                                         // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        DefaultHelmet;                                     // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        DefaultBreastPlate;                                // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRangeTargetConfig;

}

