#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimplygonUObjects

#include "Basic.hpp"

#include "SimplygonUObjects_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SimplygonUObjects.SimplygonStandinPipeline
// 0x0038 (0x0060 - 0x0028)
class USimplygonStandinPipeline : public UObject
{
public:
	struct FChartAggregatorSettings               ChartAggregatorSettings;                           // 0x0028(0x0038)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonStandinPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonStandinPipeline")
	}
	static class USimplygonStandinPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonStandinPipeline>();
	}
};
DUMPER7_ASSERTS_USimplygonStandinPipeline;

// Class SimplygonUObjects.StandinNearPipeline
// 0x01C0 (0x0220 - 0x0060)
class UStandinNearPipeline final : public USimplygonStandinPipeline
{
public:
	struct FAggregationPipelineSettings           Settings;                                          // 0x0060(0x01C0)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StandinNearPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StandinNearPipeline")
	}
	static class UStandinNearPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandinNearPipeline>();
	}
};
DUMPER7_ASSERTS_UStandinNearPipeline;

// Class SimplygonUObjects.StandinFarPipeline
// 0x01D8 (0x0238 - 0x0060)
class UStandinFarPipeline final : public USimplygonStandinPipeline
{
public:
	struct FRemeshingPipelineSettings             Settings;                                          // 0x0060(0x01D8)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StandinFarPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StandinFarPipeline")
	}
	static class UStandinFarPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandinFarPipeline>();
	}
};
DUMPER7_ASSERTS_UStandinFarPipeline;

// Class SimplygonUObjects.BillboardCloudPipeline
// 0x0108 (0x0168 - 0x0060)
class UBillboardCloudPipeline final : public USimplygonStandinPipeline
{
public:
	struct FBillboardCloudPipelineSettings        Settings;                                          // 0x0060(0x0108)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BillboardCloudPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BillboardCloudPipeline")
	}
	static class UBillboardCloudPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBillboardCloudPipeline>();
	}
};
DUMPER7_ASSERTS_UBillboardCloudPipeline;

// Class SimplygonUObjects.SimplygonPipeline
// 0x0000 (0x0028 - 0x0028)
class USimplygonPipeline : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonPipeline")
	}
	static class USimplygonPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonPipeline>();
	}
};
DUMPER7_ASSERTS_USimplygonPipeline;

// Class SimplygonUObjects.FlipbookPipeline
// 0x0100 (0x0128 - 0x0028)
class UFlipbookPipeline final : public USimplygonPipeline
{
public:
	struct FFlipbookPipelineSettings              Settings;                                          // 0x0028(0x0100)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlipbookPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlipbookPipeline")
	}
	static class UFlipbookPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlipbookPipeline>();
	}
};
DUMPER7_ASSERTS_UFlipbookPipeline;

// Class SimplygonUObjects.BillboardCloudVegetationPipeline
// 0x0108 (0x0130 - 0x0028)
class UBillboardCloudVegetationPipeline final : public USimplygonPipeline
{
public:
	struct FBillboardCloudVegetationPipelineSettings Settings;                                       // 0x0028(0x0108)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BillboardCloudVegetationPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BillboardCloudVegetationPipeline")
	}
	static class UBillboardCloudVegetationPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBillboardCloudVegetationPipeline>();
	}
};
DUMPER7_ASSERTS_UBillboardCloudVegetationPipeline;

// Class SimplygonUObjects.RemeshingPipeline
// 0x01D8 (0x0200 - 0x0028)
class URemeshingPipeline final : public USimplygonPipeline
{
public:
	struct FRemeshingPipelineSettings             Settings;                                          // 0x0028(0x01D8)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RemeshingPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RemeshingPipeline")
	}
	static class URemeshingPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemeshingPipeline>();
	}
};
DUMPER7_ASSERTS_URemeshingPipeline;

// Class SimplygonUObjects.HighDensityMeshReductionPipeline
// 0x0030 (0x0058 - 0x0028)
class UHighDensityMeshReductionPipeline final : public USimplygonPipeline
{
public:
	struct FHighDensityMeshReductionPipelineSettings Settings;                                       // 0x0028(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HighDensityMeshReductionPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HighDensityMeshReductionPipeline")
	}
	static class UHighDensityMeshReductionPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighDensityMeshReductionPipeline>();
	}
};
DUMPER7_ASSERTS_UHighDensityMeshReductionPipeline;

// Class SimplygonUObjects.SimplygonMaterialCaster
// 0x0000 (0x0028 - 0x0028)
class USimplygonMaterialCaster : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonMaterialCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonMaterialCaster")
	}
	static class USimplygonMaterialCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonMaterialCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonMaterialCaster;

// Class SimplygonUObjects.SimplygonColorCaster
// 0x0030 (0x0058 - 0x0028)
class USimplygonColorCaster : public USimplygonMaterialCaster
{
public:
	struct FColorCasterSettings                   ColorCasterSettings;                               // 0x0028(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonColorCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonColorCaster")
	}
	static class USimplygonColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonColorCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonColorCaster;

// Class SimplygonUObjects.BaseColorCaster
// 0x0000 (0x0058 - 0x0058)
class UBaseColorCaster : public USimplygonColorCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseColorCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseColorCaster")
	}
	static class UBaseColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseColorCaster>();
	}
};
DUMPER7_ASSERTS_UBaseColorCaster;

// Class SimplygonUObjects.MetallicCaster
// 0x0000 (0x0058 - 0x0058)
class UMetallicCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetallicCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetallicCaster")
	}
	static class UMetallicCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetallicCaster>();
	}
};
DUMPER7_ASSERTS_UMetallicCaster;

// Class SimplygonUObjects.SpecualarCaster
// 0x0000 (0x0058 - 0x0058)
class USpecualarCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpecualarCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpecualarCaster")
	}
	static class USpecualarCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecualarCaster>();
	}
};
DUMPER7_ASSERTS_USpecualarCaster;

// Class SimplygonUObjects.RoughnessCaster
// 0x0000 (0x0058 - 0x0058)
class URoughnessCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RoughnessCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RoughnessCaster")
	}
	static class URoughnessCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoughnessCaster>();
	}
};
DUMPER7_ASSERTS_URoughnessCaster;

// Class SimplygonUObjects.SimplygonNormalCaster
// 0x0030 (0x0058 - 0x0028)
class USimplygonNormalCaster : public USimplygonMaterialCaster
{
public:
	struct FNormalCasterSettings                  NormalCasterSettings;                              // 0x0028(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonNormalCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonNormalCaster")
	}
	static class USimplygonNormalCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonNormalCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonNormalCaster;

// Class SimplygonUObjects.NormalCaster
// 0x0000 (0x0058 - 0x0058)
class UNormalCaster final : public USimplygonNormalCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NormalCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NormalCaster")
	}
	static class UNormalCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNormalCaster>();
	}
};
DUMPER7_ASSERTS_UNormalCaster;

// Class SimplygonUObjects.SimplygonOpacityCaster
// 0x0030 (0x0058 - 0x0028)
class USimplygonOpacityCaster : public USimplygonMaterialCaster
{
public:
	struct FOpacityCasterSettings                 OpacityCasterSettings;                             // 0x0028(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonOpacityCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonOpacityCaster")
	}
	static class USimplygonOpacityCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonOpacityCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonOpacityCaster;

// Class SimplygonUObjects.OpacityCaster
// 0x0000 (0x0058 - 0x0058)
class UOpacityCaster final : public USimplygonOpacityCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityCaster")
	}
	static class UOpacityCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityCaster>();
	}
};
DUMPER7_ASSERTS_UOpacityCaster;

// Class SimplygonUObjects.EmissiveCaster
// 0x0000 (0x0058 - 0x0058)
class UEmissiveCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EmissiveCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EmissiveCaster")
	}
	static class UEmissiveCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmissiveCaster>();
	}
};
DUMPER7_ASSERTS_UEmissiveCaster;

// Class SimplygonUObjects.OpacityMaskCaster
// 0x0000 (0x0058 - 0x0058)
class UOpacityMaskCaster final : public USimplygonOpacityCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OpacityMaskCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OpacityMaskCaster")
	}
	static class UOpacityMaskCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMaskCaster>();
	}
};
DUMPER7_ASSERTS_UOpacityMaskCaster;

// Class SimplygonUObjects.AmbientOcclusionMaskCaster
// 0x0000 (0x0058 - 0x0058)
class UAmbientOcclusionMaskCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmbientOcclusionMaskCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmbientOcclusionMaskCaster")
	}
	static class UAmbientOcclusionMaskCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientOcclusionMaskCaster>();
	}
};
DUMPER7_ASSERTS_UAmbientOcclusionMaskCaster;

// Class SimplygonUObjects.ReductionPipeline
// 0x0230 (0x0258 - 0x0028)
class UReductionPipeline final : public USimplygonPipeline
{
public:
	struct FReductionPipelineSettings             Settings;                                          // 0x0028(0x0230)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReductionPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReductionPipeline")
	}
	static class UReductionPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReductionPipeline>();
	}
};
DUMPER7_ASSERTS_UReductionPipeline;

// Class SimplygonUObjects.AggregationPipeline
// 0x01C0 (0x01E8 - 0x0028)
class UAggregationPipeline final : public USimplygonPipeline
{
public:
	struct FAggregationPipelineSettings           Settings;                                          // 0x0028(0x01C0)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AggregationPipeline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AggregationPipeline")
	}
	static class UAggregationPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAggregationPipeline>();
	}
};
DUMPER7_ASSERTS_UAggregationPipeline;

// Class SimplygonUObjects.SimplygonDisplacementCaster
// 0x0038 (0x0060 - 0x0028)
class USimplygonDisplacementCaster final : public USimplygonMaterialCaster
{
public:
	struct FDisplacementCasterSettings            DisplacementCasterSettings;                        // 0x0028(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonDisplacementCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonDisplacementCaster")
	}
	static class USimplygonDisplacementCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonDisplacementCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonDisplacementCaster;

// Class SimplygonUObjects.SimplygonAmbientOcclusionCaster
// 0x0040 (0x0068 - 0x0028)
class USimplygonAmbientOcclusionCaster final : public USimplygonMaterialCaster
{
public:
	struct FAmbientOcclusionCasterSettings        AmbientOcclusionCasterSettings;                    // 0x0028(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonAmbientOcclusionCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonAmbientOcclusionCaster")
	}
	static class USimplygonAmbientOcclusionCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonAmbientOcclusionCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonAmbientOcclusionCaster;

// Class SimplygonUObjects.SimplygonGeometryDataCaster
// 0x0068 (0x0090 - 0x0028)
class USimplygonGeometryDataCaster final : public USimplygonMaterialCaster
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryDataCasterSettings            GeometryDataCasterSettings;                        // 0x0030(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonGeometryDataCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonGeometryDataCaster")
	}
	static class USimplygonGeometryDataCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonGeometryDataCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonGeometryDataCaster;

// Class SimplygonUObjects.SimplygonVertexColorCaster
// 0x0048 (0x0070 - 0x0028)
class USimplygonVertexColorCaster final : public USimplygonMaterialCaster
{
public:
	struct FVertexColorCasterSettings             VertexColorCasterSettings;                         // 0x0028(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonVertexColorCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonVertexColorCaster")
	}
	static class USimplygonVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonVertexColorCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonVertexColorCaster;

// Class SimplygonUObjects.SimplygonComputeCaster
// 0x0038 (0x0060 - 0x0028)
class USimplygonComputeCaster final : public USimplygonMaterialCaster
{
public:
	struct FComputeCasterSettings                 ComputeCasterSettings;                             // 0x0028(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimplygonComputeCaster")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimplygonComputeCaster")
	}
	static class USimplygonComputeCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonComputeCaster>();
	}
};
DUMPER7_ASSERTS_USimplygonComputeCaster;

}

