#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkeletalMeshMergeRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SkeletalMeshMergeRuntime.EMeshMergeResultType
// NumValues: 0x000F
enum class EMeshMergeResultType : uint8
{
	None                                     = 0,
	Success                                  = 1,
	ExceptionInterrupt                       = 2,
	MergeMeshEmpty                           = 3,
	MergeSkeletonEmpty                       = 4,
	RequestTimeOut                           = 5,
	SourceMeshListEmpty                      = 6,
	FailToFindBoneOnSkeleton                 = 7,
	MissSourceSkeleton                       = 8,
	MergeableAnalysisFailed                  = 9,
	LodNumNotEqual                           = 10,
	BoneNumsMismatch                         = 11,
	VertexNumsMismatch                       = 12,
	IndexBufferInvalid                       = 13,
	EMeshMergeResultType_MAX                 = 14,
};

// ScriptStruct SkeletalMeshMergeRuntime.MergeSkeletalMeshDescriptor
// 0x00C8 (0x00C8 - 0x0000)
struct alignas(0x08) FMergeSkeletalMeshDescriptor final
{
public:
	uint8                                         Pad_0[0xC8];                                       // 0x0000(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMergeSkeletalMeshDescriptor;

// ScriptStruct SkeletalMeshMergeRuntime.MergeSkeletalMesh_MaterialOverride
// 0x0030 (0x0030 - 0x0000)
struct FMergeSkeletalMesh_MaterialOverride final
{
public:
	int32                                         MeshIndex;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LOD;                                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        OverrideMaterialPath;                              // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMergeSkeletalMesh_MaterialOverride;

// ScriptStruct SkeletalMeshMergeRuntime.MergeSkeletalMesh_MaterialOverrideKey
// 0x0010 (0x0010 - 0x0000)
struct FMergeSkeletalMesh_MaterialOverrideKey final
{
public:
	uint64                                        ItemID;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMergeSkeletalMesh_MaterialOverrideKey;

// ScriptStruct SkeletalMeshMergeRuntime.TextureMergeStructInfo
// 0x0020 (0x0020 - 0x0000)
struct FTextureMergeStructInfo final
{
public:
	TArray<struct FTextureMergingInfo>            TextureMergingInfos;                               // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     MergedTextureInfo;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTextureMergeStructInfo;

// ScriptStruct SkeletalMeshMergeRuntime.SkeletalMeshes
// 0x0010 (0x0010 - 0x0000)
struct FSkeletalMeshes final
{
public:
	TArray<class USkeletalMesh*>                  SkeletalMeshes;                                    // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSkeletalMeshes;

}

