#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMExtendedRuntime

#include "Basic.hpp"

#include "SMSystem_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct SMExtendedRuntime.SMTextNodeWidgetInfo
// 0x0B00 (0x0B00 - 0x0000)
struct FSMTextNodeWidgetInfo final : public FSMTextDisplayWidgetInfo
{
public:
	struct FInlineEditableTextBlockStyle          EditableTextStyle;                                 // 0x0000(0x0AF8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         WrapTextAt;                                        // 0x0AF8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AFC[0x4];                                      // 0x0AFC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSMTextNodeWidgetInfo;

// ScriptStruct SMExtendedRuntime.SMTextSerializer
// 0x0010 (0x0010 - 0x0000)
struct FSMTextSerializer final
{
public:
	TArray<class FName>                           ToTextFunctionNames;                               // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMTextSerializer;

// ScriptStruct SMExtendedRuntime.SMTextGraphProperty
// 0x0B28 (0x0C38 - 0x0110)
struct FSMTextGraphProperty final : public FSMGraphProperty_Base
{
public:
	class FText                                   Result;                                            // 0x0110(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSMTextNodeWidgetInfo                  WidgetInfo;                                        // 0x0128(0x0B00)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FSMTextSerializer                      TextSerializer;                                    // 0x0C28(0x0010)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSMTextGraphProperty;

}

