#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SMSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "SMSystem_structs.hpp"


namespace SDK
{

// Class SMSystem.SMInstanceInterface
// 0x0000 (0x0000 - 0x0000)
class ISMInstanceInterface final
{
public:
	class UObject* GetContext() const; // (Native, Public, Const) // @ 0x140EDAEA0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMInstanceInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMInstanceInterface")
	}
	static class ISMInstanceInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISMInstanceInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISMInstanceInterface;

// Class SMSystem.SMStateMachineInterface
// 0x0000 (0x0000 - 0x0000)
class ISMStateMachineInterface final
{
public:
	void Initialize(class UObject* Context, class UActorComponent* Component); // (Native, Public) // @ 0x140EDB3E0
	void Shutdown(); // (Native, Public) // @ 0x140EDC4C0
	void Start(); // (Native, Public) // @ 0x140D36010
	void Stop(); // (Native, Public) // @ 0x140EDC5A0
	void Update(float DeltaSeconds); // (Native, Public) // @ 0x140EDCAE0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMStateMachineInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMStateMachineInterface")
	}
	static class ISMStateMachineInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISMStateMachineInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISMStateMachineInterface;

// Class SMSystem.SMStateMachineNetworkedInterface
// 0x0000 (0x0000 - 0x0000)
class ISMStateMachineNetworkedInterface final
{
public:
	void ProcessTransaction(const TArray<struct FSMNetworkedTransaction>& Transactions); // (Native, Public, HasOutParams) // @ 0x140EDBE30

	bool ShouldReplicateStates() const; // (Native, Public, Const) // @ 0x140EDC490

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMStateMachineNetworkedInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMStateMachineNetworkedInterface")
	}
	static class ISMStateMachineNetworkedInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISMStateMachineNetworkedInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISMStateMachineNetworkedInterface;

// Class SMSystem.SMNodeInstance
// 0x0058 (0x0080 - 0x0028)
class USMNodeInstance : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoEvalExposedProperties;                        // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMGraphProperty>               ExposedPropertyOverrides;                          // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UTexture2D*                             NodeIcon;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              NodeIconSize;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           NodeIconTintColor;                                 // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  TemplateGuid;                                      // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ConstructionScript(); // (Native, Event, Public, BlueprintEvent) // @ 0x140C994F0
	void EvaluateGraphProperties(); // (Final, Native, Public, BlueprintCallable) // @ 0x140EE0EF0

	class UObject* GetContext() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE0F30
	const struct FGuid GetGuid() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE0F70
	class UTexture2D* GetNodeIcon() const; // (Native, Event, Public, BlueprintCallable, BlueprintEvent, BlueprintPure, Const) // @ 0x140EE1150
	struct FVector2D GetNodeIconSize() const; // (Native, Event, Public, HasDefaults, BlueprintCallable, BlueprintEvent, BlueprintPure, Const) // @ 0x140EE1180
	struct FLinearColor GetNodeIconTintColor() const; // (Native, Event, Public, HasDefaults, BlueprintCallable, BlueprintEvent, BlueprintPure, Const) // @ 0x140EE11C0
	class FString GetNodeName() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1200
	class USMStateMachineInstance* GetOwningStateMachineNodeInstance() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1360
	class USMInstance* GetStateMachineInstance(bool bTopMostInstance) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1500
	float GetTimeInState() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE15A0
	bool HasUpdated() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE16A0
	bool IsActive() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE16D0
	bool IsInEndState() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1700

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMNodeInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMNodeInstance")
	}
	static class USMNodeInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMNodeInstance>();
	}
};
DUMPER7_ASSERTS_USMNodeInstance;

// Class SMSystem.SMBlueprint
// 0x0008 (0x00A8 - 0x00A0)
class USMBlueprint final : public UBlueprint
{
public:
	int32                                         AssetVersion;                                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMBlueprint")
	}
	static class USMBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMBlueprint>();
	}
};
DUMPER7_ASSERTS_USMBlueprint;

// Class SMSystem.SMNodeBlueprint
// 0x0000 (0x00A0 - 0x00A0)
class USMNodeBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMNodeBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMNodeBlueprint")
	}
	static class USMNodeBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMNodeBlueprint>();
	}
};
DUMPER7_ASSERTS_USMNodeBlueprint;

// Class SMSystem.SMBlueprintGeneratedClass
// 0x0010 (0x0378 - 0x0368)
class USMBlueprintGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	struct FGuid                                  RootGuid;                                          // 0x0368(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMBlueprintGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMBlueprintGeneratedClass")
	}
	static class USMBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMBlueprintGeneratedClass>();
	}
};
DUMPER7_ASSERTS_USMBlueprintGeneratedClass;

// Class SMSystem.SMNodeBlueprintGeneratedClass
// 0x0000 (0x0368 - 0x0368)
class USMNodeBlueprintGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMNodeBlueprintGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMNodeBlueprintGeneratedClass")
	}
	static class USMNodeBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMNodeBlueprintGeneratedClass>();
	}
};
DUMPER7_ASSERTS_USMNodeBlueprintGeneratedClass;

// Class SMSystem.SMStateInstance_Base
// 0x0048 (0x00C8 - 0x0080)
class USMStateInstance_Base : public USMNodeInstance
{
public:
	bool                                          bEvalGraphsOnStart;                                // 0x0080(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvalGraphsOnUpdate;                               // 0x0081(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvalGraphsOnEnd;                                  // 0x0082(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvalGraphsOnInitialize;                           // 0x0083(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvalGraphsOnRootStateMachineStart;                // 0x0084(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvalGraphsOnRootStateMachineStop;                 // 0x0085(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStateBlueprintTick;                         // 0x0086(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreStateReplicate;                             // 0x0087(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreClientTickAdd;                              // 0x0088(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreServerTickAdd;                              // 0x0089(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KeyStateAddNumServer;                              // 0x008C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysUpdate;                                     // 0x0090(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableTickTransitionEvaluation;                  // 0x0091(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDefaultToParallel;                                // 0x0092(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowParallelReentry;                             // 0x0093(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStayActiveOnStateChange;                          // 0x0094(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvalTransitionsOnStart;                           // 0x0095(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExcludeFromAnyState;                              // 0x0096(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class USMStateInstance_Base* StateInstance)> OnStateBeginEvent;    // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMStateInstance_Base* StateInstance, float DeltaSeconds)> OnStateUpdateEvent; // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMStateInstance_Base* StateInstance)> OnStateEndEvent;      // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void EvaluateTransitions(); // (Final, Native, Public, BlueprintCallable) // @ 0x140EE0F10
	void OnStateBegin(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140EE1760
	void OnStateEnd(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140EE1780
	void SetActive(bool bValue); // (Final, Native, Public, BlueprintCallable) // @ 0x140EE17A0
	bool SwitchToLinkedState(class USMStateInstance_Base* NextStateInstance, bool bRequireTransitionToPass); // (Final, Native, Public, BlueprintCallable) // @ 0x140EE1830

	bool GetIncomingTransitions(TArray<class USMTransitionInstance*>* Transitions, bool bExcludeAlwaysFalse) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE0FA0
	class USMStateInstance_Base* GetNextStateByTransitionIndex(int32 Index_0) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE10C0
	bool GetOutgoingTransitions(TArray<class USMTransitionInstance*>* Transitions, bool bExcludeAlwaysFalse) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1240
	void GetStateInfo(struct FSMStateInfo* State) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1390
	class USMTransitionInstance* GetTransitionByIndex(int32 Index_0) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE15E0
	class USMTransitionInstance* GetTransitionToTake() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1670
	bool IsStateMachine() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE1730

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMStateInstance_Base")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMStateInstance_Base")
	}
	static class USMStateInstance_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMStateInstance_Base>();
	}
};
DUMPER7_ASSERTS_USMStateInstance_Base;

// Class SMSystem.SMConduitInstance
// 0x0008 (0x00D0 - 0x00C8)
class USMConduitInstance : public USMStateInstance_Base
{
public:
	bool                                          bEvalWithTransitions;                              // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEvaluate;                                      // 0x00C9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCanEvaluate(bool bValue); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDBFB0

	bool CanEnterTransition() const; // (Native, Event, Public, BlueprintCallable, BlueprintEvent, BlueprintPure, Const) // @ 0x140EDA6C0
	bool GetCanEvaluate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDAE70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMConduitInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMConduitInstance")
	}
	static class USMConduitInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMConduitInstance>();
	}
};
DUMPER7_ASSERTS_USMConduitInstance;

// Class SMSystem.SMInstance
// 0x0650 (0x0678 - 0x0028)
class USMInstance : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  RootStateMachineGuid;                              // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance)> OnStateMachineInitializedEvent;      // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance)> OnStateMachineStartedEvent;          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance, float DeltaSeconds)> OnStateMachineUpdatedEvent; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance)> OnStateMachineStoppedEvent;          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance, const struct FSMTransitionInfo& Transition)> OnStateMachineTransitionTakenEvent; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance, const struct FSMStateInfo& NewState, const struct FSMStateInfo& PreviousState)> OnStateMachineStateChangedEvent; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TScriptInterface<class ISMStateMachineNetworkedInterface> ServerStateMachine;                    // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x150];                                     // 0x00C0(0x0150)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMNetworkedTransaction>        ActiveTransactions;                                // 0x0210(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FSMStateMachine                        RootStateMachine;                                  // 0x0220(0x0338)(Protected, NativeAccessSpecifierProtected)
	class UObject*                                R_StateMachineContext;                             // 0x0558(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                          R_ActiveStates;                                    // 0x0560(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGuid>                          RootStatePathGuidArray;                            // 0x0570(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FSMRepStateInfo                        RepActiveStateInfo;                                // 0x0580(0x0030)(Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	class USMInstance*                            ReferenceOwner;                                    // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USMStateMachineInstance>    StateMachineClass;                                 // 0x05B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C0[0x18];                                     // 0x05C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoManageTime;                                   // 0x05D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStopOnEndState;                                   // 0x05D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanEverTick;                                      // 0x05DA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanEverTickGeneralUpdate;                         // 0x05DB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanTickWhenPaused;                                // 0x05DC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DD[0x3];                                      // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickInterval;                                      // 0x05E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTickRegistered;                                   // 0x05E4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTickBeforeInitialize;                             // 0x05E5(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableBlueprintTick;                              // 0x05E6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnable3pLazyInit;                                 // 0x05E7(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseCachePathGuid;                                 // 0x05E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseFastStateRep;                                  // 0x05E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableDelayRepForCharacter;                       // 0x05EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5EB[0x1];                                      // 0x05EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeToWaitForUpdate;                            // 0x05EC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeSinceAllowedTick;                              // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         bIsProxy;                                          // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WorldSeconds;                                      // 0x05F8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WorldTimeDelta;                                    // 0x05FC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCallTickOnManualUpdate;                           // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsTicking;                                        // 0x0601(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsUpdating;                                       // 0x0602(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_603[0x1];                                      // 0x0603(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCanEvaluateTransitionsLocally : 1;                // 0x0604(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCanTakeTransitionsLocally : 1;                    // 0x0604(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCanExecuteStateLogic : 1;                         // 0x0604(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         R_bHasStarted : 1;                                 // 0x0604(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Net, Transient, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_605[0xB];                                      // 0x0605(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGuid, struct FSMGuidMap>         RootPathGuidCache;                                 // 0x0610(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                        ReferenceTemplates;                                // 0x0660(0x0010)(ExportObject, ZeroConstructor, DuplicateTransient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         HasAuthority;                                      // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EvaluateTransitions(); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDA750
	class USMInstance* GetMasterReferenceOwner(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x140EDAF10
	void Initialize(class UObject* Context, class UActorComponent* Component); // (Native, Public, BlueprintCallable) // @ 0x140EDB4A0
	bool Internal_EvaluateAndTakeTransitionChainByGuid(const struct FGuid& PathGuid); // (Final, Native, Protected, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140EDB570
	void Internal_EventCleanup(const struct FGuid& NodeGuid); // (Final, Native, Protected, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140EDB620
	void Internal_EventUpdate(); // (Final, Native, Protected, BlueprintCallable) // @ 0x140EDB6C0
	void Internal_Update(float DeltaSeconds); // (Final, Native, Protected, BlueprintCallable) // @ 0x140EDB6E0
	void LazyInitalize(class UObject* Context, class UActorComponent* Component); // (Final, Native, Public) // @ 0x140EDB840
	void LoadFromMultipleStates(const TArray<struct FGuid>& FromGuids); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x140EDB900
	void LoadFromState(const struct FGuid& FromGuid, bool bAllParents); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x140EDB9D0
	void OnRep_ActiveStateChanges(); // (Native, Protected) // @ 0x140EDBAC0
	void OnRep_RootStatePathGuidArray(); // (Native, Protected) // @ 0x140EDBAE0
	void OnStateMachineInitialized(); // (Native, Event, Public, BlueprintEvent) // @ 0x140C99940
	void OnStateMachineStart(); // (Native, Event, Public, BlueprintEvent) // @ 0x140D31FF0
	void OnStateMachineStateChanged(const struct FSMStateInfo& ToState, const struct FSMStateInfo& FromState); // (Native, Event, Public, HasOutParams, BlueprintEvent) // @ 0x140EDBB00
	void OnStateMachineStop(); // (Native, Event, Public, BlueprintEvent) // @ 0x140EDBCB0
	void OnStateMachineTransitionTaken(const struct FSMTransitionInfo& Transition); // (Native, Event, Public, HasOutParams, BlueprintEvent) // @ 0x140EDBCD0
	void OnStateMachineUpdate(float DeltaSeconds); // (Native, Event, Public, BlueprintEvent) // @ 0x140EDBDB0
	void REP_StartChanged(); // (Final, Native, Protected) // @ 0x140EDBF00
	void SetAutoManageTime(bool Value); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDBF20
	void SetCanEverTick(bool Value); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC040
	void SetCanEverTickGeneralUpdate(bool Value); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC0D0
	void SetCanTickWhenPaused(bool Value); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC160
	void SetContext(class UObject* Context); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC1F0
	void SetStateMachineClass(TSubclassOf<class USMStateMachineInstance> NewStateMachineClass); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC270
	void SetStopOnEndState(bool Value); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC2F0
	void SetTickInterval(float Value); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC380
	void SetTickOnManualUpdate(bool Value); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC400
	void Shutdown(); // (Native, Public, BlueprintCallable) // @ 0x140EDC4E0
	void Start(); // (Native, Public, BlueprintCallable) // @ 0x140EDC500
	void StartWithNewContext(class UObject* Context); // (Final, Native, Public, BlueprintCallable) // @ 0x140EDC520
	void Stop(); // (Native, Public, BlueprintCallable) // @ 0x140EDC5C0
	void Tick(float DeltaTime); // (Native, Event, Public, BlueprintEvent) // @ 0x140EDC5E0
	void Update(float DeltaSeconds); // (Native, Public, BlueprintCallable) // @ 0x140EDCB60

	bool CanAutoManageTime() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA6A0
	bool CanEverTick() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA6F0
	bool CanEverTickGeneralUpdate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA710
	bool CanTickOnManualUpdate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA730
	struct FGuid GetActiveStateGuid() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA770
	class USMStateInstance_Base* GetActiveStateInstance(bool bCheckNested) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA7B0
	class FString GetActiveStateName() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA850
	void GetAllActiveStateGuids(TArray<struct FGuid>* ActiveGuids, bool IncludeNotRepState) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA8D0
	void GetAllActiveStateInstances(TArray<class USMStateInstance_Base*>* ActiveStateInstances) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDA9F0
	TArray<struct FGuid> GetAllCurrentStateGuids() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDAAC0
	TArray<class USMInstance*> GetAllReferencedInstances(bool bIncludeChildren) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDABA0
	void GetAllStateInstances(TArray<class USMStateInstance_Base*>* StateInstances) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDACD0
	void GetAllTransitionInstances(TArray<class USMTransitionInstance*>* TransitionInstances) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDADA0
	class UObject* GetContext() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDAED0
	struct FGuid GetNestedActiveStateGuid() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDAF40
	class FString GetNestedActiveStateName() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDAF80
	class USMInstance* GetReferencedInstanceByGuid(const struct FGuid& Guid) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB020
	class USMInstance* GetReferenceOwner() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB000
	struct FGuid GetSingleActiveStateGuid(bool bCheckNested) const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB0D0
	class USMStateInstance_Base* GetSingleActiveStateInstance(bool bCheckNested) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB170
	class USMStateInstance_Base* GetStateInstanceByGuid(const struct FGuid& Guid) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB210
	TSubclassOf<class USMStateMachineInstance> GetStateMachineClass() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB2C0
	float GetTickInterval() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB2E0
	class USMTransitionInstance* GetTransitionInstanceByGuid(const struct FGuid& Guid) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB300
	bool HasStarted() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB3B0
	bool IsActive() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB760
	bool IsInEndState() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB790
	bool IsInitialized() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB7C0
	bool IsTickable() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB7E0
	bool IsTickableWhenPaused() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDB810
	void TryGetNestedActiveState(struct FSMStateInfo* FoundState, bool* bSuccess) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDC660
	void TryGetStateInfo(const struct FGuid& Guid, struct FSMStateInfo* StateInfo, bool* bSuccess) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDC7B0
	void TryGetTransitionInfo(const struct FGuid& Guid, struct FSMTransitionInfo* TransitionInfo, bool* bSuccess) const; // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x140EDC950

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMInstance")
	}
	static class USMInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMInstance>();
	}
};
DUMPER7_ASSERTS_USMInstance;

// Class SMSystem.SMNodeArrayLibrary
// 0x0000 (0x0028 - 0x0028)
class USMNodeArrayLibrary final : public UObject
{
public:
	static void bCanEnterTransitionFromEvent(struct FSMTransition& Transition, bool bValue); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140EE18F0
	static void bCanEvaluate(struct FSMTransition& Transition, bool bValue); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140EE19E0
	static void bCanEvaluateFromEvent(struct FSMTransition& Transition, bool bValue); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140EE1AD0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMNodeArrayLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMNodeArrayLibrary")
	}
	static class USMNodeArrayLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMNodeArrayLibrary>();
	}
};
DUMPER7_ASSERTS_USMNodeArrayLibrary;

// Class SMSystem.SMStateInstance
// 0x0000 (0x00C8 - 0x00C8)
class USMStateInstance : public USMStateInstance_Base
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMStateInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMStateInstance")
	}
	static class USMStateInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMStateInstance>();
	}
};
DUMPER7_ASSERTS_USMStateInstance;

// Class SMSystem.SMActionInstance
// 0x0000 (0x0080 - 0x0080)
class USMActionInstance : public USMNodeInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMActionInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMActionInstance")
	}
	static class USMActionInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMActionInstance>();
	}
};
DUMPER7_ASSERTS_USMActionInstance;

// Class SMSystem.SMStateMachineComponent
// 0x00D0 (0x01C8 - 0x00F8)
class USMStateMachineComponent : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class USMInstance* Instance)> OnStateMachineInitializedEvent;      // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance)> OnStateMachineStartedEvent;          // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance, float DeltaSeconds)> OnStateMachineUpdatedEvent; // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance)> OnStateMachineStoppedEvent;          // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance, const struct FSMTransitionInfo& Transition)> OnStateMachineTransitionTakenEvent; // 0x0148(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USMInstance* Instance, const struct FSMStateInfo& NewState, const struct FSMStateInfo& PreviousState)> OnStateMachineStateChangedEvent; // 0x0158(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class USMInstance>                StateMachineClass;                                 // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMNetworkConfigurationType                   NetworkTickConfiguration;                          // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMNetworkConfigurationType                   NetworkTransitionConfiguration;                    // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMNetworkConfigurationType                   NetworkStateConfiguration;                         // 0x0172(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeSimulatedProxies;                          // 0x0173(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTakeTransitionsFromServerOnly;                    // 0x0174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionResetTimeSeconds;                        // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplicateStatesOnLoad;                            // 0x017C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDiscardTransitionsBeforeInitialize;               // 0x017D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17E[0x2];                                      // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeToWaitForTransitionUpdate;                  // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitializeOnBeginPlay;                            // 0x0184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartOnBeginPlay;                                 // 0x0185(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLetInstanceManageTick;                            // 0x0186(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_187[0x1];                                      // 0x0187(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMNetworkedTransaction>        R_NetworkedTransactions;                           // 0x0188(0x0010)(Net, ZeroConstructor, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSMNetworkedTransaction>        PendingTransactions;                               // 0x0198(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class USMInstance*                            R_Instance;                                        // 0x01A8(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USMInstance*                            InstanceTemplate;                                  // 0x01B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideTick;                                     // 0x01B8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanEverTick;                                      // 0x01B9(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideTickInterval;                             // 0x01BA(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1BB[0x1];                                      // 0x01BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickInterval;                                      // 0x01BC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          R_bShuttingDown;                                   // 0x01C0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanInstanceNetworkTick;                           // 0x01C1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(class UObject* Context, class UActorComponent* Component); // (Native, Public, BlueprintCallable) // @ 0x140EE3520
	void Internal_OnStateMachineStarted(class USMInstance* Instance); // (Final, Native, Protected) // @ 0x140EE35F0
	void Internal_OnStateMachineStateChanged(class USMInstance* Instance, const struct FSMStateInfo& ToState, const struct FSMStateInfo& FromState); // (Final, Native, Protected) // @ 0x140EE3670
	void Internal_OnStateMachineStopped(class USMInstance* Instance); // (Final, Native, Protected) // @ 0x140EE3840
	void Internal_OnStateMachineTransitionTaken(class USMInstance* Instance, const struct FSMTransitionInfo& Transition); // (Final, Native, Protected) // @ 0x140EE38C0
	void Internal_OnStateMachineUpdated(class USMInstance* Instance, float DeltaSeconds); // (Final, Native, Protected) // @ 0x140EE3A40
	void PrintAllStates(); // (Final, Native, Public, BlueprintCallable) // @ 0x140EE3B80
	void REP_NetworkedTransactions(); // (Native, Protected) // @ 0x140EE3BA0
	void REP_OnInstanceLoaded(); // (Native, Protected) // @ 0x140EE3BC0
	void REP_ShuttingDown(); // (Native, Protected) // @ 0x140EE3BE0
	void SERVER_Initialize(class UObject* Context); // (Net, NetReliable, Native, Event, Protected, NetServer, NetValidate) // @ 0x140EE3C00
	void SERVER_ProcessTransaction(const TArray<struct FSMNetworkedTransaction>& Transactions); // (Net, NetReliable, Native, Event, Protected, NetServer, NetValidate) // @ 0x140EE3CC0
	void SERVER_Shutdown(); // (Net, NetReliable, Native, Event, Protected, NetServer, NetValidate) // @ 0x140EE3DB0
	void SERVER_Start(); // (Net, NetReliable, Native, Event, Protected, NetServer, NetValidate) // @ 0x140EE3E00
	void SERVER_Stop(); // (Net, NetReliable, Native, Event, Protected, NetServer, NetValidate) // @ 0x140EE3E50
	void SERVER_Update(float DeltaTime); // (Net, NetReliable, Native, Event, Protected, NetServer, NetValidate) // @ 0x140EE3EA0
	void Shutdown(); // (Native, Public, BlueprintCallable) // @ 0x140EE3FE0
	void Start(); // (Native, Public, BlueprintCallable) // @ 0x140EE4010
	void Stop(); // (Native, Public, BlueprintCallable) // @ 0x140EE4040
	void Update(float DeltaSeconds); // (Native, Public, BlueprintCallable) // @ 0x140EE4070

	class USMInstance* GetInstance() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE33C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMStateMachineComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMStateMachineComponent")
	}
	static class USMStateMachineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMStateMachineComponent>();
	}
};
DUMPER7_ASSERTS_USMStateMachineComponent;

// Class SMSystem.SMStateMachineInstance
// 0x0008 (0x00D0 - 0x00C8)
class USMStateMachineInstance : public USMStateInstance_Base
{
public:
	bool                                          bWaitForEndState;                                  // 0x00C8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseCurrentState;                                // 0x00C9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseIfNotEndState;                               // 0x00CA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEndStateReached(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140D2EEA0
	void OnStateMachineCompleted(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140EE3B00

	void GetAllStateInstances(TArray<class USMStateInstance_Base*>* StateInstances) const; // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE32C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SMStateMachineInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SMStateMachineInstance")
	}
	static class USMStateMachineInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMStateMachineInstance>();
	}
};
DUMPER7_ASSERTS_USMStateMachineInstance;

// Class SMSystem.SMTransitionInstance
// 0x0028 (0x00A8 - 0x0080)
class USMTransitionInstance : public USMNodeInstance
{
public:
	int32                                         PriorityOrder;                                     // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunParallel;                                      // 0x0084(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEvalIfNextStateActive;                            // 0x0085(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEvaluate;                                      // 0x0086(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEvaluateFromEvent;                             // 0x0087(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEvalWithStartState;                            // 0x0088(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class USMTransitionInstance* TransitionInstance)> OnTransitionEnteredEvent; // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          OnlyCheckTransitionOnServer;                       // 0x00A0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableCheckTransitionOnSimulatedProxy;            // 0x00A1(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseNativeTransitionExecute;                        // 0x00A2(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnTransitionEntered(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140EE3B20
	void OnTransitionInitialized(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140EE3B40
	void OnTransitionShutdown(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x140EE3B60
	void SetCanEvaluate(bool bValue); // (Final, Native, Public, BlueprintCallable) // @ 0x140EE3F50

	bool CanEnterTransition() const; // (Native, Event, Public, BlueprintCallable, BlueprintEvent, BlueprintPure, Const) // @ 0x140EE3020
	bool GetCanEvaluate() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE3390
	class USMStateInstance_Base* GetNextStateInstance() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140EE33E0
