#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SOLHelicopterMovePath_Default

#include "Basic.hpp"

#include "DFMGameplay_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SOLHelicopterMovePath_Default.SOLHelicopterMovePath_Default_C
// 0x0028 (0x03C8 - 0x03A0)
class ASOLHelicopterMovePath_Default_C final : public AEnterMovePath
{
public:
	class UArrowComponent*                        Arrow;                                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StartPoint;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TopPoint;                                          // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            FlyPercentAndTimeCurve;                            // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PathID;                                            // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PathTime;                                          // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GetSplinePercentByCurve(float Time, float* Percent); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent, BlueprintPure) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SOLHelicopterMovePath_Default_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SOLHelicopterMovePath_Default_C")
	}
	static class ASOLHelicopterMovePath_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASOLHelicopterMovePath_Default_C>();
	}
};
DUMPER7_ASSERTS_ASOLHelicopterMovePath_Default_C;

}

