#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpinePlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "SpinePlugin_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class SpinePlugin.SpineAtlasAsset
// 0x0030 (0x0058 - 0x0028)
class USpineAtlasAsset final : public UObject
{
public:
	TArray<class UTexture2D*>                     atlasPages;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RawData;                                           // 0x0040(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   atlasFileName;                                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineAtlasAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineAtlasAsset")
	}
	static class USpineAtlasAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineAtlasAsset>();
	}
};
DUMPER7_ASSERTS_USpineAtlasAsset;

// Class SpinePlugin.SpineSkeletonRendererComponent
// 0x03B0 (0x0B10 - 0x0760)
class USpineSkeletonRendererComponent final : public UProceduralMeshComponent
{
public:
	class UMaterialInterface*                     NormalBlendMaterial;                               // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     AdditiveBlendMaterial;                             // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MultiplyBlendMaterial;                             // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ScreenBlendMaterial;                               // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>       atlasNormalBlendMaterials;                         // 0x0780(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_790[0x50];                                     // 0x0790(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       atlasAdditiveBlendMaterials;                       // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7F0[0x50];                                     // 0x07F0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       atlasMultiplyBlendMaterials;                       // 0x0840(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_850[0x50];                                     // 0x0850(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       atlasScreenBlendMaterials;                         // 0x08A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B0[0x50];                                     // 0x08B0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DepthOffset;                                       // 0x0900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TextureParameterName;                              // 0x0904(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x090C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateCollision;                                  // 0x091C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91D[0x1F3];                                    // 0x091D(0x01F3)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear(); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FBF0
	void UpdateRenderer(class USpineSkeletonComponent* Skeleton); // (Final, Native, Public, BlueprintCallable) // @ 0x141273990

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineSkeletonRendererComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineSkeletonRendererComponent")
	}
	static class USpineSkeletonRendererComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineSkeletonRendererComponent>();
	}
};
DUMPER7_ASSERTS_USpineSkeletonRendererComponent;

// Class SpinePlugin.SpineBoneDriverComponent
// 0x0030 (0x0280 - 0x0250)
class USpineBoneDriverComponent final : public USceneComponent
{
public:
	class AActor*                                 Target;                                            // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoneName;                                          // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseComponentTransform;                             // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePosition;                                       // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseRotation;                                       // 0x026A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseScale;                                          // 0x026B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpineSkeletonComponent*                lastBoundComponent;                                // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeforeUpdateWorldTransform(class USpineSkeletonComponent* Skeleton); // (Final, Native, Protected) // @ 0x14126FB70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineBoneDriverComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineBoneDriverComponent")
	}
	static class USpineBoneDriverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineBoneDriverComponent>();
	}
};
DUMPER7_ASSERTS_USpineBoneDriverComponent;

// Class SpinePlugin.SpineBoneFollowerComponent
// 0x0020 (0x0270 - 0x0250)
class USpineBoneFollowerComponent final : public USceneComponent
{
public:
	class AActor*                                 Target;                                            // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoneName;                                          // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseComponentTransform;                             // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UsePosition;                                       // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseRotation;                                       // 0x026A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseScale;                                          // 0x026B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineBoneFollowerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineBoneFollowerComponent")
	}
	static class USpineBoneFollowerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineBoneFollowerComponent>();
	}
};
DUMPER7_ASSERTS_USpineBoneFollowerComponent;

// Class SpinePlugin.TrackEntry
// 0x0068 (0x0090 - 0x0028)
class UTrackEntry final : public UObject
{
public:
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> animationStart;                         // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationInterrupt;                     // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY, const struct FSpineEvent& evt)> AnimationEvent; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationComplete;                      // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> animationEnd;                           // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationDispose;                       // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetAlpha(); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FD50
	float getAnimationDuration(); // (Final, Native, Public, BlueprintCallable) // @ 0x141273A50
	float GetAnimationEnd(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270000
	float GetAnimationLast(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270050
	class FString getAnimationName(); // (Final, Native, Public, BlueprintCallable) // @ 0x141273AA0
	float GetAnimationStart(); // (Final, Native, Public, BlueprintCallable) // @ 0x1412700A0
	float GetAttachmentThreshold(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270330
	float GetDelay(); // (Final, Native, Public, BlueprintCallable) // @ 0x1412707E0
	float GetDrawOrderThreshold(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270830
	float GetEventThreshold(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270880
	bool GetLoop(); // (Final, Native, Public, BlueprintCallable) // @ 0x1412708D0
	float GetMixDuration(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270920
	float GetMixTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270970
	float GetTimeScale(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270F60
	float GetTrackEnd(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270FB0
	int32 GetTrackIndex(); // (Final, Native, Public, BlueprintCallable) // @ 0x141271000
	float GetTrackTime(); // (Final, Native, Public, BlueprintCallable) // @ 0x141271050
	bool isValidAnimation(); // (Final, Native, Public, BlueprintCallable) // @ 0x141273BF0
	void SetAlpha(float Alpha); // (Final, Native, Public, BlueprintCallable) // @ 0x141271A20
	void SetAnimationEnd(float animationEnd_0); // (Final, Native, Public, BlueprintCallable) // @ 0x141271DF0
	void SetAnimationLast(float animationLast); // (Final, Native, Public, BlueprintCallable) // @ 0x141271E80
	void SetAnimationStart(float animationStart_0); // (Final, Native, Public, BlueprintCallable) // @ 0x141271F10
	void SetAttachmentThreshold(float attachmentThreshold); // (Final, Native, Public, BlueprintCallable) // @ 0x1412723F0
	void SetDelay(float Delay); // (Final, Native, Public, BlueprintCallable) // @ 0x1412726F0
	void SetDrawOrderThreshold(float drawOrderThreshold); // (Final, Native, Public, BlueprintCallable) // @ 0x141272780
	void SetEventThreshold(float eventThreshold); // (Final, Native, Public, BlueprintCallable) // @ 0x141272990
	void SetLoop(bool Loop); // (Final, Native, Public, BlueprintCallable) // @ 0x141272A20
	void SetMixDuration(float mixDuration); // (Final, Native, Public, BlueprintCallable) // @ 0x141272AB0
	void SetMixTime(float mixTime); // (Final, Native, Public, BlueprintCallable) // @ 0x141272B40
	void SetTimeScale(float TimeScale); // (Final, Native, Public, BlueprintCallable) // @ 0x1412736D0
	void SetTrackEnd(float trackEnd); // (Final, Native, Public, BlueprintCallable) // @ 0x1412737A0
	void SetTrackTime(float TrackTime); // (Final, Native, Public, BlueprintCallable) // @ 0x141273830

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TrackEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TrackEntry")
	}
	static class UTrackEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrackEntry>();
	}
};
DUMPER7_ASSERTS_UTrackEntry;

// Class SpinePlugin.SpineSkeletonComponent
// 0x0058 (0x0150 - 0x00F8)
class USpineSkeletonComponent : public UActorComponent
{
public:
	class USpineAtlasAsset*                       Atlas;                                             // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpineSkeletonDataAsset*                SkeletonData;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USpineSkeletonComponent* Skeleton)> BeforeUpdateWorldTransform; // 0x0108(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USpineSkeletonComponent* Skeleton)> AfterUpdateWorldTransform; // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USpineAtlasAsset*                       lastAtlas;                                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USpineSkeletonDataAsset*                lastData;                                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float getAnimationDuration(const class FString& AnimationName); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FDA0
	void GetAnimations(TArray<class FString>* Animations); // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x1412700F0
	void GetBones(TArray<class FString>* Bones); // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141270480
	struct FTransform GetBoneWorldTransform(const class FString& BoneName); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x141270380
	float GetScaleX(); // (Final, Native, Public, BlueprintCallable) // @ 0x1412709C0
	float GetScaleY(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270A20
	void GetSkins(TArray<class FString>* Skins); // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141270A80
	void GetSlots(TArray<class FString>* Slots); // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141270CC0
	bool HasAnimation(const class FString& AnimationName); // (Final, Native, Public, BlueprintCallable) // @ 0x1412710A0
	bool HasBone(const class FString& BoneName); // (Final, Native, Public, BlueprintCallable) // @ 0x141271300
	bool HasSkin(const class FString& SkinName); // (Final, Native, Public, BlueprintCallable) // @ 0x141271560
	bool HasSlot(const class FString& SlotName); // (Final, Native, Public, BlueprintCallable) // @ 0x1412717C0
	bool SetAttachment(const class FString& SlotName, const class FString& attachmentName); // (Final, Native, Public, BlueprintCallable) // @ 0x141272030
	void SetBonesToSetupPose(); // (Final, Native, Public, BlueprintCallable) // @ 0x1412726B0
	void SetBoneWorldPosition(const class FString& BoneName, const struct FVector& Position); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x1412725A0
	void SetScaleX(float ScaleX); // (Final, Native, Public, BlueprintCallable) // @ 0x141272D70
	void SetScaleY(float ScaleY); // (Final, Native, Public, BlueprintCallable) // @ 0x141272E70
	bool SetSkin(const class FString& SkinName); // (Final, Native, Public, BlueprintCallable) // @ 0x141272F70
	bool SetSkins(TArray<class FString>& SkinNames); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1412731D0
	void SetSlotColor(const class FString& SlotName, const struct FColor& Color); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x141273430
	void SetSlotsToSetupPose(); // (Final, Native, Public, BlueprintCallable) // @ 0x141273590
	void SetToSetupPose(); // (Final, Native, Public, BlueprintCallable) // @ 0x141273760
	void UpdateWorldTransform(); // (Final, Native, Public, BlueprintCallable) // @ 0x141273A10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineSkeletonComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineSkeletonComponent")
	}
	static class USpineSkeletonComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineSkeletonComponent>();
	}
};
DUMPER7_ASSERTS_USpineSkeletonComponent;

// Class SpinePlugin.SpineSkeletonAnimationComponent
// 0x0100 (0x0250 - 0x0150)
class USpineSkeletonAnimationComponent final : public USpineSkeletonComponent
{
public:
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> animationStart;                         // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationInterrupt;                     // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY, const struct FSpineEvent& evt)> AnimationEvent; // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationComplete;                      // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> animationEnd;                           // 0x0190(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationDispose;                       // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 PreviewAnimation;                                  // 0x01B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PreviewSkin;                                       // 0x01C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D0[0x8];                                      // 0x01D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UTrackEntry*>                      trackEntries;                                      // 0x01D8(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bAutoPlaying;                                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_229[0x27];                                     // 0x0229(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTrackEntry* AddAnimation(int32 TrackIndex, const class FString& AnimationName, bool Loop, float Delay); // (Final, Native, Public, BlueprintCallable) // @ 0x14126F5D0
	class UTrackEntry* AddEmptyAnimation(int32 TrackIndex, float mixDuration, float Delay); // (Final, Native, Public, BlueprintCallable) // @ 0x14126F970
	void ClearTrack(int32 TrackIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FC10
	void ClearTracks(); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FD10
	class UTrackEntry* GetCurrent(int32 TrackIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1412706C0
	float GetTimeScale(); // (Final, Native, Public, BlueprintCallable) // @ 0x141270F00
	class UTrackEntry* SetAnimation(int32 TrackIndex, const class FString& AnimationName, bool Loop); // (Final, Native, Public, BlueprintCallable) // @ 0x141271AB0
	void SetAutoPlay(bool bInAutoPlays); // (Final, Native, Public, BlueprintCallable) // @ 0x141272480
	class UTrackEntry* SetEmptyAnimation(int32 TrackIndex, float mixDuration); // (Final, Native, Public, BlueprintCallable) // @ 0x141272810
	void SetPlaybackTime(float InPlaybackTime, bool bCallDelegates); // (Final, Native, Public, BlueprintCallable) // @ 0x141272BD0
	void SetTimeScale(float TimeScale); // (Final, Native, Public, BlueprintCallable) // @ 0x1412735D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineSkeletonAnimationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineSkeletonAnimationComponent")
	}
	static class USpineSkeletonAnimationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineSkeletonAnimationComponent>();
	}
};
DUMPER7_ASSERTS_USpineSkeletonAnimationComponent;

// Class SpinePlugin.SpineSkeletonDataAsset
// 0x00D0 (0x00F8 - 0x0028)
class USpineSkeletonDataAsset final : public UObject
{
public:
	float                                         DefaultMix;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSpineAnimationStateMixData>    MixData;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Bones;                                             // 0x0040(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         Slots;                                             // 0x0050(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         Skins;                                             // 0x0060(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         Animations;                                        // 0x0070(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         Events;                                            // 0x0080(0x0010)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<uint8>                                 RawData;                                           // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   skeletonDataFileName;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpineSkeletonDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpineSkeletonDataAsset")
	}
	static class USpineSkeletonDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpineSkeletonDataAsset>();
	}
};
DUMPER7_ASSERTS_USpineSkeletonDataAsset;

// Class SpinePlugin.SpineWidget
// 0x0588 (0x06D8 - 0x0150)
class USpineWidget final : public UWidget
{
public:
	class FString                                 InitialSkin;                                       // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpineAtlasAsset*                       Atlas;                                             // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpineSkeletonDataAsset*                SkeletonData;                                      // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     NormalBlendMaterial;                               // 0x0170(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     AdditiveBlendMaterial;                             // 0x0178(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MultiplyBlendMaterial;                             // 0x0180(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ScreenBlendMaterial;                               // 0x0188(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TextureParameterName;                              // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthOffset;                                       // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x019C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Brush;                                             // 0x01B0(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USpineWidget* Skeleton)> BeforeUpdateWorldTransform;         // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class USpineWidget* Skeleton)> AfterUpdateWorldTransform;          // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> animationStart;                         // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationInterrupt;                     // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY, const struct FSpineEvent& evt)> AnimationEvent; // 0x0280(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationComplete;                      // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> animationEnd;                           // 0x02A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UTrackEntry* ENTRY)> AnimationDispose;                       // 0x02B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x30];                                     // 0x02C0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USpineAtlasAsset*                       lastAtlas;                                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USpineSkeletonDataAsset*                lastData;                                          // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       atlasNormalBlendMaterials;                         // 0x0310(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x50];                                     // 0x0320(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       atlasAdditiveBlendMaterials;                       // 0x0370(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_380[0x50];                                     // 0x0380(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       atlasMultiplyBlendMaterials;                       // 0x03D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E0[0x50];                                     // 0x03E0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       atlasScreenBlendMaterials;                         // 0x0430(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_440[0x240];                                    // 0x0440(0x0240)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UTrackEntry*>                      trackEntries;                                      // 0x0680(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_6D0[0x1];                                      // 0x06D0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoPlaying;                                      // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D2[0x6];                                      // 0x06D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTrackEntry* AddAnimation(int32 TrackIndex, const class FString& AnimationName, bool Loop, float Delay); // (Final, Native, Public, BlueprintCallable) // @ 0x14126F7A0
	class UTrackEntry* AddEmptyAnimation(int32 TrackIndex, float mixDuration, float Delay); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FA70
	void ClearTrack(int32 TrackIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FC90
	void ClearTracks(); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FD30
	float getAnimationDuration(const class FString& AnimationName); // (Final, Native, Public, BlueprintCallable) // @ 0x14126FED0
	void GetAnimations(TArray<class FString>* Animations); // (Final, Native, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x141270210
