#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubstanceCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SubstanceCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SubstanceCore.SubstanceUtility
// 0x0000 (0x0028 - 0x0028)
class USubstanceUtility final : public UBlueprintFunctionLibrary
{
public:
	static void AsyncRendering(class USubstanceGraphInstance* InstancesToRender); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141034980
	static void ClearCache(); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x1410349F0
	static void CopyInputParameters(class USubstanceGraphInstance* SourceGraphInstance, class USubstanceGraphInstance* DestGraphInstance); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141034A10
	static class USubstanceInstanceFactory* CreateAggregateSubstanceFactory(class USubstanceInstanceFactory* OutputFactory, int32 OutputFactoryGraphIndex, class USubstanceInstanceFactory* InputFactory, int32 InputFactoryGraphIndex, const TArray<struct FSubstanceConnection>& Connections); // (Final, RequiredAPI, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x141034AC0
	static class USubstanceGraphInstance* CreateGraphInstance(class UObject* WorldContextObject, class USubstanceInstanceFactory* Factory, int32 GraphDescIndex, class UMaterial* ParentMaterial, const class FString& InstanceName); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141034D30
	static void DisableInstanceOutputs(class UObject* WorldContextObject, class USubstanceGraphInstance* GraphInstance, const TArray<int32>& OutputIndices); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141034F20
	static class USubstanceGraphInstance* DuplicateGraphInstance(class UObject* WorldContextObject, class USubstanceGraphInstance* GraphInstance); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141035090
	static void EnableInstanceOutputs(class UObject* WorldContextObject, class USubstanceGraphInstance* GraphInstance, const TArray<int32>& OutputIndices); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141035150
	static class FString GetFactoryName(class USubstanceGraphInstance* GraphInstance); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141035380
	static class FString GetGraphName(class USubstanceGraphInstance* GraphInstance); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x1410355D0
	static float GetSubstanceLoadingProgress(); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141036310
	static TArray<class USubstanceGraphInstance*> GetSubstances(class UMaterialInterface* Material); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141036460
	static TArray<class UTexture2D*> GetSubstanceTextures(class USubstanceGraphInstance* GraphInstance); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141036340
	static void ResetInputParameters(class USubstanceGraphInstance* GraphInstance); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x141036580
	static void SetGraphInstanceOutputSize(class USubstanceGraphInstance* GraphInstance, ESubstanceTextureSize Width, ESubstanceTextureSize Height); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x1410365F0
	static void SetGraphInstanceOutputSizeInt(class USubstanceGraphInstance* GraphInstance, int32 Width, int32 Height); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x1410366E0
	static void SyncRendering(class USubstanceGraphInstance* InstancesToRender); // (Final, RequiredAPI, Native, Static, Public, BlueprintCallable) // @ 0x1410370C0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceUtility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceUtility")
	}
	static class USubstanceUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceUtility>();
	}
};
DUMPER7_ASSERTS_USubstanceUtility;

// Class SubstanceCore.SubstanceGraphInstance
// 0x0150 (0x0178 - 0x0028)
class USubstanceGraphInstance final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PackageURL;                                        // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceInstanceFactory*              ParentFactory;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<uint32, class UTexture2D*>               ImageSources;                                      // 0x0050(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterial*                              CreatedMaterial;                                   // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceConstant*              ConstantCreatedMaterial;                           // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               DynamicCreatedMaterial;                            // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FGuid>                     OutputTextureLinkData;                             // 0x00B8(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<uint32, class USubstanceOutputData*>     OutputInstances;                                   // 0x0108(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsFrozen;                                         // 0x0158(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x1F];                                     // 0x0159(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMaterialInstanceDynamic* GetDynamicMaterialInstance(class FName Name_0, class UMaterial* InParentMaterial); // (Final, Native, Public, BlueprintCallable) // @ 0x1410352C0
	struct FSubstanceFloatInputDesc GetFloatInputDesc(const class FString& Identifier); // (Final, Native, Public, BlueprintCallable) // @ 0x141035450
	bool GetInputBool(const class FString& Identifier); // (Final, Native, Public, BlueprintCallable) // @ 0x1410356A0
	struct FLinearColor GetInputColor(const class FString& Identifier); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1410357D0
	TArray<float> GetInputFloat(const class FString& Identifier); // (Final, Native, Public, BlueprintCallable) // @ 0x141035910
	TArray<int32> GetInputInt(const class FString& Identifier); // (Final, Native, Public, BlueprintCallable) // @ 0x141035A90
	TArray<class FString> GetInputNames(); // (Final, Native, Public, BlueprintCallable) // @ 0x141035C10
	class FString GetInputString(const class FString& Identifier); // (Final, Native, Public, BlueprintCallable) // @ 0x141035D90
	ESubstanceInputType GetInputType(const class FString& InputName); // (Final, Native, Public, BlueprintCallable) // @ 0x141035F10
	struct FSubstanceInstanceDesc GetInstanceDesc(); // (Final, Native, Public, BlueprintCallable) // @ 0x141036040
	struct FSubstanceIntInputDesc GetIntInputDesc(const class FString& Identifier); // (Final, Native, Public, BlueprintCallable) // @ 0x141036190
	void SetInputBool(const class FString& Identifier, bool Bool); // (Final, Native, Public, BlueprintCallable) // @ 0x1410367D0
	void SetInputColor(const class FString& Identifier, const struct FLinearColor& Color); // (Final, Native, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x141036940
	void SetInputFloat(const class FString& Identifier, const TArray<float>& InputValues); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141036AC0
	bool SetInputImg(const class FString& InputName, class UObject* Value); // (Final, Native, Public, BlueprintCallable) // @ 0x141036C70
	void SetInputInt(const class FString& Identifier, const TArray<int32>& InputValues); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141036D80
	void SetInputString(const class FString& Identifier, const class FString& Value); // (Final, Native, Public, BlueprintCallable) // @ 0x141036F30

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceGraphInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceGraphInstance")
	}
	static class USubstanceGraphInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceGraphInstance>();
	}
};
DUMPER7_ASSERTS_USubstanceGraphInstance;

// Class SubstanceCore.SubstanceInstanceFactory
// 0x0060 (0x0088 - 0x0028)
class USubstanceInstanceFactory final : public UObject
{
public:
	TArray<class USubstanceGraphInstance*>        mGraphInstances;                                   // 0x0028(0x0010)(ZeroConstructor, DuplicateTransient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RelativeSourceFilePath;                            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AbsoluteSourceFilePath;                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceFileTimestamp;                               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceGenerationMode                      GenerationMode;                                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceInstanceFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceInstanceFactory")
	}
	static class USubstanceInstanceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceInstanceFactory>();
	}
};
DUMPER7_ASSERTS_USubstanceInstanceFactory;

// Class SubstanceCore.SubstanceOutputData
// 0x0030 (0x0058 - 0x0028)
class USubstanceOutputData final : public UObject
{
public:
	class UObject*                                ConnectedObject;                                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMaterialParameterInfo                 ParamInfo;                                         // 0x0030(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                ParentInstance;                                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  CacheGuid;                                         // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceOutputData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceOutputData")
	}
	static class USubstanceOutputData* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceOutputData>();
	}
};
DUMPER7_ASSERTS_USubstanceOutputData;

// Class SubstanceCore.SubstanceSettings
// 0x0040 (0x0068 - 0x0028)
class USubstanceSettings final : public UObject
{
public:
	int32                                         MemoryBudgetMb;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CPUCores;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AsyncLoadMipClip;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAsyncSubstancesRenderedPerFrame;                // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceEngineType                          SubstanceEngine;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDefaultSubstanceTextureSize                  DefaultSubstanceOutputSizeX;                       // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDefaultSubstanceTextureSize                  DefaultSubstanceOutputSizeY;                       // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      DefaultTemplateMaterial;                           // 0x0040(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceSettings")
	}
	static class USubstanceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceSettings>();
	}
};
DUMPER7_ASSERTS_USubstanceSettings;

// Class SubstanceCore.SubstanceTexture2D
// 0x0058 (0x01A0 - 0x0148)
class USubstanceTexture2D final : public UTexture2DDynamic
{
public:
	uint8                                         Pad_148[0x30];                                     // 0x0148(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USubstanceGraphInstance*                ParentInstance;                                    // 0x0178(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressX;                                          // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCooked;                                           // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_183[0x1D];                                     // 0x0183(0x001D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceTexture2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceTexture2D")
	}
	static class USubstanceTexture2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceTexture2D>();
	}
};
DUMPER7_ASSERTS_USubstanceTexture2D;

}

