#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubstanceCore

#include "Basic.hpp"


namespace SDK
{

// Enum SubstanceCore.ESubstanceInputType
// NumValues: 0x000C
enum class ESubstanceInputType : uint8
{
	SIT_Float                                = 0,
	SIT_Float2                               = 1,
	SIT_Float3                               = 2,
	SIT_Float4                               = 3,
	SIT_Integer                              = 4,
	SIT_Image                                = 5,
	SIT_Unused_6                             = 6,
	SIT_Unused_7                             = 7,
	SIT_Integer2                             = 8,
	SIT_Integer3                             = 9,
	SIT_Integer4                             = 10,
	SIT_MAX                                  = 11,
};

// Enum SubstanceCore.ESubstanceGenerationMode
// NumValues: 0x0007
enum class ESubstanceGenerationMode : uint8
{
	SGM_PlatformDefault                      = 0,
	SGM_Baked                                = 1,
	SGM_OnLoadSync                           = 2,
	SGM_OnLoadSyncAndCache                   = 3,
	SGM_OnLoadAsync                          = 4,
	SGM_OnLoadAsyncAndCache                  = 5,
	SGM_MAX                                  = 6,
};

// Enum SubstanceCore.EDefaultSubstanceTextureSize
// NumValues: 0x000B
enum class EDefaultSubstanceTextureSize : uint8
{
	size_0                                   = 0,
	size_16                                  = 4,
	size_32                                  = 5,
	size_64                                  = 6,
	size_128                                 = 7,
	size_256                                 = 8,
	size_512                                 = 9,
	size_1024                                = 10,
	size_2048                                = 11,
	size_4096                                = 12,
	size_MAX                                 = 13,
};

// Enum SubstanceCore.ESubstanceEngineType
// NumValues: 0x0003
enum class ESubstanceEngineType : uint8
{
	SET_CPU                                  = 0,
	SET_GPU                                  = 1,
	SET_MAX                                  = 2,
};

// Enum SubstanceCore.ESubstanceTextureSize
// NumValues: 0x000B
enum class ESubstanceTextureSize : uint8
{
	ERL_16                                   = 0,
	ERL_32                                   = 1,
	ERL_64                                   = 2,
	ERL_128                                  = 3,
	ERL_256                                  = 4,
	ERL_512                                  = 5,
	ERL_1024                                 = 6,
	ERL_2048                                 = 7,
	ERL_4096                                 = 8,
	ERL_8192                                 = 9,
	ERL_MAX                                  = 10,
};

// ScriptStruct SubstanceCore.SubstanceInputDesc
// 0x0018 (0x0018 - 0x0000)
struct FSubstanceInputDesc
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceInputType                           Type;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSubstanceInputDesc;

// ScriptStruct SubstanceCore.SubstanceInstanceDesc
// 0x0020 (0x0020 - 0x0000)
struct FSubstanceInstanceDesc final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSubstanceInputDesc>            Inputs;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSubstanceInstanceDesc;

// ScriptStruct SubstanceCore.SubstanceFloatInputDesc
// 0x0030 (0x0048 - 0x0018)
struct FSubstanceFloatInputDesc final : public FSubstanceInputDesc
{
public:
	TArray<float>                                 Min;                                               // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<float>                                 Max;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<float>                                 Default;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSubstanceFloatInputDesc;

// ScriptStruct SubstanceCore.SubstanceIntInputDesc
// 0x0030 (0x0048 - 0x0018)
struct FSubstanceIntInputDesc final : public FSubstanceInputDesc
{
public:
	TArray<int32>                                 Min;                                               // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<int32>                                 Max;                                               // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<int32>                                 Default;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSubstanceIntInputDesc;

// ScriptStruct SubstanceCore.SubstanceConnection
// 0x0020 (0x0020 - 0x0000)
struct FSubstanceConnection final
{
public:
	class FString                                 OutputIdentifier;                                  // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InputImageIdentifier;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSubstanceConnection;

}

