#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Swarms

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Swarms_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Swarms.SwarmsActorInterface
// 0x0000 (0x0000 - 0x0000)
class ISwarmsActorInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SwarmsActorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SwarmsActorInterface")
	}
	static class ISwarmsActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISwarmsActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISwarmsActorInterface;

// Class Swarms.SwarmsComponent
// 0x06D8 (0x07D0 - 0x00F8)
class USwarmsComponent : public UActorComponent
{
public:
	bool                                          bIsDrawMainVolume;                                 // 0x00F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrawBlock;                                      // 0x00F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrawDamageBox;                                  // 0x00FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrawCheckWater;                                 // 0x00FB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrawDebugConnectedInfo;                         // 0x00FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrawDebugConnectedSingle;                       // 0x00FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrawDebugLineTrace;                             // 0x00FE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDrawDebugTargetPath;                            // 0x00FF(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DrawBlockIndex;                                    // 0x0100(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DrawDebugCell_Y;                                   // 0x0104(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DrawDebugCell_Z;                                   // 0x0108(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsParallelFindPath;                               // 0x010C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DamageAreaSize;                                    // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageArea_HitRate;                                // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DamageArea_ShowRate;                               // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LODCheckCD;                                        // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpawnPointsCheckCellNum;                           // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        SpawnPoints;                                       // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        SpawnPoints_Crouch;                                // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        SpawnPoints_Prone;                                 // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FSwarmsQualitySettings                 HighSetting;                                       // 0x0158(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSwarmsQualitySettings                 MediumSetting;                                     // 0x0180(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSwarmsQualitySettings                 LowSetting;                                        // 0x01A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSwarmsMeshRendererData                MeshData;                                          // 0x01D0(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSwarmsBoidsSettings                   BoidsSettings_SOL;                                 // 0x0218(0x0098)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FSwarmsBoidsSettings                   BoidsSettings_BF;                                  // 0x02B0(0x0098)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FSwarmsVoxelSettings                   VoxelSettings;                                     // 0x0348(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x60];                                     // 0x0388(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSwarmsQualitySettings                 CurrQualitySettings;                               // 0x03E8(0x0028)(NativeAccessSpecifierPublic)
	struct FSwarmsBoidsSettings                   BoidsSettings;                                     // 0x0410(0x0098)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxLifeTime;                                       // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MainVolumeSize;                                    // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CellNumX;                                          // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CellNumY;                                          // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CellNumZ;                                          // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrMapCellsNum;                                   // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrBoidsNum;                                      // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrPlayTime;                                      // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellDataScale;                                     // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellSizeReciprocalY;                               // 0x04D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellSizeReciprocalZ;                               // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorToWorldTransform;                             // 0x04E0(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMatrix                                WorldToActorMatrix;                                // 0x0510(0x0040)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMatrix                                ActorToWorldMatrix;                                // 0x0550(0x0040)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsInitBlocksParams;                               // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSyncMapInfo;                                    // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsPlaying;                                        // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsCheckingCell;                                   // 0x0593(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInitBoids;                                      // 0x0594(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsClientStart;                                    // 0x0595(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_596[0x2];                                      // 0x0596(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CurrForward;                                       // 0x0598(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CurrRight;                                         // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                CurrUp;                                            // 0x05B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5BC[0x4];                                      // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ActorQuat;                                         // 0x05C0(0x0010)(IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UInstancedStaticMeshComponent*          ISMComponent;                                      // 0x05D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FTransform>                     TransArray;                                        // 0x05D8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 CustomDataArray;                                   // 0x05E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 ISMCustomDataArray;                                // 0x05F8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector>                        ValidSpawnPoints;                                  // 0x0608(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         TotalBlockNum;                                     // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BlockCehckTime;                                    // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OneSecondCheckNum;                                 // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         CurrBlockIndex;                                    // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         CurrBlockStart;                                    // 0x0625(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         CurrBlockEnd;                                      // 0x0626(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         CurrBlockMinDamageX;                               // 0x0627(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrBlockWaterHeight;                              // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 BlockCellsInfo;                                    // 0x0630(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrBlockCount;                                    // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSwarmsBlockSyncData>           BlockSyncDataArray;                                // 0x0648(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	int32                                         ClientInUesBlockIndex;                             // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ClientInUesCellIndex;                              // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrCheckY;                                        // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CurrCheckZ;                                        // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<bool>                                  LastCheckEmptyArray;                               // 0x0668(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         CheckCellCount;                                    // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CheckDiffuseCutCount;                              // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CheckWaterCutCount;                                // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         CheckEmptyCutCount;                                // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeInSpeed;                                       // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68C[0x4];                                      // 0x068C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 DamageCheckStartCells;                             // 0x0690(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         CurrDamageSpeed;                                   // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrDamageMinX;                                    // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrDamageMaxX;                                    // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrDamageShowMaxX;                                // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B0[0xD8];                                     // 0x06B0(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrLOD;                                           // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NextCheckLODTime;                                  // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInstanceDynamic*>       AllMainMaterials;                                  // 0x0790(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         BaseMoveToTargetCostTime;                          // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CheckTargetAddDistance;                            // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DamageAreaMoveCost;                                // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7AC[0x24];                                     // 0x07AC(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static float InverseForwardsOneAxis(float Val, bool bIsPositiveTarget, float MinAbsVal); // (Final, Native, Static, Protected) // @ 0x1427947B0
	static bool IsOverlap(float Start1, float End1, float Start2, float End2); // (Final, Native, Static, Protected) // @ 0x1427949B0
	static struct FVector SlerpForward(const struct FVector& Current, const struct FVector& Target, float DeltaTime, float AngleSpeed); // (Final, Native, Static, Protected, HasDefaults) // @ 0x142795910
	static void TryAddToBlockInfo(const float& ObjStart, const float& ObjEnd, TArray<struct FVector2D>* BlockInfo); // (Final, Native, Static, Protected, HasOutParams) // @ 0x142795F90

	void AddCellDamageInfo(int32 Y, int32 Z, int32 Layer); // (Final, Native, Protected) // @ 0x1427914B0
	void AddDamageTarget(const class APawn* Target, bool bIsLocalPawn, int32 CellIndex, int32 LayerNum); // (Final, Native, Public) // @ 0x1427915B0
	void CheckCurrBlockWaterHeight(); // (Final, Native, Protected) // @ 0x142791CF0
	bool CheckDiffuse(const struct FVector& pos); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x142792100
	void CheckLOD(); // (Final, Native, Protected) // @ 0x1427924A0
	void CheckParallelFindMoveToTargetPathTask(); // (Final, Native, Protected) // @ 0x142792880
	void CheckSpawnPoints(); // (Final, Native, Protected) // @ 0x1427929A0
	void ClientCheckBlockCells(); // (Final, Native, Protected) // @ 0x142792BD0
	void ClientDrawBox(const struct FVector& Center, const struct FVector& BoxSize, const struct FQuat& BoxQuat, const struct FColor& Color, float LifeTime); // (Net, NetReliable, Native, Event, Public, HasDefaults, NetClient) // @ 0x142792BF0
	void ClientTestStart(); // (Final, Native, Public) // @ 0x142792DA0
	void ClientTestStop(); // (Final, Native, Public) // @ 0x142792DC0
	int32 CountLOD(); // (Final, Native, Protected) // @ 0x142792DE0
	void CountMapCellsMaxMoveDistance(int32 Y, int32 Z, int32 LayerIndex); // (Final, Native, Protected) // @ 0x142792E10
	void CreateISMComponent(); // (Final, Native, Protected) // @ 0x142792F10
	void DoAddDamageTarget(const struct FSwarmsMoveToTargetData& CurrTarget); // (Final, Native, Public, HasOutParams) // @ 0x142792F30
	void DoCheckBlock(int32 Y, int32 Z); // (Final, Native, Protected) // @ 0x142793010
	bool DoCheckSpawnPoint(int32 CellY, int32 CellZ, const struct FVector& SpawnPoint); // (Final, Native, Protected, HasDefaults) // @ 0x1427930D0
	void DoClientStart(); // (Native, Protected) // @ 0x1427931E0
	void DoClientStop(); // (Final, Native, Protected) // @ 0x142793200
	void DoCustomTick(float DeltaTime); // (Final, Native, Public) // @ 0x142793530
	void DoDsStart(); // (Final, Native, Protected) // @ 0x1427935B0
	void DoDsStop(); // (Final, Native, Protected) // @ 0x1427935D0
	void DoFindDeathMapCells(int32 Y, int32 Z); // (Final, Native, Protected) // @ 0x1427935F0
	void DoFindMoveToTargetPath(TArray<struct FVector>* BaseMovePath, const struct FVector& TargetLocalPosition, const int32& LocalCellIndex, const int32& LocalLayerNum); // (Final, Native, Protected, HasOutParams, HasDefaults) // @ 0x1427936B0
	void DoInitBoids(const int32& Index_0); // (Native, Protected, HasOutParams) // @ 0x142793890
	bool DoSingleCellCheck(const struct FVector& pos, bool bCheckBlock, bool bDrawDebugLine); // (Final, Native, Protected, HasDefaults) // @ 0x142793B00
	bool DoTickCheckBlocks(float DeltaTime); // (Final, Native, Protected) // @ 0x142793C30
	void DoUesBlockCellsInfo(int32 BlockIndex); // (Final, Native, Protected) // @ 0x142793CC0
	void FindDeathMapCells(); // (Final, Native, Protected) // @ 0x142793EE0
	struct FVector FindDefaultSpawnPoint(); // (Final, Native, Protected, HasDefaults) // @ 0x142793F00
	void FindMoveToTargetPath(struct FSwarmsMoveToTargetData* CurrTarget); // (Final, Native, Protected, HasOutParams) // @ 0x1427940E0
	class UMaterialInterface* GetCurrMaterial(int32 LOD); // (Final, Native, Protected) // @ 0x142794330
	void HandleExistingParallelTask(); // (Final, Native, Protected) // @ 0x1427946A0
	void InitAllMapCellsDamageInfo(); // (Final, Native, Protected) // @ 0x1427946C0
	bool InitBlocksParams(); // (Final, Native, Protected) // @ 0x1427946E0
	void InitBoids(); // (Final, Native, Protected) // @ 0x142794710
	void InitBoidsSettings(); // (Final, Native, Protected) // @ 0x142794730
	void InitDamageCheckStartCells(); // (Final, Native, Protected) // @ 0x142794750
	void InitLineTraceParams(); // (Final, Native, Protected) // @ 0x142794770
	void InitQualitySettings(); // (Native, Protected) // @ 0x142794790
	bool IsNextEmptyBlock(int32 Y); // (Final, Native, Protected) // @ 0x142794920
	void OnRep_BlockSyncDataArray(); // (Final, Native, Protected) // @ 0x142795250
	void ParallelFindMoveToTargetPath(); // (Final, Native, Protected) // @ 0x142795270
	void SetAvatarMaterial(class UMaterialInterface* AvatarMaterial); // (Final, Native, Public) // @ 0x142795380
	void SetAvatarMesh(class UStaticMesh* AvatarMesh); // (Final, Native, Public) // @ 0x142795400
	void SetCurrBlockIndex(int32 Index_0); // (Final, Native, Protected) // @ 0x142795480
	void SetDamageArea(float DamageCenterX); // (Final, Native, Protected) // @ 0x142795500
	void SetShowLOD(int32 LOD); // (Final, Native, Protected) // @ 0x1427957C0
	void StartClientDoUesBlockCellsInfo(int32 BlockIndex); // (Final, Native, Protected) // @ 0x142795AB0
	void StartInitBlocks(); // (Final, Native, Protected) // @ 0x142795B30
	void StartParallelFindMoveToTargetPath(); // (Final, Native, Protected) // @ 0x142795B50
	void SyncMapInfoToClient(); // (Final, Native, Protected) // @ 0x142795C00
	void TickActorTransform(); // (Final, Native, Protected) // @ 0x142795C20
	void TickCheckBlocks(float DeltaTime); // (Final, Native, Protected) // @ 0x142795C40
	void TickClientDoUesBlockCellsInfo_Client(); // (Final, Native, Protected) // @ 0x142795CC0
	void TickDamageArea(); // (Final, Native, Protected) // @ 0x142795CE0
	void TickDamageTarget(float DeltaTime); // (Final, Native, Protected) // @ 0x142795D00
	bool TickFindAllMapCellsNextTarget(); // (Final, Native, Protected) // @ 0x142795D80
	void TickUpdateTransArray(float DeltaTime); // (Native, Protected) // @ 0x142795DB0
	void TryAddCellDamageInfo(int32 Y, int32 Z, const uint8& Start, const uint8& End); // (Final, Native, Protected, HasOutParams) // @ 0x142795E30
	bool TryCheckEmptyBlock(int32 Y, int32 Z); // (Final, Native, Protected) // @ 0x142796100
	void TryClientStart(); // (Final, Native, Protected) // @ 0x1427961C0
	void TryClientStart_Low(); // (Final, Native, Protected) // @ 0x1427961E0
	void TryMergeCellsInfo(uint8 CellInfo); // (Final, Native, Protected) // @ 0x142796200

	bool AddToOpenArray(const int32& Y, const int32& Z, const float& Start, const float& End, const int32& ParentIndex, const float& MoveCost, const float& TargetX, TArray<int32>* OpenCells, TMap<int32, struct FSwarmsFindPathData>* FindPathDataset) const; // (Final, Native, Protected, HasOutParams, Const) // @ 0x1427916F0
	bool CheckCellIndex(const int32& Index_0) const; // (Final, Native, Protected, HasOutParams, Const) // @ 0x142791C50
	bool CheckDamageMapCell(const struct FVector& LocalPosition, const float& radius, int32* CellIndex, int32* LayerNum) const; // (Final, Native, Protected, HasOutParams, HasDefaults, Const) // @ 0x142791DA0
	float CheckDamageTarget(const struct FVector& Position, const float& radius, int32* CellIndex, int32* LayerNum) const; // (Final, Native, Public, HasOutParams, HasDefaults, Const) // @ 0x142791F50
	bool CheckIndex(const int32& Y, const int32& Z, const bool& bShowError) const; // (Final, Native, Protected, HasOutParams, Const) // @ 0x142792360
	bool CheckPathPoint(const struct FVector& TargetPosition, const struct FVector& pathPoint) const; // (Final, Native, Protected, HasOutParams, HasDefaults, Const) // @ 0x1427928A0
	bool CheckTargetDistanceToCamera(const struct FVector& ActorLocation) const; // (Final, Native, Protected, HasOutParams, HasDefaults, Const) // @ 0x142792A50
	float DoCountMapCellsMaxMoveDistance(int32 Y, int32 Z, float* Start, float* End) const; // (Final, Native, Protected, HasOutParams, Const) // @ 0x142793220
	uint8 DoCountMapCellsTarget(int32 Y, int32 Z, uint8 Start, uint8 End, uint8 ForwardType) const; // (Final, Native, Protected, Const) // @ 0x1427933A0
	int32 FindMinOpenPoint(const TArray<int32>& OpenCells, const TMap<int32, struct FSwarmsFindPathData>& FindPathDataset) const; // (Final, Native, Protected, HasOutParams, Const) // @ 0x142793F40
	struct FVector FindMoveToTargetPathBaseLocation(const struct FVector& ActorLocation, const int32& CellIndex, const int32& LayerNum) const; // (Final, Native, Protected, HasOutParams, HasDefaults, Const) // @ 0x1427941C0
	const TArray<struct FVector> GetCurrSpawnPoints() const; // (Final, Native, Protected, Const) // @ 0x1427943C0
	bool GetIsFadeIn() const; // (Final, Native, Protected, Const) // @ 0x142794400
	struct FVector GetMoveToTargetCurrBaseLocation(const struct FSwarmsMoveToTargetData& Target) const; // (Final, Native, Protected, HasOutParams, HasDefaults, Const) // @ 0x142794430
	bool IsClient() const; // (Final, Native, Protected, Const) // @ 0x1427948C0
	bool IsDS() const; // (Final, Native, Protected, Const) // @ 0x1427948F0
	bool IsStandalone() const; // (Final, Native, Protected, Const) // @ 0x142794B00
	bool MoveCellIndex(int32* Y, int32* Z, int32 ForwardType) const; // (Final, Native, Protected, HasOutParams, Const) // @ 0x142794B30
	void NormalizeMovePath(TArray<struct FVector>* BaseMovePath, TArray<float>* BaseMoveRate) const; // (Final, Native, Protected, HasOutParams, Const) // @ 0x1427950E0
	bool RayCheckDamageMapCell(const struct FVector& LocalPosition, const float& TargetX) const; // (Final, Native, Protected, HasOutParams, HasDefaults, Const) // @ 0x142795290
	void UpdateInstances() const; // (Final, Native, Protected, Const) // @ 0x142796320

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SwarmsComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SwarmsComponent")
	}
	static class USwarmsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USwarmsComponent>();
	}
};
DUMPER7_ASSERTS_USwarmsComponent;

// Class Swarms.SwarmsComponentCPU
// 0x0000 (0x07D0 - 0x07D0)
class USwarmsComponentCPU final : public USwarmsComponent
{
public:
	static struct FVector MoveToTargetLerp(const struct FVector& offset, const struct FVector& From, const struct FVector& To, const float& FromRate, const float& ToRate, const float& Rate); // (Final, Native, Static, Private, HasOutParams, HasDefaults) // @ 0x142794D20

	void BaseUpdateTrans(uint16 Index_0, float DeltaTime); // (Final, Native, Private) // @ 0x142791AD0
	void BaseUpdateTrans_Low(uint16 Index_0, float DeltaTime); // (Final, Native, Private) // @ 0x142791B90
	void CheckDamageBox(const int32& Index_0); // (Final, Native, Private, HasOutParams) // @ 0x142791D10
	void CheckFadeIn(const int32& Index_0, const float& DeltaTime); // (Final, Native, Private, HasOutParams) // @ 0x1427921A0
	void CheckFadeIn_Low(const int32& Index_0, const float& DeltaTime); // (Final, Native, Private, HasOutParams) // @ 0x142792280
	void CheckMainVolume(const int32& Index_0, struct FVector* TargetPosition); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x1427924C0
	void CheckMapCells(const int32& Index_0, struct FVector* TargetPosition); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x1427925B0
	void CheckMapCells_Low(const int32& Index_0, struct FVector* TargetPosition); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x1427926A0
	void CheckNextNavPath(const int32& Index_0, const struct FVector& Position); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x142792790
	void CheckSpawnState(const int32& Index_0); // (Final, Native, Private, HasOutParams) // @ 0x1427929C0
	void CheckTargetVelocity(const int32& Index_0, const float& DeltaTime); // (Final, Native, Private, HasOutParams) // @ 0x142792AF0
	void DoInitBoids_Low(const int32& I); // (Final, Native, Private, HasOutParams) // @ 0x142793930
	bool DoSimpleMoveWithNavPath(const int32& Index_0, const struct FVector& NavPathPoint, float* MoveDis); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x1427939C0
	void DoUpdateTransArray(float DeltaTime, int32 Index_0); // (Final, Native, Private) // @ 0x142793D40
	void DoUpdateTransArray_Low(float DeltaTime, int32 Index_0); // (Final, Native, Private) // @ 0x142793E10
	struct FVector GetNavPath(const float& TargetX, const int32& IndexY, const int32& IndexZ); // (Final, Native, Private, HasOutParams, HasDefaults) // @ 0x142794530
	void MoveToTarget(uint16 Index_0, float DeltaTime); // (Final, Native, Private) // @ 0x142794C60
	void SetNavPath(const int32& InCellIdxY, const int32& InCellIdxZ, const int32& Index_0, const struct FSwarmsMapCellData& InCell, const int32& LayerNum, bool bIsNextPath); // (Final, Native, Private, HasOutParams) // @ 0x142795580
	void SimpleMoveWithNavPath(const int32& Index_0, float MoveDis); // (Final, Native, Private, HasOutParams) // @ 0x142795840
	float UpdateFadeIn(const int32& Index_0); // (Final, Native, Private, HasOutParams) // @ 0x142796280
	void UpdateNoise(const int32& Index_0); // (Final, Native, Private, HasOutParams) // @ 0x142796340
	void UpdateTransArray(float DeltaTime); // (Final, Native, Private) // @ 0x1427963D0
	void UpdateTransArray_Low(float DeltaTime); // (Final, Native, Private) // @ 0x142796450

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SwarmsComponentCPU")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SwarmsComponentCPU")
	}
	static class USwarmsComponentCPU* GetDefaultObj()
	{
		return GetDefaultObjImpl<USwarmsComponentCPU>();
	}
};
DUMPER7_ASSERTS_USwarmsComponentCPU;

// Class Swarms.TestSwarmsActor
// 0x0078 (0x03E8 - 0x0370)
class ATestSwarmsActor final : public AActor
{
public:
	uint8                                         Pad_370[0x8];                                      // 0x0370(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsTick;                                           // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDebugDestroy;                                   // 0x0379(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnemySwarms;                                    // 0x037A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwarmsQualityLevel                           QualityLevel;                                      // 0x037B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CheckEnemyDelay;                                   // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             TargetTraceChannel;                                // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USwarmsComponent*                       SwarmsComponent;                                   // 0x0388(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_390[0x58];                                     // 0x0390(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MultiAddDamageTarget(const class APawn* Target, bool bIsLocalPawn, int32 CellIndex, int32 LayerNum); // (Net, NetReliable, Native, Event, NetMulticast, Public) // @ 0x142794F90
	bool SubCheckOverlapResult(class APawn* Char); // (Final, Native, Public) // @ 0x142795B70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TestSwarmsActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TestSwarmsActor")
	}
	static class ATestSwarmsActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATestSwarmsActor>();
	}
};
DUMPER7_ASSERTS_ATestSwarmsActor;

}

