#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TextStyleRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class TextStyleRuntime.FontStyleRuntimeManager
// 0x0140 (0x0170 - 0x0030)
class UFontStyleRuntimeManager final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0xA0];                                      // 0x0030(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CachedCulture;                                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x90];                                      // 0x00D8(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CachedCurFontConfig;                               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFontStyleRuntimeManager* Get(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14279FE30

	bool GetFontConfigData(const class FName& InName, struct FSlateFontInfo* OutSlateFontInfo); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14279FE90
	void OnTextWidgetFontStyleCustomize(class UWidget* InWidget); // (Final, Native, Private) // @ 0x1427A0180
	void WarmupText(const class FName& InStyleName, const class FString& InContent); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1427A0200

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FontStyleRuntimeManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FontStyleRuntimeManager")
	}
	static class UFontStyleRuntimeManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFontStyleRuntimeManager>();
	}
};
DUMPER7_ASSERTS_UFontStyleRuntimeManager;

// Class TextStyleRuntime.StyleTableConfigObj
// 0x0080 (0x00A8 - 0x0028)
class UStyleTableConfigObj final : public UObject
{
public:
	struct FSoftObjectPath                        TextStyleTable;                                    // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        DefaultFontConfig;                                 // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, struct FSoftObjectPath>     FontDataConfigs;                                   // 0x0058(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StyleTableConfigObj")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StyleTableConfigObj")
	}
	static class UStyleTableConfigObj* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStyleTableConfigObj>();
	}
};
DUMPER7_ASSERTS_UStyleTableConfigObj;

// Class TextStyleRuntime.TextStyleBlueprintLib
// 0x0000 (0x0028 - 0x0028)
class UTextStyleBlueprintLib final : public UBlueprintFunctionLibrary
{
public:
	static void Blueprint_SetTextStyle(class UTextLayoutWidget* InTextWidget, const class FName InTextStyleIdx); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14279FD80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TextStyleBlueprintLib")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TextStyleBlueprintLib")
	}
	static class UTextStyleBlueprintLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextStyleBlueprintLib>();
	}
};
DUMPER7_ASSERTS_UTextStyleBlueprintLib;

// Class TextStyleRuntime.TextStyleRuntimeManager
// 0x0098 (0x00C8 - 0x0030)
class UTextStyleRuntimeManager final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x90];                                      // 0x0030(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CachedCurTxtStyleConfig;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UTextStyleRuntimeManager* Get(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x14279FE60

	bool GetTextStyleCfgData(const class FName& InName, struct FCustomTextStyle* OutCustomTextStyle); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14279FFC0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TextStyleRuntimeManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TextStyleRuntimeManager")
	}
	static class UTextStyleRuntimeManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextStyleRuntimeManager>();
	}
};
DUMPER7_ASSERTS_UTextStyleRuntimeManager;

}

