#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimiAudioProfiler

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class TimiAudioProfiler.TAProfilerBPFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UTAProfilerBPFuncLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ChangeMode(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1427A8C20
	static void CreateProfilerWidget(class APlayerController* InPlayerController); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1427A8C80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TAProfilerBPFuncLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TAProfilerBPFuncLibrary")
	}
	static class UTAProfilerBPFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTAProfilerBPFuncLibrary>();
	}
};
DUMPER7_ASSERTS_UTAProfilerBPFuncLibrary;

// Class TimiAudioProfiler.TAProfilerPanel
// 0x0098 (0x0388 - 0x02F0)
class UTAProfilerPanel final : public UUserWidget
{
public:
	class UButton*                                Button_Event;                                      // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                Button_RTPC;                                       // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                Button_Close;                                      // 0x0300(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                Button_Clean;                                      // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                Button_StartLog;                                   // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UButton*                                Button_EndLog;                                     // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollBox*                             ScrollBox_Event;                                   // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_Event;                                   // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollBox*                             ScrollBox_RTPC;                                    // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             TextBlock_RTPC;                                    // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEditableTextBox*                       EditableTextBox_Search;                            // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x40];                                     // 0x0348(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CleanUpOnClicked(); // (Final, Native, Public) // @ 0x1427A8C40
	void CloseBtnOnClicked(); // (Final, Native, Public) // @ 0x1427A8C60
	void EndLogOnClicked(); // (Final, Native, Public) // @ 0x1427A8CF0
	void SearchTextCommitted(const class FText& InNewString, ETextCommit InTextCommit); // (Final, Native, Public, HasOutParams) // @ 0x1427A8D10
	void ShowEvent(); // (Final, Native, Public) // @ 0x1427A8E20
	void ShowRTPC(); // (Final, Native, Public) // @ 0x1427A8E40
	void StartLogOnClicked(); // (Final, Native, Public) // @ 0x1427A8E60

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TAProfilerPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TAProfilerPanel")
	}
	static class UTAProfilerPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTAProfilerPanel>();
	}
};
DUMPER7_ASSERTS_UTAProfilerPanel;

}

