#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIParticular

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "UIParticular_structs.hpp"


namespace SDK
{

// Class UIParticular.InstanceTemplateWidget
// 0x0140 (0x0290 - 0x0150)
class UInstanceTemplateWidget final : public UWidget
{
public:
	TSoftObjectPtr<class UUserWidget>             WidgetTemplate;                                    // 0x0150(0x0028)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoActivate;                                     // 0x0178(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TickWhenPaused;                                    // 0x0179(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReactivate;                                       // 0x017A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCullWhenLeaveViewport;                            // 0x017B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               MeshRotate;                                        // 0x017C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         fRotate;                                           // 0x0188(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RotateName;                                        // 0x018C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FakeDepthScale;                                    // 0x0194(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FakeDepthScaleDistance;                            // 0x0198(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableWarnings;                                   // 0x019C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Brush;                                             // 0x01A0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      MeshUVArray;                                       // 0x0230(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        MeshPositionArray;                                 // 0x0240(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        MeshOrginPosArray;                                 // 0x0250(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<uint32>                                MeshIndexArray;                                    // 0x0260(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FColor>                         MeshColorArray;                                    // 0x0270(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_280[0x10];                                     // 0x0280(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateMeshs(bool bActive, bool bReset); // (Final, Native, Public, BlueprintCallable) // @ 0x1410EF340
	void SetMeshRotate(const struct FRotator& inRotator); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1410F0150
	void SetReactivate(bool bActivateAndReset); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F0370
	void SetTickWhenPaused(bool NewTickWhenPaused); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F0510

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InstanceTemplateWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InstanceTemplateWidget")
	}
	static class UInstanceTemplateWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceTemplateWidget>();
	}
};
DUMPER7_ASSERTS_UInstanceTemplateWidget;

// Class UIParticular.ParticleWidget
// 0x0060 (0x01B0 - 0x0150)
class UParticleWidget final : public UWidget
{
public:
	class UFXSystemAsset*                         ParticleSystemTemplate;                            // 0x0150(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoActivate;                                     // 0x0158(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EParticleAxisFlags                            ParticleAxis;                                      // 0x0159(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TickWhenPaused;                                    // 0x015A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReactivate;                                       // 0x015B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCullWhenLeaveViewport;                            // 0x015C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ParticleRotate;                                    // 0x0160(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         fRotate;                                           // 0x016C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RotateName;                                        // 0x0170(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SizeScale;                                         // 0x0178(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FakeDepthScale;                                    // 0x017C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FakeDepthScaleDistance;                            // 0x0180(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableWarnings;                                   // 0x0184(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             MaterialRemapArray;                                // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UFXSystemComponent*                     WorldParticleComponent;                            // 0x0198(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A0[0x10];                                     // 0x01A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateParticles(bool bActive, bool bReset); // (Final, Native, Public, BlueprintCallable) // @ 0x1410EF410
	void SetParticleAxis(EParticleAxisFlags inAxis); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F0260
	void SetParticleRotate(const struct FRotator& inRotator); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1410F02E0
	void SetReactivate(bool bActivateAndReset); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F0400
	void SetSizeScale(float InScale); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F0490
	void SetTickWhenPaused(bool NewTickWhenPaused); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F05A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleWidget")
	}
	static class UParticleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleWidget>();
	}
};
DUMPER7_ASSERTS_UParticleWidget;

// Class UIParticular.UICascadedComponent
// 0x0030 (0x0850 - 0x0820)
class UUICascadedComponent final : public UParticleSystemComponent
{
public:
	uint8                                         Pad_820[0x30];                                     // 0x0820(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UICascadedComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UICascadedComponent")
	}
	static class UUICascadedComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUICascadedComponent>();
	}
};
DUMPER7_ASSERTS_UUICascadedComponent;

// Class UIParticular.UIMeshWidget
// 0x0B50 (0x0CA0 - 0x0150)
class UUIMeshWidget final : public UWidget
{
public:
	TSoftObjectPtr<class UStaticMesh>             MeshRes;                                           // 0x0150(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0180(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Brush;                                             // 0x01B0(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0240(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFill;                                             // 0x0250(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableVertexColor;                                // 0x0251(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOriginVertex;                                  // 0x0252(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoActivate;                                     // 0x0253(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TickWhenPaused;                                    // 0x0254(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustViewInfo;                                   // 0x0255(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FakeDepthScale;                                    // 0x0256(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_257[0x1];                                      // 0x0257(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FakeDepthScaleDistance;                            // 0x0258(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableWarnings;                                   // 0x025C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      MeshUVArray;                                       // 0x0260(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        MeshPositionArray;                                 // 0x0270(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FVector>                        MeshOriginPosArray;                                // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<uint32>                                MeshIndexArray;                                    // 0x0290(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FColor>                         MeshColorArray;                                    // 0x02A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B0[0x9F0];                                    // 0x02B0(0x09F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMaterialInstanceDynamic* GetDynamicMaterial(); // (Final, Native, Public, BlueprintCallable) // @ 0x1410EF730
	void SetBrush(const struct FSlateBrush& InBrush); // (Native, Public, HasOutParams, BlueprintCallable) // @ 0x1410EFAB0
	void SetBrushFromAtlasInterface(TScriptInterface<class ISlateTextureAtlasInterface> AtlasRegion, bool bMatchSize); // (Native, Public, BlueprintCallable) // @ 0x1410EFC30
	void SetBrushFromMaterial(class UMaterialInterface* Material); // (Native, Public, BlueprintCallable) // @ 0x1410EFD20
	void SetBrushFromTexture(class UTexture2D* Texture, bool bMatchSize); // (Native, Public, BlueprintCallable) // @ 0x1410EFDB0
	void SetBrushFromTextureDynamic(class UTexture2DDynamic* Texture, bool bMatchSize); // (Native, Public, BlueprintCallable) // @ 0x1410EFE80
	void SetBrushResourceObject(class UObject* ResourceObject); // (Native, Public, BlueprintCallable) // @ 0x1410EFF50
	void SetBrushTintColor(const struct FSlateColor& TintColor); // (Final, Native, Public, BlueprintCallable) // @ 0x1410EFFE0
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1410F00D0
	void SetOpacity(float InOpacity); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F01E0
	void SetTickWhenPaused(bool NewTickWhenPaused); // (Final, Native, Public, BlueprintCallable) // @ 0x1410F0630

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIMeshWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIMeshWidget")
	}
	static class UUIMeshWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIMeshWidget>();
	}
};
DUMPER7_ASSERTS_UUIMeshWidget;

// Class UIParticular.UMGStaticsLibrary
// 0x0000 (0x0028 - 0x0028)
class UUMGStaticsLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UUserWidget* BP_FindWidgetbyName(class UUserWidget* UserWidget, const class FString& WidgetName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1410EF4E0
	static TArray<class UWidgetAnimation*> GetAllWidgetAnimations(class UUserWidget* UserWidget); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1410EF640
	static class UWidgetAnimation* GetWidgetAnimation(class UUserWidget* UserWidget, const class FString& AnimName); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1410EF760
	static float PlayAnimationByName(class UUserWidget* UserWidget, const class FString& AnimName, const class FString& WidgetName, EUMGPlayAnimMode PlayMode); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1410EF860

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UMGStaticsLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UMGStaticsLibrary")
	}
	static class UUMGStaticsLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGStaticsLibrary>();
	}
};
DUMPER7_ASSERTS_UUMGStaticsLibrary;

}

