#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UITween

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum UITween.ETweenerPropType
// NumValues: 0x000A
enum class ETweenerPropType : uint8
{
	Default                                  = 0,
	RenderTranslation                        = 1,
	RenderScale                              = 2,
	RenderShear                              = 3,
	RenderTransformAngle                     = 4,
	RenderOpacity                            = 5,
	BrushMaterial                            = 6,
	ColorAndOpacity                          = 7,
	OverrideMaterial                         = 8,
	ETweenerPropType_MAX                     = 9,
};

// Enum UITween.EUITweenEaseType
// NumValues: 0x002B
enum class EUITweenEaseType : uint8
{
	Custom                                   = 0,
	Linear                                   = 1,
	EaseInQuad                               = 2,
	EaseOutQuad                              = 3,
	EaseInOutQuad                            = 4,
	EaseOutInQuad                            = 5,
	EaseInCubic                              = 6,
	EaseOutCubic                             = 7,
	EaseInOutCubic                           = 8,
	EaseOutInCubic                           = 9,
	EaseInQuart                              = 10,
	EaseOutQuart                             = 11,
	EaseInOutQuart                           = 12,
	EaseOutInQuart                           = 13,
	EaseInQuint                              = 14,
	EaseOutQuint                             = 15,
	EaseInOutQuint                           = 16,
	EaseOutInQuint                           = 17,
	EaseInSine                               = 18,
	EaseOutSine                              = 19,
	EaseInOutSine                            = 20,
	EaseOutInSine                            = 21,
	EaseInExpo                               = 22,
	EaseOutExpo                              = 23,
	EaseInOutExpo                            = 24,
	EaseOutInExpo                            = 25,
	EaseInCirc                               = 26,
	EaseOutCirc                              = 27,
	EaseInOutCirc                            = 28,
	EaseOutInCirc                            = 29,
	EaseInElastic                            = 30,
	EaseOutElastic                           = 31,
	EaseInOutElastic                         = 32,
	EaseOutInElastic                         = 33,
	EaseInBack                               = 34,
	EaseOutBack                              = 35,
	EaseInOutBack                            = 36,
	EaseOutInBack                            = 37,
	EaseInBounce                             = 38,
	EaseOutBounce                            = 39,
	EaseInOutBounce                          = 40,
	EaseOutInBounce                          = 41,
	EUITweenEaseType_MAX                     = 42,
};

// ScriptStruct UITween.UIAnimationTrack
// 0x0558 (0x0558 - 0x0000)
struct FUIAnimationTrack final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WidgetName;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETweenerPropType                              AnimationType;                                     // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParamKey;                                          // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUITweenEaseType                              Ease;                                              // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 EaseTargetVal;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                     FloatCurve;                                        // 0x0038(0x00A0)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeVectorCurve                    VectorCurve;                                       // 0x00D8(0x01D0)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeCurveLinearColor               ColorCurve;                                        // 0x02A8(0x0268)(Edit, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0510(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFrom;                                            // 0x0514(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_515[0x43];                                     // 0x0515(0x0043)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUIAnimationTrack;

// ScriptStruct UITween.UIAnimation
// 0x0048 (0x0048 - 0x0000)
struct FUIAnimation final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AnimationName;                                     // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLoop;                                            // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsAutoPlay;                                        // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUIAnimationTrack>              AnimationTracks;                                   // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUIAnimation;

// ScriptStruct UITween.UIAnimationController
// 0x0020 (0x0020 - 0x0000)
struct FUIAnimationController final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUIAnimation>                   Animations;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FUIAnimationController;

}

