#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class UMG.Visual
// 0x0000 (0x0028 - 0x0028)
class UVisual : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Visual")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Visual")
	}
	static class UVisual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVisual>();
	}
};
DUMPER7_ASSERTS_UVisual;

// Class UMG.Widget
// 0x0128 (0x0150 - 0x0028)
class UWidget : public UVisual
{
public:
	TDelegate<void()>                             bIsEnabledDelegate;                                // 0x0028(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   ToolTipText;                                       // 0x0038(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ToolTipTextDelegate;                               // 0x0050(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ToolTipWidgetDelegate;                             // 0x0060(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             VisibilityDelegate;                                // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FInvalidateWidgetReason& InvalidatedReason)> OnWidgetInvalidated; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	class UWidget*                                ToolTipWidget;                                     // 0x0090(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPanelSlot*                             Slot;                                              // 0x0098(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, TextExportTransient, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInvalidateWidgetReason                InvalidatedReason;                                 // 0x00A0(0x0001)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	EWidgetEnableQualityFlags                     EnableQualityConfig;                               // 0x00A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetEnableQualityFlags                     EnableQualityConfigHD;                             // 0x00A2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetEnablePlatformFlags                    EnablePlatformConfig;                              // 0x00A3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       RenderTransform;                                   // 0x00A4(0x001C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ExtendHitMargin;                                   // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              RenderTransformPivot;                              // 0x00D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionZ;                                         // 0x00E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WidgetLayerId;                                     // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialStrategy                             MaterialInheritStrategy;                           // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsVariable : 1;                                   // 0x00E9(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCreatedByConstructionScript : 1;                  // 0x00E9(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsEnabled : 1;                                    // 0x00E9(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Cursor : 1;                              // 0x00E9(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EFlowDirectionPreference                      FlowDirectionPreference;                           // 0x00EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bBreakUpTransfer : 1;                              // 0x00EB(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDirtyTransferSkipSize : 1;                        // 0x00EB(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableTick : 1;                                  // 0x00EB(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         UsedLayerPolicy : 1;                               // 0x00EB(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCacheRelativeTransform : 1;                       // 0x00EB(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCacheRenderOpacity : 1;                           // 0x00EB(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnlyCacheRenderTranslation : 1;                   // 0x00EB(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bBlockable : 1;                                    // 0x00EB(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOptimalPerf : 1;                                  // 0x00EC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStrictLayer : 1;                                  // 0x00EC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCacheChildLayout : 1;                             // 0x00EC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateAccessibleWidgetData*             AccessibleWidgetData;                              // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsVolatile : 1;                                   // 0x00F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetNavigation*                      Navigation;                                        // 0x0100(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MaskGeometryMargin;                                // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RenderOpacity;                                     // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMouseCursor                                  Cursor;                                            // 0x0114(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetClipping                               Clipping;                                          // 0x0115(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              Visibility;                                        // 0x0116(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetPixelSnapping                          PixelSnapping;                                     // 0x0117(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateGeometryMaskType                        MaskGeometryType;                                  // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugShowMaskRegion;                              // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x26];                                     // 0x011A(0x0026)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPropertyBinding*>               NativeBindings;                                    // 0x0140(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void ForceLayoutPrepass(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C800CD0
	void ForceVolatile(bool bForce); // (Final, Native, Public, BlueprintCallable) // @ 0x14C800CF0
	EMaterialStrategy GetMaterialStrategy(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C800E90
	class UMaterialInterface* GetOverrideMaterial(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C800EC0
	float GetPositionZ(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C800FC0
	void InvalidateLayoutAndVolatility(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801440
	void RemoveFromParent(); // (Native, Public, BlueprintCallable) // @ 0x140D2F400
	void ResetCursor(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801490
	void SetAllNavigationRules(EUINavigationRule Rule, class FName WidgetToFocus); // (Final, Native, Public, BlueprintCallable) // @ 0x14C8014B0
	void SetClipping(EWidgetClipping InClipping); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801570
	void SetCursor(EMouseCursor InCursor); // (Final, Native, Public, BlueprintCallable) // @ 0x14C8015F0
	void SetExtendHitMargin(float Left, float Top, float Right, float Bottom); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801670
	void SetFocus(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C8017C0
	void SetIsEnabled(bool bInIsEnabled); // (Native, Public, BlueprintCallable) // @ 0x14939E780
	void SetKeyboardFocus(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801860
	void SetMaterialStrategy(EMaterialStrategy InStrategy); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801880
	void SetNavigationRule(EUINavigation Direction, EUINavigationRule Rule, class FName WidgetToFocus); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801900
	void SetNavigationRuleBase(EUINavigation Direction, EUINavigationRule Rule); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801A10
	void SetNavigationRuleCustom(EUINavigation Direction, TDelegate<void(EUINavigation Navigation)> InCustomDelegate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801AD0
	void SetNavigationRuleCustomBoundary(EUINavigation Direction, TDelegate<void(EUINavigation Navigation)> InCustomDelegate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801BB0
	void SetNavigationRuleExplicit(EUINavigation Direction, class UWidget* InWidget); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801C90
	void SetOverrideMaterial(class UMaterialInterface* InMaterial); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801D50
	void SetPixelSnapping(EWidgetPixelSnapping InPixelSnapping); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801E60
	void SetPositionZ(float InPositionZ); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801EE0
	void SetRenderOpacity(float InOpacity); // (Final, Native, Public, BlueprintCallable) // @ 0x14C801F60
	void SetRenderScale(const struct FVector2D& Scale); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C801FE0
	void SetRenderShear(const struct FVector2D& Shear); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C802060
	void SetRenderTransform(const struct FWidgetTransform& InTransform); // (Final, Native, Public, BlueprintCallable) // @ 0x14C8020E0
	void SetRenderTransformAngle(float Angle); // (Final, Native, Public, BlueprintCallable) // @ 0x14C8021C0
	void SetRenderTransformPivot(const struct FVector2D& Pivot); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C802240
	void SetRenderTranslation(const struct FVector2D& translation); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C8022C0
	void SetToolTip(class UWidget* Widget); // (Final, Native, Public, BlueprintCallable) // @ 0x14C8023C0
	void SetToolTipText(const class FText& InToolTipText); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x14C802440
	void SetUserFocus(class APlayerController* PlayerController); // (Final, Native, Public, BlueprintCallable) // @ 0x14C802510
	void SetVisibility(ESlateVisibility InVisibility); // (Native, Public, BlueprintCallable) // @ 0x14C802730

	const struct FGeometry GetCachedGeometry() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800D80
	EWidgetClipping GetClipping() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800DC0
	struct FVector2D GetDesiredSize() const; // (Final, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800DF0
	class UGameInstance* GetGameInstance() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800E30
	bool GetIsEnabled() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800E60
	class ULocalPlayer* GetOwningLocalPlayer() const; // (BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800EF0
	class APlayerController* GetOwningPlayer() const; // (BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x140C98750
	const struct FGeometry GetPaintSpaceGeometry() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800F20
	class UPanelWidget* GetParent() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800F60
	EWidgetPixelSnapping GetPixelSnapping() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800F90
	float GetRenderOpacity() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C800FF0
	float GetRenderTransformAngle() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801020
	const struct FGeometry GetTickSpaceGeometry() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801050
	ESlateVisibility GetVisibility() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801170
	bool HasAnyUserFocus() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C8011A0
	bool HasFocusedDescendants() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C8011D0
	bool HasKeyboardFocus() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801200
	bool HasMouseCapture() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801230
	bool HasMouseCaptureByUser(int32 UserIndex, int32 PointerIndex) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801260
	bool HasUserFocus(class APlayerController* PlayerController) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801320
	bool HasUserFocusedDescendants(class APlayerController* PlayerController) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C8013B0
	bool IsHovered() const; // (Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141FB59C0
	bool IsVisible() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C801460

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Widget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Widget")
	}
	static class UWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget>();
	}
};
DUMPER7_ASSERTS_UWidget;

// Class UMG.ProgressBar
// 0x0238 (0x0388 - 0x0150)
class UProgressBar : public UWidget
{
public:
	struct FProgressBarStyle                      WidgetStyle;                                       // 0x0150(0x01B8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USlateWidgetStyleAsset*                 Style;                                             // 0x0308(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USlateBrushAsset*                       BackgroundImage;                                   // 0x0310(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USlateBrushAsset*                       FillImage;                                         // 0x0318(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USlateBrushAsset*                       MarqueeImage;                                      // 0x0320(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Percent;                                           // 0x0328(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftValue;                                         // 0x032C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightValue;                                        // 0x0330(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProgressBarFillType                          BarFillType;                                       // 0x0334(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMarquee;                                        // 0x0335(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_336[0x2];                                      // 0x0336(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              BorderPadding;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             PercentDelegate;                                   // 0x0340(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           FillColorAndOpacity;                               // 0x0350(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             FillColorAndOpacityDelegate;                       // 0x0360(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_370[0x18];                                     // 0x0370(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetBidirectionalLeftValue(float InLeftValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EE480
	void SetBidirectionalRightValue(float InRightValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EE500
	void SetBidirectionalValue(float InLeftValue, float InRightValue); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EE580
	void SetFillColorAndOpacity(const struct FLinearColor& InColor); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C7EEFC0
	void SetIsMarquee(bool InbIsMarquee); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EF2D0
	void SetPercent(float InPercent); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EF580

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProgressBar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProgressBar")
	}
	static class UProgressBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressBar>();
	}
};
DUMPER7_ASSERTS_UProgressBar;

// Class UMG.PanelWidget
// 0x0018 (0x0168 - 0x0150)
class UPanelWidget : public UWidget
{
public:
	TArray<class UPanelSlot*>                     Slots;                                             // 0x0150(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIsCacheSlot : 1;                                  // 0x0160(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPanelSlot* AddChild(class UWidget* Content); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7ED610
	void ClearChildren(); // (Native, Public, BlueprintCallable) // @ 0x145F61070
	class UPanelSlot* InsertChildAt(int32 Index_0, class UWidget* Content); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EDF10
	class UPanelSlot* InternalInsertChildAt(int32 Index_0, class UWidget* Content); // (Final, Native, Protected) // @ 0x14C7EDFD0
	void OnSlotAdded(class UPanelSlot* InSlot); // (Native, Protected) // @ 0x144B8E8F0
	void OnSlotInserted(class UPanelSlot* InSlot, int32 Index_0); // (Native, Protected) // @ 0x14C7EE090
	void OnSlotRemoved(class UPanelSlot* InSlot); // (Native, Protected) // @ 0x142012200
	void ReleaseSlateResources(bool bReleaseChildren); // (Native, Public) // @ 0x14C7EE160
	bool RemoveChild(class UWidget* Content); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EE1F0
	bool RemoveChildAt(int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7EE280
	bool ReplaceChildAt(int32 Index_0, class UWidget* Content); // (Final, Native, Public) // @ 0x14C7EE310

	bool CanAddMoreChildren() const; // (Final, Native, Public, Const) // @ 0x14C7ED7B0
	bool CanHaveMultipleChildren() const; // (Final, Native, Public, Const) // @ 0x14C7ED800
	TArray<class UWidget*> GetAllChildren() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7ED840
	class UWidget* GetChildAt(int32 Index_0) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7ED920
	int32 GetChildIndex(const class UWidget* Content) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7ED9B0
	int32 GetChildrenCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7EDA40
	class UClass* GetSlotClass() const; // (Native, Protected, Const) // @ 0x14C7EDC60
	const TArray<class UPanelSlot*> GetSlots() const; // (Final, Native, Public, Const) // @ 0x14C7EDC90
	bool HasAnyChildren() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413EEF20
	bool HasChild(class UWidget* Content) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7EDE80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PanelWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PanelWidget")
	}
	static class UPanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanelWidget>();
	}
};
DUMPER7_ASSERTS_UPanelWidget;

// Class UMG.CanvasPanel
// 0x0068 (0x01D0 - 0x0168)
class UCanvasPanel : public UPanelWidget
{
public:
	uint8                                         bNeedComputeLayout : 1;                            // 0x0168(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCacheChildWidget : 1;                             // 0x0168(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_169[0x67];                                     // 0x0169(0x0067)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCanvasPanelSlot* AddChildToCanvas(class UWidget* Content); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7DC430
	void ReleaseCacheSlateWidget(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7DC9D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CanvasPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CanvasPanel")
	}
	static class UCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasPanel>();
	}
};
DUMPER7_ASSERTS_UCanvasPanel;

// Class UMG.UniformGridPanel
// 0x0028 (0x0190 - 0x0168)
class UUniformGridPanel : public UPanelWidget
{
public:
	struct FMargin                                SlotPadding;                                       // 0x0168(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MinDesiredSlotWidth;                               // 0x0178(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDesiredSlotHeight;                              // 0x017C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_180[0x10];                                     // 0x0180(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UUniformGridSlot* AddChildToUniformGrid(class UWidget* Content, int32 InRow, int32 InColumn); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FC8A0
	void SetMinDesiredSlotHeight(float InMinDesiredSlotHeight); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FE420
	void SetMinDesiredSlotWidth(float InMinDesiredSlotWidth); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FE4A0
	void SetSlotPadding(const struct FMargin& InSlotPadding); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FE8F0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UniformGridPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UniformGridPanel")
	}
	static class UUniformGridPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUniformGridPanel>();
	}
};
DUMPER7_ASSERTS_UUniformGridPanel;

// Class UMG.SlateVectorArtData
// 0x0038 (0x0060 - 0x0028)
class USlateVectorArtData final : public UObject
{
public:
	TArray<struct FSlateMeshVertex>               VertexData;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<uint32>                                IndexData;                                         // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                     Material;                                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              ExtentMin;                                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              ExtentMax;                                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SlateVectorArtData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SlateVectorArtData")
	}
	static class USlateVectorArtData* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlateVectorArtData>();
	}
};
DUMPER7_ASSERTS_USlateVectorArtData;

// Class UMG.WidgetSwitcher
// 0x0018 (0x0180 - 0x0168)
class UWidgetSwitcher : public UPanelWidget
{
public:
	int32                                         ActiveWidgetIndex;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16C[0x14];                                     // 0x016C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetActiveWidget(class UWidget* Widget); // (Native, Public, BlueprintCallable) // @ 0x1413F2FF0
	void SetActiveWidgetIndex(int32 Index_0); // (Native, Public, BlueprintCallable) // @ 0x1413F2F60

	class UWidget* GetActiveWidget() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C80D9C0
	int32 GetActiveWidgetIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C80D9F0
	int32 GetNumWidgets() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C80DA20
	class UWidget* GetWidgetAtIndex(int32 Index_0) const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1413F2A80

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WidgetSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WidgetSwitcher")
	}
	static class UWidgetSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetSwitcher>();
	}
};
DUMPER7_ASSERTS_UWidgetSwitcher;

// Class UMG.PanelSlot
// 0x0010 (0x0038 - 0x0028)
class UPanelSlot : public UVisual
{
public:
	class UPanelWidget*                           Parent;                                            // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                Content;                                           // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PanelSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PanelSlot")
	}
	static class UPanelSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanelSlot>();
	}
};
DUMPER7_ASSERTS_UPanelSlot;

// Class UMG.ButtonSlot
// 0x0028 (0x0060 - 0x0038)
class UButtonSlot final : public UPanelSlot
{
public:
	struct FMargin                                Padding;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0049(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x16];                                      // 0x004A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7DD8C0
	void SetPadding(const struct FMargin& InPadding); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7DE040
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7DE740

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ButtonSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ButtonSlot")
	}
	static class UButtonSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UButtonSlot>();
	}
};
DUMPER7_ASSERTS_UButtonSlot;

// Class UMG.UserWidget
// 0x01A0 (0x02F0 - 0x0150)
class UUserWidget : public UWidget
{
public:
	uint8                                         Pad_150[0x8];                                      // 0x0150(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0158(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ColorAndOpacityDelegate;                           // 0x0168(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0178(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ForegroundColorDelegate;                           // 0x01A0(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x01B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UUMGSequencePlayer*>             ActiveSequencePlayers;                             // 0x01C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UUMGSequencePlayer*>             StoppedSequencePlayers;                            // 0x01D0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	struct FLiteAnimationController               LiteAnimationController;                           // 0x01E0(0x0070)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FNamedSlotBinding>              NamedSlotBindings;                                 // 0x0250(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UWidgetTree*                            WidgetTree;                                        // 0x0260(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUMGSequenceTickManager*                AnimationTickManager;                              // 0x0268(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Priority;                                          // 0x0270(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSupportsKeyboardFocus : 1;                        // 0x0274(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsFocusable : 1;                                  // 0x0274(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStopAction : 1;                                   // 0x0274(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasScriptImplementedTick : 1;                     // 0x0274(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasScriptImplementedPaint : 1;                    // 0x0274(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNeedPrepassWhenAnim : 1;                          // 0x0274(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNeedCheckLatentAction : 1;                        // 0x0274(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_275[0xB];                                      // 0x0275(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	EWidgetTickFrequency                          TickFrequency;                                     // 0x0280(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        InputComponent;                                    // 0x0288(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAnimationEventBinding>         AnimationCallbacks;                                // 0x0290(0x0010)(ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x50];                                     // 0x02A0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddToPlayerScreen(int32 ZOrder); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FC9A0
	void AddToViewport(int32 ZOrder); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FCA30
	void BindToAnimationEvent(class UWidgetAnimation* Animation, TDelegate<void()> Delegate, EWidgetAnimationEvent AnimationEvent, class FName UserTag); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FCAB0
	void BindToAnimationFinished(class UWidgetAnimation* Animation, TDelegate<void()> Delegate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FCC20
	void BindToAnimationStarted(class UWidgetAnimation* Animation, TDelegate<void()> Delegate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FCD00
	void CancelLatentActions(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FCDE0
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Destruct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool IsAnimationPlaying(const class UWidgetAnimation* InAnimation); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FCFE0
	bool IsAnimationPlayingForward(const class UWidgetAnimation* InAnimation); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FD070
	void ListenForInputAction(class FName ActionName, EInputEvent EventType, bool bConsume, TDelegate<void()> callback); // (Final, Native, Protected, BlueprintCallable) // @ 0x14C7FD1F0
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnAnimationFinished(const class UWidgetAnimation* Animation); // (BlueprintCosmetic, Native, Event, Protected, BlueprintEvent) // @ 0x142012200
	void OnAnimationStarted(const class UWidgetAnimation* Animation); // (BlueprintCosmetic, Native, Event, Protected, BlueprintEvent) // @ 0x144B8E8F0
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnFocusLost(const struct FFocusEvent& InFocusEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnInitialized(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnKeyChar(const struct FGeometry& MyGeometry, const struct FCharacterEvent& InCharacterEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnMotionDetected(const struct FGeometry& MyGeometry, const struct FMotionEvent& InMotionEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnMouseCaptureLost(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnMouseLeave(const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnTouchForceChanged(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnTouchGesture(const struct FGeometry& MyGeometry, const struct FPointerEvent& GestureEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnTouchMoved(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	float PauseAnimation(const class UWidgetAnimation* InAnimation); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FD370
	float PauseAnimationByName(const class FName InAnimationName); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FD410
	class UUMGSequencePlayer* PlayAnimation(class UWidgetAnimation* InAnimation, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FD4B0
	void PlayAnimationByName(class FName InAnimationName, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FD670
	class UUMGSequencePlayer* PlayAnimationForward(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FD830
	class UUMGSequencePlayer* PlayAnimationReverse(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FD930
	class UUMGSequencePlayer* PlayAnimationTimeRange(class UWidgetAnimation* InAnimation, float StartAtTime, float EndAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FDA30
	void PlaySound(class USoundBase* SoundToPlay); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FDC20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void RegisterInputComponent(); // (Final, Native, Protected, BlueprintCallable) // @ 0x14C7FDCA0
	void RemoveFromViewport(); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x144C8CD60
	void ReverseAnimation(const class UWidgetAnimation* InAnimation); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FDCC0
	void SetAlignmentInViewport(const struct FVector2D& Alignment); // (Final, BlueprintCosmetic, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C7FDD40
	void SetAnchorsInViewport(const struct FAnchors& Anchors); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FDDC0
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity); // (Final, BlueprintCosmetic, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C7FDE50
	void SetDesiredSizeInViewport(const struct FVector2D& size); // (Final, BlueprintCosmetic, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C7FDF50
	void SetForegroundColor(const struct FSlateColor& InForegroundColor); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FE0D0
	void SetInputActionBlocking(bool bShouldBlock); // (Final, Native, Protected, BlueprintCallable) // @ 0x14C7FE240
	void SetInputActionPriority(int32 NewPriority); // (Final, Native, Protected, BlueprintCallable) // @ 0x14C7FE2D0
	void SetNumLoopsToPlay(const class UWidgetAnimation* InAnimation, int32 NumLoopsToPlay); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FE520
	void SetOwningPlayer(class APlayerController* LocalPlayerController); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FE5E0
	void SetPadding(const struct FMargin& InPadding); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FE660
	void SetPlaybackSpeed(const class UWidgetAnimation* InAnimation, float PlaybackSpeed); // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable) // @ 0x14C7FE6F0
	void SetPositionInViewport(const struct FVector2D& Position, bool bRemoveDPIScale); // (Final, BlueprintCosmetic, Native, Public, HasDefaults, BlueprintCallable) // @ 0x14C7FE7B0
	void StopAllAnimations(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FEA80
	void StopAnimation(const class UWidgetAnimation* InAnimation); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FEAA0
	void StopAnimationByName(class FName InAnimationName); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FEB20
	void StopAnimationsAndLatentActions(); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FEBA0
	void StopListeningForAllInputActions(); // (Final, Native, Protected, BlueprintCallable) // @ 0x14C7FEBC0
	void StopListeningForInputAction(class FName ActionName, EInputEvent EventType); // (Final, Native, Protected, BlueprintCallable) // @ 0x14C7FEBE0
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void UnbindAllFromAnimationFinished(class UWidgetAnimation* Animation); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FECA0
	void UnbindAllFromAnimationStarted(class UWidgetAnimation* Animation); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FED20
	void UnbindFromAnimationFinished(class UWidgetAnimation* Animation, TDelegate<void()> Delegate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FEDA0
	void UnbindFromAnimationStarted(class UWidgetAnimation* Animation, TDelegate<void()> Delegate); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7FEE80
	void UnregisterInputComponent(); // (Final, Native, Protected, BlueprintCallable) // @ 0x14C7FEF60

	struct FVector2D GetAlignmentInViewport() const; // (Final, BlueprintCosmetic, Native, Public, HasDefaults, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FCE40
	struct FAnchors GetAnchorsInViewport() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FCE80
	float GetAnimationCurrentTime(const class UWidgetAnimation* InAnimation) const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FCEC0
	bool GetIsVisible() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FCF60
	class APawn* GetOwningPlayerPawn() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FCF90
	bool IsAnyAnimationPlaying() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FD100
	bool IsInteractable() const; // (BlueprintCosmetic, Event, Public, BlueprintEvent, Const) // @ 0x14B5B5E20
	bool IsInViewport() const; // (Final, BlueprintCosmetic, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FCF60
	bool IsListeningForInputAction(class FName ActionName) const; // (Final, Native, Protected, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FD130
	bool IsPlayingAnimation() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7FD1C0
	void OnPaint(struct FPaintContext& Context) const; // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent, Const) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UserWidget")
	}
	static class UUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserWidget>();
	}
};
DUMPER7_ASSERTS_UUserWidget;

// Class UMG.ContentWidget
// 0x0000 (0x0168 - 0x0168)
class UContentWidget : public UPanelWidget
{
public:
	class UPanelSlot* SetContent(class UWidget* Content); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7E15B0

	class UWidget* GetContent() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7E0EE0
	class UPanelSlot* GetContentSlot() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7E0F10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ContentWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ContentWidget")
	}
	static class UContentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentWidget>();
	}
};
DUMPER7_ASSERTS_UContentWidget;

// Class UMG.InvalidationBox
// 0x0018 (0x0180 - 0x0168)
class UInvalidationBox : public UContentWidget
{
public:
	bool                                          bCanCache;                                         // 0x0168(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CacheRelativeTransforms;                           // 0x0169(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16A[0x16];                                     // 0x016A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InvalidateCache(); // (Final, Native, Public, BlueprintCallable) // @ 0x140C994B0
	void SetCanCache(bool CanCache); // (Final, Native, Public, BlueprintCallable) // @ 0x14C7E6240

	bool GetCanCache() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x14C7E4E10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InvalidationBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InvalidationBox")
	}
	static class UInvalidationBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInvalidationBox>();
	}
};
DUMPER7_ASSERTS_UInvalidationBox;

// Class UMG.TextLayoutWidget
// 0x0080 (0x01D0 - 0x0150)
class UTextLayoutWidget : public UWidget
{
public:
	struct FShapedTextOptions                     ShapedTextOptions;                                 // 0x0150(0x0003)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
