#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UploadToolsModule

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "UploadToolsModule_structs.hpp"


namespace SDK
{

// Class UploadToolsModule.COSConfigGlobal
// 0x0050 (0x0078 - 0x0028)
class UCOSConfigGlobal final : public UObject
{
public:
	class FString                                 APPID;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Secret_id;                                         // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Secret_key;                                        // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BucketName;                                        // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HostName;                                          // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("COSConfigGlobal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"COSConfigGlobal")
	}
	static class UCOSConfigGlobal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOSConfigGlobal>();
	}
};
DUMPER7_ASSERTS_UCOSConfigGlobal;

// Class UploadToolsModule.COSConfig
// 0x0050 (0x0078 - 0x0028)
class UCOSConfig final : public UObject
{
public:
	class FString                                 APPID;                                             // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Secret_id;                                         // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Secret_key;                                        // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BucketName;                                        // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HostName;                                          // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("COSConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"COSConfig")
	}
	static class UCOSConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCOSConfig>();
	}
};
DUMPER7_ASSERTS_UCOSConfig;

// Class UploadToolsModule.UploadToolsModuleBPTools
// 0x0000 (0x0028 - 0x0028)
class UUploadToolsModuleBPTools final : public UBlueprintFunctionLibrary
{
public:
	static void SetMemoryStatsFlag(bool Flag, int32 Num); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140FA46D0
	static void UploadFile(const struct FUploadFileRequestInfo& InFileInfo); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140FA4790
	static void UploadLog(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140FA4970
	static void UploadZippedFile(const struct FUploadFileNtf& UploadNtf, const EUploadFileType& Type); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x140FA4990

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UploadToolsModuleBPTools")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UploadToolsModuleBPTools")
	}
	static class UUploadToolsModuleBPTools* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUploadToolsModuleBPTools>();
	}
};
DUMPER7_ASSERTS_UUploadToolsModuleBPTools;

// Class UploadToolsModule.UploadToolsModuleDelegates
// 0x0010 (0x0038 - 0x0028)
class UUploadToolsModuleDelegates final : public UObject
{
public:
	TMulticastInlineDelegate<void(const struct FUploadFinishTlogInfo& TlogInfo)> OnUploadFinish;     // 0x0028(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UUploadToolsModuleDelegates* Get(); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x140FA46A0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UploadToolsModuleDelegates")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UploadToolsModuleDelegates")
	}
	static class UUploadToolsModuleDelegates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUploadToolsModuleDelegates>();
	}
};
DUMPER7_ASSERTS_UUploadToolsModuleDelegates;

}

