#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VariantManagerContent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "VariantManagerContent_structs.hpp"


namespace SDK
{

// Class VariantManagerContent.LevelVariantSets
// 0x0068 (0x0090 - 0x0028)
class ULevelVariantSets final : public UObject
{
public:
	class UClass*                                 DirectorClass;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UVariantSet*>                    VariantSets;                                       // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetNumVariantSets(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1428CD0A0
	class UVariantSet* GetVariantSet(int32 VariantSetIndex); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1428CD440
	class UVariantSet* GetVariantSetByName(const class FString& VariantSetName); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1428CD4D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelVariantSets")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelVariantSets")
	}
	static class ULevelVariantSets* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelVariantSets>();
	}
};
DUMPER7_ASSERTS_ULevelVariantSets;

// Class VariantManagerContent.LevelVariantSetsActor
// 0x0018 (0x0388 - 0x0370)
class ALevelVariantSetsActor final : public AActor
{
public:
	struct FSoftObjectPath                        LevelVariantSets;                                  // 0x0370(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class ULevelVariantSets* GetLevelVariantSets(bool bLoad); // (Final, Native, Public, BlueprintCallable) // @ 0x1428CD000
	void SetLevelVariantSets(class ULevelVariantSets* InVariantSets); // (Final, Native, Public, BlueprintCallable) // @ 0x1428CD780
	bool SwitchOnVariantByIndex(int32 VariantSetIndex, int32 VariantIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1428CD820
	bool SwitchOnVariantByName(const class FString& VariantSetName, const class FString& VariantName); // (Final, Native, Public, BlueprintCallable) // @ 0x1428CD8E0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelVariantSetsActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelVariantSetsActor")
	}
	static class ALevelVariantSetsActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelVariantSetsActor>();
	}
};
DUMPER7_ASSERTS_ALevelVariantSetsActor;

// Class VariantManagerContent.LevelVariantSetsFunctionDirector
// 0x0018 (0x0040 - 0x0028)
class ULevelVariantSetsFunctionDirector final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LevelVariantSetsFunctionDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LevelVariantSetsFunctionDirector")
	}
	static class ULevelVariantSetsFunctionDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelVariantSetsFunctionDirector>();
	}
};
DUMPER7_ASSERTS_ULevelVariantSetsFunctionDirector;

// Class VariantManagerContent.PropertyValue
// 0x0188 (0x01B0 - 0x0028)
class UPropertyValue : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<FFieldPathProperty_>                   Properties;                                        // 0x0080(0x0010)(ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 PropertyIndices;                                   // 0x0090(0x0010)(ZeroConstructor, Deprecated, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCapturedPropSegment>           CapturedPropSegments;                              // 0x00A0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FString                                 FullDisplayString;                                 // 0x00B0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PropertySetterName;                                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FString, class FString>            PropertySetterParameterDefaults;                   // 0x00C8(0x0050)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasRecordedData;                                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 LeafPropertyClass;                                 // 0x0120(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ValueBytes;                                        // 0x0130(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EPropertyValueCategory                        PropCategory;                                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_141[0x6F];                                     // 0x0141(0x006F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString GetFullDisplayString() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1428CCFC0
	class FText GetPropertyTooltip() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1428CD1B0
	bool HasRecordedData() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1428CD600

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyValue")
	}
	static class UPropertyValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValue>();
	}
};
DUMPER7_ASSERTS_UPropertyValue;

// Class VariantManagerContent.PropertyValueTransform
// 0x0000 (0x01B0 - 0x01B0)
class UPropertyValueTransform final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyValueTransform")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyValueTransform")
	}
	static class UPropertyValueTransform* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueTransform>();
	}
};
DUMPER7_ASSERTS_UPropertyValueTransform;

// Class VariantManagerContent.PropertyValueVisibility
// 0x0000 (0x01B0 - 0x01B0)
class UPropertyValueVisibility final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyValueVisibility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyValueVisibility")
	}
	static class UPropertyValueVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueVisibility>();
	}
};
DUMPER7_ASSERTS_UPropertyValueVisibility;

// Class VariantManagerContent.PropertyValueColor
// 0x0000 (0x01B0 - 0x01B0)
class UPropertyValueColor final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyValueColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyValueColor")
	}
	static class UPropertyValueColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueColor>();
	}
};
DUMPER7_ASSERTS_UPropertyValueColor;

// Class VariantManagerContent.PropertyValueMaterial
// 0x0000 (0x01B0 - 0x01B0)
class UPropertyValueMaterial final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyValueMaterial")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyValueMaterial")
	}
	static class UPropertyValueMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueMaterial>();
	}
};
DUMPER7_ASSERTS_UPropertyValueMaterial;

// Class VariantManagerContent.PropertyValueOption
// 0x0000 (0x01B0 - 0x01B0)
class UPropertyValueOption final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PropertyValueOption")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PropertyValueOption")
	}
	static class UPropertyValueOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueOption>();
	}
};
DUMPER7_ASSERTS_UPropertyValueOption;

// Class VariantManagerContent.SwitchActor
// 0x0020 (0x0390 - 0x0370)
class ASwitchActor final : public AActor
{
public:
	uint8                                         Pad_370[0x18];                                     // 0x0370(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x0388(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SelectOption(int32 OptionIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1428CD630

	TArray<class AActor*> GetOptions() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1428CD0D0
	int32 GetSelectedOption() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1428CD250

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SwitchActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SwitchActor")
	}
	static class ASwitchActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASwitchActor>();
	}
};
DUMPER7_ASSERTS_ASwitchActor;

// Class VariantManagerContent.Variant
// 0x0040 (0x0068 - 0x0028)
class UVariant final : public UObject
{
public:
	class FText                                   DisplayText;                                       // 0x0028(0x0018)(Deprecated, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVariantObjectBinding*>          ObjectBindings;                                    // 0x0058(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	class AActor* GetActor(int32 ActorIndex); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1428CCE90
	int32 GetNumActors(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1413EEB80
	void SetDisplayText(const class FText& NewDisplayText); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1428CD6B0
	void SwitchOn(); // (Final, Native, Public, BlueprintCallable) // @ 0x1428CD800

	class FText GetDisplayText() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1428CCF20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Variant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Variant")
	}
	static class UVariant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVariant>();
	}
};
DUMPER7_ASSERTS_UVariant;

// Class VariantManagerContent.VariantObjectBinding
// 0x0058 (0x0080 - 0x0028)
class UVariantObjectBinding final : public UObject
{
public:
	struct FSoftObjectPath                        ObjectPtr;                                         // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TLazyObjectPtr<class UObject>                 LazyObjectPtr;                                     // 0x0040(0x001C)(IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPropertyValue*>                 CapturedProperties;                                // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FFunctionCaller>                FunctionCallers;                                   // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VariantObjectBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VariantObjectBinding")
	}
	static class UVariantObjectBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVariantObjectBinding>();
	}
};
DUMPER7_ASSERTS_UVariantObjectBinding;

// Class VariantManagerContent.VariantSet
// 0x0048 (0x0070 - 0x0028)
class UVariantSet final : public UObject
{
public:
	class FText                                   DisplayText;                                       // 0x0028(0x0018)(Deprecated, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bExpanded;                                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UVariant*>                       Variants;                                          // 0x0060(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	int32 GetNumVariants(); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1413EEC50
	class UVariant* GetVariant(int32 VariantIndex); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1428CD280
	class UVariant* GetVariantByName(const class FString& VariantName); // (Final, Native, Public, BlueprintCallable, BlueprintPure) // @ 0x1428CD310
	void SetDisplayText(const class FText& NewDisplayText); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x1428CD6B0

	class FText GetDisplayText() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1428CCF20

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VariantSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VariantSet")
	}
	static class UVariantSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVariantSet>();
	}
};
DUMPER7_ASSERTS_UVariantSet;

}

