#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VirtualMaterialRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "VirtualMaterialRuntime_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class VirtualMaterialRuntime.VirtualMaterialInstanceConstant
// 0x0008 (0x02F0 - 0x02E8)
class UVirtualMaterialInstanceConstant final : public UMaterialInstanceConstant
{
public:
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VirtualMaterialInstanceConstant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VirtualMaterialInstanceConstant")
	}
	static class UVirtualMaterialInstanceConstant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVirtualMaterialInstanceConstant>();
	}
};
DUMPER7_ASSERTS_UVirtualMaterialInstanceConstant;

// Class VirtualMaterialRuntime.VirtualMaterialSettings
// 0x0198 (0x01D0 - 0x0038)
class UVirtualMaterialSettings final : public UDeveloperSettings
{
public:
	uint32                                        DefaultConfigIndex;                                // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EVirtualMaterialPlatform, class FString> PlatformGenTextureSaveDir;                         // 0x0040(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bUseSmartSubDir;                                   // 0x0090(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoGenOnPostSaveMaterialInstance;                // 0x0091(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowValidation;                                  // 0x0092(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowValidation_VMTextureSize;                    // 0x0093(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowValidation_VMTextureGroup;                   // 0x0094(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         VMBaseMaterialUsedInMIAllowRegex;                  // 0x0098(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	bool                                          bShowVMExt;                                        // 0x00A8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EVirtualMaterialPlatform, class FString> PlatformGenerateTextureRecordFilePath;             // 0x00B0(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0100(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVMSourceTextureProperties             TemplateTexturePropertyBlackList;                  // 0x0110(0x0010)(Edit, Config, NativeAccessSpecifierPublic)
	TMap<class FString, struct FVMSourceTextureProperties> SourceTexturePropertyWhiteList;           // 0x0120(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FString>                         ExcludePathOfTexturesFromRefreshVMTexturesProperty; // 0x0170(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            ExcludeMetaDataValueEqualFromRefreshVMTexturesProperty; // 0x0180(0x0050)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VirtualMaterialSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VirtualMaterialSettings")
	}
	static class UVirtualMaterialSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVirtualMaterialSettings>();
	}
};
DUMPER7_ASSERTS_UVirtualMaterialSettings;

// Class VirtualMaterialRuntime.VirtualMaterialTemplate
// 0x0000 (0x0028 - 0x0028)
class UVirtualMaterialTemplate final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VirtualMaterialTemplate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VirtualMaterialTemplate")
	}
	static class UVirtualMaterialTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVirtualMaterialTemplate>();
	}
};
DUMPER7_ASSERTS_UVirtualMaterialTemplate;

}

