#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VirtualMaterialRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum VirtualMaterialRuntime.EVirtualMaterialPlatform
// NumValues: 0x0004
enum class EVirtualMaterialPlatform : uint8
{
	Unknown                                  = 0,
	Mobile                                   = 1,
	Desktop                                  = 2,
	EVirtualMaterialPlatform_MAX             = 3,
};

// ScriptStruct VirtualMaterialRuntime.VMTextureParameter
// 0x0038 (0x0038 - 0x0000)
struct FVMTextureParameter final
{
public:
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>                ParameterValue;                                    // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMTextureParameter;

// ScriptStruct VirtualMaterialRuntime.VMParameterGroup
// 0x0070 (0x0070 - 0x0000)
struct FVMParameterGroup final
{
public:
	struct FStaticParameterSet                    StaticParameters;                                  // 0x0000(0x0040)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FScalarParameterValue>          ScalarParameters;                                  // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVectorParameterValue>          VectorParameters;                                  // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVMTextureParameter>            TextureParameters;                                 // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMParameterGroup;

// ScriptStruct VirtualMaterialRuntime.VMSourceTextureProperties
// 0x0010 (0x0010 - 0x0000)
struct FVMSourceTextureProperties final
{
public:
	TArray<class FString>                         Properties;                                        // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMSourceTextureProperties;

// ScriptStruct VirtualMaterialRuntime.VMIPerPlatformTextureParameter
// 0x0048 (0x0048 - 0x0000)
struct FVMIPerPlatformTextureParameter final
{
public:
	struct FMaterialParameterInfo                 ParameterInfo;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>                ParameterValue;                                    // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ExpressionGUID;                                    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMIPerPlatformTextureParameter;

// ScriptStruct VirtualMaterialRuntime.VMIPerPlatformParameters
// 0x00A8 (0x00A8 - 0x0000)
struct FVMIPerPlatformParameters final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      Parent;                                            // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStaticParameterSet                    StaticParameters;                                  // 0x0028(0x0040)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FScalarParameterValue>          ScalarParameters;                                  // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVectorParameterValue>          VectorParameters;                                  // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVMIPerPlatformTextureParameter> TextureParameters;                                // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FMaterialTextureInfo>           TextureStreamingData;                              // 0x0098(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMIPerPlatformParameters;

// ScriptStruct VirtualMaterialRuntime.VMIPerPlatformData
// 0x00B0 (0x00B0 - 0x0000)
struct FVMIPerPlatformData final
{
public:
	int32                                         OverrideTemplateIndex;                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVMIPerPlatformParameters              MaterialParameters;                                // 0x0008(0x00A8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMIPerPlatformData;

// ScriptStruct VirtualMaterialRuntime.VMIAllPlatformData
// 0x0050 (0x0050 - 0x0000)
struct FVMIAllPlatformData final
{
public:
	TMap<EVirtualMaterialPlatform, struct FVMIPerPlatformData> PlatformData;                         // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMIAllPlatformData;

// ScriptStruct VirtualMaterialRuntime.VMaterialGenTextureInfo
// 0x0020 (0x0020 - 0x0000)
struct FVMaterialGenTextureInfo final
{
public:
	class FString                                 TextureName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               TheTexture;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreated;                                          // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegenerated;                                      // 0x0019(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVMaterialGenTextureInfo;

// ScriptStruct VirtualMaterialRuntime.VMaterialHighTextureInfo
// 0x00E8 (0x00E8 - 0x0000)
struct FVMaterialHighTextureInfo final
{
public:
	class FString                                 TextureName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              TheTexture;                                        // 0x0010(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TheTextureObjectPathBackup;                        // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EVirtualMaterialPlatform, class FString> CachedTextureHashMap;                              // 0x0048(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<EVirtualMaterialPlatform, struct FVector2D> CachedSizeXYMap;                                // 0x0098(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMaterialHighTextureInfo;

// ScriptStruct VirtualMaterialRuntime.VMGenTextureConfig
// 0x0090 (0x0090 - 0x0000)
struct FVMGenTextureConfig final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              size;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              MinSize;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultSizeIndex;                                  // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             TextureConfigTemplate;                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialUsedToGen;                                 // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseMaterialToGenAllMips;                          // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FVMSourceTextureProperties> SourceTextureOverridePropertyWhiteList;   // 0x0040(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMGenTextureConfig;

// ScriptStruct VirtualMaterialRuntime.VMaterialConfig
// 0x0028 (0x0028 - 0x0000)
struct FVMaterialConfig final
{
public:
	class FName                                   Title;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVMGenTextureConfig>            GenTextureConfig;                                  // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 GenTextureQualityMips;                             // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMaterialConfig;

// ScriptStruct VirtualMaterialRuntime.VMTPerPlatformConfig
// 0x0050 (0x0050 - 0x0000)
struct FVMTPerPlatformConfig final
{
public:
	int32                                         EnableConfigIndex;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVMaterialConfig>               MaterialConfigs;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialParent;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowMaterialSubclass;                            // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowMaterialUsedInMI;                            // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      HiResPreviewMaterial;                              // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMTPerPlatformConfig;

// ScriptStruct VirtualMaterialRuntime.VMTAllPlatformConfig
// 0x0050 (0x0050 - 0x0000)
struct FVMTAllPlatformConfig final
{
public:
	TMap<EVirtualMaterialPlatform, struct FVMTPerPlatformConfig> PlatformConfigs;                    // 0x0000(0x0050)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMTAllPlatformConfig;

// ScriptStruct VirtualMaterialRuntime.VMSourceTextureConfig
// 0x0018 (0x0018 - 0x0000)
struct FVMSourceTextureConfig final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             TextureConfigTemplate;                             // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVMSourceTextureConfig;

}

