#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VisibilityCache

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct VisibilityCache.GridXYResult
// 0x0010 (0x0010 - 0x0000)
struct FGridXYResult final
{
public:
	TArray<uint64>                                GridXYResult;                                      // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridXYResult;

// ScriptStruct VisibilityCache.GridXYBitMask
// 0x0010 (0x0010 - 0x0000)
struct FGridXYBitMask final
{
public:
	TArray<uint8>                                 GridXYBitMask;                                     // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridXYBitMask;

// ScriptStruct VisibilityCache.GridID
// 0x0010 (0x0010 - 0x0000)
struct FGridID final
{
public:
	TArray<int16>                                 GridID;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridID;

// ScriptStruct VisibilityCache.GridZList
// 0x0010 (0x0010 - 0x0000)
struct FGridZList final
{
public:
	TArray<int32>                                 GridZList;                                         // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridZList;

// ScriptStruct VisibilityCache.GridVisibilityData
// 0x0050 (0x0050 - 0x0000)
struct FGridVisibilityData final
{
public:
	TMap<uint16, uint16>                          Data;                                              // 0x0000(0x0050)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGridVisibilityData;

}

