#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VisibilityCache

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VisibilityCache_structs.hpp"


namespace SDK
{

// Class VisibilityCache.VisibilityCache
// 0x0180 (0x01A8 - 0x0028)
class UVisibilityCache final : public UObject
{
public:
	float                                         GridSize;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinVisibilityRatio;                                // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUncachedInvisible;                                // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FIntPoint, struct FGridVisibilityData> GridsVisibilityData;                          // 0x0038(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, uint16>                     NameIndexMap;                                      // 0x0088(0x0050)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int16                                         ValidGridCount;                                    // 0x00D8(0x0002)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   Range;                                             // 0x00DC(0x001C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GirdXYSize;                                        // 0x00F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GirdXSum;                                          // 0x00FC(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GirdYSum;                                          // 0x0100(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0xA4];                                     // 0x0104(0x00A4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VisibilityCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VisibilityCache")
	}
	static class UVisibilityCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVisibilityCache>();
	}
};
DUMPER7_ASSERTS_UVisibilityCache;

// Class VisibilityCache.VcrCache
// 0x0070 (0x0098 - 0x0028)
class UVcrCache final : public UObject
{
public:
	int16                                         ValidGridCount;                                    // 0x0028(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   Range;                                             // 0x002C(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GirdXYSize;                                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GirdXSum;                                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GirdYSum;                                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGridZList>                     GridZList;                                         // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGridID>                        GridID;                                            // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGridXYBitMask>                 GridXYBitMask;                                     // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGridXYResult>                  GridXYResult;                                      // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VcrCache")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VcrCache")
	}
	static class UVcrCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVcrCache>();
	}
};
DUMPER7_ASSERTS_UVcrCache;

}

