#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaterFallScrollBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "WaterFallScrollBox_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// Class WaterFallScrollBox.WaterfallScrollView
// 0x04E0 (0x0648 - 0x0168)
class UWaterfallScrollView : public UPanelWidget
{
public:
	struct FScrollBoxStyle                        WidgetStyle;                                       // 0x0168(0x0248)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class USlateWidgetStyleAsset*                 Style;                                             // 0x03B0(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                TemplateWidget;                                    // 0x03B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C0[0x1];                                      // 0x03C0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EOrientation                                  Orientation;                                       // 0x03C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ColumnCount;                                       // 0x03C8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EditorPreviewItemCount;                            // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemWidthType                                ItemWidthType;                                     // 0x03D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ItemFixedSize;                                     // 0x03D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ItemSpacing;                                       // 0x03DC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x03E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F4[0x10];                                     // 0x03F4(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUserCustomEveryItemSize;                          // 0x0404(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_405[0x13];                                     // 0x0405(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnReachTop;                                        // 0x0418(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnReachBottom;                                     // 0x0428(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnScrolling;                                       // 0x0438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnScrollEnd;                                       // 0x0448(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnGetItemCount;                                    // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Position, class UWidget* ItemWidget)> OnProcessItemWidget;                  // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Position, class UWidget* ItemWidget)> OnProcessResetItemWidgetCallback;     // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_488[0x10];                                     // 0x0488(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ItemPosition)>           OnGetItemSize;                                     // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UWidget* Item, int32 Index)> OnRecycleItem;                  // 0x04A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnProcessItemsUpdateFinished;                      // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnBeforeCreateItem;                                // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnAfterCreateItem;                                 // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	EConsumeMouseWheel                            ConsumeMouseWheel;                                 // 0x04E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimateWheelScrolling;                            // 0x04E9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowOverscroll;                                   // 0x04EA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              ScrollBarVisibility;                               // 0x04EB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EC[0x1];                                      // 0x04EC(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableDelayAddItems;                              // 0x04ED(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EE[0x2];                                      // 0x04EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AddItemsCountPerFrame;                             // 0x04F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AddItemsTimePerFrame;                              // 0x04F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoadMoreOffset;                                    // 0x04F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bItemAutoSizeToContent;                            // 0x04FC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTickRefresh;                                // 0x04FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoContainerSize;                                // 0x04FE(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4FF[0x1];                                      // 0x04FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxContainerValue;                                 // 0x0500(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDescendantScrollDestination                  NavigationDestination;                             // 0x0504(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_505[0x3];                                      // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NavigationScrollPadding;                           // 0x0508(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredScrollOffset;                               // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_510[0x10];                                     // 0x0510(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           ScrollContainer;                                   // 0x0520(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_528[0x120];                                    // 0x0528(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear(); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F11F0
	void DeleteDelayTimerHandle(); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1210
	void EndInertialScrolling(); // (Final, Native, Public) // @ 0x1427F1230
	void ForceSetBottomBoundary(float InBottomBoundary); // (Final, Native, Public) // @ 0x1427F1250
	void ForceSetScrollBarVisible(bool bVisible); // (Final, Native, Protected) // @ 0x1427F12D0
	int32 GetFirstVisibleIdx(int32 Column); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1360
	int32 GetIndexByItem(class UWidget* Item); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1420
	class UWidget* GetItemByIndex(int32 ItemIndex); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F14B0
	int32 GetLastVisibleIdx(int32 Column); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1570
	bool IsScrolling(float CurOffset); // (Final, Native, Protected) // @ 0x1427F16C0
	void NotifyContainerSizeChange(int32 Index_0, float ScreenRatio, float ItemRatio); // (Final, Native, Public) // @ 0x1427F1750
	void ProccessResetVisibleItem(); // (Final, Native, Public) // @ 0x1427F1850
	void RecycleAllItem(); // (Final, Native, Protected) // @ 0x1427F1870
	void RefreshAllItems(); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1890
	void RefreshItem(int32 ItemIndex); // (Final, Native, Protected, BlueprintCallable) // @ 0x1427F18B0
	void RefreshItemCount(); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1930
	void RefreshVisibleItem(); // (Final, Native, Public) // @ 0x1427F1950
	void RefreshVisibleItems(); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1990
	void RefreshVisibleItemSizeAndPos(); // (Final, Native, Public) // @ 0x1427F1970
	void RelinkTemplateWidget(const class FString& Filename); // (Final, Native, Public) // @ 0x1427F19B0
	void SafeScrollToIndex(float offset, int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1A70
	void ScrollToEnd(const bool bAnimateScroll, const bool bInterruptAnimateScroll, const float AnimateSpeed); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1B40
	void ScrollToEndByIndex(int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1C50
	void ScrollToIndex(int32 Index_0); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1CD0
	void ScrollToIndexIfNotInScreen(int32 Index_0, bool bNeedAllInScreen); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1D50
	void ScrollToIndexToScreen(int32 Index_0, float ScreenRatio, float ItemRatio); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1E10
	void ScrollToItem(const int32 ItemIndex, const bool bAnimateScroll, const bool bInterruptAnimateScroll, const float AnimateSpeed, const float ViewportFactor, const bool bIntoView); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F1F10
	void ScrollToStart(); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F20E0
	void ScrollToStartByParam(const bool bAnimateScroll, const bool bInterruptAnimateScroll, const float AnimateSpeed); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F2100
	void ScrollWidgetIntoView(class UWidget* WidgetToFind, bool AnimateScroll, EDescendantScrollDestination ScrollDestination); // (Final, Native, Protected) // @ 0x1427F2210
	void SetAlwaysShowScrollbar(bool bAlwaysShow); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F2310
	void SetAutoSizeContainerMaxValue(float MaxValue); // (Final, Native, Public) // @ 0x1427F23A0
	void SetConsumeMouseWheel(EConsumeMouseWheel NewConsumeMouseWheel); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F2420
	void SetEditorPreviewItemCount(const int32 InEditorPreviewItemCount); // (Final, Native, Public, BlueprintCallable) // @ 0x141193CB0
	void SetEnableDelayAddItems(bool bNewEnableDelayAddItems, int32 InAddItemsTimePerFrame, int32 InAddItemsCountPerFrame); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F24A0
	void SetItemSpacing(const struct FVector2D& InItemSpacing); // (Final, Native, Public, HasDefaults, BlueprintCallable) // @ 0x1427F25A0
	void SetOrientation(EOrientation NewOrientation); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F2620
	void SetScrollBarVisibility(ESlateVisibility NewScrollBarVisibility); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F26A0
	void SetScrollOffset(float NewScrollOffset); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F2720
	void SetScrollOffsetV2(float NewScrollOffset); // (Final, Native, Public, BlueprintCallable) // @ 0x1427F27A0
	void TriggerViewportSizeChange(); // (Final, Native, Public) // @ 0x1427F2820

	int32 GetFirstVisibleItemIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1427F13F0
	int32 GetItemCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1427F1540
	int32 GetLastVisibleItemIndex() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1427F1600
	float GetScrollOffset() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1427F1630
	float GetScrollOffsetOfEnd() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1427F1660
	int32 GetVisibleItemCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x1427F1690

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WaterfallScrollView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WaterfallScrollView")
	}
	static class UWaterfallScrollView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterfallScrollView>();
	}
};
DUMPER7_ASSERTS_UWaterfallScrollView;

}

