#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Equipment_UpgradeSchedule_PC

#include "Basic.hpp"

#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Equipment_UpgradeSchedule_PC.WBP_Equipment_UpgradeSchedule_PC_C
// 0x0048 (0x0650 - 0x0608)
class UWBP_Equipment_UpgradeSchedule_PC_C final : public ULuaUIBaseView
{
public:
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem;                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_1;                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_2;                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_3;                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_4;                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_5;                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_6;                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_7;                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Equipment_UpgradeScheduleItem_C*   WBP_Equipment_UpgradeItem_8;                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Equipment_UpgradeSchedule_PC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Equipment_UpgradeSchedule_PC_C")
	}
	static class UWBP_Equipment_UpgradeSchedule_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Equipment_UpgradeSchedule_PC_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Equipment_UpgradeSchedule_PC_C;

}

