#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Store_Fantasia

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Store_Fantasia.WBP_Store_Fantasia_C
// 0x0028 (0x0630 - 0x0608)
class UWBP_Store_Fantasia_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_storeContent_in;                              // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFImage*                               DFImage_80;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_710;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_791;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Store_Fantasia(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SequenceEvent_1(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SequenceEvent_0(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ResetSpineAnim(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SequenceEvent__ENTRYPOINTWBP_Store_Fantasia_0(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SequenceEvent__ENTRYPOINTWBP_Store_Fantasia_1(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Store_Fantasia_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Store_Fantasia_C")
	}
	static class UWBP_Store_Fantasia_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Store_Fantasia_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Store_Fantasia_C;

}

