#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SlotCompIconFX_Loading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMGlobalDefines_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SlotCompIconFX_Loading.WBP_SlotCompIconFX_Loading_C
// 0x0028 (0x0320 - 0x02F8)
class UWBP_SlotCompIconFX_Loading_C final : public UDFMImageLoadingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WPB_SlotCompIconImage_Loading_loop_Triangle;       // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFCanvasPanel*                         DFCanvasPanel_46;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_63;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           wtRootCanvas;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SlotCompIconFX_Loading(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void OnIconSizeChange(const struct FVector2D& GridSize); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void StopLoadingAnim_BP(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void PlayLoadingAnim_BP(); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SlotCompIconFX_Loading_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SlotCompIconFX_Loading_C")
	}
	static class UWBP_SlotCompIconFX_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SlotCompIconFX_Loading_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SlotCompIconFX_Loading_C;

}

