#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chat_VoiceBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chat_VoiceBtn.WBP_Chat_VoiceBtn_C
// 0x0040 (0x0648 - 0x0608)
class UWBP_Chat_VoiceBtn_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_loop;                                         // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_146;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_145;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_01;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_02;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_03;                                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFTextBlock*                           TextBlock_254;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Chat_VoiceBtn(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Chat_VoiceBtn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Chat_VoiceBtn_C")
	}
	static class UWBP_Chat_VoiceBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chat_VoiceBtn_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Chat_VoiceBtn_C;

}

