#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonButtonHoverV1S2

#include "Basic.hpp"

#include "GPUserInterface_structs.hpp"
#include "Engine_structs.hpp"
#include "WBP_CommonHoverBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonButtonHoverV1S2.WBP_DFCommonButtonHoverV1S2_C
// 0x0A80 (0x0E30 - 0x03B0)
class UWBP_DFCommonButtonHoverV1S2_C final : public UWBP_CommonHoverBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_DFCommonButtonHoverV1S2_C;      // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAni;                                          // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFCanvasPanel*                         DFCanvasPanel_63;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_1;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_3;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_48;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   btnMainTitle;                                      // 0x03E0(0x0018)(Edit, BlueprintVisible)
	int32                                         size;                                              // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFBrushButtonStateStyle               Style0;                                            // 0x0400(0x0518)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDFBrushButtonStateStyle               Style1;                                            // 0x0918(0x0518)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DFCommonButtonHoverV1S2(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void Destruct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void CustomEvent(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetPressedStateStyle(const struct FButtonStyle& pressedStyle); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTitle(const class FText& btnMainTitle_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetType(int32 size_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetNormalStateStyle(struct FButtonStyle* normalStyle); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetDisabledStyle(struct FButtonStyle* disabledStyle); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonButtonHoverV1S2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonButtonHoverV1S2_C")
	}
	static class UWBP_DFCommonButtonHoverV1S2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonButtonHoverV1S2_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonButtonHoverV1S2_C;

}

