#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUpComponent_SwitchBtn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUpComponent_SwitchBtn.WBP_SetUpComponent_SwitchBtn_C
// 0x00E0 (0x03D0 - 0x02F0)
class UWBP_SetUpComponent_SwitchBtn_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFButton*                              Button_231;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_222;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_01;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_02;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         BpType;                                            // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BpIconVisi;                                        // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BpText;                                            // 0x0320(0x0018)(Edit, BlueprintVisible)
	struct FSlateColor                            Text_Color_01;                                     // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Text_Color_02;                                     // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Text_Color_03;                                     // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UPaperSprite>>    Btn_Bg;                                            // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_SetUpComponent_SwitchBtn(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BndEvt__Button_231_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_Set_Type(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_Set_Select(int32 NewParam); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetSelectedView(bool NewParam); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetExpanded(bool bExpand); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SetUpComponent_SwitchBtn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUpComponent_SwitchBtn_C")
	}
	static class UWBP_SetUpComponent_SwitchBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SetUpComponent_SwitchBtn_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SetUpComponent_SwitchBtn_C;

}

