#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ControllerFunctionButtonCommand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ControllerFunctionButtonCommand.WBP_ControllerFunctionButtonCommand_C
// 0x0028 (0x0688 - 0x0660)
class UWBP_ControllerFunctionButtonCommand_C final : public ULuaUIHudBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_HudController;                                 // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFMMobileCustomLayoutDraggableButton*  ShowMsgBtn;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ControllerButtonType_C*            WBP_ControllerButtonType;                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ControllerFunctionButtonCommand(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMsgWidgetState(int32 MsgState); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetPositionType(int32 Type_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ControllerFunctionButtonCommand_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ControllerFunctionButtonCommand_C")
	}
	static class UWBP_ControllerFunctionButtonCommand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ControllerFunctionButtonCommand_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ControllerFunctionButtonCommand_C;

}

