#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUpComponent_FunctionGroup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUpComponent_FunctionGroup.WBP_SetUpComponent_FunctionGroup_C
// 0x0090 (0x0698 - 0x0608)
class UWBP_SetUpComponent_FunctionGroup_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_SetUpComponent_FunctionGroup_out;              // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_SetUpComponent_FunctionGroup_in;               // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFVerticalBox*                         FunctionList;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_keyboardTitle_C*    Title;                                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BpTitle;                                           // 0x0630(0x0018)(Edit, BlueprintVisible)
	class FText                                   BpTitle_0;                                         // 0x0648(0x0018)(Edit, BlueprintVisible)
	class FText                                   BpTitle_1;                                         // 0x0660(0x0018)(Edit, BlueprintVisible)
	class FText                                   BpTitle_2;                                         // 0x0678(0x0018)(Edit, BlueprintVisible)
	int32                                         Type;                                              // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SetUpComponent_FunctionGroup(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetTitleText(const class FString& Title_0); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetType(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SetUpComponent_FunctionGroup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUpComponent_FunctionGroup_C")
	}
	static class UWBP_SetUpComponent_FunctionGroup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SetUpComponent_FunctionGroup_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SetUpComponent_FunctionGroup_C;

}

