#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Market_Banner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Market_Banner.WBP_Market_Banner_C
// 0x00C0 (0x06C8 - 0x0608)
class UWBP_Market_Banner_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFButton*                              DFButton_Icon;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFButton*                              DFButton_Left;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFButton*                              DFButton_Right;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFCommonRichTextBlock*                 DFCommonRichTextBlock_0;                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_1;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_32;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_67;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_126;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_Icon;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonHoverBg_V2_C*                WBP_CommonHoverBg_V2;                              // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonKeyIconBox_C*                WBP_CommonKeyIconBox;                              // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonKeyIconBox_C*                WBP_CommonKeyIconBox_1;                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, class UTexture2D*>        BannerID2Path;                                     // 0x0678(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Market_Banner(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BndEvt__DFButton_Right_K2Node_ComponentBoundEvent_7_OnButtonReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_Left_K2Node_ComponentBoundEvent_6_OnButtonReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_Left_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_Left_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_Left_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_Right_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_Right_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_Right_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetBanner(const class FString& ID); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Market_Banner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Market_Banner_C")
	}
	static class UWBP_Market_Banner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Market_Banner_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Market_Banner_C;

}

