#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonDropDownItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterface_structs.hpp"
#include "GPUserInterface_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonDropDownItem.WBP_DFCommonDropDownItem_C
// 0x3368 (0x39B8 - 0x0650)
class UWBP_DFCommonDropDownItem_C final : public UDFCommonDropDownItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsShowRightText;                                   // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BpText;                                            // 0x0660(0x0018)(Edit, BlueprintVisible)
	struct FDFRichTextBlockCheckStateStyle        TextStyle_PC;                                      // 0x0678(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDFRichTextBlockCheckStateStyle        TextStyle;                                         // 0x2018(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DFCommonDropDownItem(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetIsShowRightText(bool bInShowRightText); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetKeyText(const class FText& txt); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetRightText(const class FText& txt); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetPC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonDropDownItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonDropDownItem_C")
	}
	static class UWBP_DFCommonDropDownItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonDropDownItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonDropDownItem_C;

}

