#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonButtonIconV1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonButtonIconV1.WBP_CommonButtonIconV1_C
// 0x0050 (0x0340 - 0x02F0)
class UWBP_CommonButtonIconV1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFButton*                              DFButton_83;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFMImage*                              DFMImage_Icon;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            ImageIcon;                                         // 0x0308(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SetSize;                                           // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x2];                                      // 0x0332(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              imageSize;                                         // 0x0334(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled;                                          // 0x033C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_CommonButtonIconV1(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BP_InitWidget_1(bool InSelected); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Set_Type(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_Set_Type(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetSelected(bool bInSelected); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CommonButtonIconV1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_CommonButtonIconV1_C")
	}
	static class UWBP_CommonButtonIconV1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonButtonIconV1_C>();
	}
};
DUMPER7_ASSERTS_UWBP_CommonButtonIconV1_C;

}

