#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Itemview_Hint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Itemview_Hint.WBP_Itemview_Hint_C
// 0x0080 (0x0688 - 0x0608)
class UWBP_Itemview_Hint_C final : public UDFInteractorMissionTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_Itemview_Favorite_PlayOnce;                    // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_Itemview_Favorite_loop;                        // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_Itemview_Favorite_out;                         // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_Itemview_Favorite_in;                          // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_53;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_129;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPaperSprite>            Image;                                             // 0x0648(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         TempAniType;                                       // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UPaperSprite>>    RefImage;                                          // 0x0678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Itemview_Hint(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BP_SetMissionType(int32 InType); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_PlayAni(int32 InAniType, bool InbPlay); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SequenceEvent_1(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SequenceEvent_0(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetType(int32 Type_0); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Itemview_Hint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Itemview_Hint_C")
	}
	static class UWBP_Itemview_Hint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Itemview_Hint_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Itemview_Hint_C;

}

