#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScreenEffectArmor_Break

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScreenEffectArmor_Break.WBP_ScreenEffectArmor_Break_C
// 0x0040 (0x04F8 - 0x04B8)
class UWBP_ScreenEffectArmor_Break_C final : public UDFMHUDHitBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Armor_Break_Old;                                   // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CircleMask_Hit1;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFSafeZone*                            DFSafeZone_92;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIMeshWidget*                          fx_mp;                                             // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHitArmor;                                         // 0x04E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E5[0x3];                                      // 0x04E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentEffectName;                                 // 0x04EC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ScreenEffectArmor_Break(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void OnDeactive(class FName EffectName); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnActive(class FName EffectName); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void OnInitialized(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_ModifyHitEffect(const bool HitArmor); // (Event, Protected, BlueprintEvent) // @ 0x14B5B5E20
	void Finished_73AC1BC748D50012E81FBDA85633B520(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetCameraBlur(bool Enable, bool* Ret); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ScreenEffectArmor_Break_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ScreenEffectArmor_Break_C")
	}
	static class UWBP_ScreenEffectArmor_Break_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScreenEffectArmor_Break_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ScreenEffectArmor_Break_C;

}

