#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AuctionSearchBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AuctionSearchBar.WBP_AuctionSearchBar_C
// 0x08A0 (0x0EA8 - 0x0608)
class UWBP_AuctionSearchBar_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFCanvasPanel*                         DFCanvasPanel_28;                                  // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFCheckBox*                            DFCheckBox_83;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage;                                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_34;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_60;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFTextBlock*                           DFTextBlock_33;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InputBoxWithBtn_C*                 WBP_InputBoxWithBtn;                               // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FEditableTextBoxStyle                  Style;                                             // 0x0648(0x0860)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_AuctionSearchBar(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_11_OnCheckBoxReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_10_OnCheckBoxReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_7_OnCheckBoxReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_6_OnCheckBoxReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_4_OnCheckBoxPressedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_3_OnCheckBoxClickedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_1_OnCheckBoxPressedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCheckBox_83_K2Node_ComponentBoundEvent_0_OnCheckBoxClickedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_AuctionSearchBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_AuctionSearchBar_C")
	}
	static class UWBP_AuctionSearchBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AuctionSearchBar_C>();
	}
};
DUMPER7_ASSERTS_UWBP_AuctionSearchBar_C;

}

