#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Marker_Map_TrackAnimations

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Marker_Map_TrackAnimations.WBP_Marker_Map_TrackAnimations_C
// 0x0030 (0x0320 - 0x02F0)
class UWBP_Marker_Map_TrackAnimations_C final : public UAnimTrackingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_Marker_Map_TrackAnimations_in;                 // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_Marker_Map_TrackAnimations_out;                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_Marker_Map_TrackAnimations_loop;               // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFMImage*                              DFMImage_InnerCircle;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFMImage*                              DFMImage_OuterCircle;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Finished_6B7C5BD84B810214459DD09A319DDB35(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_PlayTrackingAnimation(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_WBP_Marker_Map_TrackAnimations(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Marker_Map_TrackAnimations_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Marker_Map_TrackAnimations_C")
	}
	static class UWBP_Marker_Map_TrackAnimations_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Marker_Map_TrackAnimations_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Marker_Map_TrackAnimations_C;

}

