#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Recruit_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Recruit_Head.WBP_Recruit_Head_C
// 0x0030 (0x0638 - 0x0608)
class UWBP_Recruit_Head_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFImage*                               DFImage_Invisibility;                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonHeadIcon_C*                  wtCommonHeadIcon;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Common_SmallFlatRank_C*            wtRankDivisionIcon;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UPaperSprite>>    ICON;                                              // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor)

public:
	void ExecuteUbergraph_WBP_Recruit_Head(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetPC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Recruit_Head_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Recruit_Head_C")
	}
	static class UWBP_Recruit_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Recruit_Head_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Recruit_Head_C;

}

