#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Marker_Map_EvacuateTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DFMGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Marker_Map_EvacuateTime.WBP_Marker_Map_EvacuateTime_C
// 0x0048 (0x0370 - 0x0328)
class UWBP_Marker_Map_EvacuateTime_C final : public UEvacuteTimeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_Marker_Map_EvacuateTime_in;                    // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_Marker_Map_EvacuateTime_out;                   // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            NewVar_0;                                          // 0x0348(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetType(int32 Type_0); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Finished_03EFA1AD41722E16C9C6DD910FDBF17D(); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetTextType(const int32& InTextType); // (Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void BP_PlayFadeIn(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_PlayFadeOut(); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void ExecuteUbergraph_WBP_Marker_Map_EvacuateTime(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Marker_Map_EvacuateTime_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Marker_Map_EvacuateTime_C")
	}
	static class UWBP_Marker_Map_EvacuateTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Marker_Map_EvacuateTime_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Marker_Map_EvacuateTime_C;

}

