#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonTabV1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterface_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonTabV1.WBP_DFCommonTabV1_C
// 0x0060 (0x0668 - 0x0608)
class UWBP_DFCommonTabV1_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFCommonCheckButton_TabV1_C*           DFCommonCheckButton;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Lock;                                           // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   btnMainTitle;                                      // 0x0620(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UPaperSprite>            ImageIcon;                                         // 0x0638(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Show_Icon;                                         // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowSpacerLine;                                   // 0x0661(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_DFCommonTabV1(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_0_OnCheckButtonStateChanged__DelegateSignature(const ECheckButtonState& CurCheckState); // (HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void BP_InitTabStyle(const class FText& btnMainTitle_0, TSoftObjectPtr<class UPaperSprite> ImageIcon_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTitle(const class FText& InMainTitle); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetIsLocked(bool Is_Lock_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetShowSpacerLine(bool bShowSpacerLine_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonTabV1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonTabV1_C")
	}
	static class UWBP_DFCommonTabV1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonTabV1_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonTabV1_C;

}

