#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUpComponent_TwoBtnHD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_BaseSetUpItem_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUpComponent_TwoBtnHD.WBP_SetUpComponent_TwoBtnHD_C
// 0x00B8 (0x0728 - 0x0670)
class UWBP_SetUpComponent_TwoBtnHD_C final : public UWBP_BaseSetUpItem_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_SetUpComponent_TwoBtnHD_C;      // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_SetUpComponent_TwoBtn_out;                     // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_SetUpComponent_TwoBtn_in;                      // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SwitchBtn_C*        Close;                                             // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_Disabled;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HoverPan;                                          // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SwitchBtn_C*        Open;                                              // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFTextBlock*                           TextBlock;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BpTitle;                                           // 0x06B8(0x0018)(Edit, BlueprintVisible)
	class FText                                   BpBtnText_01;                                      // 0x06D0(0x0018)(Edit, BlueprintVisible)
	class FText                                   BpBtnText_02;                                      // 0x06E8(0x0018)(Edit, BlueprintVisible)
	bool                                          bExp_01;                                           // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bExp_02;                                           // 0x0701(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_702[0x6];                                      // 0x0702(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Index, bool bEpanded)> OnStateChanged;                       // 0x0708(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bExped_01;                                         // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bExped_02;                                         // 0x0719(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71A[0x2];                                      // 0x071A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x071C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disabled;                                          // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Type;                                              // 0x0724(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SetUpComponent_TwoBtnHD(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void OnMouseLeave(const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__Close_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__Open_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetSelectedByIndex(int32 Index_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetBtnByIndex(int32 Index_0, class UWBP_SetUpComponent_SwitchBtn_C** Btn, class UWBP_SetUpComponent_SwitchBtn_C** Another); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent, BlueprintPure) // @ 0x14B5B5E20
	void CanExp(class UWBP_SetUpComponent_SwitchBtn_C* Btn, bool* bCnaExp); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent, BlueprintPure) // @ 0x14B5B5E20
	void UpdateBtnState(class UWBP_SetUpComponent_SwitchBtn_C* Btn, int32 State); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void IsExped(class UWBP_SetUpComponent_SwitchBtn_C* Btn, bool* bExped); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent, BlueprintPure) // @ 0x14B5B5E20
	void SetExped(class UWBP_SetUpComponent_SwitchBtn_C* Btn, bool bExped); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_TryToggleExpByIndex(int32 Index_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_PreInit(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetDisabled(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetType(int32 Type_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_NotifyState(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SetUpComponent_TwoBtnHD_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUpComponent_TwoBtnHD_C")
	}
	static class UWBP_SetUpComponent_TwoBtnHD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SetUpComponent_TwoBtnHD_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SetUpComponent_TwoBtnHD_C;

}

