#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonTabV3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "GPUserInterface_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonTabV3.WBP_DFCommonTabV3_C
// 0x33A8 (0x39B0 - 0x0608)
class UWBP_DFCommonTabV3_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFCommonCheckButton_TabV3_C*           DFCommonCheckButton;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShowSpacerLine;                                   // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPaperSprite>            ImageIcon;                                         // 0x0620(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Show_Icon;                                         // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   btnMainTitle;                                      // 0x0650(0x0018)(Edit, BlueprintVisible)
	bool                                          Is_Lock;                                           // 0x0668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDFRichTextBlockCheckStateStyle        TextStyle;                                         // 0x0670(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDFRichTextBlockCheckStateStyle        TextStyle_PC;                                      // 0x2010(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DFCommonTabV3(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_1_OnCheckButtonStateChanged__DelegateSignature(const ECheckButtonState& CurCheckState); // (HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_InitTabStyle(const class FText& btnMainTitle_0, TSoftObjectPtr<class UPaperSprite> ImageIcon_0, bool Show_Icon_0, bool bShowSpacerLine_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTitle(const class FText& InMainTitle); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Set_Lock(bool Is_Lock_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetShowSpacerLine(bool bShowSpacerLine_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTitleDefaultPolicy(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonTabV3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonTabV3_C")
	}
	static class UWBP_DFCommonTabV3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonTabV3_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonTabV3_C;

}

