#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cursor_ConsoleKM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPGameplay_structs.hpp"
#include "GPGameplay_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Cursor_ConsoleKM.WBP_Cursor_ConsoleKM_C
// 0x0040 (0x0340 - 0x0300)
class UWBP_Cursor_ConsoleKM_C final : public UGPSoftwareCursor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFImage*                               DFImage;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_1;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_2;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_3;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_4;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFSizeBox*                             DFSizeBox_0;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFZeroSizeBox*                         DFZeroSizeBox_0;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Cursor_ConsoleKM(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BP_UpdateType(EGPSoftwareCursorType InType); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Cursor_ConsoleKM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Cursor_ConsoleKM_C")
	}
	static class UWBP_Cursor_ConsoleKM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Cursor_ConsoleKM_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Cursor_ConsoleKM_C;

}

