#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScreenMarkerMission_Raid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPQuest_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "IrisWorld_classes.hpp"
#include "QMarkerCustomImage_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScreenMarkerMission_Raid.WBP_ScreenMarkerMission_Raid_C
// 0x0078 (0x04E0 - 0x0468)
class UWBP_ScreenMarkerMission_Raid_C final : public URaidScreenMarkerView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0468(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_ScreenMarkerMission_Raid_loop;                 // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_ScreenMarkerMission_Raid_out;                  // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_ScreenMarkerMission_Raid_in;                   // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFCanvasPanel*                         DFCanvasPanel_159;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFTextBlock*                           DistMText;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFTextBlock*                           UpDistMText;                                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenMarkerMission__Flagged_C*    WBP_ScreenMarkerMission__Flagged;                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPaperSprite*>                   IconImageArray;                                    // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                   Bpcolor;                                           // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	EGPQuestActionMarkerType                      markerType;                                        // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsAimed;                                          // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_ScreenMarkerMission_Raid(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void HealthPointChanged(float HealthPointPercent); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetType(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetRaidMarkerAppearance(EGPQuestActionMarkerType InMarkerType); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetDistText(bool bIsInScreenArea, float Distance); // (Public, HasDefaults, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PlayTargetAnimation(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetCustomImage(EQMarkerCustomImage ImageType); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Set_Is_Aim(bool bIsAim, EGPQuestActionMarkerType markerType_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetArrow(bool bIsOutScreen, float Angle); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ScreenMarkerMission_Raid_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ScreenMarkerMission_Raid_C")
	}
	static class UWBP_ScreenMarkerMission_Raid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScreenMarkerMission_Raid_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ScreenMarkerMission_Raid_C;

}

