#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUp_InputV2_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUp_InputV2.WBP_SetUp_InputV2_C
// 0x0028 (0x0CD8 - 0x0CB0)
class WBP_SetUp_InputV2_0::UWBP_SetUp_InputV2_C final : public UDFHDSettingsInputPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFVerticalBox*                         FunctionGroupList;                                 // 0x0CB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFScrollBox*                           InputPanelScrollBox;                               // 0x0CC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_InputRevoke_C*      WBP_SetUpComponent_TipsBar;                        // 0x0CC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x0CD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SetUp_InputV2(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("WidgetBlueprintGeneratedClass WBP_SetUp_InputV2.WBP_SetUp_InputV2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUp_InputV2_C")
	}
	static class WBP_SetUp_InputV2_0::UWBP_SetUp_InputV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<WBP_SetUp_InputV2_0::UWBP_SetUp_InputV2_C>();
	}
};
DUMPER7_ASSERTS_WBP_SetUp_InputV2_0__UWBP_SetUp_InputV2_C;

}

