#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonKeyIconBoxText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMGameplay_structs.hpp"
#include "DFMGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CommonKeyIconBoxText.WBP_CommonKeyIconBoxText_C
// 0x00C0 (0x07B0 - 0x06F0)
class UWBP_CommonKeyIconBoxText_C final : public UDFHDKeyIconBoxTextWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_CommonKeyIconBoxText_out;                      // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_CommonKeyIconBoxText_in;                       // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UPlatformScaleBox*                      PlatformScaleBox_PreTextBlock;                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlatformScaleBox*                      PlatformScaleBox_ZoomText;                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   DisplayInputActionName;                            // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionAxisName;                                    // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisScale;                                         // 0x0728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           KeyNames;                                          // 0x0730(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	float                                         KeyIconHeight;                                     // 0x0740(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FontStyleIdx;                                      // 0x0744(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowPreText;                                      // 0x074C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_74D[0x3];                                      // 0x074D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PreText;                                           // 0x0750(0x0018)(Edit, BlueprintVisible)
	bool                                          bShowRightText;                                    // 0x0768(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   RightText;                                         // 0x0770(0x0018)(Edit, BlueprintVisible)
	int32                                         Type;                                              // 0x0788(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EKeyIconType                                  KeyIconType;                                       // 0x078C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   EmptyText;                                         // 0x0790(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PaddingIconAndText;                                // 0x07A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CommonKeyIconBoxText(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetStyle(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetKeyByActionAxisName(class FName ActionOrAxisName); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetKeyByDisplayInputActionName(class FName DisplayInputActionName_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetKeyByKeyNames(TArray<class FName>& KeyNames_0); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetType(int32 Type_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetText(const class FText& InText, const class FText& InRightText); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetTextFont(class FName InTextStyleIdx); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CommonKeyIconBoxText_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_CommonKeyIconBoxText_C")
	}
	static class UWBP_CommonKeyIconBoxText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CommonKeyIconBoxText_C>();
	}
};
DUMPER7_ASSERTS_UWBP_CommonKeyIconBoxText_C;

}

