#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContentStreamlineBullet2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ContentStreamlineBullet2.WBP_ContentStreamlineBullet2_C
// 0x0040 (0x0648 - 0x0608)
class UWBP_ContentStreamlineBullet2_C final : public ULuaUIBaseView
{
public:
	class UDFBackgroundBlur*                      DFBackgroundBlur_69;                               // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFMCommonImage*                        ItemDetailImageBg;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemDetailStreamContentEffect_C*   WBP_ItemDetailStreamContent_Effect;                // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemDetailStreamContentEffect_C*   WBP_ItemDetailStreamContent_Effect_33;             // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemDetailContent_Item_C*          WBP_Weapon;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemDetailContent_ListContent_C*   wHeadsetLabelBtn;                                  // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   Bpcolor;                                           // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ContentStreamlineBullet2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ContentStreamlineBullet2_C")
	}
	static class UWBP_ContentStreamlineBullet2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ContentStreamlineBullet2_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ContentStreamlineBullet2_C;

}

