#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonTabV2S2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "GPUserInterface_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonTabV2S2.WBP_DFCommonTabV2S2_C
// 0x3370 (0x3978 - 0x0608)
class UWBP_DFCommonTabV2S2_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFCommonTabV2_C*                       DFCommonCheckButton;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_Lock;                                           // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   btnMainTitle;                                      // 0x0620(0x0018)(Edit, BlueprintVisible)
	struct FDFRichTextBlockCheckStateStyle        Style_PC;                                          // 0x0638(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDFRichTextBlockCheckStateStyle        Style;                                             // 0x1FD8(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DFCommonTabV2S2(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_17_OnCheckBoxClickedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_13_OnCheckBoxHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_12_OnCheckBoxHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_11_OnCheckBoxReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_10_OnCheckBoxPressedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_9_OnCheckBoxClickedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_8_OnCheckBoxHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_7_OnCheckBoxHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_6_OnCheckBoxPressedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTitle(const class FText& btnMainTitle_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_InitTabStyle(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetType(bool Is_Lock_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetPC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonTabV2S2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonTabV2S2_C")
	}
	static class UWBP_DFCommonTabV2S2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonTabV2S2_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonTabV2S2_C;

}

