#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUp_UI

#include "Basic.hpp"

#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUp_UI.WBP_SetUp_UI_C
// 0x0038 (0x0640 - 0x0608)
class WBP_SetUp_UI::UWBP_SetUp_UI_C final : public ULuaUIBaseView
{
public:
	class UWidgetAnimation*                       WBP_SetUp_Game_out;                                // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_SetUp_Game_in;                                 // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoice_C*   _wtItemTextLanuage;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoice_C*   _wtItemVoiceLanuage;                               // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_Check_C*            WBP_SetUpComponent_Check_5;                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_keyboardTitle_C*    WBP_SetUpComponent_ListTitle_1;                    // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_keyboardTitle_C*    WBP_SetUpComponent_ListTitle_5;                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("WidgetBlueprintGeneratedClass WBP_SetUp_UI.WBP_SetUp_UI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUp_UI_C")
	}
	static class WBP_SetUp_UI::UWBP_SetUp_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<WBP_SetUp_UI::UWBP_SetUp_UI_C>();
	}
};
DUMPER7_ASSERTS_WBP_SetUp_UI__UWBP_SetUp_UI_C;

}

