#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Hero_HeroItem02

#include "Basic.hpp"

#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Hero_HeroItem02.WBP_Hero_HeroItem02_C
// 0x0028 (0x0630 - 0x0608)
class UWBP_Hero_HeroItem02_C final : public ULuaUIBaseView
{
public:
	class UDFImage*                               DFImage_39;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFWrapBox*                             DFWrapBox_74;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hero_HeroItem01_C*                 WBP_Hero_HeroItem01;                               // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hero_HeroItem01_C*                 WBP_Hero_HeroItem01_1;                             // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Hero_HeroItem01_C*                 WBP_Hero_HeroItem01_2;                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Hero_HeroItem02_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Hero_HeroItem02_C")
	}
	static class UWBP_Hero_HeroItem02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Hero_HeroItem02_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Hero_HeroItem02_C;

}

