#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Warehouse_ExtArrange_Pc

#include "Basic.hpp"

#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Warehouse_ExtArrange_Pc.WBP_Warehouse_ExtArrange_Pc_C
// 0x0050 (0x0658 - 0x0608)
class UWBP_Warehouse_ExtArrange_Pc_C final : public ULuaUIBaseView
{
public:
	class UWidgetAnimation*                       WBP_Warehouse_ExtArrange_Pc_out;                   // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_Warehouse_ExtArrange_Pc_in;                    // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFImage*                               DFImage_99;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_392;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFTipsAnchor*                          TipsAnchor_ExtManager;                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DFCommonIconButton_C*              wtArrangeWindowBtn;                                // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WBP_DFCommonButtonV2S2_0::UWBP_DFCommonButtonV2S2_C* wtCancelExtArrangeBtn;                // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DFCommonCheckInstruction_C*        wtCommonCheckInstruction;                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class WBP_DFCommonButtonV2S2_0::UWBP_DFCommonButtonV2S2_C* wtConfirmExtArrangeBtn;               // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DFCommonCheckBoxWithText_C*        wtSelectAllCheckBox;                               // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Warehouse_ExtArrange_Pc_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Warehouse_ExtArrange_Pc_C")
	}
	static class UWBP_Warehouse_ExtArrange_Pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Warehouse_ExtArrange_Pc_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Warehouse_ExtArrange_Pc_C;

}

