#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUp_InputV2_Gamepad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DFMGameHud_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUp_InputV2_Gamepad.WBP_SetUp_InputV2_Gamepad_C
// 0x0028 (0x0698 - 0x0670)
class UWBP_SetUp_InputV2_Gamepad_C final : public UDFMSettingsInputPanel_Gamepad
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_SetUpComponent_KeyRebindingTips_Gamepad_C* _wtKeyRebindingTips;                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFVerticalBox*                         FunctionGroupList;                                 // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFScrollBox*                           InputPanelScrollBox;                               // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SetUp_InputV2_Gamepad(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SetUp_InputV2_Gamepad_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUp_InputV2_Gamepad_C")
	}
	static class UWBP_SetUp_InputV2_Gamepad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SetUp_InputV2_Gamepad_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SetUp_InputV2_Gamepad_C;

}

