#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BHD_ModeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BHD_ModeButton.WBP_BHD_ModeButton_C
// 0x0078 (0x0680 - 0x0608)
class UWBP_BHD_ModeButton_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InitialState;                                      // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UpAni;                                             // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DownAni;                                           // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecoverHoverAni;                                   // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAni;                                          // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFCanvasPanel*                         CP_bg;                                             // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFButton*                              DFButton_0;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_Locked;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComputeTextBlock*                      DFTextBlock_ModeName;                              // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         BtnStateType;                                      // 0x0658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ModeText;                                          // 0x0660(0x0018)(Edit, BlueprintVisible)
	bool                                          IsLock;                                            // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_BHD_ModeButton(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BndEvt__DFButton_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void 自定义事件_0(const class FString& NewCulture); // (BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Destruct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void Construct(); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_0_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFButton_0_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void SetButtonState(int32 StateType); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Set_Mode_Text(const class FText& Text); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetLock(bool IsLock_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BHD_ModeButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BHD_ModeButton_C")
	}
	static class UWBP_BHD_ModeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BHD_ModeButton_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BHD_ModeButton_C;

}

