#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUp_Radio_0

#include "Basic.hpp"

#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUp_Radio.WBP_SetUp_Radio_C
// 0x0090 (0x0698 - 0x0608)
class WBP_SetUp_Radio_0::UWBP_SetUp_Radio_C final : public ULuaUIBaseView
{
public:
	class UWidgetAnimation*                       WBP_SetUp_Game_out;                                // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_SetUp_Game_in;                                 // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_SetUpComponent_keyboardTitle_C*    WBP_SetUpComponent_keyboardTitle;                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_keyboardTitle_C*    WBP_SetUpComponent_ListTitle;                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_keyboardTitle_C*    WBP_SetUpComponent_ListTitle_1;                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoice_C*   WBP_SetUpComponent_MultipleChoice_1;               // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoice_C*   WBP_SetUpComponent_MultipleChoice_2;               // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoice_C*   WBP_SetUpComponent_MultipleChoice_3;               // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoice_C*   WBP_SetUpComponent_MultipleChoice_4;               // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoiceV1_C* WBP_SetUpComponent_MultipleChoiceV1_1;             // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_MultipleChoiceV1_C* WBP_SetUpComponent_MultipleChoiceV1_246;           // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SplitBtn_2_C*       WBP_SetUpComponent_SplitBtn;                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SplitBtn_2_C*       WBP_SetUpComponent_SplitBtn_1;                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SplitBtn_2_C*       WBP_SetUpComponent_SplitBtn_2;                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SplitBtn_2_C*       WBP_SetUpComponent_SplitBtn_3;                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SplitBtn_2_C*       WBP_SetUpComponent_SplitBtn_4;                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SetUpComponent_SplitBtn_3_C*       WBP_SetUpComponent_SplitBtn_5;                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFVerticalBox*                         wtPlayerList;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("WidgetBlueprintGeneratedClass WBP_SetUp_Radio.WBP_SetUp_Radio_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUp_Radio_C")
	}
	static class WBP_SetUp_Radio_0::UWBP_SetUp_Radio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<WBP_SetUp_Radio_0::UWBP_SetUp_Radio_C>();
	}
};
DUMPER7_ASSERTS_WBP_SetUp_Radio_0__UWBP_SetUp_Radio_C;

}

