#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonButtonV1S3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterface_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonButtonV1S3.WBP_DFCommonButtonV1S3_C
// 0x0040 (0x0648 - 0x0608)
class UWBP_DFCommonButtonV1S3_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class DFCommonButtonV1_0::UDFCommonButtonV1_C* DFCommonButton;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFCommonBusinessButtonV1_PCOnly_Commerce_C* DFCommonButton_PCOnly;                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UPaperSprite>>    RefImage;                                          // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FText                                   btnMainTitle;                                      // 0x0630(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_DFCommonButtonV1S3(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void GetPressedStateStyle(const struct FButtonStyle& pressedStyle); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTitle(const class FText& btnMainTitle_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void PC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetFlowAnimType(EFlowAnimType FlowType); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetNormalStateStyle(struct FButtonStyle* normalStyle); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetDisabledStyle(struct FButtonStyle* disabledStyle); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UWidget* GetNavigationSelectorTarget(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FName GetNavigationSelectorStyle(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonButtonV1S3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonButtonV1S3_C")
	}
	static class UWBP_DFCommonButtonV1S3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonButtonV1S3_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonButtonV1S3_C;

}

