#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonCheckButtonDroDownItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "GPUserInterface_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonCheckButtonDroDownItem.WBP_DFCommonCheckButtonDroDownItem_C
// 0x3378 (0x3980 - 0x0608)
class UWBP_DFCommonCheckButtonDroDownItem_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFCommonDroDownItem_C*                 DFCommonCheckButton;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFTextBlock*                           wtRightText;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsShowRightText;                                   // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BpText;                                            // 0x0628(0x0018)(Edit, BlueprintVisible)
	struct FDFRichTextBlockCheckStateStyle        TextStyle_PC;                                      // 0x0640(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDFRichTextBlockCheckStateStyle        TextStyle;                                         // 0x1FE0(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DFCommonCheckButtonDroDownItem(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetIsShowRightText(bool bInShowRightText); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetKeyText(const class FText& txt); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetRightText(const class FText& txt); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetPC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UWidget* GetNavigationSelectorTarget(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FName GetNavigationSelectorStyle(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonCheckButtonDroDownItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonCheckButtonDroDownItem_C")
	}
	static class UWBP_DFCommonCheckButtonDroDownItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonCheckButtonDroDownItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonCheckButtonDroDownItem_C;

}

