#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SetUpComponent_FunctionKeyChoiceItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SetUpComponent_FunctionKeyChoiceItem.WBP_SetUpComponent_FunctionKeyChoiceItem_C
// 0x0060 (0x0668 - 0x0608)
class UWBP_SetUpComponent_FunctionKeyChoiceItem_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WBP_SetUpComponent_FunctionKeyChoiceItem_out;      // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WBP_SetUpComponent_FunctionKeyChoiceItem_in;       // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFImage*                               DFImage_328;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_Mask;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           HoverPan;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DFTabGroupDroDownBox_Pc_C*         WBP_DFTabGroupDroDownBox_Pc;                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0648(0x0018)(Edit, BlueprintVisible)
	bool                                          Disabled;                                          // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_SetUpComponent_FunctionKeyChoiceItem(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void OnMouseLeave(const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent); // (BlueprintCosmetic, Event, Public, HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void SetStyle(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetDisabled(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UWidget* GetNavigationSelectorTarget(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FName GetNavigationSelectorStyle(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SetUpComponent_FunctionKeyChoiceItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SetUpComponent_FunctionKeyChoiceItem_C")
	}
	static class UWBP_SetUpComponent_FunctionKeyChoiceItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SetUpComponent_FunctionKeyChoiceItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SetUpComponent_FunctionKeyChoiceItem_C;

}

