#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GunStand_GunsmithSceneSocketPartUI

#include "Basic.hpp"

#include "GPUserInterfaceCore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GunStand_GunsmithSceneSocketPartUI.WBP_GunStand_GunsmithSceneSocketPartUI_C
// 0x0018 (0x0620 - 0x0608)
class UWBP_GunStand_GunsmithSceneSocketPartUI_C final : public ULuaUIBaseView
{
public:
	float                                         longRatio;                                         // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         shortRatio;                                        // 0x060C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowDebugInfo;                                    // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ItemSizeX;                                         // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemSizeY;                                         // 0x0618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetDistance;                                    // 0x061C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GunStand_GunsmithSceneSocketPartUI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GunStand_GunsmithSceneSocketPartUI_C")
	}
	static class UWBP_GunStand_GunsmithSceneSocketPartUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GunStand_GunsmithSceneSocketPartUI_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GunStand_GunsmithSceneSocketPartUI_C;

}

