#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFCommonCheckButtonV3S1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterfaceCore_classes.hpp"
#include "GPUserInterface_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFCommonCheckButtonV3S1.WBP_DFCommonCheckButtonV3S1_C
// 0x33B0 (0x39B8 - 0x0608)
class UWBP_DFCommonCheckButtonV3S1_C final : public ULuaUIBaseView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDFCommonCheckButtonV3_C*               DFCommonCheckButton;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               HotZone;                                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ClickCallback;                                     // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UPaperSprite>            ImageIcon;                                         // 0x0630(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                   btnMainTitle;                                      // 0x0658(0x0018)(Edit, BlueprintVisible)
	bool                                          Show_Icon;                                         // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         size;                                              // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDFRichTextBlockCheckStateStyle        TextStyle;                                         // 0x0678(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDFRichTextBlockCheckStateStyle        TextStyle_PC;                                      // 0x2018(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DFCommonCheckButtonV3S1(int32 EntryPoint); // (Final, UbergraphFunction, HasDefaults) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void GetPressedStateStyle(const struct FButtonStyle& pressedStyle); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void Set_Type(TSoftObjectPtr<class UPaperSprite> ImageIcon_0, const class FText& btnMainTitle_0, bool Show_Icon_0, int32 size_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTitle(const class FText& InbtnMainTitle); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void ShowIcon(bool Show_Icon_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetSize(int32 size_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetPC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetNormalStateStyle(struct FButtonStyle* normalStyle); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void GetDisabledStyle(struct FButtonStyle* disabledStyle); // (Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class FName GetNavigationSelectorStyle(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	class UWidget* GetNavigationSelectorTarget(); // (Event, Public, HasOutParams, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFCommonCheckButtonV3S1_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFCommonCheckButtonV3S1_C")
	}
	static class UWBP_DFCommonCheckButtonV3S1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFCommonCheckButtonV3S1_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFCommonCheckButtonV3S1_C;

}

