#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DFTabGroupMainSubBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GPUserInterface_structs.hpp"
#include "GPUserInterface_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DFTabGroupMainSubBox.WBP_DFTabGroupMainSubBox_C
// 0x3370 (0x3848 - 0x04D8)
class UWBP_DFTabGroupMainSubBox_C final : public UDFCommonTabGroupItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       UncheckedUpAni;                                    // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDFCanvasPanel*                         DFCanvasPanel_Child;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFImage*                               DFImage_Arrow;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFSizeBox*                             DFSizeBox_1;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDFMImage*                              Image_Bg;                                          // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDFRichTextBlockCheckStateStyle        TextStyle_PC;                                      // 0x0508(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDFRichTextBlockCheckStateStyle        TextStyle;                                         // 0x1EA8(0x19A0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DFTabGroupMainSubBox(int32 EntryPoint); // (Final, UbergraphFunction) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_0_OnCheckBoxReleasedEvent__DelegateSignature(); // (BlueprintEvent) // @ 0x14B5B5E20
	void OnSetIsDropDown(bool bIsDropDown); // (Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BndEvt__DFCommonCheckButton_K2Node_ComponentBoundEvent_1_OnCheckButtonStateChanged__DelegateSignature(const ECheckButtonState& CurCheckState); // (HasOutParams, BlueprintEvent) // @ 0x14B5B5E20
	void PreConstruct(bool IsDesignTime); // (BlueprintCosmetic, Event, Public, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SwitchCheckButtonState(ECheckButtonState InCheckButtonState); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetMainTabText(const class FText& InMainText); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void BP_SetStyle(bool bDropDown_0); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20
	void SetPC(); // (Public, BlueprintCallable, BlueprintEvent) // @ 0x14B5B5E20

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DFTabGroupMainSubBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DFTabGroupMainSubBox_C")
	}
	static class UWBP_DFTabGroupMainSubBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DFTabGroupMainSubBox_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DFTabGroupMainSubBox_C;

}

