#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebBrowserWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WebBrowserWidget.WebBrowser
// 0x0048 (0x0198 - 0x0150)
class UWebBrowser final : public UWidget
{
public:
	TMulticastInlineDelegate<void(const class FText& Text)> OnUrlChanged;                            // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& URL, const class FString& Frame)> OnBeforePopup; // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 InitialURL;                                        // 0x0170(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsTransparency;                             // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_181[0x17];                                     // 0x0181(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ExecuteJavascript(const class FString& ScriptText); // (Final, Native, Public, BlueprintCallable) // @ 0x141123A10
	void LoadString(const class FString& Contents, const class FString& DummyURL); // (Final, Native, Public, BlueprintCallable) // @ 0x141123BF0
	void LoadURL(const class FString& NewURL); // (Final, Native, Public, BlueprintCallable) // @ 0x141123DD0

	class FText GetTitleText() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141123AD0
	class FString GetUrl() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141123B70

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WebBrowser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WebBrowser")
	}
	static class UWebBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebBrowser>();
	}
};
DUMPER7_ASSERTS_UWebBrowser;

// Class WebBrowserWidget.WebBrowserAssetManager
// 0x0050 (0x0078 - 0x0028)
class UWebBrowserAssetManager final : public UObject
{
public:
	TSoftObjectPtr<class UMaterial>               DefaultMaterial;                                   // 0x0028(0x0028)(Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WebBrowserAssetManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WebBrowserAssetManager")
	}
	static class UWebBrowserAssetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebBrowserAssetManager>();
	}
};
DUMPER7_ASSERTS_UWebBrowserAssetManager;

}

