#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZipLib

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "ZipLib_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ZipLib.ZipAsyncBase
// 0x0008 (0x0038 - 0x0030)
class UZipAsyncBase : public UBlueprintAsyncActionBase
{
public:
	class UZipper*                                Zipper;                                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZipAsyncBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZipAsyncBase")
	}
	static class UZipAsyncBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZipAsyncBase>();
	}
};
DUMPER7_ASSERTS_UZipAsyncBase;

// Class ZipLib.UnzipAsyncBase
// 0x0008 (0x0038 - 0x0030)
class UUnzipAsyncBase : public UBlueprintAsyncActionBase
{
public:
	class UUnzipper*                              Unzipper;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnzipAsyncBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnzipAsyncBase")
	}
	static class UUnzipAsyncBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnzipAsyncBase>();
	}
};
DUMPER7_ASSERTS_UUnzipAsyncBase;

// Class ZipLib.ZipDirectoryProxy
// 0x0068 (0x00A0 - 0x0038)
class UZipDirectoryProxy final : public UZipAsyncBase
{
public:
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnDirectoryZipped; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnError; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnFileZipped; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UZipDirectoryProxy* ZipDirectory(const class FString& DirectoryToZip, const class FString& ResultLocation, const class FString& Password, const EZipCreationFlag CreationFlag, const EZipCompressLevel Compression); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x141091E10

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZipDirectoryProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZipDirectoryProxy")
	}
	static class UZipDirectoryProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZipDirectoryProxy>();
	}
};
DUMPER7_ASSERTS_UZipDirectoryProxy;

// Class ZipLib.ZipFilesProxy
// 0x0068 (0x00A0 - 0x0038)
class UZipFilesProxy final : public UZipAsyncBase
{
public:
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnDirectoryZipped; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnError; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnFileZipped; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UZipFilesProxy* ZipFiles(const TArray<struct FFileToZip>& FilesToZip, const class FString& ResultLocation, const class FString& Password, const EZipCreationFlag CreationFlag, const EZipCompressLevel Compression); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x141092030

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZipFilesProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZipFilesProxy")
	}
	static class UZipFilesProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZipFilesProxy>();
	}
};
DUMPER7_ASSERTS_UZipFilesProxy;

// Class ZipLib.UnzipArchiveProxy
// 0x0068 (0x00A0 - 0x0038)
class UUnzipArchiveProxy final : public UUnzipAsyncBase
{
public:
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnArchiveUnzipped; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnError; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ArchiveFileLocation, const class FString& DiskFileLocation, const int64 FilesExtractedCount, const int64 TotalFilesCount)> OnFileUnzipped; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UUnzipArchiveProxy* UnzipZipArchive(const class FString& ZipArchiveLocation, const class FString& ResultLocation, const class FString& Password, const bool bOverwrite); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x1410917D0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UnzipArchiveProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UnzipArchiveProxy")
	}
	static class UUnzipArchiveProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnzipArchiveProxy>();
	}
};
DUMPER7_ASSERTS_UUnzipArchiveProxy;

// Class ZipLib.Unzipper
// 0x0068 (0x0090 - 0x0028)
class UUnzipper final : public UObject
{
public:
	TMulticastInlineDelegate<void(const bool bSuccess, const int64 FilesZippedCount)> OnFilesUnzippedDynamicEvent; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& ArchiveLocation, const class FString& DiskLocation, const int64 FilesZippedCount, const int64 TotalFilesCount)> OnFileUnzippedDynamicEvent; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UUnzipper* CreateUnzipper(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x141090F80

	void GetAllFileInfoList(TArray<struct FUnzipFileInfo>* OutFileInfoList); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141090FE0
	void SetArchive(const class FString& Path); // (Final, Native, Public, BlueprintCallable) // @ 0x141091260
	void SetBufferSize(const int64& NewBufferSize); // (Final, Native, Public, HasOutParams, BlueprintCallable) // @ 0x141091320
	void UnzipAllAsync(const class FString& TargetLocation, const class FString& Password, const bool bForce); // (Final, Native, Public, BlueprintCallable) // @ 0x141091470

	bool IsValid() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141091160

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Unzipper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Unzipper")
	}
	static class UUnzipper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUnzipper>();
	}
};
DUMPER7_ASSERTS_UUnzipper;

// Class ZipLib.ZipLibrary
// 0x0000 (0x0028 - 0x0028)
class UZipLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int64 GetUnZipCompletedResult(); // (Final, Native, Static, Public) // @ 0x141091130
	static class UUnzipper* UnzipArchiveSimple(const class FString& ArchivePath, const class FString& TargetLocation); // (Final, Native, Static, Public) // @ 0x141091690
	static void UnZipCompletedSetFlag(const bool bSuccess, const int64 FilesZippedCount); // (Final, Native, Static, Public) // @ 0x1410913B0

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZipLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZipLibrary")
	}
	static class UZipLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZipLibrary>();
	}
};
DUMPER7_ASSERTS_UZipLibrary;

// Class ZipLib.Zipper
// 0x00D0 (0x00F8 - 0x0028)
class UZipper final : public UObject
{
public:
	TMulticastInlineDelegate<void(const class FString& ArchivePath, const class FString& FilePath, const int64 FilesZippedCount, const int64 TotalFilesCount)> OnFileZippedEventDynamic; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const bool bSuccess, const int64 TotalFilesZipped)> OnFilesZippedEventDynamic; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0xB0];                                      // 0x0048(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UZipper* CreateZipper(); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x141090FB0

	void AddDirectory(const class FString& Path); // (Final, Native, Public, BlueprintCallable) // @ 0x141090D80
	void AddFile(const class FString& FilePath, const class FString& ArchivePath); // (Final, Native, Public, BlueprintCallable) // @ 0x141090E40
	bool RemoveFile(const class FString& ArchivePath); // (Final, Native, Public, BlueprintCallable) // @ 0x141091190
	bool Zip(const class FString& TargetLocation, const class FString& Password, const EZipCompressLevel CompressLevel, const EZipCreationFlag CreationFlag); // (Final, Native, Public, BlueprintCallable) // @ 0x1410919C0
	void ZipAsync(const class FString& TargetLocation, const class FString& Password, const EZipCompressLevel CompressLevel, const EZipCreationFlag CreationFlag, const int64 CheckSize); // (Final, Native, Public, BlueprintCallable) // @ 0x141091B80

	int32 GetFilesCount() const; // (Final, Native, Public, BlueprintCallable, BlueprintPure, Const) // @ 0x141091100

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Zipper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Zipper")
	}
	static class UZipper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZipper>();
	}
};
DUMPER7_ASSERTS_UZipper;

}

