#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZZAnimationLib

#include "Basic.hpp"

#include "ZZAnimationLib_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ZZAnimationLib.DynamicAttributtAnimInstance
// 0x0980 (0x0BF0 - 0x0270)
class UDynamicAttributtAnimInstance final : public UAnimInstance
{
public:
	struct FDynamicAttrAnimInstanceProxy          Proxy;                                             // 0x0270(0x0980)(BlueprintVisible, BlueprintReadOnly, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicAttributtAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicAttributtAnimInstance")
	}
	static class UDynamicAttributtAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicAttributtAnimInstance>();
	}
};
DUMPER7_ASSERTS_UDynamicAttributtAnimInstance;

// Class ZZAnimationLib.JogStartingComponent
// 0x0130 (0x0228 - 0x00F8)
class UJogStartingComponent final : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FVector& JogStartLocation)> OnJogStartDelegate;       // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class ACHARACTER*                             OwnerCharacter;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCharacterMovementComponent*            ObserveredCharacterMovementComponent;              // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 ObserveredSkeletalMeshComponent;                   // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JogStartingLocation;                               // 0x0128(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceNeededToNomalJog;                          // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityCanBeSeemsAsIdleThreshold;                 // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JogStartingLocationKey;                            // 0x013C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JogStartDistanceKey;                               // 0x0144(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JogStartToJoggingConditionKey;                     // 0x014C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   IdleToJogStartConditionKey;                        // 0x0154(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MainJogStartAnimSeqKey;                            // 0x015C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SecondaryJogStartAnimSeqKey;                       // 0x0164(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JogStartFirstStepAngleAlphaKey;                    // 0x016C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   JogStartFirstStepTransitionKey;                    // 0x0174(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MainJogStartAnimPositionKey;                       // 0x017C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SecondaryJogStartAnimPositionKey;                  // 0x0184(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          JogStartForwardSequence;                           // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          JogStartBackwardSequence;                          // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          JogStartLeftSequence;                              // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          JogStartRightSequence;                             // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x78];                                     // 0x01B0(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JogStartingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JogStartingComponent")
	}
	static class UJogStartingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJogStartingComponent>();
	}
};
DUMPER7_ASSERTS_UJogStartingComponent;

// Class ZZAnimationLib.JogStopComponent
// 0x0078 (0x0170 - 0x00F8)
class UJogStopComponent final : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FVector& JogStopLocation, const struct FVector& JogStopVelocity)> OnJogStopDelegate; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	class ACHARACTER*                             OwnerCharacter;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCharacterMovementComponent*            ObserveredCharacterMovementComponent;              // 0x0118(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 ObserveredSkeletalMeshComponent;                   // 0x0120(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x48];                                     // 0x0128(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("JogStopComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JogStopComponent")
	}
	static class UJogStopComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJogStopComponent>();
	}
};
DUMPER7_ASSERTS_UJogStopComponent;

// Class ZZAnimationLib.MSAISkeletalMeshComponent
// 0x0030 (0x0F80 - 0x0F50)
class UMSAISkeletalMeshComponent final : public USkeletalMeshComponent
{
public:
	TArray<TSubclassOf<class UAnimInstance>>      AppendedAnimBlueprint;                             // 0x0F48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_F58[0x10];                                     // 0x0F58(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimInstance*>                  AppendAnimInstances;                               // 0x0F68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_F78[0x8];                                      // 0x0F78(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MSAISkeletalMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MSAISkeletalMeshComponent")
	}
	static class UMSAISkeletalMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMSAISkeletalMeshComponent>();
	}
};
DUMPER7_ASSERTS_UMSAISkeletalMeshComponent;

// Class ZZAnimationLib.ZZAnimationLibBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UZZAnimationLibBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CalcSpringDamper(float& InOutValue, float& InOutValueRate, const float& InTargetValue, const float& InTargetValueRate, const float InDeltaTime, const float InUndampedFrequency, const float InDampingRatio); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x1428584C0
	static void CalcVectorSpringDamper(struct FVector& InOutValue, struct FVector& InOutValueRate, const struct FVector& InTargetValue, const struct FVector& InTargetValueRate, const float InDeltaTime, const float InUndampedFrequency, const float InDampingRatio); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable) // @ 0x142858710
	static void ConvertSpringToStrengthParams(float* OutStrength, float* OutDampingRatio, float* OutExtraDamping, const float InSpring, const float InDamping); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142858950
	static void ConvertStrengthToSpringParams(float* OutSpring, float* OutDamping, float InStrength, float InDampingRatio, float InExtraDamping); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable) // @ 0x142858B50
	static struct FTransform GetComponentSpaceBoneTransformOfAnimSequenceInEditor(class UAnimSequence* inAnimSequence, float InTime, class FName InBoneName); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x142858D10
	static struct FTransform GetComponentSpaceBoneTransformOfAnimSequenceNew(const class UAnimSequence* inAnimSequence, const float& InTime, const class FName& InBoneName); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x142858E50
	static struct FTransform GetLocalSpaceBoneTransformOfAnimSequence(class UAnimSequence* inAnimSequence, float InTime, class FName InBoneName); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x142858FB0
	static struct FTransform GetLocalSpaceBoneTransformOfRefPose(class UAnimSequence* inAnimSequence, class FName InBoneName); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x1428590F0
	static float GetLocomotionOfACertainDirection(const struct FCustomizedOrientationWarpingAngleSetting& OrientationWarpingAngleSetting, float directionAngle, int32 DirectionIndex); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x1428591F0
	static TArray<float> GetLocomotionOfAllDirections(const struct FCustomizedOrientationWarpingAngleSetting& OrientationWarpingAngleSetting, float directionAngle); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x142859410
	static int32 GetValidSectionFromCustomizedOrientationWarpingAngleSetting(const struct FCustomizedOrientationWarpingAngleSetting& OrientationWarpingAngleSetting, float directionAngle); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x142859630
	static struct FQuat SolveAimWithHardClamp(const struct FTransform& CurrentTransform, const struct FVector& TargetPosition, const struct FVector& AimVector, const float UpVectorWeight, const struct FVector& UpVector, const float AimClampInDegree); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x142859810
	static void SwitchToCPUSkinning(class USkinnedMeshComponent* InMesh, bool inEnableCPUSkinning); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142859A60
	static float ZZAnimationLibSampleFunction(float Param); // (Final, Native, Static, Public, BlueprintCallable) // @ 0x142859B20
	static TArray<class FString> ZZAttrDictDebugStrs(const struct FAnimInstanceAttributeDict& inDict); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x142859BA0
	static void ZZCalculatOrientationWarpingAngle(float directionAngle, float* outLocomotionNorthAngle, float* outLocomotionWestAngle, float* outLocomotionSouthAngle, float* outLocomotionEastAngle); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x142859DA0
	static float ZZCalculatTargetFrame(float InTargetValue, class UAnimSequence* inAnimSequence, EFindTargetFrameResult* OutResult, class FName CurveName, bool curveIsInOrder); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x142859F70
	static struct FAnimInstanceAttributeDict ZZCollectAnimBPAttributeFromComponents(const class AActor* TargetActor, bool useCustomComponentTagName, class FName customComponentTagName); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14285A110
	static float ZZEvaluateCurveName(class UAnimSequence* inAnimSeq, float InTime, bool* Success, class FName CurveName); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285A250
	static class UAnimSequence* ZZGetAnimSeqAttrFromMap(const struct FAnimInstanceAttributeDict& inDict, class FName KeyName, bool* Success); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285A3A0
	static bool ZZGetBoolAttrFromMap(const struct FAnimInstanceAttributeDict& inDict, class FName KeyName, bool* Success); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285A500
	static class FName ZZGetCurrentStateNameByMachineName(class UAnimInstance* inAnimInstance, class FName inMachineName); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14285A660
	static float ZZGetCurrentStateWeightByName(class UAnimInstance* inAnimInstance, class FName inMachineName); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14285A720
	static float ZZGetFloatAttrFromMap(const struct FAnimInstanceAttributeDict& inDict, class FName KeyName, bool* Success); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285A7E0
	static int32 ZZGetIntegerAttrFromMap(const struct FAnimInstanceAttributeDict& inDict, class FName KeyName, bool* Success); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285A940
	static void ZZGetMovementRelatedInfo(const class UCharacterMovementComponent* inCharacterMovement, struct FAnimMovementData* outAnimMovementData); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285AAA0
	static struct FRotator ZZGetRotatorAttrFromMap(const struct FAnimInstanceAttributeDict& inDict, class FName KeyName, bool* Success); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14285AB70
	static float ZZGetSpecificStateWeightByNames(class UAnimInstance* inAnimInstance, class FName inMachineName, class FName inStateName); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14285ACE0
	static ECharacterLocalDirection ZZGetStrafeMainDirection(float inMovingCardinalDirection); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14285ADD0
	static int32 ZZGetStrafeMainDirectionWithCustomRange(const struct FCustomizedOrientationWarpingAngleSetting& AngleSetting, float inMovingCardinalDirection); // (Final, Native, Static, Public, BlueprintCallable, BlueprintPure) // @ 0x14285AE50
	static float ZZGetStrafeMovingDirection(const struct FVector& MovingDirectionInLocalSpace, const struct FVector& ForwardAxis, const struct FVector& UpAxis); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14285B030
	static void ZZGetStrafeMovingDirections(float inStrafeMovingDirection, ECharacterLocalDirection* DirectionA, ECharacterLocalDirection* DirectionB, float* BlendAlpha); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285BA50
	static void ZZGetStrafeMovingDirectionsWithCustomRange(const struct FCustomizedOrientationWarpingAngleSetting& AngleSetting, float inStrafeMovingDirection, ECharacterLocalDirection* DirectionA, ECharacterLocalDirection* DirectionB, float* BlendAlpha); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285BBC0
	static void ZZGetStrafeMovingDirectionWithBuffer(float inStrafeMovingDirection, ECharacterLocalDirection* DirectionA, ECharacterLocalDirection PreviousDirection, float bufferValue); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285B160
	static void ZZGetStrafeMovingDirectionWithBufferWithCustomRange(const struct FCustomizedOrientationWarpingAngleSetting& AngleSetting, float inStrafeMovingDirection, int32* DirectionA, int32 PreviousDirection, float bufferValue); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285B2B0
	static void ZZGetStrafeMovingDirectionWithBufferWithCustomRangeByReference(struct FCustomizedOrientationWarpingAngleSetting* AngleSetting, float inStrafeMovingDirection, int32* DirectionA, float* directionAngle, int32 PreviousDirection, float bufferValue); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285B560
	static float ZZGetStrafeMovingDirectionWithCustomRange(const struct FCustomizedOrientationWarpingAngleSetting& AngleSetting, const struct FVector& MovingDirectionInLocalSpace, const struct FVector& ForwardAxis, const struct FVector& UpAxis); // (Final, Native, Static, Public, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14285B7C0
	static struct FVector ZZGetVectorAttrFromMap(const struct FAnimInstanceAttributeDict& inDict, class FName KeyName, bool* Success); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14285BE90
	static struct FAnimInstanceAttributeDict ZZMergeAttrDicts(TArray<struct FAnimInstanceAttributeDict>* inDicts); // (Final, Native, Static, Public, HasOutParams, BlueprintCallable, BlueprintPure) // @ 0x14285C000
	static void ZZPredictStopOffset(class UCharacterMovementComponent* inCharacterMovementComp, bool isPivot, struct FVector* outPredictOffset, bool* Success); // (Final, Native, Static, Public, HasOutParams, HasDefaults, BlueprintCallable, BlueprintPure) // @ 0x14285C280

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZZAnimationLibBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZZAnimationLibBPLibrary")
	}
	static class UZZAnimationLibBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZZAnimationLibBPLibrary>();
	}
};
DUMPER7_ASSERTS_UZZAnimationLibBPLibrary;

// Class ZZAnimationLib.ZZAnimAttrFetchInterface
// 0x0000 (0x0000 - 0x0000)
class IZZAnimAttrFetchInterface final
{
public:
	struct FAnimInstanceAttributeDict FetchAnimAttr(); // (Native, Event, Public, BlueprintCallable, BlueprintEvent) // @ 0x14285E760

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZZAnimAttrFetchInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZZAnimAttrFetchInterface")
	}
	static class IZZAnimAttrFetchInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IZZAnimAttrFetchInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IZZAnimAttrFetchInterface;

// Class ZZAnimationLib.ZZAnimSettings
// 0x0020 (0x0058 - 0x0038)
class UZZAnimSettings final : public UDeveloperSettings
{
public:
	class FName                                   CollectAttributeFromComponentWithTagName;          // 0x0038(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DistanceCurveName;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DisableSpeedWarpingCurveName;                      // 0x0048(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TurningDistanceCurveName;                          // 0x0050(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZZAnimSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ZZAnimSettings")
	}
	static class UZZAnimSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZZAnimSettings>();
	}
};
DUMPER7_ASSERTS_UZZAnimSettings;

}

